{
  "title": "Marmousets",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Marmousets",
  "content": "The marmousets (referred to as les petites gens) is a nickname, first recorded in the chronicles of Jean Froissart, for a group of counselors to Charles VI of France. Although they were neither princes nor civil servants, they were very close to the king. Thanks to this position, they were able to access the highest functions of the state. These men were endowed with another quality, the solidarity between them. Chosen by Charles VI in 1388, they vowed to remain united and friends. \n\nCharles VI was crowned in 1380, at the age of 11. His four uncles – the dukes of Burgundy, Berry, Anjou and Bourbon – served as his regents, entrusted with governing France. In November 1388, Pierre Aycelin de Montaigut, Cardinal of Laon, proposed in court that Charles VI relieve the dukes of their duties and assume control of the government.[1]\n\nThe marmousets—Pierre Aycelin de Montaigut, Bureau de La Rivière, Jean Le Mercier, Jean de Montaigu, Nicolas du Bosc, Olivier V de Clisson, Pierre le Bègue de Villaines and Guillaume IV de Melun—soon became Charles' privy council. The eight clerics and lords swore to stay united as friends, interdependent towards one another.\n\nThe marmousets' position as privy council ended on 5 August 1392, due to Charles VI's decline into insanity.[2] Le Mercier, de la Rivière and de Villaines were imprisoned,[3] de Montaigu escaped to Avignon, and de Clisson was fined 100,000 francs, dismissed of his title and banished from France.[3] Some of the marmousets eventually returned to their duties in minor posts, and while they were no longer a faction, many of their ideas were later put into practice by Charles VII, who became the natural heir of their policies.[2]\n\nThis French history–related article is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Marmousets"
  ],
  "findings": [
    "History",
    "Counselors",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:07:03.214365"
}