{
  "title": "R v Hasan",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/R_v_Hasan",
  "content": "R v Hasan [2005] UKHL 22,[1] formerly known as R v. Z [2003] (On Appeal from the Court of Appeal (Criminal Division)), is a House of Lords case in English law, and a leading modern authority on the common law defence of duress.\n\nThe defendant had worked as a driver and minder for Claire Taeger, who ran an escort agency and was involved in prostitution. In about July or August 1999, according to the defendant, Sullivan became Taeger's boyfriend and also her minder in connection with her prostitution business. He had, the defendant said, the reputation of being a violent man and a drug dealer.\n\nThe prosecution alleged that on 29 August 1999 a man living in Croydon telephoned Taeger's agency asking for the services of a prostitute. The defendant went to the address with a prostitute. But the client had changed his mind and claimed that he had not made a telephone call. The defendant insisted that a £50 cancellation fee be paid, and forced his way into the house, producing a knife and demanding payment. The client went upstairs and opened a safe, whereupon the defendant took some £4000 from it and ran from the house. This incident founded the first count of aggravated burglary in the indictment later preferred against the defendant. But his account of the incident was quite different. He said that he had been given the £50 fee without any threat and had taken nothing from the safe. But he said that after this incident he had reported the existence of the safe and its contents to Taeger in the presence of Sullivan.\n\nAccording to the defendant, his work for Taeger fell off with the arrival of Sullivan, who urged Taeger to get rid of him. There was a row in October or November 1999 and he stopped working for Taeger. But she lived in a flat which the defendant let to her, and she owed him outstanding rent. As security for this, he said, Sullivan made a red Rover car available to him, which he parked outside this flat. The next day it was gone, and he assumed that Taeger had a key and had taken it.\n\nAccording to the defendant's evidence at trial, he saw Sullivan shortly before Christmas 1999. Sullivan said he was short of cash as he was doing a big cocaine deal. He wanted the key to the Rover, which the defendant said he would look for. Just after Christmas 1999, the defendant said, Sullivan visited him again. He again spoke of a cocaine deal, giving the defendant to believe he had killed two dealers. He also spoke of killing another man by injecting him with a heroin overdose. He offered to show the defendant the body of a man, Bryan Davies, in the boot of the Rover.\n\nBryan Davies had died of a heroin overdose on 16 December 1999. On 14 April 2000 his body was discovered in the boot of the Rover, and the police believed that he had been injected with a fatal dose. Sullivan and Taeger were arrested and when interviewed said that the defendant had had the Rover in December 1999. They were awaiting trial at the time of the defendant's trial.\n\nDefendant was indicted for aggravated burglary related to an incident on 23 January 2000, involving the same house and the same victim as the earlier incident. The defendant admitted at trial that he had forced his way into the house on this occasion, armed with a knife, and had attempted to steal the contents of the safe, but claimed that he had acted under duress exerted by Sullivan, who had fortified his reputation for violence by talking of three murders he had recently committed. On the day in question, the defendant claimed, he had been ambushed outside his home by Sullivan and an unknown black man whom he described as a \"lunatic yardie\". Sullivan demanded that the defendant get the money from the safe mentioned on the earlier occasion, and told the defendant that the black man would go with him to see that this was done. Sullivan said that, if the defendant did not do it, he and his family would be harmed. The defendant claimed that he had no chance to escape and go to the police. The black man drove the defendant to the house and gave him a knife, saying that he himself had a gun. The defendant then broke into the house and tried unsuccessfully to open and then to remove the safe. The black man was in the vicinity throughout, and drove him away when the attempt failed.\n\nOn 5 June 2000 the defendant was arrested and interviewed in relation to the two burglaries. He denied any involvement in either. The victims of the second burglary then identified him on an identification parade. He was charged and produced a note which began \"I rely on duress\". He gave no detailed particulars.\n\nOn 26 June 2000 the defendant was interviewed, in the presence of his solicitor, by police investigating the death of Bryan Davies. He made a witness statement, describing his relationship with Sullivan and Taeger and explaining how the Rover had come to be outside his flat, where Taeger lived, before Christmas 1999. He then had an off-the-record conversation with the police (which Lord Steyn has described in [45] and [46] of his opinion).\n\nBy a defence statement dated 4 August 2000 the defendant gave further details of his defence of duress, claiming that he had been coerced into committing the second burglary by Sullivan.\n\nLord Bingham identified the elements of the defence, to which they are summarised as below:\n\nThe defendant was sentenced to 9 years of imprisonment.\n\nThe defendant lost the benefit of a defence based on duress as it was deemed right that a person voluntarily associating with known criminals ought reasonably to have foreseen the risk of future coercion. Furthermore, it was stated that the policy of the law should be to discourage association with criminals, and should thus be wary to excuse the criminal conduct of those who do so.\n",
  "concepts": [
    "R v Hasan",
    "defendant",
    "sullivan",
    "taeger",
    "said",
    "man",
    "1999",
    "house",
    "safe",
    "rover",
    "incident"
  ],
  "findings": [
    "Facts",
    "Judgment",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T17:32:49.435883"
}