{
  "title": "Hans Olsson (alpine skier)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Hans_Olsson_(alpine_skier)",
  "content": "Hans Anders Olsson (born 27 August 1984, in Mora, Sweden) is a Swedish former alpine skier.[1] He represented Sweden at the 2010 Winter Olympics in Vancouver,[2] where he came 12th in downhill. He also represented Sweden at the 2007, 2009 and 2011 Alpine World Ski Championships.[3] Olsson specialised in the speed disciplines of super-G and particularly downhill.\n\nHans' brother Jon Olsson Delér, is an alpine ski racer and a freestyle skier who has won multiple Winter X Games medals. Hans took a gold medal at the 2004 World Junior Alpine Skiing Championships, where he won the super-G.[4]\n\nOlsson made his debut in the Alpine Ski World Cup at Kvitfjell in 2003–04 FIS Alpine Ski World Cup: he went on to make a total of 155 World Cup starts.[3] His best position in the season-long World Cup standings in downhill was 12th, which he achieved in 2008-09.[5] His career highlights include podium finishes in World Cup races at Lake Louise, Canada, and Åre, Sweden, in 2008 and 2009 respectively. During his racing career, Olsson initially lived on Frösön,[6] before moving to Innsbruck, Austria.[7] He is multilingual, speaking Swedish, German and English.\n\nHans Olsson announced his retirement from competition on 16 April 2015,[8] following three seasons in which he was plagued by injuries. In August of that year he took up a position in the organisation of the 2019 Alpine World Ski Championships in Åre,[3] also moving to the village.[9] He has been in a relationship with fellow alpine skier Maria Pietilä Holmner since 2004:[7] as of 2018 the couple were engaged.[10] They both worked as part of the team covering alpine skiing at the 2018 Winter Olympics for Eurosport.[11]\n\nHe is a member of IFK Mora.[4]\n",
  "concepts": [
    "Hans Olsson (alpine skier)",
    "alpine",
    "world",
    "olsson",
    "world cup",
    "ski",
    "cup",
    "sweden",
    "hans",
    "winter",
    "skier"
  ],
  "findings": [
    "World Cup results",
    "Season standings",
    "Race podiums",
    "World Championship results",
    "Olympic results",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:10.697162"
}