{
  "title": "Pure Trance",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Pure_Trance",
  "content": "Pure Trance (Japanese: ピュア・トランス, Hepburn: Pyua Toransu) is a shōjo (targeted towards girls) science-fiction manga by Junko Mizuno.  Her debut manga, it appeared as a serial in the booklets of Avex Trax's Pure Trance techno compilation CD series. It was later collected into a bound volume by East Press and published in 1998.\n\nLast Gasp published an English-language translation of Pure Trance in July 2005; the edition was produced by jaPRESS.\n\nPure Trance takes place in the future, after World War III, which left the surface of the earth inhospitable to life. The humans able to escape underground now live underneath a dome in Tokyo, Japan, while those unable to become creatures resembling brains with eyes and a spine. The people living underground survive on Pure Trance, nutritional capsules which have caused overeating in females to become a serious issue.\n\nThe plot of Pure Trance follows Kaori Suzuki, a kind and good-natured nurse at Overeaters Treatment Center 102, run by the drug-addicted and violently abusive director Keiko Yamazaki. Though normally docile in spite of the director's terrible treatment, Kaori lashes out after three expectant mothers die due to a lethal combination of medicines administered by the director. The director subsequently imprisons Kaori and subjects her to constant torture, and creates artificial nurses Umeko and Takeko to replace the human nurses working at the center. Meanwhile, the deceased women's fetuses are raised in an artificial womb and grow into healthy children— Yuriko, who is very strong and intelligent; shy and dainty Rika; and twins Miki and Yuki, who possess magical powers. The children are raised by robot nurse Kiyomi and Aiko, head of the children's ward, but are constantly tormented by the two artificial nurses. When Aiko stands up to them one day, the director brutally chokes her to death and decides to take the children for herself to use as experiments. With the help of Kiyomi, Kaori escapes to the surface with the children via a ventilation shaft, but not before Kiyomi sacrifices herself, leaving only her robotic head at the entrance. The head is later found by Professor Kajiwara, who restores an amnesiac Kiyomi into a new robotic body, naming her B-ko.\n\nOn the surface, the group encounters Seiko, a popular idol singer who went missing years ago and who has adapted to the wilderness of the surface. Seiko leads the group to an abandoned park and educates them on the flora and fauna. Underground, the director is furious at Kaori and the children's escape, and has her security guard Kimiko and the two artificial nurses pursue them on the surface, much to their chagrin. After several years of living on the surface, Kaori's health deteriorates as she cannot stomach real food, only Pure Trance, whereas the children thrive and grow into adults. While the children are out tripping on hallucinogenic mushrooms one day, Kimiko and the nurses encounter Seiko, who unwittingly leads them to Kaori, whom they capture and take back to the director. When the children return home, the twins use their powers to locate Kaori, but unfortunately witness the director poisoning her to death. The incident leaves them very weak and their hair turns white.\n\nMeanwhile, a hole develops in the dilapidated dome covering Tokyo, and plants and animals from the surface begin creeping into the underground. A research team is formed by Professor Kajiwara to explore and determine the habitability of the surface. The children, saddened by Kaori's death and frightened by the explorers, hide in the ruins of a love motel. The director however has a nightmare about the children and a mysterious dark haired woman, and upon waking forces Kimiko and the artificial nurses to venture once more to the surface, this time to kill the children. Rika, who is popular among the brain creatures of the surface, gets pregnant from one of her boyfriends, while the twins have a vision that they will die soon and Rika will die in childbirth. They suggest combining their powers with Yuriko, and perform a ritual that transfers their souls into her body.\n\nRika gives birth to a daughter, Yuka, but dies in the process and becomes one of the brain creatures. At Center 102, a patient spots a bird that flies in through the window and eats it, causing her to recover from her overeating illness quickly. The few remaining human nurses utilize this information to create a cheap and effective cure for overeating, causing the center to be shut down and the director to be arrested. They then open a successful pachinko parlor in the building. With the director gone, Kimiko becomes a female wrestling star while the artificial nurses are taken in at a nurse themed hostess bar. Deconstruction of the dome over Tokyo begins and real food as well as the integration of the brain creatures and the various plants and animals become mainstream.\n\nYuriko raises Yuka and teaches her to hunt on the surface. She grows up suddenly by shedding her skin and emerging as a mature woman. The pair are found by the dome deconstruction team, and come under the care of Professor Kajiwara and B-ko. The artificial nurses become spontaneously pregnant and are rushed to a hospital. While walking around the city, Yuriko and Yuka spot the prison where the director is held, and Yuka—the dark haired woman from the directors nightmare—promptly kills her, right as the artificial nurses give birth to baby girls that resemble the director.\n\nPure Trance is manga artist Junko Mizuno's first major manga; previously, she had self-published a dojinshi, MINA animal DX, of which she printed only fifty copies of one black-and-white issue in 1996.[1] Her work in the Japanese popular culture magazine H caught the attention of record label Avex Trax, which placed advertisements in the magazine.[2] Mizuno explained: \"They asked me to write a manga to appear with a series of CD compilations called Pure Trance that were introducing techno music to Japan. He wanted something like techno itself, a mixture of futuristic and primitive things.\"[1] She drew inspiration for Pure Trance from Akira.[1]\n\nWritten and illustrated by Junko Mizuno, Pure Trance appeared as a serial in the CD booklets of Avex Trax's eponymous techno-compilation series,[1][3] from May 8, 1996, to January 14, 1998.[4][5] It was compiled into a bound volume and published by East Press in 1998.[1]\n\nLast Gasp licensed Pure Trance for an English-language translation in North America, and published it in 2005.[6]\n\nKidRobot released a series of merchandise based on Pure Trance, including clothing and vinyl figures.[7]\n\nPaul Gravett listed Pure Trance on his recommended reading list.[8] Jason Thompson, in Manga: The Complete Guide (2007), gave Pure Trance 3.5 of 4 stars, praising it as a combination of Russ Meyer's work and a science-fiction film from the 1970s. Writing that Mizuno drew influence from manga artist Osamu Tezuka, he praised the art as \"dense and delirious\".[3] In a retrospective review of Mizuno's work, Thompson wrote that the \"trippy, grindhouse\" narrative contained \"weak\" places and had a tendency to wander; he compared the plot to an apocalyptic film from the 1970s.[9]\n\nFrom March 13 to June 14, 2009, Pure Trance appeared at an exhibit by the Japan Society in New York, Krazy! The Delirious World of Anime + Manga + Video Games.[10] Critical reaction to the manga was positive. In his review of the exhibit, Ken Johnson of The New York Times highlighted Pure Trance as an example of \"impressive\" \"draftsmanship, design and imagination\" in a manga.[10] Writing for About.com, Evan Minto wrote that Pure Trance was on display as an example of \"the evolution of the 'manga-style' that is now so synonymous with the medium\", because of \"its creation of 'hybrid forms' based on traditional manga style, Lolita fashions, and even pornography.\"[11] Another guest reviewer for About.com, Scott VonSchilling expressed his happiness that one of Mizuno's works was on the display; according to him, Mizuno's works, which have an American cult following, are very recognizable: \"Her mash-up of the ultra-cute with dirty and grotesque imagery catches your eye and hooks you in. It initially looks like family-friendly kiddie-fare, but viewers quickly realize that it's some of the most adult material on display.\"[11]\n",
  "concepts": [
    "Pure Trance"
  ],
  "findings": [
    "Plot",
    "Development",
    "Media",
    "Manga",
    "Other",
    "Reception",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:08:44.688894"
}