{
  "title": "Helen Taggart Clark",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Helen_Taggart_Clark",
  "content": "Helen Taggart Clark (née, Taggart; pen names, H. T. C. and Helen T. Clark; April 24, 1849 – July 26, 1918) was an American columnist, short story writer, and poet. She wrote a weekly column for the Sudbury, Massachusetts News, and was a contributor to Frank Leslie's Illustrated Newspaper, the Christian Union, the Woman's Journal, and the Springfield Republican.\n\nHelen Taggart was born in Northumberland, Pennsylvania, April 24, 1849. She was the oldest of three children of the Col. David Taggart and Annie Pleasants (Cowden) Taggart.[1] There were three siblings, John C., Hanna C. H., and James.[2]\n\nShe was educated in the Friends' Central School, in Philadelphia, Pennsylvania. In October 1869, she made a six months' stay in Charleston, South Carolina to make a visit to her father, then stationed in that city as paymaster in the United States Army.[1]\n\nIn 1870, she married Rev. David Henry Clark, a Unitarian minister settled over the church in Northumberland. Four years later, they removed to New Milford, Pennsylvania, to take charge of a Free Religious Society there. In 1875. Rev. Clark was called to the Free Congregational Society in Florence, Massachusetts.[1]\n\nAttention was first drawn to \"H. T. C .\", by which some of her earlier work was signed, in 1880, by her occasional poems in the Boston Index, of which her husband was for a time assistant editor, and in the Springfield, Republican. Her life, as she put it, had been one of intellectual aspirations and clamorous dish-washing and bread-winning. Clark left Florence, Massachusetts in 1884, returning to her father's house in Northumberland with her youngest child, an only daughter, her two older children being boys. There, for two years, she was a teacher in the high school, varying her duties by teaching music and German outside of school hours, story and verse writing, and leading a Shakespeare class. In August, 1887, she accepted a position in the Good Cheer office, Greenfield, Massachusetts, till she was recalled to Northumberland the following February by the illness of her father. He died a little later, after which time Clark has made her home in her native town.\n\nClark had a large circle of friends, and her social duties took up much of her time, but she made time write a weekly column for the Sudbury, Massachusetts News, to perform the duties pertaining to her office as secretary of the Woman's Relief Corps in her town, to lead a young people's literary society, and to contribute stories and poems to Frank Leslie's Illustrated Newspaper, the Christian Union, the Woman's Journal, and the Springfield Republican.[3] Her Verses was published in 1891 in Philadelphia by Lippincott.[4]\n\nThe Clarks had at least one child, a son, John.[4] By 1911, she was living in Brooklyn, New York.[2]\n\nHelen Taggart Clark died at her home in Brooklyn, July 26, 1918.[5]\n",
  "concepts": [
    "Helen Taggart Clark"
  ],
  "findings": [
    "Early life and education",
    "Career",
    "Personal life",
    "Selected works",
    "As Helen T. Clark",
    "References",
    "Attribution",
    "External links"
  ],
  "timestamp": "2025-04-11T10:09:35.082172"
}