{
  "title": "City of Norwich School",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/City_of_Norwich_School",
  "content": "The City of Norwich School, more commonly known as CNS, is a coeducational secondary school and sixth form with academy status in Norwich, England.\n\nIn 1910, the Education Committee decided to merge the King Edward VI Middle School in Norwich with the Municipal and Presbyterian Schools for boys to create the new City of Norwich School, a boys' grammar school, which was to be built at Eaton.[1][2]\n\nThe grammar school had around 950 boys in 1960, and around 850 in 1969 when administered by the Norwich Education Committee.\n\nIt became a comprehensive in 1970 at which point its name changed to Eaton (City of Norwich) School and co-educational in 1971. Three female sixth-formers were admitted in 1972 (Hazel, Marian and Mary.)  The original building is still in use today and sits alongside dedicated, modern facilities for science, mathematics, the arts and sixth form.\n\nPreviously a community school administered by Norfolk County Council, City of Norwich School converted to academy status on 1 September 2014 and is now sponsored by Ormiston Academies Trust. However the school continues to co-ordinate with Norfolk County Council for admissions.\n\nIt has over 1,300 pupils in years 7 to 11 and nearly 400 pupils in years 12 and 13.  The school currently employs over 190 staff. \n\nIt is situated just west of the A146 ring road (former A47), with the A11 to the north and the A140 to the south. Eaton Golf Club is next door to the south-west.\n\nThe pupils from Years 7 to 11 at CNS are split into five houses named after notable coastal villages in Norfolk: Blakeney, Holkham, Kelling, Thornham and Winterton. Their house colours are Blue, Purple, Green, Yellow and Red respectively. Pupils in years 12 and 13 are not categorised into houses and instead belong as a singular community known as CNS Sixth Form.\n",
  "concepts": [
    "City of Norwich School"
  ],
  "findings": [
    "History",
    "Grammar school",
    "Comprehensive",
    "Academy",
    "Admissions",
    "House system",
    "Notable former pupils",
    "City of Norwich School (boys' grammar school)",
    "King Edward VI Middle School",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:13:43.396797"
}