{
  "title": "Bone Cancer Research Trust",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Bone_Cancer_Research_Trust",
  "content": "The Bone Cancer Research Trust (BCRT) is a charity dedicated to fighting primary bone cancer. The charity funds research, raises awareness of the disease, provides patient information, and provides support services. The charity operates internationally but is based in the United Kingdom, Charity Number 1159590,[1] registered in 2006 in England and Wales.[2]\n\nBCRT funds research into primary bone cancer, in particular, osteosarcoma, Ewing's sarcoma, chondrosarcoma, chordoma, spindle cell sarcoma, and adamantinoma.\n\nBCRT was initially a parents' group started in September 2004.  Five families who had lost children to osteosarcoma and wanted to see more research carried out into this rare cancer to hopefully improve the outcome for future sufferers were brought together.\n\nThe parents' group increased with the addition of families, including one from Ireland, whose children had battled against another primary bone cancer, Ewing sarcoma.  Expanding the group helped to unite skills and enthusiasm as well as funds already raised.  The families pooled money totalling £176,000 to start the charity and fund the first pieces of research.\n\nThe Bone Cancer Research Trust became a registered charity in March 2006 and by September 2006, the first two successful applications for research grants had been accepted.\n\nThe charity normally puts out two research calls per year. To date the charity has funded 83 projects totalling £3.9 million.\n\nThe families who formed the charity had major concerns regarding the lack of reliable information available. Little detailed information resources were available in the UK or the internet as a whole.\n\nAlongside research funding, information provision is now one of the charities activities.  The Bone Cancer Research Trust provides information (online and printed) on primary bone cancers for patients, their families, the general public, media and health care professionals.  Currently there is detailed information on osteosarcoma, Ewing sarcoma and chondrosarcoma and a glossary/ medical dictionary.\n\nThe Bone Cancer Research Trust has an annual \"Awareness Week\" (in October).[3][4][5][6]\n\nDuring Awareness Week various activities are carried out by the charity's supporters with the main campaign being \"Bake a Cake for Bone Cancer\".  Another highlight is the annual Patients' and Supporters' Conference, which brings together patients and parents with the many different professionals whose work affects the lives of those who find themselves with a diagnosis of bone cancer.[7][8]\n\nThe work of the Bone Cancer Research Trust is almost entirely funded by the public. The charity raises money through donations, community fundraising events, retail and legacies. Fundraising events are commonly tagged on social media using #TeamBones.\n\nThe Bone Cancer Research Trust produces a twice yearly newsletter entitled \"United\".\n\nThe Bone Cancer Research Trust has National Institute for Health and Care Research (NIHR) Partner status. The charity also works closely with The Teenage Cancer Trust and the Information Standard.\n\nBCRT governance is provided by a board of trustees. The current chair of trustees is Professor Alison Gartland (research active cell biologist). The deputy chair of trustees is Elizabeth Eatock. The remaining Board consists of Gill Johnstone (founder and patient parent), Mr Jonathan Stevenson (consultant orthopaedic surgeon), Professor Bernadette Brennan (consultant paediatric oncologist), Arlene Eves (former patient), Dr Darrell Green (research active molecular biologist and geneticist) and Damian Harper (former patient).\n\nSam Waley-Cohen\n\nJames Corden, Diane-Louise Jordan, Paterson Joseph, Piers Morgan, Amanda Holden, Ben Shephard, Aled Jones\n",
  "concepts": [
    "Bone Cancer Research Trust"
  ],
  "findings": [
    "About",
    "History",
    "Research funding",
    "Present day activities and future direction",
    "Raising awareness",
    "Fundraising",
    "Publications",
    "Partnerships",
    "Board of Trustees",
    "Celebrity Ambassadors",
    "Celebrity Supporters",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:07:24.141323"
}