{
  "title": "Mont Cenis Pass Railway",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Mont_Cenis_Pass_Railway",
  "content": "The Mont Cenis Pass Railway operated from 1868 to 1871 (with some interruptions) during the construction of the Fréjus Rail Tunnel through the Alps between Saint-Michel-de-Maurienne, southeast France and Susa, Piedmont, northwest Italy. It was designed by John Barraclough Fell and his three-rail design was used on some other mountain railways. The railway was 77 kilometres (48 miles) long, with a gauge of 1,100 mm (3 ft 7+5⁄16 in). The height at the summit was 2,283 metres (7,490 ft) and the maximum gradient was 9 per cent (1 in 11).[1] It was used to transport English mail to India as part of the 1,400-mile (2,300 km) All Red Route.[2]\n\nA British company was established in 1864 by a number of British contractors, engineers and investors to obtain permission from the two governments to build the railway. These included: Thomas Brassey, Fell, James Brunlees and Alexander Brogden. Having obtained permission, in 1866 they established the Mont Cenis Railway Company to build and run the railway.   Although it would eventually be superseded by the tunnel, they believed that during its life, the cost of the pass railway would be repaid with a profit to them. The company used British engine-drivers and workmen.[3]\n\nIn the event there were delays in establishing the railway and it did not start until 15 June 1868. Additionally the tunnel progressed faster than expected as new tunnelling methods were developed and the tunnel was opened on 16 October 1871, resulting in the pass railway being active for a shorter time than expected and leaving the proprietors with a considerable loss. However, the technology proved itself and was used on a number of other mountain railways.\n\nUntil this railway was built, rail passengers had to cross the Alps by horse-drawn Stage coach in summer or sledge in winter.[2]\n\nThe Pass Railway is sometimes called the Mont Cenis Summit Railway so as to distinguish it from the Tunnel Railway.[4]\n\nBy the early 1860s most of a 1400-mile rail connection between Calais and Brindisi had been built, much of it by Thomas Brassey and John Barraclough Fell. The only major remaining problem was the crossing of the Alps. Work on the Fréjus or Mont Cenis tunnel had started in 1857 but it looked as though it would take many years to build, using traditional tools and gunpowder.[3]\n\nA full rail service from Calais to Brindisi, continuing by sea to Alexandria, would take about 30 hours off the journey time from Britain to India, China and Australasia compared with the current option of Calais to Marseilles by rail and onwards by sea. The increasing volumes of trade, in mail, passengers and goods presented a tempting prospect of profits to be made by crossing the Alpine barrier as well as an opportunity to strengthen the ties of Empire.[12]  In 1866, at a British Association meeting, Fell reported how four years earlier he had been asked to design some means of improving on the existing horse-drawn transport across the Alps over the Mont Cenis Pass. The slopes and curves were too much for a conventional train and so far no such railway had been built anywhere but Fell managed to design a suitable system, with a pairs of horizontal wheels beneath the engine bearing on a third rail placed centrally between the running rails, and he patented it.[13] He set a maximum gradient of 1 in 12 (8.3%) and a minimum curve of 2 chains (40 m). The French and Italian governments had agreed to the idea subject to satisfactory testing.[12] The detailed design was carried out by A. Alexander at Brassey Jackson Betts & Co.'s Canada Works in Birkenhead. The gauge was 1,100 mm (3 ft 7+5⁄16 in).[14]\n\nExperiments on the new locomotive were carried out between 1863 and 1865 on a purpose built railway of 1,100 mm (3 ft 7+5⁄16 in) gauge near Whaley Bridge adjacent to - and, at one point, passing under - the Bunsal Incline of the Cromford and High Peak Railway at gradients of 1 in 13 and 1 in 12, with curves up to 2.5 chains radius.[15] Early experiments were private but public experiments took place in January. They showed that the light locomotive would not work on the 1 in 12 slope without the central rail drive but could tow four wagons weighing 7 tons each with it.[16]\n\nWith this information, the Mont Cenis Concessionary Company was formed on 12 April 1864 to obtain concessions from the two governments to build a railway on the public road over the pass until the tunnel should be opened. The subscribers were:  The Duke of Sutherland, Thomas Brassey, Sir Morton Peto and Edward Betts, James Lister,  Thomas Crampton, Alexander Brogden, James Cross, Fell, James Brunlees, Joseph Jopling, T S Cutbill and C. Lowinger.[17]\nEach took one share at £1,000 except that Brassey took three, Fell took two and Peto and Betts took one between them.[17]\n\nOn behalf of the company Fell approached the French and Italian governments for permission to build the railway. The governments would not be asked for any money. The company expected to make a profit. The French government wanted more proof that the scheme was practicable. The Italians said they would grant permission if the French did. To provide additional evidence a second test line was constructed along the zig-zag section from Lanslebourg to the summit. It was 1¼ miles long with a ruling gradient of 1 in 12 and an average of 1 in 13. It started at 5,321 feet and rose to 5,815 feet. Rails were borrowed from the Victor Emmanuel Railway. This test line was completed by 23 January 1865.[18]\n\nMeanwhile, a second locomotive was built by James Cross and Company of St Helens and was the first engine to be sold by him.[19] It was designed by Alexander after consultation with Fell. Cross was probably used because Brassey's works was very busy.[20]\n\nThe trials were observed by officials from the governments of France, Italy, Great Britain, Austria and Russia. There were 600 spectators. The British representative was Henry Whatley Tyler. Trials began on 28 Feb 1865. Only the first locomotive was available but the trials were very successful. Captain Tyler came again in the spring when locomotive 2 had arrived. He found that some parts of this locomotive needed strengthening and it would not be advisable to test it very much until replacements had been obtained. However, he did test it successfully.[21] The trials gradually moved towards several runs on each day. On 19 July they were observed by the Frederick Hardman from the Times and the French commissioners made the last of six visits. There were three more days of trials for the Italians and the Russians and a special day for James Brunlees on 31 July. This ended the official tests but private testing continued until the end of November. The French concession was granted on 4 November 1865 and the Italian on 17 December.[22]\n\nOn 7 February 1866 the Mont Cenis Railway Company (Limited) (MCR) was established as company 2820c under the Companies Act 1862. There were 12,500 shares of £20 each. For each share £1 was to be paid on application, £3 on allotment and further calls of £4 would be made at intervals of not less than three months.[23]\n\nThey could not have chosen a worse time. In January 1866 the contractors Watson & Overend had failed with liabilities of £1½ million and on 5 February the railway promoter Thomas Savin failed.[24]\n\nThe directors and other officers of the company were: The Duke of Sutherland (President), Sir James Hudson (Chairman), Thomas Brassey, The Duke of Vallombrosa, Lord Abinger, Sir Morton Peto, Sir Robert Dallas, Edward Blount, Jervoise Smith, Thomas Crampton, W B Buddicom, Alexander Brogden, Fell, James Brunlees (Engineer) and T S Cutbill (Secretary). By October Cutbill had been replaced by W.J.C.Cutbill.[25]\n\nOn 11 May 1866 Overend, Gurney and Company failed.  Samuel Morton Peto and  Edward Betts also failed and their support was lost.[26]\n\nIn August the directors found that they each had to take up five more shares for the company to qualify for the London Stock Exchange. By 21 Aug 8,678 shares had been taken up by 448 shareholders. Among these, Brassey took 945, Brogden 792, the Duke of Sutherland 542, Abinger 292, Brunlees 137, Crampton 237, and Fell 242.[27]\n\nIn early 1866 detailed plans and sections were drawn up for submission to governments. Construction began in March. The railway was to be 48 miles (77 km) long and would follow the existing roadway over the pass, although at villages the railway had to leave the road and use a separate right of way. Where it was necessary for the track to cross the roadway on the level the tall centre rail was lowered into a trough by the operation of a lever.[13] Out of the 33-foot (10 m) standard width of the road the company was allowed 13 feet (4 m) for track, with the governments retaining 20 feet (6 m) for roadway. There was a continuous wooden barrier separating the roadway from the rail track. Over a distance of 9 miles (14 km) the track had to run in snow shelters. Where avalanches were likely these had to be built of masonry; elsewhere they were of sheet iron.[28]  At some hairpin bends adjustments had to be made to meet the railway's minimum radius of 130 feet (40 m). Much of the road was built on a shelf and this had to be strengthened or widened in places. On the Italian side the road had been built with a gentle slope. This had proved too prone to avalanches and had been replaced by a steep zig-zag called Les Échelles (the ladders), but the railway had to revert to the original roadway because the \"ladders\" were too severe for it. This section needed 660 yards (600 m) of masonry avalanche shelter. Using the Michelin map, the rise from St Michel is 4,492 feet (1,369 m) and from Susa 5,178 feet (1,578 m). J. B. Fell was appointed ‘Managing Director at the Mont Cenis’. It seems that direct labour was employed on the French side whereas on the Italian side the contractor Gianoli & Canova was used.[7]\n\n Fell had intended to have two classes of locomotives: one to pull heavy loads slowly up steep slopes from Lanslebourg and Susa and one to run faster on easily graded sections between Lanslebourg and St Michel. He was over-ruled by his co-directors. A. Alexander was appointed Locomotive engineer and Brassey's Canada Works had quoted to build the locomotives. After the first one was built, the directors discovered that French law prohibited importation of foreign machinery subject to a French patent. Fell had taken out at least one French patent. At this late stage the most reputable French manufacturers were busy so they used Ernest Goüin et Cie. of Paris even though Alexander had reported on them unfavourably. In August the locomotives were expected to be delivered in February, March and April 1867. The locos were designed by Alexander and his designs were passed by the board. The rolling stock was built by Chevalier, Cheilus & Cie of Paris.[29]\n\nAt the beginning of September 1866 Abinger, Brogden and Vallambrosa visited the works. They found: 2,200 men employed, rails being laid at both ends and on the plateau of the line and a scarcity of horses owing to the Austro-Italian war. On the French side the stones comprising the foundation of the road were so large that blasting was required to make holes for the fence. The locomotives might possibly be an issue. Otherwise nothing seemed likely to delay them.[30]\n\nIt had been a cool summer so the ice had not melted as much as usual. On 25 September, after a few days of warm rain, a tributary to the river Arc swept debris into the main river where it formed a dam, creating a reservoir. When this dam finally burst, there was a deluge which caused damage at fifty places between Termignon and St Michel.[30]\n\nBetween Lanslebourg and Susa, all was well. The permanent way was nearly complete by early December, when snow stopped the work.[30]\n\nOn 19 February 1867, at the second half-yearly general meeting, shareholders were told that most of the line would be ready by May. On 4 March, Fell wrote to the board that he expected the line to open in September. On 4 April the board were told that locomotive construction was well behind schedule. The first loco should be ready by 1 May, the second in June, and the remainder to follow at the rate of one per week. The first carriage was ready apart from its wheels.[31]\n\nIn mid August the Board of Trade dispatched Captain Tyler to inspect the railway and the tunnel. On the way he inspected the locomotives and rolling under construction in Paris. On 22 August the repairs between St Michel and Lanslebourg were incomplete. However, on 26 August a test run was attempted. Two Goüin locomotives had been delivered but were not yet ready for service. So they had to use the second of the two British-built engines, built by James Cross at St Helens.[20] Alexander Brogden was present. He wrote an account of the test to the Duke of Sutherland which remains in the Duke's records and is quoted verbatim by Ransom. Everyone was nervous because there had been no previous test. However, the test was passed very well. Captain Tyler even composed a song. There were fifty people on the train and Brunlees was the driver.[32]\n\nDuring the same visit, Brogden and Tyler investigated the tunnel. In the letter mentioned above Brogden reported that progress was good. The tunnel should be pierced in three years and completed in four – much earlier than previously anticipated. Tyler's official report on the tunnel was that 7,366 metres had been bored, 4,884 remained and that the French had passed through the hard quartz and returned to the softer schist. The link between the tunnel and the French railway was another matter. It would not begin for a year and would take another four years to complete.[33]\n\nThe company asked the French and Italian regulators to come to an inspection on 20 September, with a view to open for freight as soon as possible and open for passengers in October. They were optimistic. However, later in September they had a successful private test using the No. 3 locomotive, the first from Goüin. In October, Brassey was touring his contracts. On the 12th he arrived at Mont-Cenis expecting a successful test. It was a cold and wet day. The test was a disaster. Not only No. 3 but two other locomotives broke down in the attempt to complete the test. Brassey had to stand in the cold and wet, waiting for replacement engines. According to Helps, his biographer, Brassey developed a chill which led eventually to his death.[33]\n\nAt a general meeting in November, shareholders were informed that Goüin had used inferior iron on the rocking shafts, rather than first grade iron or forged steel as specified, and the shafts therefore had failed in the test. Also the trailing axles could not accommodate the tight curves and would have to be removed. This meant that the rear driving wheels would need additional bearings and springs. On 17 April 1868 the Times reported that seven locomotives had had their shafts replaced or shortly wou",
  "concepts": [
    "Mont Cenis Pass Railway"
  ],
  "findings": [
    "Timeline",
    "The setting",
    "Experiments",
    "Permission to build",
    "Onsite trials",
    "Mont Cenis Railway Company",
    "Construction",
    "Locomotives",
    "September 1866",
    "Visit report",
    "Flood",
    "February 1867 General Meeting",
    "August 1867",
    "Board of Trade inspection",
    "Inspection of tunnel",
    "September 1867 French and Italian regulators",
    "November 1867",
    "General Meeting",
    "Late delivery of rolling stock",
    "Financial problems",
    "Inspection",
    "Testing & final opening April–June 1868",
    "The completed line",
    "Floods August 1868",
    "General Manager",
    "New locomotives",
    "Snow blockage November 1868",
    "General Meeting February 1869",
    "Further developments",
    "Review",
    "Other Fell railways",
    "See also",
    "External links",
    "References"
  ],
  "timestamp": "2025-04-11T10:09:24.622767"
}