{
  "title": "Achelous",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Achelous",
  "content": "In ancient Greek religion and mythology, Achelous (also Acheloos or Acheloios) (/ˌækɪˈloʊ.əs/; Ancient Greek: Ἀχελώϊος, and later Ἀχελῷος, Akhelôios) was the god associated with the Achelous River, the largest river in Greece. According to Hesiod, he was the son of the Titans Oceanus and Tethys. He was also said to be the father of the Sirens, several nymphs, and other offspring.\n\nAchelous was able to change his shape, and in the form of a bull, he wrestled Heracles for the right to marry Deianeira, but lost. He was also involved in the legend of the Argive hero Alcmaeon.[2]\n\nThe name Ἀχελώϊος is possibly pre-Greek,[3] its meaning is not entirely certain. Recent arguments suggest it is Semitic in origin, with the initial Αχ- stemming from the Akkadian aḫu (\"bank of the river\"), or aḫû (\"seashore\") and the suffix -ελώἴος, from the Akkadian illu (\"watercourse\" or \"water of the river invading land\").[4] According to linguist Ivan Duridanov [bg], the Thracian river name Achelōos (alternatively, Achēlon and Achelon), located near Anchialo, in the Black Sea, is cognate to the Greek word, both deriving from a Proto-Indo-European stem *ɘku̯el, meaning 'water'.[5]\n\nAccording to Hesiod, Achelous, along with all the other river gods, was the son of the Titans Oceanus and Tethys.[6] According to the sixth-century mythographer Acusilaus, Achelous was the \"oldest and most honoured\" of the river-god offspring of Oceanus.[7] Servius, relating a tradition of unknown origin, reports that Achelous was said to have been the son of Earth (i.e. Gaia).[8]\n\nAchelous had various offspring.[9] He was said to be the father of the Sirens.[10] According to the 3rd-century BC poet Lycophron, the Sirens were the daughters of Achelous, by an unnamed \"melodious mother\" (perhaps meaning the mother was a Muse),  while Ovid calls the Sirens simply daughters of Achelous, with no mention of their mother.[11] Another 3rd-century BC, poet Apollonius of Rhodes, makes the mother the Muse Terpsichore,[12] while according to other accounts, she was the Muse Melpomene,[13] or the Calydonian princess Sterope.[14] By Perimede, the daughter of Aeolus, Achelous was said to have fathered Hippodamas and Orestes.[15]\n\nAchelous was also said to be the father (with no mothers mentioned) of several nymphs associated with various famous springs.[16] These included Pirene, the nymph of a spring at Corinth,[17] Castalia, the nymph of a spring at Delphi,[18] and Dirce, the nymph of a spring (and the stream that flowed from it) at Thebes, which became associated with the Dirce who was Antiope's aunt.[19] Plato has \"the nymphs\" as daughters of Achelous,[20] and the 5th-century BC poet Panyassis seems also to have referred to \"Achelesian nymphs\".[21] He was also the father (again with no mother mentioned) of Alcmeon's second wife Callirrhoe, whose name means \"the lovely spring\".[22] Such examples suggest the possibility of a tradition in which Achelous was considered to be the father of all springs or, at least, the nymphs associated with them.[23]\n\nAchelous was a suitor for Deianeira, daughter of Oeneus, the king of Calydon; he transformed himself into a bull and fought Heracles for the right to marry Deianeira, but was defeated, and Heracles married Deianeira.[25] The story of Achelous, in the form of a bull, battling with Heracles for Deianeira, was apparently told as early as the 7th century BC, in a lost poem by the Greek poet Archilochus, while according to a summary of a lost poem by the early 5th-century BC Greek poet Pindar, during the contest, Heracles broke off one of Achelous's bull-horns, and the river-god was able to get his horn back by trading it for a horn from Amalthea.[26]\n\nSophocles, in his play Women of Trachis (c. 450–425 BC), has Deianeira tell her story, how Achelous wooed her in the shape of a bull, a snake, and a half-man/half-bull:[27]\n\nFor my suitor was a river-god, Achelous, who in three shapes was always asking me from my father—coming now as a bull in visible form, now as a serpent, sheeny and coiled, now ox-faced with human trunk, while from his thick-shaded beard wellheads of fountain-water sprayed. In the expectation that such a suitor would get me, I was always praying in my misery that I might die, before I should ever approach that marriage-bed. But at last, to my joy, the glorious son of Zeus and Alcmena came and closed with him in combat and delivered me.[28]\nIn later accounts, Achelous does not get his horn back, as he does in Pindar's poem. Ovid, in his poem Metamorphoses (8 AD), has Achelous tell a different story.[29] In this version, Achelous fights Heracles, and loses three times: first in his normal (human?) shape, then as a snake, and finally as a bull. Heracles tore off one of Achelous's bull-horns, and the Naiads filled the horn with fruit and flowers, transforming it into the \"Horn of Plenty\" (cornucopia).[30] According to the Fabulae (before 207 AD), by the Latin mythographer Hyginus, Heracles gave the broken-off horn to \"the Hesperides (or Nymphs)\", and it was \"these goddesses\" who \"filled the horn with fruit and called it \"Cornucopia\".[31] According to Strabo, in some versions of the story Heracles gave  Achelous's horn to Deianeira's father Oeneus as a wedding gift.[32]  While several sources make Achelous the father, by various mothers, of the Sirens (see above), according to the 4th-century AD Greek teacher of rhetoric Libanius, they were born from the blood Achelous shed when Heracles broke off his horn.[33]\n\nThe breaking off of Achelous' horn was rationalized as Heracles' diversion of the Acarnanian river.[34] Both Diodorus Siculus and Strabo give such accounts.[35] According to Diodorus, Heracles diverted the Achelous River's course, while according to Strabo, some writers \"conjecturing the truth from the myths\" said that, to please his father-in-law Oeneus, Heracles confined the river by means of \"embankments and channels\". In this way, Heracles defeated the raging river, and in so doing created a large amount of new fertile land and \"certain poets, as we are told, have made this deed into a myth\" (Diodorus).  By both accounts, this new bountiful land of the Achelous River delta came to be known as Amaltheia's horn of plenty.\n\nJoseph Fontenrose saw in this story the possible reflection of an ancient tradition of conflict between Zeus and Achelous.[36] For the Latin poets during the Roman Imperial period, from Propertius onward, the story of Heracles and Achelous' contest for Deianeria continued to be popular, with Achelous as \"the stereotypical unlucky lover\".[37]\n\nAchelous played a role in the story of the Argive hero Alcmaeon, who had killed his mother Eriphyle because of her treachery against his father Amphiaraus, and needed to be religiously purified.[38] According to Apollodorus, Alcmaeon was first purified by Phegeus the king of Psophis, but nevertheless the land of Psophis became barren because of the cursed Alcmaeon's presence. As Thucydides tells the story, the oracle of Apollo told Alcmaeon that he needed to find a land to live in that did not yet exist at the time of his mother's death. After long travels, Alcmaeon finally came to the springs of the Achelous River, where he was purified by the river-god, and received Achelous's daughter Callirrhoe as his wife, and at the mouth of the river he discovered a land newly made by deposits of river silt, where he could make his home free of his curse.[39] Later, according to Apollodorus, Achelous commanded Alcmaeon to dedicate the necklace and robe—the cause of his mother's treachery—at Delphi, which he did.[40]\n\nOvid, in his Metamorphoses, has the river-god involved in two transformation stories concerning the creation of islands near the mouth of the Achelous River.[41] According to Ovid, the Echinades Islands were once five local nymphs.[42] One day, the nymphs were offering sacrifices to the gods on the banks of the Achelous, but they forgot to include Achelous himself. The river-god became so angry, he overflowed his banks with a raging flood, sweeping the nymphs away into the sea. As Achelous tells the story:\n\nI tore forests from forests, fields from fields; and with the place they stood on, I swept the nymphs away, who at last remembered me then, into the sea. There my flood and the sea, united, cleft the undivided ground into as many parts as now you see the Echinades yonder amid the waves.[43]\nAchelous goes on to describe the creation of another island: \"far away beyond the others is one island that I love: the sailors call it Perimele.\"[44] She was the daughter of Hippodamas, whose virginity Achelous took from her. Her enraged father threw her off a high cliff into the sea. But Achelous prayed to Poseidon to save her, and in answer Poseidon transformed the girl into an island.[45]\n\nAchelous's name could be used to refer to water (or fresh water?) in general.[46] Thus Euripides can have a house, far from the Achelous river itself, being sprinkled with \"Achelous' water\",[47] or have servants \"bring Achelous\" [Ἀχελῷον φέρειν] to douse a fire,[48] while the comic playwright Aristophanes, in his Lysistrata, has the Woman's chorus leader, while pouring water on the Men's chorus, say \"Achelous, you’re on!\".[49]\n\nIn particular, his name was used to refer to the water that was mixed with wine for drinking. Examples include three fragments from now lost fifth-century BC Attic plays. A Sophocles fragment has the single line: \"So Achelous runs with wine in our place\",[50] and a fragment from a satyr play by Achaeus has unhappy satyrs complaining about too much \"of Achelous\" being mixed with the wine they are being given to drink.[51] An Aristophanes fragment has a character complain about the aftereffects of drinking unwatered wine:[52]\n\nI had a savage fit\n\nof vomiting, for the wine stirred me up,\n\n\nhaving no admixture of Achelous\nOvid, in his Fasti, uses Achelous' name as a stand in for water when he connects wine drinking with  the wearing of flowers in the hair:\n\nNo serious business does he do whose brow is garlanded; no water of the running brook is quaffed by such as twine their hair with flowers: so long as thy stream, Achelous, was dashed with no juice of grapes, none cared to pluck the rose.[53]\nVirgil has Liber (Dionysus) responsible for the mixing of the \"draughts of Achelous\" with wine.[54]\nWhile according to Hyginus, a man named Cerasus was the first to mix wine with \"the Achelous river in Aetolia\", explaining that this is why the word for \"mixing\" in Greek is cerasai.[55] Achelous is also mythologicaly linked with Dionysus and wine, through his connection with Deianeira, and her father Oeneus.[56] There are various stories involving Oeneus (whose name means \"Wine-man\") Dionysus, and the origins of wine.[57] According to Apollodorus, Oeneus was the first mortal given the grape vine by Dionysus.[58] Hyginus explains that Oeneus was given the grape vine and instruction on viticulture by the wine-god, as a reward for his \"generous hospitality\" in having turned a blind eye to the god seducing his wife and fathering Deianeira.[59]\n\nAchelous was a rural-agricultural water god whose importance was a reflection of the agricultural importance of rivers and their fertile river deltas. This relationship is also reflected in the association of Achelous' broken-off horn with the cornucopia or horn of plenty.[62] Apparently some ancient Greeks considered sacrifices to Achelous to be even more important than those to the agriculture goddess Demeter.[63] Many inscriptions attest to the cult of Achelous, which was particularly associated with the oracle at Dodona. Although of early importance, his cult declined in significance from the end of the fourth-century BC.[64]\n\nFrom at least as early as Homer, Achelous was apparently considered to be an important divinity throughout Greece.[65] Calling Achelous \"king\", Homer mentions Achelous (along with Oceanus) as a mighty river, using him as a measure of the strength of (the even mightier) Zeus:[66]\n\nWith [Zeus] doth not even king Achelous vie, nor the great might of deep-flowing Ocean, from whom all rivers flow and every sea, and all the springs and deep wells; howbeit even he hath fear of the lightning of great Zeus, and his dread thunder, whenso it crasheth from heaven.[67]\nThe clear implication is that Achelous is the mightiest of the rivers (save perhaps for Oceanus himself), which would be in accord with Acusilaus' making Achelous the \"oldest and most honoured\" of the river-god offspring of Oceanus.[68] However some ancient scholars thought that the line: \"nor the great might of deep-flowing Ocean\", was spurious, which would in fact make Achelous—rather than Oceanus—the source of all other waters.[69] A commentary on Iliad 21.195, preserved on Oxyrhynchus Papyrus 221, contains a fragment of a poem, possibly from the Epic tradition, which mentions \"the waters of silver-eddying Achelous\" being the source of \"the whole sea\".[70] A late-5th-century BC commentary on an Orphic theogony, preserved by the Derveni Papyrus, quotes a poetic fragment calling the rivers the \"sinews of Achelous\".[71] The same Oxyrhynchus Papyrus also quotes ancient verses which apparently equated Achelous and Oceanus,[72] and that \"many people sacrifice to Achelois before sacrificing to Demeter, since Acheloios is the name of all rivers and the crop comes from water\".[73]\n\nAchelous as a cultic figure is attested as early as the seventh century BC. The 2nd-century geographer Pausanias, reports seeing, near Megara, an altar to Achelous erected by the seventh-century BC \"tyrant\", Theagenes of Megara.[75] Achelous was the only river-god to achieve Panhellenic cult status. By the fifth century BC he shared many sanctuaries with his daughters the nymphs.[76] Achelous appears in many votive reliefs which often include nymphs. Such reliefs were given as dedications in sanctuaries.[77] A votive relief (Athens 1488), dedicated to \"Pan and the Nymphs\", shows Hermes leading three nymphs in a cave, with a relief head of Achelous depicted on the wall of the cave.[78] In a similar votive relief (Athens 1859), Achelous is depicted as a bull with a human head.[79] Achelous could also be venerated in the form of stylized votive masks, similar to the cult masks of the wine-god Dionysus.[80] A well-known example of such a cult mask, considered to be Achelous, is a marble mask (c. 490–470 BC) from Marathon (Berlin SK 100).[81]\n\nAccording to the early 4th-century BC Greek historian Ephorus, the oracle at Dodona usually added to his pronouncements the command to offer sacrifices to Achelous, and that, while people would offer sacrifices to their local river, only the Achelous river was honoured everywhere, with Achelous's name often being invoked in oaths, prayers and sacrifices, \"all the things that concern the gods\".[82] Ephorus, explaining the \"puzzle\" of why Achelous name was used to mean water, said that, because of the frequent oracular command at Dodona to off",
  "concepts": [
    "Achelous",
    "achelous",
    "river",
    "bull",
    "heracles",
    "bc",
    "nymphs",
    "water",
    "god",
    "according",
    "century"
  ],
  "findings": [
    "Etymology",
    "Family",
    "Mythology",
    "Heracles and Deianeira",
    "Alcmaeon",
    "Creation of islands",
    "Water and wine",
    "Cult",
    "River-gods and bulls",
    "Iconography",
    "Achelous and Heracles",
    "Votive reliefs",
    "Other contexts",
    "Possible origins",
    "The Achelous River",
    "The Metamorphoses",
    "See also",
    "Notes",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:56.423652"
}