{
  "title": "Lane Twitchell",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Lane_Twitchell",
  "content": "Lane Jay Twitchell (born 1967) is a mixed media artist . Twitchell mainly works in paint media, paper cutting, and collage. \n\nLane Jay Twitchell was born on November 17, 1967, in Murray, UT. He was raised in the cities of Ogden and Salt Lake City, UT as a member of the Church of Jesus Christ of Latter-day Saints (LDS Church).[citation needed] He attended the University of Utah on a special departmental scholarship in 1986, and graduated with his BFA in 1993. He then went on to the School of Visual Arts in New York City, where he graduated with his MFA in 1995.[1] He currently lives and works in Brooklyn, New York, and also works as a professor at the School of Visual Arts in New York City.[2]\n\nTwitchell had his first solo exhibition at New York's gallery, Deitch Projects (1999). Twitchell has received positive reviews in The New York Times, The New York Observer, The Washington Post, and Art in America. In 1998, Lane Twitchell was the recipient of a Rema Hort Mann Foundation grant. He is also a two-time winner of a New York Foundation for the Arts fellowship in Drawing (1999) and Craft (2003).[citation needed] In 1998, he participated in the Museum of Modern Art's (MoMA) P.S. 1 National Studio Program.[3] He completed his artist residency at Wier Farm Trust in Wilton, CT. He has completed two New York City public art commissions, and two commissions with the Chicago Public Art Program and the Department of Cultural Affairs Percent Art Program.[4][5] His work is held at The Museum of Modern Art,[6] the Springville Museum of Art (Springville, UT), and The Church Museum of History and Art (Salt Lake City, UT). Cherie K. Woodworth wrote, “What Twitchell does is reinterpret the Western landscape— landscape as kaleidoscope, as a quilt made of paper, as a wide open world refracted in a giant, man-made snowflake. It is the landscape and the heart of the West—its natural grandeur, its history, its modern-day suburbs. Twitchell’s landscape is a labyrinthine desert rose blossoming in the midst of Manhattan.”[citation needed]\n",
  "concepts": [
    "Lane Twitchell"
  ],
  "findings": [
    "Biography",
    "Career",
    "Works",
    "References",
    "Further reading"
  ],
  "timestamp": "2025-04-11T10:06:28.613068"
}