{
  "title": "Jeff Monken",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jeff_Monken",
  "content": "Jeffrey Michael Monken (born April 15, 1967) is an American college football coach.  He is the head football coach at the United States Military Academy, a position he has held since 2014. Monken previously served as the head football coach of Georgia Southern University from 2010 to 2013. Prior to that, he worked under Paul Johnson as a running backs coach and special teams coordinator at Georgia Southern, the United States Naval Academy, and Georgia Tech.\n\nAfter graduating from Millikin University in Decatur, Illinois in 1989, Monken took his first coaching position as a graduate assistant at Hawaii.[1] It was during his tenure at Hawaii he first worked under Paul Johnson, who was the Rainbows' offensive coordinator at the time.[2] From Hawaii, Monken coached for one season at Arizona State and three seasons at Buffalo.\n\nHe was hired as a head coach for the first time at J. Sterling Morton High School for the 1995 season.[3] From Morton, Monken spent one season at Concordia before being hired by Johnson as a running backs coach at Georgia Southern in 1997.[2]\n\nHe continued to coach under Johnson at Georgia Southern (1997–2001), at Navy (2002–2007), and at Georgia Tech (2008–2009) before taking the head coaching position at Georgia Southern.[3]\n\nIn November 2009, Monken was hired to succeed Chris Hatcher as the head coach at Georgia Southern.[4] In his first season with the Georgia Southern, Monken led the Eagles to an overall record of 10–5 and to the 2010 FCS Playoffs Semifinals, defeating top-ranked and previously undefeated Appalachian State to begin a streak of six consecutive wins.[5]\n\nIn 2011, Monken led the Eagles to an overall record of 11–3, the Southern Conference championship and a second-straight trip to the 2011 FCS Playoffs Semifinals.[5] He was named both the AFCA 2011 FCS Region 2 Coach of the Year and the Southern Conference Coach of the Year.[6]\n\nIn 2012, Monken again led the Eagles to a Southern Conference Championship with a 10–4 overall record, a third consecutive FCS Semifinal Game appearance and final No. 3 national ranking. Georgia Southern accepted an invitation to join the Sun Belt Conference in March 2013 and subsequently made the move to FBS. In its first transition year in 2013, the Eagles were not eligible for the NCAA playoffs and ended their FCS history with a 26–20 victory over Florida in the season finale.[7]\n\nOn December 30, 2013, Monken was introduced as the 37th head coach of the Army Black Knights football program.[8] Monken's Army tenure started slow, with a 4–8 2014 season and 2–10 2015 season, including a loss to Joe Moorhead's FCS Fordham Rams.[9][10] In 2018, he became the first head coach to lead Army to three consecutive bowl appearances, consecutive 10-win seasons, and its first ever 11-win season.  These resulted in a final AP Poll ranking of No. 19[11] and final Coaches Poll ranking of No. 20[12] for Monken's 2018 Black Knights, the highest the Black Knights had finished in the final polls since legendary Army coach Earl 'Red' Blaik's 1958 squad. It also resulted in the Cadets winning their eighth Lambert Trophy (signifying the Black Knights as the best team in the East in Division I FBS), but their first since that 1958 team.[13] Following his team's 2018 accomplishments, Coach Monken was awarded the George Munger Collegiate Coach of the Year Award by the Maxwell Football Club,[14] the Vince Lombardi College Football Coach of the Year Award by the Lombardi Foundation,[15] and the President's Award by the Touchdown Club of Columbus.[16] In 2021, Monken was awarded the ECAC Division I FBS Football Coach of the Year Award.[17]\n\nMonken graduated from Joliet Central High School in Joliet, Illinois in 1985.[18] He is a cousin of Todd Monken, the current offensive coordinator for the Baltimore Ravens. A dozen of Monken's family members, including his father, Mike, and brother, Tom, have coached football at the high school, college, or professional level.[19] Monken was inducted into the Millikin Athletics Hall of Fame in October 2013.\n\n# denotes interim head coach\n\n# denotes interim head coach\n",
  "concepts": [
    "Jeff Monken",
    "coach",
    "monken",
    "southern",
    "georgia",
    "head",
    "season",
    "georgia southern",
    "football",
    "year",
    "head coach"
  ],
  "findings": [
    "Coaching career",
    "Assistant coaching career",
    "Head coaching career",
    "Army",
    "Personal life",
    "Head coaching record",
    "College",
    "References",
    "Further reading",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:06.408231"
}