{
  "title": "Binary tiling",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Binary_tiling",
  "content": "In geometry, a binary tiling (sometimes called a Böröczky tiling)[1] is a tiling of the hyperbolic plane, resembling a quadtree over the Poincaré half-plane model of the hyperbolic plane. The tiles are congruent, each adjoining five others. They may be convex pentagons, or non-convex shapes with four sides, alternatingly line segments and horocyclic arcs, meeting at four right angles.\n\nThere are uncountably many distinct binary tilings for a given shape of tile. They are all weakly aperiodic, which means that they can have a one-dimensional symmetry group but not a two-dimensional family of symmetries. There exist binary tilings with tiles of arbitrarily small area.\n\nBinary tilings were first studied mathematically in 1974 by Károly Böröczky [hu]. Closely related tilings have been used since the late 1930s in the Smith chart for radio engineering, and appear in a 1957 print by M. C. Escher.\n\nA tiling of a surface is a covering of the surface by geometric shapes, called tiles, with no overlaps and no gaps. An example is the familiar tiling of the Euclidean plane by squares, meeting edge-to-edge,[2] as seen for instance in many bathrooms.[3] When all the tiles have the same shape and size (they are all congruent), the tiling is called a monohedral tiling, and the shape of the tiles is called the prototile of the tiling.[2] The binary tilings are monohedral tilings of the hyperbolic plane, a kind of non-Euclidean geometry with different notions of length, area, congruence, and symmetry than the Euclidean plane.[4]\n\nTwo common models for the hyperbolic plane are the Poincaré disk model and Poincaré half-plane model. In these, the points of the hyperbolic plane are modeled by points in the Euclidean plane, in an open disk or the half-plane above a horizontal line respectively. Hyperbolic lines are modeled by those Euclidean circles and lines that cross the model's boundary perpendicularly. The boundary points of the model are called ideal points, and a hyperbolic line through an ideal point is said to be asymptotic to it. The half-plane model has one more ideal point, the point at infinity, asymptotic to all vertical lines. Another important class of hyperbolic curves, called horocycles, are modeled as circles that are tangent to the boundary of the model, or as horizontal lines in the half-plane model. Horocycles are asymptotic to their point of tangency, or to the point at infinity if they have none.[5][6]\n\nIn one version of binary tiling, each tile is a shape bounded by two hyperbolic lines and two horocycles. These four curves should be asymptotic to the same ideal point, with the two horocycles at hyperbolic distance \n\n\n\nlog\n⁡\n2\n\n\n{\\displaystyle \\log 2}\n\n from each other. With these choices, the tile has four right angles, like a rectangle, with its sides alternating between segments of hyperbolic lines and arcs of horocycles. The choice of \n\n\n\nlog\n⁡\n2\n\n\n{\\displaystyle \\log 2}\n\n as the distance between the two horocycles causes one of the two arcs of horocycles (the one farther from the asymptotic point) to have twice the hyperbolic length of the opposite arc. Copies of this shape, meeting edge-to-edge along their line segment sides, can tile the slab or crescent shaped region between two horocycles. A nested family of these slabs or crescents can then tile the entire hyperbolic plane, lined up so that the long arc of each tile in one slab is covered by the short arcs of two tiles in the next slab. The result is a binary tiling.[1]\n\nIn the Poincaré half-plane model of hyperbolic geometry, each tile can be modeled as an axis-parallel square or rectangle.[4][7] In this model, rays through the vertical sides of a tile model hyperbolic lines, asymptotic to the point at infinity, and lines through the horizontal sides of a tile model horocycles, asymptotic to the same point.[5] The hyperbolic length of an arc of a horizontal horocycle is its Euclidean length divided by its \n\n\n\ny\n\n\n{\\displaystyle y}\n\n-coordinate, while the hyperbolic distance between points with the same \n\n\n\nx\n\n\n{\\displaystyle x}\n\n-coordinate is the logarithm of the ratio of their \n\n\n\ny\n\n\n{\\displaystyle y}\n\n-coordinates.[6] From these facts one can calculate that successive horocycles of a binary tiling, at hyperbolic distance \n\n\n\nln\n⁡\n2\n\n\n{\\displaystyle \\ln 2}\n\n, are modeled by horizontal lines whose Euclidean distance from the \n\n\n\nx\n\n\n{\\displaystyle x}\n\n-axis doubles at each step, and that the two bottom half-arcs of a binary tile each equal the top arc.\n\nAn alternative and combinatorially equivalent version of the tiling places its vertices at the same points, but connects them by hyperbolic line segments instead of arcs of horocycles, so that each tile becomes a hyperbolic convex pentagon. This makes the tiling a proper pentagonal tiling.[7][8] The hyperbolic lines through the non-vertical sides of these tiles are modeled in the half-plane model by semicircles centered on the \n\n\n\nx\n\n\n{\\displaystyle x}\n\n-axis, and the sides form arcs of these semicircles.[6]\n\nIn the square tiling of the Euclidean plane, every two tiles are positioned in the same way: there is a symmetry of the whole tiling (a translation) that takes one tile to the other. But a binary tiling does not have symmetries that take every tile to every other tile. For instance, for the four tiles two levels below any given tile, no symmetry takes a middle tile to an outer tile. Further, there is only one way of tiling the Euclidean plane by square tiles that meet edge-to-edge, but there are uncountably many edge-to-edge binary tilings.[1] The prototile of the binary tiling can be modified to force the tiling to be edge-to-edge, by adding small protrusions to some sides and matching indentations to others.[4]\n\nSome binary tilings have a one-dimensional infinite symmetry group. For instance, when a binary tiling is viewed in the half-plane model, it may be possible to scale the model by any power of two without changing the tiling. When this is possible, the tiling has infinitely many symmetries, one for each power of two.[1] However, no binary tiling has a two-dimensional symmetry group. This can be expressed mathematically by saying that it is not possible to find a finite set of tiles such that all tiles can be mapped to the finite set by a symmetry of the tiling. More technically, no binary tiling has a cocompact symmetry group.[4]\n\nAs a tile all of whose tilings are not fully periodic, the prototile of a binary tiling solves an analogue of the einstein problem in the hyperbolic plane. This problem asks for a single prototile that tiles only aperiodically; long after the discovery of the binary tilings, it was solved in the Euclidean plane by the discovery of the \"hat\" and \"spectre\" tilings. However, the binary tilings are only weakly aperiodic, meaning that no tiling has a two-dimensional group of symmetries. Because they can have one-dimensional symmetries, the binary tilings are not strongly aperiodic.[9]\n\nIn binary tilings, more strongly than having all tiles the same shape, all first coronas of tiles have the same shape (possibly after a reflection). The first corona is the set of tiles touching a single central tile. Here, coronas are considered the same if they are reflections of each other. For tilings of the Euclidean plane, having all first coronas the same implies that the tiling is periodic and isohedral, meaning that all tiles are symmetric to each other. The binary tilings show that, in the hyperbolic plane, a tiling can have congruent coronas without being isohedral.[10]\n\nThe dual tilings of the binary tilings are formed by choosing a reference point within each tile of a binary tiling, and connecting pairs of reference points of tiles that share an edge with each other. They are not monohedral: the binary tilings have vertices where three or four tiles meet, and correspondingly the dual tilings have some tiles that are triangles and some tiles that are quadrilaterals. The fact that the binary tilings are non-periodic but monohedral (having only one tile shape) translates an equivalent fact about the dual tilings: they are non-periodic but monocoronal, having the same pattern of tiles surrounding each vertex.[7]\n\nBinary tilings were first studied mathematically in 1974 by Károly Böröczky [hu].[4][11][12] Böröczky was investigating the density of a discrete planar point set, the average number of points per unit area. This quantity is used, for instance, to study Danzer sets. For points placed one per tile in a monohedral tiling of the Euclidean plane, the density is inverse to the tile area. But for the hyperbolic plane, paradoxical issues ensue.[4][12] The tiles of a binary tiling can be grouped into three-tile subunits, with each subunit consisting of one tile above two more (as viewed in the Poincaré half-plane model). Points centered within the upper tile of each subunit have one point per subunit, for an apparent density equal to one third of the area of a binary tile. However, the same points and the same binary tiling can be regrouped in a different way, with two points per subunit, centered in the two lower tiles of each subunit, with two times the apparent density. This example shows that it is not possible to determine the density of a hyperbolic point set from tilings in this way.[12][13]\n\nAnother application involves the area of tiles in a monohedral tiling.\nIn defining the binary tilings, there is a free parameter, the distance between the vertical sides of the tiles. All tiles in a single tiling have equal hyperbolic areas, but if this distance changes, the (equal) area of all the tiles will also change, in proportion. Choosing this distance to be arbitrarily small shows that the hyperbolic plane has tilings by congruent tiles of arbitrarily small area.[11]\n\nJarkko Kari has used a system of colorings of tiles from a binary tiling, analogous to Wang tiles, to prove that determining whether a given system of hyperbolic prototiles can tile the hyperbolic plane is an undecidable problem.[8] Subdivisions of a binary tiling that replace each tile by a grid graph have been used to obtain tight bounds on the fine-grained complexity of graph algorithms.[14] Recursive data structures resembling quadtrees, based on binary tiling, have been used for approximate nearest neighbor queries in the hyperbolic plane.[15]\n\nA 1957 print by M. C. Escher, Regular Division of the Plane VI, has this tiling as its underlying structure, with each square tile of a binary tiling (as seen in its quadtree form) subdivided into three isosceles right triangles.[16] It is one of several Escher prints based on the half-plane model of the hyperbolic plane.[17] The print itself replaces each triangle by a stylized lizard.[16]\n\nThe Smith chart, a graphical method of visualizing parameters in radio engineering, resembles a binary tiling on the Poincaré disk model of the hyperbolic plane, and has been analyzed for its connections to hyperbolic geometry and to Escher's hyperbolic tilings.[18] It was first developed in the late 1930s by Tōsaku Mizuhashi,[19] Phillip Hagar Smith,[20] and Amiel R. Volpert.[21]\n\nThe Cayley graph of the Baumslag–Solitar group \n\n\n\nB\nS\n(\n1\n,\n2\n)\n\n\n{\\displaystyle BS(1,2)}\n\n, has the group elements as vertices, connected by edges representing multiplication by this group's standard generating elements. This graph can be decomposed into \"sheets\", whose vertices and edges form a binary tiling. At each level of a binary tiling, there are two choices for how to continue the tiling at the next higher level. Any two sheets will coincide for some number of levels until separating from each other by following different choices at one of these levels, giving the sheets the structure of an infinite binary tree.[22][23]\n\nA related tiling of the hyperbolic plane by Roger Penrose can be interpreted as being formed by adjacent pairs of binary tiles, one above the other, whose unions form L-shaped tiles. Like binary tiling, it is weakly aperiodic.[24] Charles Radin describes another modification to the binary tiling in which an angular bump is added to the two lower sides of each tile, with a matching indentation cut from the upper side of each tile. These modified tiles can form the usual binary tilings, but they can also be used to form different tilings that replace each face of an apeirogonal tiling by the subset of a binary tiling that lies inside a horocycle. (For horizontal horocycles in the Poincaré half-plane, the inside is above the horocycle.) These mixed binary and apeirogonal tilings avoid the density paradoxes of the binary tiling.[4]\n\nThe dual graph of a binary tiling has a vertex for each tile, and an edge for each pair of tiles that share an edge. It takes the form of an infinite binary tree (extending infinitely both upwards and downwards, without a root) with added side-to-side connections between tree nodes at the same level as each other.[1] An analogous structure for finite complete binary trees, with the side-to-side connections at each level extended from paths to cycles, has been studied as a network topology in parallel computing, the ringed tree.[25] Ringed trees have also been studied in terms of their hyperbolic metric properties in connection with small-world networks.[26]\nOmitting the side-to-side connections gives an embedding of an infinite binary tree as a hyperbolic tree.[15]\n",
  "concepts": [
    "Binary tiling"
  ],
  "findings": [
    "Tiles",
    "Enumeration and aperiodicity",
    "Applications",
    "Related patterns",
    "See also",
    "References"
  ],
  "timestamp": "2025-04-11T10:14:21.325875"
}