{
  "title": "Curing (food preservation)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Curing_(food_preservation)",
  "content": "Curing is any of various food preservation and flavoring processes of foods such as meat, fish and vegetables, by the addition of salt, with the aim of drawing moisture out of the food by the process of osmosis. Because curing increases the solute concentration in the food and hence decreases its water potential, the food becomes inhospitable for the microbe growth that causes food spoilage. Curing can be traced back to antiquity, and was the primary method of preserving meat and fish until the late 19th century. Dehydration was the earliest form of food curing.[1]  Many curing processes also involve smoking, spicing, cooking, or the addition of combinations of sugar, nitrate, and nitrite.[1]\n\nMeat preservation in general (of meat from livestock, game, and poultry) comprises the set of all treatment processes for preserving the properties, taste, texture, and color of raw, partially cooked, or cooked meats while keeping them edible and safe to consume. Curing has been the dominant method of meat preservation for thousands of years, although modern developments like refrigeration and synthetic preservatives have begun to complement and supplant it.\n\nWhile meat-preservation processes like curing were mainly developed in order to prevent disease and to increase food security, the advent of modern preservation methods mean that in most developed countries today[update], curing is instead mainly practiced for its cultural value and desirable impact on the texture and taste of food. For less-developed countries, curing remains a key process in the production, transport and availability of meat.\n\nSome traditional cured meat (such as authentic Parma ham[2] and some authentic Spanish chorizo and Italian salami) is cured with salt alone.[3] Today, potassium nitrate (KNO3) and sodium nitrite (NaNO2) (in conjunction with salt) are the most common agents in curing meat, because they bond to the myoglobin and act as a substitute for oxygen,[4] thus turning myoglobin red.[4][5] More recent evidence shows that these chemicals also inhibit the growth of the bacteria that cause the disease botulism.[4]\n\nThe combination of table salt with nitrates or nitrites, called curing salt, is often dyed pink to distinguish it from table salt.[6] Neither table salt nor any of the nitrites or nitrates commonly used in curing (e.g., sodium nitrate [NaNO3],[7] sodium nitrite,[7] and potassium nitrate[8]) is naturally pink.\n\nMeat decomposes rapidly if it is not preserved. The speed of decomposition depends on several factors, including ambient humidity, temperature, and the presence of pathogens. Most types of untreated meat cannot be kept at room temperature for lengthy periods before spoiling.\n\nSpoiled meat changes color and exudes a foul odor. Ingestion can cause serious food poisoning. Salt-curing processes were developed in antiquity[9] in order to ensure food safety without relying on then unknown anti-bacterial agents.\n\nThe short shelf life of fresh meat does not pose significant problems when access to it is easy and supply is abundant. But in times of scarcity and famine, or when the meat must be transported over long distances, food preservation is necessary.\n\nCuring significantly increases the length of time meat remains edible, by making it inhospitable to the growth of microbes.\n\nSalt (sodium chloride) is the primary ingredient used in meat curing.[10] Removal of water and addition of salt to meat creates a solute-rich environment where osmotic pressure draws water out of microorganisms, slowing down their growth.[10][11]  Doing this requires a concentration of salt of nearly 20%.[11]\n\nIn sausage production, salt causes the soluble proteins to come to the surface of the meat that was used to make the sausages.  These proteins coagulate when the sausage is heated, helping to hold the sausage together.[12]\n\nThe sugar added to meat for the purpose of curing it comes in many forms, including honey, corn syrup solids, and maple syrup.[13] However, with the exception of bacon, it does not contribute much to the flavor,[14] but it does alleviate the harsh flavor of the salt.[10] Sugar also contributes to the growth of beneficial bacteria such as Lactobacillus by feeding them.[15]\n\nNitrates and nitrites extend shelf life,[citation needed] help kill bacteria, produce a characteristic flavor and give meat a pink or red color.[16] Nitrite (NO−2) is generally supplied by sodium nitrite or (indirectly) by potassium nitrate. Nitrite salts are most often used to accelerate curing and impart a pink colour.[17] Nitrate is specifically used only in a few curing conditions and products where nitrite (which may be generated from nitrate) must be generated in the product over long periods of time.\n\nNitrite further breaks down in the meat into nitric oxide (NO), which then binds to the iron atom in the center of myoglobin's heme group, reducing oxidation and causing a reddish-brown color (nitrosomyoglobin) when raw and the characteristic cooked-ham pink color (nitrosohemochrome or nitrosyl-heme) when cooked. The addition of ascorbate to cured meat reduces formation of nitrosamines (see below), but increases the nitrosylation of iron.\n\nThe use of nitrite and nitrate salts for meat in the US has been formally used since 1925.[citation needed] Because of the relatively high toxicity of nitrite (the lethal dose in humans is about 22 mg/kg of body weight), the maximum allowed nitrite concentration in US meat products is 200 ppm. Plasma nitrite is reduced in persons with endothelial dysfunction.[18]\n\nNitrite-containing processed meat is associated with increased risk of developing colorectal cancer.[19] Adding nitrites to meat has been shown to generate known carcinogens such as nitrosamines, N-nitrosamides[20] and nitrosyl-heme, resulting from nitrosylation reactions; the World Health Organization (WHO) advises that each 50 g (1.8 oz) of \"processed meats\" eaten a day would raise the risk of getting bowel cancer by 18% over a lifetime; \"processed meat\" refers to meat that has been transformed through salting, curing, fermentation, smoking, or other processes to enhance flavour or improve preservation. The World Health Organization's review of more than 400 studies concluded, in 2015, that there was sufficient evidence that \"processed meats\" caused cancer, particularly colon cancer; the WHO's International Agency for Research on Cancer classified \"processed meats\" as carcinogenic to humans (Group 1).[17][21]\n\nThe use of nitrites in food preservation is highly controversial[22] due to the potential for the formation of nitroso-compounds such as nitrosamines, N-nitrosamides and nitrosyl-heme.[citation needed] When the meat is cooked at high temperatures, nitrite-cured meat products can also lead to the formation of nitrosamines.[16][23] The effect is seen for red processed meat, but not for white meat or fish.[24][25] Nitrates and nitrites may cause cancer and the production of carcinogenic nitrosamines can be potently inhibited by the use of the antioxidants vitamin C and the alpha-tocopherol form of vitamin E during curing.[26] Under simulated gastric conditions, nitrosothiols rather than nitrosamines are the main nitroso species being formed.[24] The use of either compound is therefore regulated; for example, in the United States, the concentration of nitrates and nitrites is generally limited to 200 ppm or lower.[16]\n\nThe meat industry considers nitrites irreplaceable because they speed up curing and improve color while retarding the growth of Clostridium botulinum,[17] the bacteria that causes botulism. Botulism, however, is an extremely rare disease (less than 1000 cases per year reported worldwide) and is almost always associated with home preparations of preserved food.[27][17] For example, all Parma ham has been made without nitrites since 1993, but was reported in 2018 to have caused no cases of botulism.[17]\n\nFurthermore, while the FDA has set a limit of 200 ppm of nitrates for cured meat, they are not allowed and not recognized as safe by the FDA in most other foods, even foods that are not cooked at high temperatures, such as cheese.[28]\n\nProcessed meats without \"added nitrites\" may be misleading as they may be using naturally occurring nitrites from celery instead.[29]\n\nA 2019 report from Consumer Reports[30] found that using celery (or other natural sources) as a curing agent introduced naturally occurring nitrates and nitrites. The USDA allows the term \"uncured\" or \"no nitrates or nitrites added\" on products using these natural sources of nitrites, which provides the consumer a false sense of making a healthier choice.\nThe Consumer Reports investigation also provides the average level of sodium, nitrates and nitrites found per gram of meat in their report.\n\nConsumer Reports and the Center for Science in the Public Interest filed a formal request to the USDA to change the labeling requirements in 2019.[31]\n\nMeat can also be preserved by \"smoking\". If the smoke is hot enough to slow-cook the meat, this will also keep it tender.[32]  One method of smoking calls for a smokehouse with damp wood chips or sawdust.[33]  In North America, hardwoods such as hickory, mesquite, and maple are commonly used for smoking, as are the wood from fruit trees such as apple, cherry, and plum, and even corncobs.\n\nSmoking helps seal the outer layer of the food being cured, making it more difficult for bacteria to enter. It can be done in combination with other curing methods such as salting. Common smoking styles include hot smoking, smoke roasting (pit barbecuing) and cold smoking.  Smoke roasting and hot smoking cook the meat while cold smoking does not. If the meat is cold smoked, it should be dried quickly to limit bacterial growth during the critical period where the meat is not yet dry. This can be achieved, as with jerky, by slicing the meat thinly.\n\nThe smoking of food directly with wood smoke is known to contaminate the food with carcinogenic polycyclic aromatic hydrocarbons.[34]\n\nSince the 20th century, with respect to the relationship between diet and human disease (e.g. cardiovascular, etc.), scientists have conducted studies on the effects of lipolysis on vacuum-packed or frozen meat. In particular, by analyzing entrecôtes of frozen beef during 270 days at −20 °C (−4 °F), scientists found an important phospholipase that accompanies the loss of some unsaturated fat n-3 and n-6, which are already low in the flesh of ruminants.[35]\n\nElevated levels of nitrites in preserved meats increase the risk of nasopharyngeal cancer.[36]\n\nIn 2015, the International Agency for Research on Cancer of the World Health Organization classified processed meat, that is, meat that has undergone salting, curing, fermenting, or smoking, as \"carcinogenic to humans\".[37][38][21]\n\nA survival technique since prehistory, the preservation of meat has become, over the centuries, a topic of political, economic, and social importance worldwide.\n\nFood curing dates back to ancient times, both in the form of smoked meat and salt-cured meat.[10]\n\nSeveral sources describe the salting of meat in the ancient Mediterranean world. Diodore of Sicily in his Bibliotheca historica wrote that the Cosséens[39] in the mountains of Persia salted the flesh of carnivorous animals.[40] Strabo indicates that people at Borsippa were catching bats and salting them to eat.[41] The ancient Greeks prepared tarichos (τάριχος), which was meat and fish conserved by salt or other means.[a] The Romans called this dish salsamentum – which term later included salted fat, the sauces and spices used for its preparation.[42] Also evidence of ancient sausage production exists. The Roman gourmet Apicius speaks of a sausage-making technique involving œnogaros (a mixture of the fermented fish sauce garum with oil or wine).[43] Preserved meats were furthermore a part of religious traditions: resulting meat for offerings to the gods was salted before being given to priests, after which it could be picked up again by the offerer, or even sold in the butcher's.[42]\n\nA trade in salt meat occurred across ancient Europe. In Polybius's time (c. 200 – c.118 BCE),[44] the Gauls exported salt pork each year to Rome in large quantities, where it was sold in different cuts: rear cuts, middle cuts, hams, and sausages. This meat, after having been salted with the greatest care, was sometimes smoked. These goods had to have been considerably important, since they fed part of the Roman people and the armies. The Belgae were celebrated above all for the care which they gave to the fattening of their pigs. Their herds of sheep and pigs were so many, they could provide skins and salt meat not only for Rome, but also for most of Italy.[citation needed] The Ceretani of Spain drew a large export income from their hams, which were so succulent, they were in no way inferior to those of Cantabria. These tarichos of pig became especially sought, to the point that the ancients considered this meat the most nourishing of all and the easiest to digest.[42]\n\nIn Ethiopia, according to Pliny,[45][clarification needed] and in Libya according to Saint Jerome, the Acridophages (literally, the locust-eaters) salted and smoked the crickets which arrived at their settlements in the spring in great swarms and which constituted, it was said, their sole food.\n\nThe smoking of meat was a traditional practice in North America, where Plains Indians hung their meat at the top of their tipis to increase the amount of smoke coming into contact with the food.[10]\n\nIn Europe, medieval cuisine made great use of meat and vegetables, and the guild of butchers was amongst the most powerful. During the 12th century,[46] salt beef was consumed by all social classes. Smoked meat was called carbouclée in Romance tongues[47] and bacon if it was pork.[48]\n\nThe Middle Ages made pâté a masterpiece: that which is, in the 21st century, merely spiced minced meat (or fish), baked in a terrine and eaten cold, was at that time composed of a dough envelope stuffed with varied meats and superbly decorated for ceremonial feasts. The first French recipe, written in verse by Gace de La Bigne, mentions in the same pâté three great partridges, six fat quail, and a dozen larks. Le Ménagier de Paris mentions pâtés of fish, game, young rabbit, fresh venison, beef, pigeon, mutton, veal, and pork, and even pâtés of lark, turtledove, baby bird, goose, and hen. Bartolomeo Sacchi, called Platine, prefect of the Vatican Library, gives the recipe for a pâté of wild beasts: the flesh, after being boiled with salt and vinegar, was larded and placed inside an envelope of spiced fat, with a mélange of pepper, cinnamon and pounded lard; one studded the fat with cloves until it was entirely covered, then placed it inside a pâte.\n\nIn the 16th century, the most fashionable pâtés were of woodcock, au bec doré, chapon, beef tongue, cow feet, sheep feet, chicken, veal, and venison.[49] In the same era, Pierre Belon notes that",
  "concepts": [
    "Curing (food preservation)"
  ],
  "findings": [
    "Reasons for curing",
    "Chemical actions",
    "Salt",
    "Sugar",
    "Nitrates and nitrites",
    "Nitrites from celery",
    "Smoke",
    "Research",
    "Health effects",
    "History",
    "Traditional methods",
    "Middle Ages",
    "Early modern era",
    "Effects on trade",
    "See also",
    "Notes",
    "References",
    "Further reading",
    "External links"
  ],
  "timestamp": "2025-04-11T10:08:31.033142"
}