{
  "title": "Smoke Monday",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Smoke_Monday",
  "content": "Quindarious \"Smoke\" Monday (born February 19, 2000) is an American professional football safety. He played college football at Auburn.\n\nMonday attended Carver High School in Atlanta, Georgia. Monday was a four-star recruit and the sixth ranked athlete in the class of 2018.[1] Monday decided to attend Auburn University over various Power 5 offers.[2]\n\nAs a freshman, Monday totaled 13 tackles, two sacks, and one interception. Monday's first career start was against Ole Miss, where he was almost ejected for targeting.[3] In his sophomore season, Monday recorded 20 tackles, one sack, and one interception that was returned for a touchdown in the 2019 Iron Bowl.[4] Monday played in all 11 of Auburn's games in 2020 and recorded 64 tackles, one sack, one forced-fumble, and two interceptions. He had a 100-yard interception return for a touchdown in a 30–17 victory over Tennessee.[5] He was named to the Second-team All-Southeastern Conference (SEC).[6] In Monday's senior season, he tallied 58 tackles, two sacks, and one interception. The interception was a pick six tying Monday for the Auburn record for most interceptions returned for a touchdown in Auburn history with three.[7] At the regular season's end, Monday announced he would declare for the 2022 NFL draft following the Tiger's bowl game.[8] In his final collegiate game, Monday recorded five tackles before being ejected for targeting.[9]\n\nMonday signed with the New Orleans Saints as an undrafted free agent on April 30, 2022.[12] On August 2, Monday suffered a torn ACL during practice, which prematurely ended his season.[13] He was placed on injured reserve on August 5.[14]\n\nOn August 28, 2023, Monday was released by New Orleans.[15]\n\nOn January 30, 2024, Monday signed with the Montreal Alouettes of the Canadian Football League.[16][17] He was released on June 2, 2024.[18]\n",
  "concepts": [
    "Smoke Monday",
    "monday",
    "tackles",
    "interception",
    "auburn",
    "season",
    "touchdown",
    "recorded",
    "football",
    "august",
    "30"
  ],
  "findings": [
    "Early life",
    "College career",
    "Professional career",
    "New Orleans Saints",
    "Montreal Alouettes",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:22.176737"
}