{
  "title": "Fiberfab",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Fiberfab",
  "content": "Fiberfab was an American automotive manufacturer established in 1964. Starting with accessories and body parts, they progressed to making kit cars and fully assembled automobiles. They became one of the longest lasting kit car manufacturers.[1]\n\nAfter moving from Wisconsin to California, Warren Harding \"Bud\" Goodwin began racing sports cars.[2] He built his own racing special, topped with a Microplas Mistral body. Goodwin incorporated Sports Car Engineering (SCE) in 1957 to manufacture Mistral bodies under license and sell them as the SCE Spyder.[2][3] SCE's bodies incorporated the innovation of bonding steel tubing into the fiberglass for rigidity. SCE also manufactured custom chassis. By the time Goodwin sold the company to Du Crest Fiberglass in 1958, SCE's product line had grown to include the Tornado and Hurricane models.[2]\n\nIn 1964 Goodwin and partner John Hebler established the Fiberfab Company in Palo Alto, California.[4] The company started building street rod parts and body panels for Corvettes, Mustangs, and Jaguars before moving on to complete bodies and kit cars.\n\nNoel Johnson was a Fiberfab employee who later became part owner of the company.[4] He said that Goodwin was impressed by the Devin body kit concept, but wanted a product that would be easier for the inexperienced home builder to assemble.\n\nWithin two years Fiberfab had launched several complete body kits, including the Apache, Aztec and Aztec II, and the Centurion.\n\nIn 1966 Fiberfab was made a subsidiary of Velocidad Inc., another company controlled by Goodwin.[4] The key people in Velocidad were Jamaica K. Goodwin (president), Warren “Bud” Goodwin (vice-president), and John E. Hebler (Secretary-Treasurer/plant manager). The company was also referred to as Fiberfab-Velocidad Inc.\n\nThe Fiberfab company moved from Palo Alto to Sunnyvale.[5] In early January 1967 Fiberfab opened a new plant to produce the Valkyrie in Santa Clara.[6]\n\nIn 1967, Goodwin was arrested on suspicion of murder in the shooting death of his 28-year-old second wife and Fiberfab executive, Jamaica Karen Goodwin (née Elwood).[5][7] He was convicted of voluntary manslaughter and sentenced to twelve months imprisonment. He died of a heart attack while serving his sentence on 26 December 1968.[8]\n\nAround this time Hebler left the company to start Hebina Plastics with John Ubina, Fiberfab's former head of fiberglass layup.[4] Hebina designed their own car called the Gazelle, which was unrelated to the Neoclassic Gazelle sold by Classic Motor Carriages (CMC).[9] By 1970 the company had been acquired by Bill Voegele, a former Fiberfab engineer, and changed its name to Voegele Industries to reflect the change in ownership.[10] The car was released as the Voegele Amante GT.\n\nIn 1971 Richard G. Figueroa, Fiberfab's plant manager, partnered with Martin Enterprises, Fiberfab's Eastern US distributor, to start Concept Design America Ltd. (CDA) and salvage the financially struggling Fiberfab. They took control of the bodymaker and reorganized it as the Fiberfab Corp. division of CDA.[4]\n\nIn November 1974 Fiberfab Inc. was purchased by Pennsylvania-based A.T.R. Incorporated. Aris V.C. Valli was appointed president of the company.[11]\n\nIn August 1976 Aris Valli died from a heart attack and his son, Robert F. Valli, became acting president of Fiberfab.[4] The company began an internal reorganization.\n\nIn October 1978 Fiberfab, Inc. put new marketing and management teams in place, with Robert F. Valli as president. The number of models was reduced to three by cutting four product lines, including the Avenger GT.\n\nAfter a reorganization in 1979, the company changed its name to Fiberfab International Inc.[11][4] One source reports that the company did not last more than a single year with that name.[11]\n\nIn 1979 the company moved to Minneapolis.[12]\n\nOn 13 July 1979 Fiberfab was sued by LaVerne J. Martincic for infringing her claimed trademark of the \"MiGi\" name.[13] Martincic was the wife of Joseph Martincic, head of the Martin Enterprises Inc. that had controlled Fiberfab. Martincic said that Martin Enterprises had used the MiGi name from as early as 1975, and that she held the rights to the name after Martin Enterprises went out of business in May 1975. Martincic further claimed to have transferred the rights to the name to Daytona Automotive Fiberglass, a new neoclassic builder she was now involved in.\n\nFiberfab was purchased by competing kit car maker Classic Motor Carriages and registered as Fiberfab International Inc. on 27 May 1983.[14][15] CMC acquired all of the Fiberfab kits and molds except the Valkyrie, and stored them behind their Miami manufacturing facility unused until they were eventually scrapped.[16][1]\n\nCMC was forced to close in 1994 after the Florida Attorney General's Office filed suit against it on behalf of 900 of its customers.[17][18] It agreed to pay $2.5 million in compensation. While the case was proceeding a new company called Auto Resolutions was established by the owner George Levin to continue making Classic Motor Carriages vehicles, later operating under the name Street Beasts. Complaints continued.[18] Street Beasts closed down in 2010 and auctioned off its plant, molds, and machinery in 2011.[19]\n\nIn 2003 a new company called Factory Fiberfab US was formed to restart Fiberfab production. Originally based in Creston, Washington, they later relocated to La Pine, Oregon.[20] Factory Fiberfab US was headed by Daniel Richer, and has no affiliation with previous Fiberfab management.\n\nTheir primary product was a revised Valkyrie, but they also provided support for older Fiberfab products. This company planned to begin producing Valkyries for the 2004 Model year.\n\nAs of this writing, the company's website is still up, but has not been updated for several years.[12]\n\nFiberfab's product line included assorted autobody accessories and custom parts.[4] The company made fiberglass seat buckets, hoods and hood scoops, wheel flares, and assorted custom body parts for Jaguars and the VW Beetle.\n\nAmong the company's first products were replacement nose assemblies for early Corvettes. One version gave older Corvettes a front similar to the XP-700 concept car. Another product more closely resembled the 1961 Mako Shark concept car that influenced the 1967 C3 Corvette.[4]\n\nAnother of Fiberfab's early products was the E/T Mustang conversion.[21] This kit was designed by a moonlighting Larry Shinoda.[22] The final product looked somewhat like the nose of the mid-engined Ford Mustang I prototype.\n\nAn estimated fifty E/T Mustang kits were produced by Fiberfab. One was installed on an original Shelby Mustang.[23]\n\nSimilar kits were later produced by a company called VFN Fiberglass.[24]\n\nThe Apache was a complete replacement hardtop body for a Corvette chassis.[4] The body was advertised as being adaptable to other chassis with wheelbases between 98 and 104 in (2,489 and 2,642 mm). The kit was able to reuse the windscreen and doors from a Corvette. It is unknown whether any Apaches were actually sold.\n\nThe Fiberfab Aztec GT came out in 1964 and was built until 1965. The body resembled a Ford GT40 to some, but has also been compared to a coupe version of the earlier SCE Spyder, while still others cite influences including the Lola Mk6 / Lola GT.[4] Different versions of the Aztec GT could be had with an canopy door, gull-wing doors, or conventional doors.[25]\n\nIt has been estimated that hundreds or possibly thousands of Aztecs GTs were produced.[26]\n\nIn the fall of 1965 the original Aztec GT was replaced by an upgraded version called the Aztec II.[4] The bodywork of the Aztec II included a bobbed tail with a rear spoiler, and a longer nose. The revisions made the car more closely resemble a GT40.\n\nA further development of the Aztec model, the 1965–66 Azteca included a custom chassis designed to accept a mid-mounted Corvair engine.[27] Just three were built.[28] A restored, customized Azteca appeared at the 2013 SEMA show with a supercharged Corvair engine said to develop in the range of 275–350 hp (205.1–261.0 kW).[29]\n\nIn the mid-1960s Fiberfab was developing a car to be called the Banshee. It was designed by Russell and Chris Beebe, although they suggest that the mold maker made unauthorized changes to the final shape.[4] During the car's development General Motors (GM) approached Goodwin and bought the Banshee name from him.[4] GM would use the name for their Pontiac Banshee line of concept cars, starting in 1964. The Fiberfab car was renamed the Caribee.\n\nThe Banshee/Caribee had gull-wing doors and styling that has been compared to a Shelby Daytona coupe.[30] The body was made to be fitted over a variety of front-engine chassis, including ones from Triumph, MG and Austin-Healey.\n\nTwelve copies of the car were built.[30]\n\nIn around 1965 Fiberfab released the Centurion — a replica of the 1959 XP-87 Corvette Stingray Racer. Fiberfab's body was designed to be fitted to a Corvette chassis from 1953 to 1965.[31][32] Estimates of the number of bodies produced ranges from five to seven, with only five bodies remaining.[31][33] It is believed that the Centurion was canceled due to pressure from General Motors after a visit by Goodwin to the automaker.[4]\n\nOne Centurion appeared in a television commercial for garbage bags, and another was reported to have been backup to the real XP-87 in the movie \"Clambake\".[33]\n\nJay Leno owns or has owned a Centurion.[34] In 2018 a Centurion sold at auction for $91,000.[35]\n\nThe Valkyrie was released by Fiberfab in the fall of 1966. It looked even more like the GT40 than did the Aztecs. This mid-engined coupe used a custom steel chassis, and was sold in two forms. One was as a fully assembled automobile called the Valkyrie 500 GT that was priced at $12,500. This version included a leather interior, upgraded running gear and a 427 cu in (7.0 L) Chevrolet big-block engine producing 500 hp (372.8 kW). The other form was as a $1495 kit many of whose parts were sourced by the owner/builder. This version was typically powered by a Chevrolet small-block engine. When CMC bought the assets of Fiberfab Inc., the Valkyrie was not included in the deal.\n\nProduction continued in small numbers for many years. In 2003 the Factory Fiberfab US company promised to resume production.\n\nReleased in 1966 shortly after the Valkyrie, the Avenger GT's body was essentially the same as the Valkyrie's, except for having a longer tail section to cover the Avenger GT's rear-mounted engines. Two versions were built: the GT-12, which was based on a Volkswagen Beetle chassis and used the VW's suspension, engine and transaxle, and the GT-15, which had a custom-built chassis that used a Corvair front subframe and suspension as well as the Corvair's rear suspension, engine and transaxle.\n\nThousands of Avengers were sold in the 1970s.[26] Production ended in 1978.[11]\n\nThe Vagabond was one of two dune buggy models built by Fiberfab. Mounted a full-length VW chassis, the body incorporated headlamps integrated into the front fenderline.[36] The Vagabond was built from 1968 to 1970.[37]: 66–67 \n\nThe Clodhopper was a traditional dune buggy body for a shortened VW chassis.[38] It was built from 1968 to 1970.[37]: 66–67 \n\nSome Clodhoppers were re-badged and sold as Martin Enterprises buggies during the early 1970s, after Martin Enterprises became a controlling partner in Fiberfab.[4]\n\nIntroduced in 1968, this was another car based on a design by Chris and Russell Beebe, who also built the molds.[4] The car's shape has been compared to that of the Lamborghini Miura.[4][39] The formally registered trademark name for the car was \"The Jamaican\".[40] The car was named for Jamaica Goodwin.[41]\n\nLike the earlier Banshee/Caribee, the body could be fitted to the chassis from a TR3, TR4, MGA, or Austin-Healey.\n\nThe Jamaican II was an update to the earlier car. One version of The Jamaican II came with a custom chassis made by Fiberfab that was designed to accept a V8 engine.[39]\n\nAnother version of the car could be mounted on a VW Beetle chassis.[42]\n\nThe Aztec 7 was a Fiberfab kit inspired by the Bertone Carabo, an Alfa Romeo concept car of 1968.[43][44] The wedge-shaped car had gull-wing doors and was built on a Volkswagen platform. The windshield is the same used by the Lamborghini Miura.[43] At least two different versions of the Aztec 7 body existed; Type A and Type B.[45]\n\nProduction of the Aztec 7 started in the early 1970s. An estimated 400 copies were made.[46]\n\nThe Liberty SLR (for \"Super Light Roadster\") was Fiberfab's first neoclassic kit, with styling similar to an Aston Martin Ulster.[47] The car was designed to use a rear end from a Ford Mustang or Mercury Cougar and to be powered by a Ford Windsor V8 engine.[48] Front suspension was from a 1950–1967 Dodge half-ton truck. It was built by Fiberfab in the mid-1970s.\n\nThe original MiGi was an MG TD replica. Fiberfab built it in the mid-1970s, but the car and name were involved in some labor and legal issues.[13] The MiGi was replaced in Fiberfab's line up by the MiGi II.\n\nIn around 1975 Fiberfab introduced a kit for a reverse tricycle called the Scarab STM (for \"Sports Transport Module\").[4] The car used a custom frame with front suspension from a VW Beetle and a motorcycle frame and engine in back.[49] The Scarab STM was made at the company's Baldwin Street, Bridgeville, Pennsylvania plant. As few as six were built.\n\nThe Jet-A-Bout was an early personal watercraft built by Fiberfab.[4] As suggested by the name, the craft did not use a propeller but rather a jet pump driven by a gasoline engine. Various sizes of engines were offered. The foam-filled hull only required 2 inches (51 mm) of draft. It was Fiberfab's response to the launch of Bradley Automotive's Surfer GT.\n\nIn 1983 Fiberfab International introduced their 1929 Mercedes Benz SSK replica.[50] This was the CMC Gazelle re-badged as a Fiberfab kit.[4]\n\nThe Gazelle was an old design, originally a product of Bay Products Corp., then the Tiffany Motor Cars subsidiary of Bay Products Corporation, and then, on 8 September 1976, a product of Classic Motor Carriages, Inc., when George Newman formed the new company.\n\nFollowing the CMC takeover, the MG TD replicas from CMC's lineup were sold as Fiberfabs. In addition to versions based on a Volkswagen chassis, this product also offered the option of being built on Ford Pinto or Chevrolet Chevette mechanicals.\n\nThe Fiberfab Speedster 356 was a re-badged version of the CMC Classic Speedster, while the Californian was the fender-flared CMC Speedster C. The body was inspired by the Speedster variant of the Porsche 356. CMC acquired the design when they bought the rights to the Intermeccanica Speedster.[14] These were built from the mid to late 1980s.[47]\n\nThe Speedster 359 was a Speedster 356 whose body was modified to incorporate styling features from the Porsche 959. Production started in the late 1980s. It shared the original 959/911 wheelbase.",
  "concepts": [
    "Fiberfab",
    "fiberfab",
    "car",
    "company",
    "body",
    "built",
    "gt",
    "chassis",
    "called",
    "production",
    "cars"
  ],
  "findings": [
    "Corporate history",
    "Sports Car Engineering",
    "Fiberfab Co.",
    "Fiberfab, a division of Velocidad Inc.",
    "Fiberfab Corp. division of Concept Design America Ltd.",
    "Fiberfab Inc., division of A.T.R. Inc.",
    "Fiberfab International Inc.",
    "Fiberfab International Inc., division of Classic Motor Carriages, Inc.",
    "Factory Fiberfab US",
    "Products",
    "Original Fiberfab",
    "Re-badged CMC products",
    "Factory Fiberfab US",
    "Foreign offices, licensees, derivatives, imitators",
    "Canada",
    "Germany",
    "Sweden",
    "Finland",
    "United Kingdom",
    "South Africa",
    "United States",
    "Brazil",
    "Noteworthy cars",
    "Movie cars",
    "Steam-powered land speed record car",
    "Electric and hybrid conversions",
    "References",
    "Further reading",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:34:58.081006"
}