{
  "title": "Laurieston, Falkirk",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Laurieston,_Falkirk",
  "content": "Laurieston is a village in the Falkirk council area in Central Scotland. It is 1.5 miles (2.4 km) east Falkirk, 1.6 miles (2.6 km) south-west of Grangemouth and 1.6 miles (2.6 km) west of Polmont.\n\nLaurieston is located on the A803 road between Falkirk and Polmont. At the time of the 2001 census, Laurieston had a population of 2,752 residents,[2]  down from 3,000 in 1991 and 3,300 in 1971.[2]\n\nThe course of the Antonine Wall runs through the village with the largest fort on the wall located at Mumrills.\n\nLaurieston was a planned village. Before Francis Napier, 6th Lord Napier, started feuing the lands of Langton in 1756, there was just a scatter of cottages and farmhouses. This new settlement was called New Merchiston after the Napier family seat. It was then renamed Lawrencetown in 1765 after Napier sold the project to Sir Lawrence Dundas, becoming known as Laurieston within a few years.[3] Situated on the main street is Hawthorn Cottage, a nineteenth-century stone dwelling that was once owned by Alfred Nobel, inventor of dynamite and creator of the Nobel Prizes after his death. Nobel lived there while managing an explosives factory near the nearby villages of Redding and Westquarter.[4]\n\nMumrills Fort, the largest Roman Fort on the Antonine Wall, was situated to the east while the path of the Antonine Wall runs through the village. The course of the wall runs roughly along Grahamsdyke Street, which is named after the wall's medieval name \"Gryme's Dyke\".[5]\n\nThis Falkirk location article is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Laurieston, Falkirk",
    "wall",
    "laurieston",
    "village",
    "napier",
    "falkirk",
    "wall runs",
    "runs",
    "nobel",
    "miles km",
    "miles"
  ],
  "findings": [
    "History",
    "Notable people",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:45.436171"
}