{
  "title": "West View of the City of Edinburgh",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/West_View_of_the_City_of_Edinburgh",
  "content": "West View of the City of Edinburgh is an engraving by the landscapist, Paul Sandby.[1] This engraving on paper was published in 1753 and has an alternate name, Vue Occidentale de la Ville d'Edinbourg Capitale d'Ecosse. This portrayal of the city of Edinburgh was transferred from Scottish National Portrait Gallery to the Scottish National Gallery of Modern Art (Modern Two).[2]\n\nThis depiction was the Government of Scotland's first comprehensive map after the threat of the Jacobite Rebellion. Young Sandby, who was employed by the Board of Ordnance at the Tower of London, was dispatched to Scotland in 1747 as the main draughtsman for the king's military survey of the country. During his comprehensive surveys, Sandby started sketching and painting the first picturesque landscapes of Scotland while carrying a copy of Slezer's Theatrum Scotiae in his back pocket.[1]\n\nThe view of Castle Rock, Arthur's Seat, and Salisbury Crags from the farmlands of the West was enjoyed by many. The Old Town, Salisbury Crags, and Arthur's Seat can be seen in the middle left of this topographical image, with Edinburgh Castle in the centre. Beyond the castle, just to the right, is George Heriot's Hospital. The picture was made prior to the development of Edinburgh's New Town.[3] The Royal Mile's lofty peaks behind the castle provide a vantage point for the homes below. Since Sandby's time in Edinburgh, the vistas from the west end have changed considerably, but George Heriot's School still dominates the High Riggs beneath the Castle.[1]\n",
  "concepts": [
    "West View of the City of Edinburgh",
    "edinburgh",
    "castle",
    "sandby",
    "west",
    "scotland",
    "view",
    "town",
    "seat",
    "scottish national",
    "scottish"
  ],
  "findings": [
    "About",
    "Description",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:26:36.512360"
}