{
  "title": "Magnuson Park",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Magnuson_Park",
  "content": "Magnuson Park is a park in the Sand Point neighborhood of Seattle, Washington, United States. At 350 acres (140 ha) it is the second-largest park in Seattle, after  Discovery Park in Magnolia (which covers 534 acres (2.16 km2)). Magnuson Park is located at the site of the former Naval Station Puget Sound, on the Sand Point peninsula with Pontiac and Wolf bays that juts into Lake Washington in northeast Seattle.[1]\n\nThe area has been inhabited since the end of the last glacial period (c. 8,000 BCE—10,000 years ago). Prairie or tall grassland areas (anthropogenic grasslands) were maintained along what is now Sand Point Way NE (map [1]), among numerous locations in what is now Seattle.[2] The Xacuabš (Xachua'bsh or hah-choo-AHBSH, \"the People of the Large Lake\", now of the Duwamish tribe) had the village of TLEHLS (\"minnows\" or \"shiners\") on the shores of what is now called Wolf Bay in Windermere, on Lake Washington south of SqWsEb, now called Sand Point-Magnuson Park.[3] BEbqwa'bEks (\"small prairie\"—anthropogenic grassland) was near what is now Windermere. One or three sizable longhouses have been documented. Villages were diffuse.[4] These people may have been associated with the hloo-weelh-AHBSH of Union Bay. Just on the other side of Sand Point, the village of too-HOO-beed was of the too-oh-beh-DAHBSH extended family, near what is now called Thornton Creek at what is now Matthews Beach, so Sand Point was their shared \"side yard\".[5]\n\nThe first park at Sand Point was established in 1900 as Carkeek Park, a gift from developers Mr. and Mrs. Morgan J. Carkeek. After World War I, a movement was begun to build Naval Air Station (NAS) Seattle at Sand Point, and King County began acquiring surrounding parcels. In 1922 the U.S. Navy began construction on the site, which it was leasing from the county, and in 1926 the Navy was deeded the 413-acre (1.67 km2) field outright. The name Carkeek Park was subsequently given to a new park on the west side of the city, north of Ballard on Puget Sound. This deed amounted to a public gift of $500,000 from the county to the Navy, in 1926 dollars; this would be $5,283,000 in 2005 dollars, not including significant real estate appreciation.[6] The facility then became known as Naval Air Station Sand Point.\n\nDuring construction of the naval air station, the Sand Point Airfield was the origin of the first successful aerial circumnavigation of the world, which was completed in 1924.[7]\n\nNaval Air Station Seattle was deactivated in 1970 and the airfield was shut down; the reduced base was renamed \"Naval Support Activity Seattle.\" Negotiations began as to who would receive the surplus property.\n\nIn 1975 a large portion of the Navy's land was given to the City of Seattle and to the NOAA. The city's land was largely developed as a park and named Sand Point Park. In 1977, it was renamed Magnuson Park in honor of longtime U.S. Senator Warren Magnuson, a former naval officer from Seattle. Both names for the park are commonly used. The airfield runways were demolished in the late 1970s and new construction on the north end for the NOAA was completed in 1982.\n\nThe Sand Point peninsula on which Magnuson Park is located juts into Lake Washington between Wolf Bay and Pontiac Bay. As well as the park, the peninsula is occupied by  parts of View Ridge and Windermere, and gives its name to the Sand Point neighborhood to the west.[1] The easternmost point was formerly Naval Air Station-Sand Point; the old military base is now mostly public parkland. Other portions are occupied by the National Oceanic and Atmospheric Administration (NOAA) western regional center[8] and by city housing.[9]\n\nMagnuson Park today features several sports fields, a picnic area, a swimming beach, public sailboating,[10] many paths for walking and bicycling, a dog park or off-leash dog area and \"Kite Hill\", a large grassy man-made hill constructed in the 1980s from earth and pavement pieces of the old airfield tarmac. Vehicle access includes boat launch ramps and large parking lots for cars, trucks, and boat trailers.\n\nThe park also has a history of unofficial clothing-optional use since the mid-1970s.\n\nDrop in the Park was the free open air concert given on 20 September 1992 by Pearl Jam in Magnuson Park. The theme was Rock the Vote to encourage visitors to vote for the presidential election that year. All 30,000 tickets were given away within a few hours. A local radio station announced the ticket giveaway location early on a weekend morning. People converged on the site to get 2 free tickets for each person in line. The concert was initially scheduled for 23 May 1992 at Gasworks park, but was eventually cancelled by local authorities over crowd management and other logistics concerns.\n\nThe Sports Meadow, a 12 acres (4.9 ha) natural grass athletic field area, was developed in the early 1980s near the center of the former main runway. Rebuilt in 2004-05 and raised nearly eight feet to improve drainage, it is now divided into four unlit soccer fields.[11] As of 2005, the City of Seattle had a development plan that featured a large sports field complex of approximately ten fields, with seven well lit. The plan had encountered opposition from neighborhood groups, environmental and park advocates.\n\nThe plan was amended to five new athletic fields with an engineered wetlands area, with additional pavement areas removed and construction of new walking trails. Opened in April 2009 southeast of the Meadow area, the first three fields (all lit with synthetic turf) are primarily for rugby (field # 5, lit) and soccer (# 6, 7, both lit). Later in the year the baseball field (# 8, unlit) and softball field (# 9) to the south were completed, but were not opened until late 2010 to allow the natural grass outfields to mature. Runoff from the athletic fields feeds the wetlands area and restrictions on lighting were enacted; no late nights or Sundays.[12][13]\n\nSand Point provides habitat for the second richest bird habitat of any park in Seattle, with 170 species reported including pine siskins, Anna's hummingbirds, and black-capped chickadees.[14]  Wildlife diversity has been improved in part by a wetlands restoration project that radically transformed the park's landscape and hydrology.\n\nSand Point was substantially regraded during construction of the naval air station. Existing marshlands were eliminated with fill or paved over and the point's natural slope was flattened. Runoff was channeled into storm drains, and around 20% of the park's surface was rendered impervious with concrete and asphalt.[15]\n\nAs the storm drains aged, they became less effective at channeling water to the lake, leading to an increase in sheet flow runoff and over-saturation of the park's sports fields. The irregular runoff patterns also resulted in substantial volume of untreated water draining into Lake Washington.\n\nThe Wetlands Restoration project created a set of mounds, plateaus, valleys, and ponds to channel water more effectively and improve drainage of over-saturated areas. This constructed wetland provides natural filtration of urban drainage water and reduces pollution in Lake Washington.[16]\n\nPart of the wetlands project included the removal of the parking lot at the south end of the Sports Meadow and the demolition of Building 193 at the south end of the park. Built in 1943 as a hangar for transport aircraft, it was later the base's commissary and exchange; it was removed in December 2006.[17] 30 acres (12 ha) of wetlands, including walking paths and observation points, were completed in 2009.[12][13] The next phase of wetland restoration was completed in late 2011.\n\nMagnuson Park is home to Seattle's biggest playground, the Junior League of Seattle Children's Playground which was designed, developed and funded through the efforts of the Junior League of Seattle, a women's leadership and volunteer organization. Opened in 1999 and spearheaded by prominent Seattle resident, Mary Herche, the Playground celebrated its 10th anniversary on May 16, 2009, where children played in the 20,000 square feet (1,900 m2) of colorful climbing walls, sand box, swings, slides and much more.\n\nThe Junior League of Seattle donated and dedicated this \"Air, Land and Sea\" playground to the children of Seattle to commemorate the organization's 75 years of community service. The playground was designed partly by children and built entirely by volunteers at the site of the former Naval Air Station Control Tower.[18]\n",
  "concepts": [
    "Magnuson Park"
  ],
  "findings": [
    "History",
    "Early history",
    "Naval use",
    "City park",
    "Geography",
    "Amenities",
    "Concerts",
    "Sports fields",
    "Wetland restoration",
    "Playground",
    "See also",
    "References",
    "Further reading",
    "External links"
  ],
  "timestamp": "2025-04-11T10:20:07.691372"
}