{
  "title": "East Indian language",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/East_Indian_language",
  "content": "The East Indian language or East Indian dialect, also known as Mobai Marathi[failed verification] and East Indian Mahratti[failed verification]; is the form of Marathi-Konkani languages spoken in Bombay (Mumbai).[2] It has a significant amount of Indo-Portuguese loanwords.[1] It does not have a unique script of its own. Devanagari and the Roman script are used by its speakers, who are the native Christians of the Seven Islands of Bombay in the northern Konkan division.[2] The dialect is losing popular usage due to immigration, depopulation & anglo-americanisation among the younger generation. However, it is still used to make songs and dramas, as well as in Christian worship since the Novus Ordo was approved in the 1960s.[citation needed]\n\nAll pronouns have a change from yah to te. Words in Marathi for yes, where, here, there, have different East Indian counterparts. Other grammatical nuances differ from standard-spoken Marathi.[3]\n\nFrom the early days of the East India Company, there were no other Indian Christians in the North Konkan except the East Indian Catholics. Employments that were intended for Christians, were the monopoly of the Bombay East Indians. With development, came in railways and steamship, a boon for the travelling public. And with that came a number of immigrants from Goa who were also known as Portuguese Christians. The British found it expedient to adopt a designation which would distinguish the Christians of North Konkan who were British subjects and the Goan, who were Portuguese subjects (Mangalorean Catholics were not Portuguese subjects at this point any more). Accordingly, on the occasion of The Golden Jubilee of Queen Victoria, the Christians of North Konkan, who were known as \"Portuguese Christians\" discarded that name and adopted the designation \"East Indian\". By the adoption of the name \"East Indian\" they wanted to impress upon the British Government of Bombay that they were the earliest Roman Catholic Subjects of the British Crown in this part of India, in as much as parts of Bombay, by its cession in 1661, were the first foothold the British acquired in India, after Surat. As the children of the soil, they urged on the Government, that they were entitled to certain natural rights and privileges as against the immigrants.[4]\n",
  "concepts": [
    "East Indian language"
  ],
  "findings": [
    "Differences from Poona (Pune) Marathi",
    "Historical references",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:14:52.759949"
}