{
  "title": "Walter A. Sheaffer",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Walter_A._Sheaffer",
  "content": "Walter A. Sheaffer (July 27, 1867 – June 19, 1946) was an American inventor and businessman who developed the first commercially successful lever-filling fountain pen and founded the W.A. Sheaffer Pen Company.\n\nWalter A. Sheaffer was born in Bloomfield, Davis County, Iowa, on July 27, 1867. His father, Jacob Sheaffer, moved to Bloomfield from Ottumwa, Iowa, after returning from California Gulch in 1854 and entered the jewelry business. At that time in Bloomfield, which was only a small town of several hundred people. \n\nHe was the oldest child of Elizabeth and Jacob Royer Sheaffer, who had settled in Bloomfield in 1854 and established a jewelry store. Sheaffer dropped out of school and first started working as a printer's devil, then a grocery boy and in the summer he operated a peanut stand. \n\nHe next worked at a jewelry store in Centerville, Iowa and later at a store in Unionville, Missouri. He returned to Bloomfield in 1888, to become a partner with his father in the family business.\n[1]\n\nIn 1906, Sheaffer purchased a jewelry store in Fort Madison, Iowa where he established the Sheaffer Jewelry and Music Co. on Second St. Inspired by the success of self-filling fountain pens—notably, Conklins—Sheaffer turned his attention to inventing a self-filling mechanism of his own. He received his first fountain pen patent in 1908, for a lever-filler, but did not put his design into production until 1912.  \n\nThe new business was incorporated at the end of January 1913 as the W.A. Sheaffer Pen Company; its success was rapid, and the jewelry store was soon sold. Within ten years, the company had joined the top rank of American pen manufacturers, and was advertising nationally.  Sheaffer served as president of the company from 1913 to 1938. From 1938 until his death, he served as chairman of the board, while his son Craig Royer Sheaffer served as president.\n\nSheaffer died in Fort Madison on June 19, 1946.\n",
  "concepts": [
    "Walter A. Sheaffer",
    "sheaffer",
    "jewelry",
    "store",
    "pen",
    "bloomfield",
    "jewelry store",
    "iowa",
    "company",
    "served",
    "fountain"
  ],
  "findings": [
    "Early life",
    "Career",
    "Death",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:50.297564"
}