{
  "title": "Alfred Oxner",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Alfred_Oxner",
  "content": "Alfred Mycolayovych Oxner (Ukrainian: Альфред Миколайович Окснер; Russian: Альфре́д Никола́евич О́кснер) (15 February 1898 – 20 November 1973) was a Ukrainian botanist and lichenologist. His research covered various areas: floristics, taxonomy, phylogenetics, phytogeography, and phytosociology. Oxner founded the National Lichenological Herbarium of Ukraine.\n\nAlfred Nikolaevich Oxner was born on 15 February 1898 in Elizavetgrad (now Kropyvnytskyi, Ukraine). Although his family was of German nobility, they kept their origins and nationality secret during the time of the former socialist regime. The names of his real parents, Nicolay Ochsner, an ensign in the reserve and a farmer, and his mother Wilgelmine (née Schwartz), are on his birth certificate. However, he grew up with the families of his foster mother Zinaida Lazarevna Solomonova and her brother Mozyrj Lazarevich Solomonov.[2]\n\nIn 1917, after graduating from the Elisavetgrad Gymnasium, Oxner entered Kyiv University (physical and mathematical faculty), from which he graduated in 1924. At university Oxner heard lectures from and was influenced by prominent Soviet scientists such as Aleksandr Fomin, Mykola Kholodny, and Ivan Schmalhausen. As a student he studied botany at the A.V. Fomin Botanical Garden at the University. From 1920 to 1924 he worked as a teacher in secondary schools, then he was engaged in teaching at the Kirovograd Agricultural College. He was appointed as a post-graduate student and began research at the herbarium of the Botanical Garden. In his spare time he studied the local flora, and subsequently published one of his first scientific papers, entitled \"Some rare plants of the Zinov’iv District of the Kherson Region\". Although lichens later became his main focus, he maintained an interest in vascular plants, and continued to work on the taxonomy of the family Liliaceae; this work was later published in the first edition of Flora of Ukraine.[2]\n\nAs a student Oxner undertook several botanical expeditions to Ukraine and Belarus, where he collected many plants, mosses, and lichens. This field research resulted in the 1924 publication \"Additions to the Flora of the Lichens of Belarus\".[2]\n\nIn 1926, Oxner became a senior researcher at the Department of Botany of the People's Commissariat for Education of the Ukrainian SSR. This department was taken over in 1927 by the Institute of Botany of the People's Commissariat of Education, and in 1931 the institute was transferred to the jurisdiction of the Academy of Sciences of the Ukrainian SSR. Since 1931 Oxner worked at the Institute of Botany of the Academy of Sciences of the Ukrainian SSR. In 1935 he received his candidate degree in biological sciences without defending a dissertation (a distinction called honoris causa). World War II interrupted his studies, and in 1942 he evacuated to Kirov, working there as a teacher at a secondary school. He continued to work on his thesis, and that same year defended his doctoral thesis, \"Analysis and History of the Arctic Lichen Flora Origin\".\nAfter that he was given the title of Professor at Kyiv University. In 1968, Oxner was elected director of the Institute of Botany, a position he kept until 1970. In 1972 he became a corresponding member of the Academy of Sciences of the Ukrainian SSR. Alfred Nikolaevich Oxner died on 20 November 1973.[2]\n\nIn 1998, on the occasion of the 100th anniversary of the birth of Alfred Oxner, the Institute of Botany. N.G. Kholodny founded a prize with his name, awarded to young lichenologists every 2–3 years.[2]\n\nFour genera are named after Alfred Oxner: Oxnerella S.Y.Kondr., Lőkös & Hur (2014);[3] Oxneria S.Y.Kondr. & Kärnefelt (2003);[4] Oxneriaria S.Y.Kondr. & Lőkös (2017);[5] and Oxneriopsis S.Y.Kondr., Upreti & Hur (2017).[6]\nSeveral species have also been named in his honour, including: Lecanora oxneri Cretz. (1941);[7] Melaspilea oxneri Makar. (1948); Porina oxneri R.Sant. (1952);[8] Cladonia oxneri Rass. (1960);[9] Endopyrenium oxneri Akramova (1965);[10] Physcia oxneri Inaschv. (1966);[11] Ascochyta alfrediae Vasyag. (1968);[12] Aspicilia oxneriana O.B.Blum (1970);[13] Haematomma oxneri Vodopjanova (1971);[14] Xanthoria oxneri S.Y.Kondr. & Poelt (1993); Caloplaca oxneri S.Y.Kondr. & Søchting (1996);[15] Xanthoria alfredi S.Y.Kondr. & Poelt (1997);[16] Ivanpisutia oxneri S.Y.Kondr., Lőkös & Hur (2015); Rinodina oxneriana S.Y.Kondr., Lőkös & Hur (2016);[17] Staurothele oxneri S.Y.Kondr., Lőkös & Hur (2016);[17] Leptosphaeria oxneriae Cl.Roux & S.Y.Kondr. (2017);[18] and Hyperphyscia oxneri S.Y.Kondr. & Hur (2018).[19]\n",
  "concepts": [
    "Alfred Oxner"
  ],
  "findings": [
    "Biography",
    "Selected works",
    "Recognition",
    "Eponyms",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:23:49.082290"
}