{
  "title": "Lake pigment",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Lake_pigment",
  "content": "A lake pigment is a pigment made by precipitating a dye with an inert binder, or mordant, usually a metallic salt.  Lake pigments are largely chemically organic.[1] Manufacturers and suppliers to artists and industry frequently omit the lake designation in the name. Many lake pigments are fugitive because the dyes involved are not lightfast. Red lakes were particularly important in Renaissance and Baroque paintings; they were often used as translucent glazes to portray the colors of rich fabrics and draperies.[2]\n\nThe term lake is derived from the term lac, the secretions of the Indian wood insect Kerria lacca (formerly Laccifer lacca or Coccus lacca).[3][4] It has the same root as the word lacquer, and comes originally from the Hindi word lakh, through the Arabic word lakk and the Persian word lak.[5]\n\nMany lake pigments are azo dyes. They characteristically have sulfonate and sometimes carboxylate substituents, which confer negative charge to the chromophore (colored species).\n\nThe metallic salts or binders used are typically colourless or almost so.[1] The organic component of the dye determines the color of the resulting precipitate.  The metallic salts that induce the formation of lakes are typically salts of dications such as Ca2+ or Sr2+.[1]  The resulting lake pigment can be diluted with an inert material such as alumina.\n\nLake pigments have a long history in decoration and the arts. Some have been produced for thousands of years and traded over long distances. In ancient times chalk, white clay, and crushed bones were used as sources of the calcium salts.\n\nThe red lakes were particularly important in the history of art; because they were translucent, they were often used in layers of glazes over a more opaque red (sometimes the mineral-based pigment vermilion, or sometimes a red lake mixed with lead white or vermilion) to create a deep, rich red color. They are common in paintings by Venetian artists of the 16th century, including Titian, to depict fine draperies and fabrics.[2]\n\nIndigo and rose madder are now produced more cheaply from synthetic sources, although some use of natural products persists, especially among artisans. The food and cosmetics industries have shown renewed interest in cochineal as a source of natural red dye.[8]\n",
  "concepts": [
    "Lake pigment"
  ],
  "findings": [
    "Etymology",
    "Chemistry",
    "History and art",
    "References"
  ],
  "timestamp": "2025-04-11T10:16:33.530738"
}