{
  "title": "Matthew J. Ryan",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Matthew_J._Ryan",
  "content": "Matthew J. Ryan (April 27, 1932 – March 29, 2003) was an American politician from Pennsylvania who served as a Republican member of the Pennsylvania House of Representatives for Delaware County from 1963 to 1968 and from the 168th district from 1969 to 2003 including as Speaker of the Pennsylvania House of Representatives from 1981 to 1983 and again from 1995 to 2003.\n\nRyan was born in Philadelphia, Pennsylvania and was a 1950 graduate of Saint Joseph's Preparatory School, in Philadelphia, Pennsylvania. He earned a degree from Villanova University in 1954 and a law degree from Villanova University School of Law in 1959.[2] Ryan served in the United States Marine Corps from 1954 to 1956.[3]\n\nRyan was first elected to represent the 168th legislative district in the Pennsylvania House of Representatives in 1962.[2] He served in the House Republican Leadership as Policy Committee Chairman from 1971 to 1972.[2] He was the Republican Whip from 1973 to 1978, with 1973–1974 spent as the Majority Whip.[2] He was elected Republican Leader in 1979–1980, with those years in the majority.[2] He served as Speaker of the Pennsylvania House of Representatives from 1981 to 1982.[2] In 1983, the Republicans became the minority and Ryan became the Republican Leader again.[2] In 1995, the Republicans regained the majority and elected Ryan Speaker of the House, a position he held until his death in 2003.[2][3]\n\nIn 2002, the political website PoliticsPA named him to the list of \"Smartest Legislators,\" calling him \"quick and sharp with his Irish wit from the Speaker's rostrum\" and a \"man of true wisdom.\"[4] In a 2002 PoliticsPA Feature story designating politicians with yearbook superlatives, he was named the \"Most Popular.\"[5]\n\nThe Matthew J. Ryan Veterinary Hospital at the University of Pennsylvania is named in his honor.[6]\n\nIn 1999, the Capitol Annex of the Pennsylvania State Capitol building in Harrisburg was renamed the Speaker Matthew J. Ryan Legislative Office Building.[3]\n",
  "concepts": [
    "Matthew J. Ryan"
  ],
  "findings": [
    "Early life and education",
    "Career",
    "Legacy",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:07:54.443628"
}