{
  "title": "Scottish Credit and Qualifications Framework",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Scottish_Credit_and_Qualifications_Framework",
  "content": "The Scottish Credit and Qualifications Framework (SCQF) is the national credit transfer system for all levels of qualifications in Scotland. Awards are classified under the framework at levels, and study undertaken at that level is valued in credit points. The Scottish Credit and Qualifications Framework Partnership promotes lifelong learning in the country. Through the SCQF, learners can gain a better understanding of qualifications and plan their future learning.\n\nThe SCQF is in the custody of, and managed by, the Scottish Credit and Qualifications Framework Partnership (SCQF Partnership). Since its creation in November 2006 the SCQF Partnership, which is a company limited by guarantee and a registered charity, has aimed to: ensure that, where appropriate, all assessed learning and qualifications are included within the Framework and extend the recognition of informal and non-formal learning; fully develop and promote the Framework as a lifelong learning tool; and develop relationships with other frameworks internationally.\n\nIts members are the Quality Assurance Agency for Higher Education; College Development Network; the Scottish Qualifications Authority; and Universities Scotland. In addition, there is a Co-opted Director representing employer interests and another co-option is the Chair of the SCQFP Quality Committee.\n\nThe Framework has 12 levels.\n\nPost Graduate Certificate\n\nProfessional Development Award\n\nNational Progression Award, Professional Development Award\n\nNational Progression AwardIntermediate 2 (discontinued) Credit Standard Grade (discontinued)\n\nNational Progression AwardIntermediate 1 (discontinued) General Standard Grade (discontinued)\n\nNational Progression AwardAccess 3 (discontinued) Foundation Standard Grade (discontinued)\n\nStudy undertaken at any level is given a credit value. Obtaining a qualification will require a certain number of credit points of study to have been obtained. Each credit is equivalent to a notional 10 hours of study.\n\nThe Scottish credit point requirements can be converted into European Credit Transfer and Accumulation System (ECTS) credit points as follows, or by simply halving the Scottish values to arrive at the European equivalent:\n\nEntry requirements at institutions are usually expressed in terms of both points and level, e.g. \"a points at b level\".\n\nCredit points obtained from study at lower levels can be counted towards a qualification, whether by study within the institution or by awarding through transfer, but this is at the discretion of the awarding institution.\n\nCredit values may differ for medical, veterinary and dental science degrees and certain undergraduate and postgraduate combined study (integrated masters).\n\nScottish higher education institutions had long used the SCOTCAT (Scottish Credit Accumulation and Transfer) system for equating courses from different institutions.  SCOTCAT had three levels.  Level 1 was equivalent to University 1st Year, an HNC or a Certificate of Higher Education (Cert HE).  Level 2 was equivalent to University 2nd Year, an HND or a Diploma of Higher Education.  Level 3 was equivalent to Years 3 and 4 at a Scottish University, and generally these credits lead to a Special or Honours Degree.\n\nFollowing the creation of the  Scottish Qualifications Authority by the merger of the Scottish Examinations Board and SCOTVEC, efforts were made to unite the different levels of vocational and academic qualifications.  The aim was to make it easier for employers and education institutions to understand the level to which a person had been educated.[1] A secondary aim was to remove prejudice against vocational and non-traditional qualifications.\n\nEducation and training providers in Scotland then agreed to create a common framework for all qualifications, both current and historical. This led to the development of a 12-level framework with courses, units, modules and clusters being placed at a specific level with a credit weighting.\n\nChanges have been made to Higher Education level courses to prepare the Scottish system for the Bologna process.[citation needed]\n",
  "concepts": [
    "Scottish Credit and Qualifications Framework",
    "credit",
    "scottish",
    "qualifications",
    "level",
    "framework",
    "study",
    "education",
    "points",
    "levels",
    "discontinued"
  ],
  "findings": [
    "Levels",
    "Credit points",
    "Background",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T15:16:48.865032"
}