{
  "title": "Battle of Fidentia (82 BC)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Battle_of_Fidentia_(82_BC)",
  "content": "The Battle of Fidentia took place in September of 82 BC at Fidentia during the context of Sulla's Second Civil War. The battle pitted the Optimates under the command of Marcus Terentius Varro Lucullus against the Populares forces commanded by Lucius Quincius. The battle resulted in a decisive Optimate victory.\n\nAt the beginning of September, the Optimate general, Quintus Caecilius Metellus Pius sent Marcus Terentius Varro Lucullus (younger brother of Lucius Licinius Lucullus) at the head of two Legions to open up a second front against the Populares at Placentia. Metellus remained at Faventia with four Legions and waited for and defeated an army commanded by Gaius Norbanus Balbus who marched from Gaul at the Battle of Faventia.[2]\n\nAfter being informed of this victory, Marcus Terentius Varro Lucullus at once attacked the camp of Lucius Quincius, the second in command of Norbanus Balbus who had previously marched to (and was defeated at) Fidentia with 5 Legions. His numerical disadvantage not withstanding, his troops fought bravely and obtained victory, taking the Populare camp. The Populares lost around 18,000 soldiers whilst the Optimates lost relatively few.[1][3]\n\nAfter this battle, the presence of the Populare threat to the Optimates in the north of Italy was completely destroyed. In the south, Sulla would soon win another victory for his cause at the Battle of the Colline Gate which largely ended the war.[2]\n",
  "concepts": [
    "Battle of Fidentia (82 BC)",
    "battle",
    "victory",
    "lucullus",
    "varro lucullus",
    "varro",
    "terentius varro",
    "terentius",
    "second",
    "populares",
    "optimates"
  ],
  "findings": [
    "Context",
    "The battle",
    "Consequences",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:37.192082"
}