{
  "title": "2023 Mid and East Antrim District Council election",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/2023_Mid_and_East_Antrim_District_Council_election",
  "content": "No overall control\n\nDemocratic Unionist Party\n\nThe 2023 election to Mid and East Antrim District Council was held on 18 May 2023, alongside other local elections in Northern Ireland, two weeks after local elections in England.[1] The Northern Ireland elections were delayed by 2 weeks to avoid overlapping with the coronation of King Charles III.[2]\n\nThey returned 40 members to the council via Single Transferable Vote.\n\nTyler Hoey was selected as a DUP candidate to contest the 2023 Mid and East Antrim Council elections. In 2020, Hoey 'liked' a social media post commemorating the Greysteel massacre, which stated, \"On this day 27 years ago, An Ulster Freedom Fighters Active Service Unit from North Antrim-Londonderry Brigade 'Trick or Treated' its way into the republican Rising Sun bar in Greysteel in order to gain revenge for the Shankill Bombing. Spirit of '93\".[3] Following this revelation, DUP leader Jeffrey Donaldson said that Hoey \"deeply regrets some of the things that he said in the past\" and that he is \"entitled to a second chance.\"[4]\n\nNote: \"Votes\" are the first preference votes.\n\n2019: 2 x DUP, 2 x Independent, 1 x TUV, 1 x SDLP, 1 x Alliance\n\n2023: 2 x DUP, 1 x TUV, 1 x UUP, 1 x Alliance, 1 x Independent\n\n2019–2023 Change: Sinn Féin and UUP gain from SDLP and Independent\n\n2019: 2 x TUV, 2 x DUP, 1 x UUP, 1 x Sinn Féin\n\n2023: 2 x TUV, 2 x DUP, 1 x Sinn Féin, 1 x UUP\n\n2019–2023 Change: No change\n\n2019: 3 x DUP, 2 x TUV, 1 x UUP, 1 x Alliance\n\n2023: 2 x DUP, 2 x TUV, 1 x UUP, 1 x Sinn Féin, 1 x Alliance\n\n2019–2023 Change: Sinn Féin gain from DUP\n\n2019: 2 x DUP, 2 x UUP, 1 x Alliance\n\n2023: 2 x DUP, 2 x UUP, 1 x Alliance\n\n2019–2023 Change: No change\n\n2019: 2 x DUP, 1 x Alliance, 1 x Sinn Féin, 1 x UUP\n\n2023: 2 x DUP, 1 x Alliance, 1 x Sinn Féin, 1 x UUP\n\n2019–2023 Change: No change\n\n2019: 2 x DUP, 1 x UUP, 1 x Alliance, 1 x Independent\n\n2023: 2 x DUP, 1 x Alliance, 1 x UUP, 1 x Independent\n\n2019–2023 Change: No change\n\n2019: 2 x DUP, 2 x Alliance, 1 x UUP\n\n2023: 2 x Alliance, 2 x DUP, 1 x UUP\n\n2019–2023 Change: No change\n",
  "concepts": [
    "2023 Mid and East Antrim District Council election",
    "dup",
    "2023",
    "uup",
    "2019",
    "change",
    "alliance",
    "sinn féin",
    "sinn",
    "féin",
    "2023 change"
  ],
  "findings": [
    "Controversies",
    "Election results",
    "Districts summary",
    "District results",
    "Ballymena",
    "Bannside",
    "Braid",
    "Carrick Castle",
    "Coast Road",
    "Knockagh",
    "Larne Lough",
    "Changes during the term",
    "† Co-options",
    "‡ Changes in affiliation",
    "Notes",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:28:34.770676"
}