{
  "title": "Samuel Goodall",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Samuel_Goodall",
  "content": "Samuel Granston Goodall  (died 21 April 1801) was an officer of the Royal Navy who saw service during the Seven Years' War, the American War of Independence and the French Revolutionary Wars in a career that spanned 50 years, rising to the rank of Admiral of the White.\n\nGoodall rose from obscure origins to the rank of lieutenant during the Seven Years' War, and continued to rise through the ranks to command his own ships. He ended the war serving in the West Indies and North America, having seen action at the Battle of Havana, and then returned to Britain. He commanded several ships in the peace before the outbreak of the American War of Independence, when he commanded several ships of the line with the Channel Fleet. He was with Keppel at the Battle of Ushant in 1778, and with Fielding at the capture of a Dutch convoy in 1780. Goodall next took part in Darby's relief of Gibraltar and the Second Battle of Ushant in 1781, after which he sailed to the West Indies to join the fleet under Sir George Rodney.\n\nSeveral fleet actions followed, and Goodall distinguished himself with service at the Battle of the Saintes and the subsequent Battle of the Mona Passage, where he was instrumental in the capture of two French ships of the line. After further service in North America, he returned to Britain on the conclusion of the war. The Spanish armament in 1790 provided a chance for further employment, he commissioned a ship, but stepped down with the passing of the crisis, having been promoted to rear-admiral. A brief posting to the Newfoundland command came in 1792, but he returned in winter that year just prior to the outbreak of the French Revolutionary Wars. Flying his flag aboard the 98-gun HMS Princess Royal he served with Lord Hood's fleet, first as governor of Toulon during the occupation of that city, and then as second in command of the Mediterranean Fleet, under Hood's successor, Admiral William Hotham. Goodall took part in Hotham's two actions in 1795, the Naval Battle of Genoa and the Naval Battle of Hyères Islands, but the nature of the battles prevented any chance of distinguishing himself. Disappointed at not being offered the command of the fleet on Hotham's recall, Goodall struck his flag and retired ashore. He was promoted on the basis of his seniority to admiral of the white, but saw no further active service before his death in 1801.\n\nDetails of Goodall's family and early life are unknown, though he is presumed to have entered the navy c. 1750.[1][2] The earliest date he is known to be active is 1 September 1756, when he was made lieutenant.[1] He was promoted to commander on 2 June 1760 and given the 8-gun sloop HMS Hazard, capturing the French privateer Duc d'Ayen on 7 August 1760 while she was at anchor off Egersund, Norway.[2][3] Duc d'Ayen was a dogger armed with seven 4-pounders and had a crew of 65 men.[4] Her capture was alleged to have been in violation of Denmark's neutrality, and Goodall became involved in a lengthy correspondence on the subject.[1]\n\nGoodall was then sent out to the West Indies where on 3 January 1762 he was promoted to the rank of post captain and on 13 January was made commander of the 24-gun HMS Mercury.[1][2][4] He joined the fleet under Sir George Pocock and took part in the Battle of Havana.[1][2] In June he was sent to silence a battery east of Cojimar as part of the operations to land troops.[1] He moved to the North American Station after this, where he assisted in the protection of the trade on the coast of Georgia before returning to Britain in spring 1764.[1][2] The draw down of the navy after the Treaty of Paris ended the Seven Years' War left Goodall ashore on half-pay. He returned to service in 1769, commissioning the 32-gun HMS Winchelsea in February and sailing to the Mediterranean in May.[1][5] Goodall was then despatched in the summer of 1770 to protect British interests in Smyrna.[1][6]\n\nThe outbreak of the American War of Independence offered further opportunities for employment as the navy built and activated ships. Goodall took command of the 64-gun HMS Defiance in February 1778, and joined the fleet under Augustus Keppel in time to fight at the Battle of Ushant on 27 July.[1][7] Defiance was heavily engaged in the fighting, losing eight men killed and seventeen wounded from her crew.[4][6] She then joined the squadron under Molyneux Shuldham in December that year.[7] In 1779 Goodall was appointed to the 74-gun HMS Valiant, which he would command for the next four years.[1][8]\n\nGoodall spent the first three of these serving with the Channel Fleet, at first under Sir Charles Hardy, and then from December with Commodore Charles Fielding's squadron.[8] He was with the squadron on 31 December 1780 when the British force intercepted a Dutch convoy, and Fielding demanded to be allowed to search the ships. Their commander, Lodewijk van Bylandt refused, and Fielding attacked. After a brief action the Dutch surrendered and the convoy was taken into Portsmouth.[8] Goodall then served under successive commanders of the Channel Fleet, firstly Sir Francis Geary, and then Sir George Darby.[4][6][8] On 4 January 1781, while sailing in company with the 64-gun HMS Courageux under Lord Mulgrave, a squadron of three French frigates was spotted and chased.[9] Two of them escaped, but the third was chased down and engaged in a heavy fight by Courageux, until being forced to surrender. She was the former HMS Minerva, which had been captured by the French in 1778. She had sustained losses of 49 killed and 24 wounded, while Courageux had 10 men killed and seven wounded.[9] Minerva was taken back into the Royal Navy under the name HMS Recovery.[9]\n\nGoodall was next at the relief of Gibraltar by Darby's fleet on 12 April 1781, followed by service in Rear-Admiral Robert Digby's squadron, before returning to Darby's fleet in summer and autumn 1781.[8] He was present at the Second Battle of Ushant with Rear-Admiral Richard Kempenfelt's fleet on 12 December 1781, after which he sailed to the West Indies to join the fleet there under Admiral Sir George Rodney on 28 February 1782.[8] Goodall was engaged at the first clash with the French fleet under the Comte de Grasse off Dominica on 9 April 1782, and again at their decisive defeat at the Battle of the Saintes on 12 April.[1][8] In the former engagement Valiant was part of the van, and was heavily involved in the fighting, suffering casualties of 38 men killed and wounded.[6] At the Saintes Valiant was in the rear division and had nine killed and 28 wounded.[10]\n\nAfter the victory at the Saintes, and during a period of calm weather, Rodney detached a squadron under his second in command, Sir Samuel Hood, to pursue some of the crippled French ships.[6][10] Valiant was one of the ships detached with Hood, and on 19 April the squadron caught two ships of the line and three frigates at the entrance to the Mona Passage. The French force, consisting of the 64-gun ships Caton and Jason, and the frigates Astree, Aimable and Ceres attempted to escape, Hood signalling for them to be engaged before they could run themselves ashore. In the ensuing Battle of the Mona Passage, Valiant found herself the headmost ship, and with most of the other British ships becalmed or chasing other ships, Goodall pressed on sail to catch the Caton, and managed to rake her bows, on which she immediately struck.[10] Goodall did not stop to take possession, but instead pressed on after the fleeing Jason, opening fire on her and fighting a fierce engagement for 45 minutes until the French ship surrendered.[10][11] Valiant had 12 men killed and wounded in the action.[10]\n\nGoodall sailed in July that year to North America with Admiral Hugh Pigot, stopping at New York City between September and October, and taking part in the blockade of Cape François in November.[8][10][11] He returned to Jamaica in early 1783, and then departed for Britain in April that year to pay Valiant after the Peace of Paris brought about the conclusion of the war.[8][10][11]\n\nGoodall next comes to attention in May 1790 when he commissioned the 80-gun HMS Gibraltar during the period of crisis known as the Spanish armament.[10][11] Gibraltar was intended for service in the Channel, but the crisis passed over without breaking into open war. Goodall was made rear-admiral of the blue on 21 September 1790, and in 1792 received a posting to command in Newfoundland, hoisting his flag aboard the 50-gun HMS Romney. He returned to Britain in the winter, but was soon back on active service with the outbreak of the French Revolutionary Wars the following year.[1]\n\nGoodall was promoted to rear-admiral of the red on 3 February 1793, and in April hoisted his flag aboard the 98-gun HMS Princess Royal with orders to take one of the divisions of the fleet and sail south to take up a post as commander-in-chief Mediterranean Fleet.[1][12] He served under Lord Hood during the occupation of Toulon, during which time he acted as governor of the city until the arrival from Britain of Sir Gilbert Elliott.[1][11] Goodall then took part in the operations against Corsica, receiving official praise for his efforts from Hood, and a promotion to vice-admiral of the blue on 12 April 1794.[1][11] He was appointed second in command to Hood's successor in the Mediterranean, Admiral William Hotham, and took part in the Naval Battle of Genoa on 4 March 1795, and the Naval Battle of Hyères Islands on \n13 July, having been further advanced to vice-admiral of the white on 4 July 1795.[1][11] These battles were minor victories for the British, though Goodall was unable to distinguish himself, a frustration he shared with another officer, Captain Horatio Nelson of HMS Agamemnon. Goodall supported Nelson, and advised Hotham to press his advantage and call for a general action, but Hotham demurred.[13][14]\n\nGoodall was not offered the command of the fleet after Hotham's recall, and reportedly disappointed by this, he requested permission to strike his flag at the end of 1795.[1] He had no further active service, though he continued to be promoted on the basis of his seniority, reaching the rank of admiral of the blue on 14 February 1799, and admiral of the white on 1 January 1801.[1] Admiral Samuel Goodall died unmarried at Teignmouth on 21 April 1801, and was buried there.[1][15] He left bequests totalling nearly £20,000 to naval friends and companions, hinting at 'a man who valued friendship and loyalty'.[1]\n",
  "concepts": [
    "Samuel Goodall"
  ],
  "findings": [
    "Early service",
    "American War of Independence",
    "Channel Fleet",
    "Gibraltar and West Indies",
    "Spanish armament and interwar years",
    "French Revolutionary Wars",
    "Citations",
    "References"
  ],
  "timestamp": "2025-04-11T12:40:51.826802"
}