{
  "title": "Abuletisdze",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Abuletisdze",
  "content": "The Abuletisdze family (Georgian: აბულეთისძე) was a Georgian noble family – eristavs – with its most prominent members in the 12th and 13th century. The family held appanages in the valleys of Aragvi and Tedzami in the eastern province of Kakheti.\n\nThe dynastic name Abuletidze (literally, \"sons/descendants of Abulet\") is derived from a male name Abulet. A person with this name appears as a commander under the Georgian king David IV (r. 1089-1125). He was among those nobles who recovered the fortress of Samshvilde from Seljuk Turks in 1110. Later, Abulet was a governor of Ani in 1124. He is last heard of in 1130.\n\nThe Abuletisdze's loyalty to the crown was not permanent, however. In the early 12th century, they were among the most powerful vassals and rivals of the kings of Georgia. Thus, already in the reign of David IV, Dzagan Abuletisdze is reported to have defied the royal authority, but was eventually to take refuge at the Shio-Mghvime Monastery which surrendered him to the king. Dzagan's brother Modistos was a catholicos of the Georgian Orthodox Church, and was removed from this position by the same king.[1]\n\nWe next hear of Abulet's son Ivane and grandson Kirkish (Tirkash) who served as the commanders of Georgian troops in Armenia, but subsequently plotted the murder of King Demetrius I, probably to place the king's half-brother Vakhtang on the throne. The king was timely warned and survived. He had Ivane murdered in 1132, while Kirkash fled to the Seljukid sultan of the Shah-Armenid state centered at Akhlat. The sultan enfeoffed him with Arsharunik whence he launched several raids into Georgia. Kirkish was eventually captured and cast into prison by Demetrius.  When Demetrius was temporarily overthrown by his son David V, was restored to favor and granted the office of amirspasalar of which the rival Orbeli clan was dispossessed by the new king. Demetrius, once restored to the throne shortly thereafter, again gave the post to the Orbeli.[2] Yet, the members of this family remained among the high nobility of Georgia, and were titled as eristavt-eristavs. One of them, Dzagan featured prominently in the Mongol capture of Baghdad in 1258, and returned with a substantial wealth of booty through which he acquired the village of Angroini and donated it to the Shio-Mghvime Monastery. Later in the 13th century, the family went in decline. By 1405, their fiefdom in Kakheti had passed to a branch of the Abazasdze.\n\nThis article about a member of the Georgian nobility is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Abuletisdze",
    "king",
    "georgian",
    "family",
    "demetrius",
    "abulet",
    "georgia",
    "dzagan",
    "david",
    "century",
    "abuletisdze"
  ],
  "findings": [
    "History",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T17:28:47.971113"
}