{
  "title": "Kentford",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Kentford",
  "content": "Kentford is a village and civil parish located in the West Suffolk district of Suffolk in eastern England. Situated on the banks of the River Kennet, the village is positioned on the B1506 road connecting Newmarket to Bury St. Edmunds. The village is served by the Kennett railway station, located just off the A14, which offers an indirect railway connection to London via Cambridge. Kentford is located about four miles northeast of Newmarket and nine miles west of Bury St. Edmunds. The village falls within the Bury St. Edmunds division of the county and is divided between the Lackford and Risbridge Hundred. Kentford is also part of the Newmarket petty sessional division, Mildenhall union and county court district, rural deanery of Newmarket, archdeaconry of Sudbury, and diocese of St. Edmundsbury and Ipswich.[2] The population of Kentford was estimated to be 1125 as of 2021.[1]\n\nThe history of Kentford dates back many centuries. The village's name is recorded as early as the 11th century as Cheneteforde, and means \"ford across the River Kennett\".[3] Throughout its history, Kentford has experienced growth and expansion, transforming from a small settlement to a moderate-sized village. In 1674, the village consisted of only 12 houses, but by 2010, the population had grown to 457 residents living in approximately 250 houses.[4]\n\nHistorically, Kentford has been closely associated with farming and the horse racing industry, both of which have played a significant role in providing employment opportunities within the village. The village's proximity to Newmarket, a renowned center for horse racing, has contributed to its connection with the equestrian world. Additionally, the village hosts the presence of a tannery and two public houses: The Bell Inn and The Kentford.[4]\n\nRegal Lodge, a notable building in Kentford, briefly operated as the Langtry Hotel, named after its former owner, Lillie Langtry, who was the mistress of the Prince of Wales, later King Edward VII.[4]\n\nLangtry Heavily modified and expanded a farmhouse in Kentford into a grand residence called Regal Lodge.[5] The property was purchased in 1893,[6] and built in 1863.[5] The house was the setting for Langtry's weekend parties, and it featured impressive rooms designed for large social gatherings, including a theatre-like drawing-room and servant quarters that have remained untouched since the Edwardian era. Regal Lodge also played a role in Langtry's passion for horse racing, hosting celebrations following her notable victories. After the First World War, the property operated as Langtry Hotel for a number of years. Eventually the property was sold and is now owned as private residence.[5]\n\nKentford gained recognition as one of the first villages in Suffolk to benefit from gigabit broadband through the Openreach scheme. In 2019, engineers worked to install the latest fibre-to-the-premises (FTTP) broadband, offering residents and businesses access to download speeds of up to one gigabit per second, 18 times faster than the national average.[7] This initiative was aimed to improve connectivity in rural communities and serve as a trial for Openreach to extend their FTTP network into more challenging or commercially less viable areas.[7]\n\nThe Church of St. Mary, located in the centre of the village, is an ancient stone building constructed in the Decorated style.[2][8] The church consists of a chancel, nave, small south porch, and a small western tower that once held three bells.[8] Noteworthy features of the church include well-preserved 18th-century box pews, considered to be among the finest examples in Suffolk. Inside the nave, traces of paintings can still be observed on the north wall, including depictions of the \"Three Quick and The Three Dead\".[8] The church remains active offering regular service and as a hub for community events.\n\nA prominent landmark in Kentford is the site of the village's old Packhorse Bridge, once one of only two such bridges in Suffolk. Only the wall leading to the bridge remains, with the remaining parts of the bridge vanishing by the 1970s.[9]  The second packhorse bridge is located in the neighbouring village Moulton, which is in a almost-fully-intact state.\n\n Media related to Kentford at Wikimedia Commons\n\nThis Suffolk location article is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Kentford"
  ],
  "findings": [
    "History",
    "Infrastructure",
    "Landmarks",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:06:42.874301"
}