{
  "title": "Whittaker, Michigan",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Whittaker,_Michigan",
  "content": "Whittaker is an unincorporated community in Washtenaw County in the U.S. state of Michigan.[1]  The community is located within Augusta Charter Township. As an unincorporated community, Whittaker has no legally defined boundaries or population statistics of its own but does have its own post office with the 48190 ZIP Code.[2]\n\nWhittaker sits at an elevation of 676 feet (206 m) above sea level.[1]  The community is located about 25 miles (40 km) southeast of Ann Arbor in the southeastern corner of Washtenaw County.[3] Paint Creek flows near Whittaker, and U.S. Route 23 is approximately four miles (6.4 km) to the west.\n\nWhittaker is served by Lincoln Consolidated School District.[4]\n\nThe area was originally referred to as Augusta Center, when businessman Frank Whittaker opened a general store near a railway line around 1860 after moving a few miles south from the community of Willis.  Augusta Township, which was established much earlier in 1836, built its township hall in the area in 1867.  A hotel, several stores, blacksmith shops, and a creamery were soon built in the growing community that was named after Whittaker.  In 1880, the community was given a train station on the Wabash Railroad, which allowed for easy export of lumber and other goods directly to Detroit.[5][6]\n\nThe community of Whittaker received its first post office on January 9, 1882 with William Bishop serving as the first postmaster.[7]  The post office has continued to remain in operation, and the current post office is located at 11014 Whittaker Road.[8]  The post office utilizes the 48190 ZIP Code and serves only a very small area; it is primarily used for post office box services.  The surrounding areas are served by Milan 48160 to the west, Ypsilanti 48197 to the north, and Willis 48191 to the east and south.[9]\n\nThe single railway line continues to run through the community.  It is currently operated by Norfolk Southern Railway but contains no station in the area.[10]\n\nThis Washtenaw County, Michigan location article is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Whittaker, Michigan"
  ],
  "findings": [
    "Geography",
    "History",
    "Images",
    "References"
  ],
  "timestamp": "2025-04-11T10:20:38.828567"
}