{
  "title": "Yuli Raizman",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Yuli_Raizman",
  "content": "Yuli Yakovlevich Raizman (Russian: Юлий Яковлевич Райзман; December 15, 1903 – December 11, 1994) was a Soviet and Russian film director, screenwriter and pedagogue. People's Artist of the USSR (1964) and Hero of Socialist Labour (1973).[1]\n\nIn 1924 he became a literary consultant for Mezhrabpom-Rus, the German-Russian film studio.[2] He was assigned as assistant to Yakov Protazanov in 1925[3] and made his directorial debut in 1927 with The Circle,[2] first drawing attention the following year with Penal Servitude.[3] His next success was The Earth Is Thirsty in 1930, the Soviet Union's first sound film.[3]\n\nHe joined Mosfilm[3] in 1931 and in 1937 he won his first Stalin Prize for The Last Night, which was also his first collaboration with the writer Yevgeny Gabrilovich with whom he worked for the next 40 years.[2] The film also achieved international recognition winning the Grand Prix at the Paris International Exhibition of 1937.[2]\n\nIn 1942, his film Mashenka was also a success,[3] which earned him a second Stalin Prize.\n\nHe made a couple of war documentaries, Fall of Berlin – 1945 and Towards an Armistice with Finland,[2] both of which won the Stalin Prize.\n\nRainis (1949) won another Stalin Prize (second degree).\n\nCavalier of the Golden Star, also known as Dream of a Cossack, won the top prize at the 1951 Karlovy Vary International Film Festival[2] and also competed for the Grand Prix at the 1951 Cannes Film Festival. It also won the Stalin Prize of the First degree.\n\nThe Communist marked the fortieth anniversary of the October Revolution and a follow-up, Your Contemporary, appeared in 1968.[2]\n\nHis film Private Life (1982) won the USSR State Prize and was nominated for the Academy Award for Best Foreign Language Film.[4]\n\nHis 7 Stalin/State Prizes made him one of the most decorated cultural figures in the Soviet Union. He was the first person to receive the Lifetime Achievement Award at the Nika Awards in 1988 presented by the Russian Academy of Cinema Arts and Science.[2]\n\nHis uncle was Fedor Ozep.\n\nHe was married to Syuzanna Raizman (née Ter), who died in 1991.\n",
  "concepts": [
    "Yuli Raizman"
  ],
  "findings": [
    "Career",
    "Personal life",
    "Filmography",
    "Awards and honors",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:20:24.051723"
}