{
  "title": "Zambian National Women's Lobby",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Zambian_National_Women's_Lobby",
  "content": "The Zambian National Women's Lobby (NWLG, National Women's Lobby Group, ZNWL) is a Zambian organization whose mission is to \"bridge the gender gap in political decision making by advocating for increased women's participation and representation\".[1] The Lobby was created following Zambia's transition from a one-party state to a multi-party democracy in 1990.  At the time, only seven women served in the Parliament of Zambia out of 150 seats, and only three women served on the Central Committee, the equivalent of today's Presidential Cabinet. The official motto of ZNWL is \"WIZER\" which stands for \"Women in Zambia for Equality Representation\".[2]\n\nThe First Women's Rights Conference in Zambia took place in 1970, under the UNIP Women's Brigade, which was renamed 'The Women's League' in 1975.[3][4] The League had their own constitution and a Presidentialy elected executive secretary who became an automatic member of the Central Committee of United National Independence Party. The Central Committee representative was responsible for the representation of all women's affairs in the Government.[5] The Women's League promoted a return to traditionalism and an expectation that League members would help men achieve political power, which caused some women to protest such ideas.\n\nIn March 1985, The Second Women's Rights Conference was held on the Copperbelt with [Mama Betty Kaunda] addressing 135 participants. Issues discussed in the three days conference were deemed non-reflective of the League's aims. By the 1990s, The League had become unpopular and saw the birthing of ZNWL in 1991.[6]\n\nThe Movement for Multiparty Democracy (MMD) emerged as another political party with a women's branch. The formation of the MMD encouraged many Zambian women to enter politics and seek equality. MMD appealed to professional women to advocate for gender equality and societal transformation.[7]\n\nZNWL was founded on 20 July 1991 in Lusaka at the Young Women's Christian Association Centre (YWCA) following a meeting that comprised well educated middle class women .[8][9] The NWLG alongside the church, law society, the independent press and other movements, added their voice towards moving Zambia from a one party state to a multi - party state in 1990 and has used its space to open up a dialogue toward fuller consideration of women's issues including, promoting the equal participation of women in the political decision-making process, promoting a culture of gender equality and respect for the human rights of women through changes in attitudes, language, procedure and laws, and having more women politicians through affirmative action.[10] Unlike MMD or The Women's League, ZNWL was non-governmental. ZNWL lobbied for political advancement of women and supported women running in local elections. ZNWL was not endorsed by the UNIP or MMD, as it was seen as the opposition.[11] By 1995, there were 2,000 members.[12]\n\nSince its inception, the NWLG has become one of the leading forces for women's rights in Zambia, and has been formally recognized by the government as the lead NGO for these issues.  ZNWL is credited with being a major contributor in Zambia's democracy as it encouraged women to contest multi-party elections.[13] The organization has been active in a number of international workshops, and has been duplicated in countries like South Africa and Botswana.[14]\n\nIn 2014, the United States Embassy gave a $25,000 grant to develop the Full Participation Fund (FPF).[15] The FPF raised awareness about women in politics and encouraged dialogue between FPF participants and members of Parliament. The women who participated also received trainings on how to address issues affecting women and educational programs.\n\nIn 2016, President Edgar Lungu appointed eight women into his Cabinet, which was praised by ZNWL Executive Director Juliet Chibuta.[16]\n\nIn 2017, the Zambia Accountability Programme (ZAP) partnered with ZNWL to produce a documentary called Mothering Zambia which highlighted the work both organizations were doing to address the problem of the lack of women's participation in politics.[17]\n",
  "concepts": [
    "Zambian National Women's Lobby"
  ],
  "findings": [
    "Women's organization history",
    "Formation",
    "Impact",
    "Notes",
    "External links"
  ],
  "timestamp": "2025-04-11T10:49:41.020006"
}