{
  "title": "Fred Page",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Fred_Page",
  "content": "Frederick Page (September 29, 1915 – December 23, 1997) was a Canadian ice hockey administrator and ice hockey referee. He originated from Port Arthur, Ontario, where he played junior ice hockey, refereed locally and later at the Memorial Cup and Allan Cup competitions. He was a league executive in Fort William, then served as president of the Thunder Bay Amateur Hockey Association from 1958 to 1962. He was elected second vice president of the Canadian Amateur Hockey Association (CAHA) in 1962, and rose up the ranks to be its president from 1966 to 1968. Page wanted the CAHA to gain more control over its affairs, and become less dependent on the National Hockey League (NHL). Under his leadership, the NHL ended direct sponsorship of junior hockey teams. He was instrumental in negotiating the revised agreement for the NHL Amateur Draft in 1967, and later served as co-chairman of the resulting joint player development committee.\n\nPage served as vice-president of the International Ice Hockey Federation from 1966 to 1972, where he helped organize the Ice Hockey World Championships, and served as a director of ice hockey at the Olympic Games. He assisted in negotiating international hockey participation on behalf of Canada, and was one of the four signatories of the agreement to play the 1972 Summit Series between the Canadian and the Soviet Union national teams. He later became a founding member of the Pacific Coast Junior Hockey League and the Canadian Junior A Hockey League, and presided over the British Columbia Junior Hockey League. He was inducted into the Northwestern Ontario Sports Hall of Fame, the Hockey Hall of Fame, the BC Hockey Hall of Fame, and the BC Sports Hall of Fame. He received the Canadian Centennial Medal, and was made the namesake of the Fred Page Cup.\n\nPage was born on September 29, 1915, in Port Arthur, Ontario.[1][2][3] He grew up playing minor ice hockey in Port Arthur, then played junior ice hockey for the 1934–35 season. He won the Thunder Bay Amateur Hockey Association (TBAHA) championship with the Port Arthur Juniors that season. His finished his playing career in the 1938–39 season with the Nipigon Intermediates.[1][2][4][5]\n\nFrom 1940 to 1948, Page was an ice hockey referee and a coach in Fort William minor hockey. He was promoted to officiating for the TBAHA from 1948 to 1954.[5] He refereed the first game played at the Fort William Gardens when it opened on March 6, 1951.[6] He was recognized for his refereeing abilities, and was selected to officiate in playoffs for the Memorial Cup and the Allan Cup.[2][7] During game three of the 1953 Memorial Cup Western Canada final, Leo Konyk scored an overtime game-winning goal for the St. Boniface Canadiens, then grabbed Page who was refereeing, and began dancing with him at center ice. After the incident, Page implied that he did not like dancing.[8] He later officiated in the 1958 Memorial Cup playoffs, and at 1958 Allan Cup tournament.[2][7]\n\nPage became involved as an executive with the Fort William Minor Hockey Association in 1948, and was elected to be the organization's president in 1951. He later served on the TBAHA executive committee starting in 1954, and was its president from 1959 to 1964.[5][9] He arranged to have exhibition games at the Fort William Gardens with teams from the Soviet Union and Japan during the 1959–60 season. He also urged for residents in Port Arthur to push for a replacement to the lost Port Arthur Arena. During Fort William's general meeting in 1960, he announced the hosting duties for the 1961 Canadian Amateur Hockey Association (CAHA) general meeting.[10]\n\nPage also participated on the CAHA committee in his role as the TBAHA president.[11] He was the CAHA executive who oversaw the Western half of the 1960 Memorial Cup playoffs. He ordered the final match of a series to be stopped due to on-ice violence, and awarded the series to the Brandon Wheat Kings.[12] At the 1961 general meeting of the CAHA, Page made a motion to provide greater compensation for the visiting team in senior ice hockey playoffs to cover travel expenses.[13] At the same meeting, he opposed a motion which gave the CAHA president or his representative the power to choose either the two-referee-system without linesmen, or the one-referee-two-linesmen system for CAHA playoffs. Page preferred having one referee and two linesmen.[14] In the winter of 1961–62, he co-chaired the Port Arthur Bearcats European exhibition game tour and travelled with the team. The Bearcats visited Czechoslovakia, East Germany and Sweden, and won the 1962 Ahearne Cup.[5][15]\n\nPage was elected the second vice-president of the CAHA on May 25, 1962, and served in the role under president Art Potter until 1964.[11][16] Page chaired the Western Canada junior hockey committee that examined the reduced calibre of play in the Memorial Cup, brought on by rapid expansion which included 17 new teams in the British Columbia Amateur Hockey Association (BCAHA) within two years.[17] In December 1962, he negotiated a new draft agreement with the National Hockey League (NHL) to allow the drafting of four 17-year-olds, with a payment of $2,000 to the junior club.[18] He also acted as a chaperone for the Soviet Union national ice hockey team on tour in Canada in December 1962.[19] From 1963 to 1964, he was the  chairman of a CAHA committee to establish a leadership program and clinics for coaches.[5][20]\n\n\"We used to go to Europe, get drunk for five days, and still beat everybody. That all ended in the 1960s.\"\n\nPage was elected the first vice-president of the CAHA on May 23, 1964, and served in the role under president Lionel Fleury until 1966.[11][22] Page served on the CAHA committee to oversee the Canada men's national junior ice hockey team,[5] and the committee to examine the existing professional amateur draft agreement, and the financial reliance of the CAHA on the NHL.[23] He was also placed in charge of the Lacombe Rockets tour of Switzerland, Czechoslovakia and Sweden, during December 1964.[5][24]\n\nHis role as vice-president was occupied by the arbitration committee to resolve disagreements between the provinces and the respective junior leagues. The Manitoba Amateur Hockey Association (MAHA) and the Saskatchewan Amateur Hockey Association (SAHA) were at odds, due to the Flin Flon Bombers and the Brandon Wheat Kings playing in the Saskatchewan Junior Hockey League (SJHL) instead of in the Manitoba Junior Hockey League (MJHL). Page and the committee reached a resolution by profit sharing the ticket sales between the leagues and teams.[25] He also admitted a mistake in the Western junior playoffs structure, and agreed to revisit the issue as proposed by Jimmy Dunn and the MJHL.[26]\n\nPage was in charge of the Western junior playoffs for the 1964 Memorial Cup, and stated it was too late to change the playoffs when the SAHA did not meet its deadline to determine a league winner to face the BCAHA champion.[27] He decided that the SJHL should give financial compensation to the BCAHA team, as per the CAHA regulations.[28] He was later in charge of the contentious 1965 Memorial Cup, which included many penalties between the Edmonton Oil Kings and the Niagara Falls Flyers.[29]\n\nPage was re-elected as first vice-president on May 28, 1965.[30] He announced that the CAHA would choose the site of the 1966 Memorial Cup based on recommendations from the Ontario Hockey Association (OHA) champion, despite the desire of the OHA to host  games in Maple Leaf Gardens for the biggest profit, and that no set rule was in place for determining the location of the games.[31] The games were ultimately played in the Gardens, since the OHA championship was won by the nearby Oshawa Generals.[32]\n\nPage also attended exploratory meetings in May 1966, between the CAHA and potential team owners in Western Canada. Discussions included concerns about financial burdens on owners, junior age limits, and a draft proposal with the NHL to end direct team sponsorship.[33] He chaired the CAHA general meeting while Fleury was absent due to a heart condition. Page said that he expected to enter talks with the NHL regarding a new professional-amateur pact being proposed by the CAHA, and that the old agreement would end in June 1967. At the same meeting, the CAHA accepted the Canadian Interuniversity Athletic Union as an associate member.[34]\n\nPage was elected president of the CAHA on May 28, 1966,[35] and served in the role for two years until 1968.[11] While president, he was chairman of the Canadian national team committee, and chairman of the CAHA rules committee.[20] He wanted the CAHA to gain more control over its affairs, become more independent from the NHL, a move away from junior-aged players being bound by contracts to professional teams. He set about to replace the existing system of NHL clubs directly sponsoring junior teams with a universal draft instead. He recognized that a new system might cost more money to operate, but give the CAHA more control over its junior players in the future.[36] He entered into negotiations for a new player development agreement between the CAHA, the NHL, and the Amateur Hockey Association of the United States (AHAUS).[1]\n\nPage and NHL president Clarence Campbell announced a new tentative five-year agreement on August 19, 1966, with several proposed changes to the existing system, effective July 1, 1967. The direct sponsorship of junior teams by the NHL was to be phased out in the upcoming year, and no new sponsored players could be registered or be required to sign a contract restricting movement between teams.[37] The agreement eliminated the A, B and C forms, which had angered the parents of amateur players and were the source of legal action threats when the professional team refused to release a player.[38] Page succeeded in getting junior-aged players to be eligible for the NHL Amateur Draft once they graduate from junior hockey, or to be signed as a free agent in the year the player reaches his 20th birthday. The NHL agreed to pay development fees to the CAHA for the drafted players, and it allowed the CAHA to distribute the fees. The new agreement came at a time that also leveled the playing field for new NHL clubs in the 1967 NHL expansion.[37]\n\nDespite the new agreement, Page faced challenges from teams in Western Canada which wanted the age limit to be 21, and allow the movement of players to team in other provinces. The dissenting teams dropped out of the SJHL, and formed the independent Canadian Major Junior Hockey League (CMJHL) which was not sanctioned by the CAHA.[39][40][41] Page suspended those persons involved with the CMJHL, and the CAHA amended its internal rules to revoke the suspensions if the players or the league returned to CAHA jurisdiction.[40][42] He instructed the Alberta Amateur Hockey Association (AAHA) and SAHA branches to inform of the suspensions from the CAHA,[43] and was forced to call an emergency meeting of the CAHA, when the Quebec Amateur Hockey Association (QAHA) joined the AAHA, and the SAHA in opposition to the suspensions.[44] The meeting resulted in the suspension of CMJHL commissioner Frank Boucher and the teams' governors, in addition to the players. The CAHA invited teams and players to rejoin the SJHL or the Alberta Junior Hockey League to be eligible to compete for the Memorial Cup.[45] The CMJHL proceeded with legal action against Page and the CAHA, with the aim to have the suspension lifted and be eligible for the Memorial Cup.[46]\n\nOn the international side of the game, the new agreement that Page negotiated with the NHL included provisions for players to be reinstated as amateurs after two years of not playing professional, or by a review board for a quicker decision.[47] Despite those provisions, Page said that the CAHA recognized suspensions handed out by the NHL, and would not permit Carl Brewer to play as an amateur with the Canada men's national ice hockey team unless the reason for the suspension was resolved with the Toronto Maple Leafs.[48]\n\nIn 1966, Avery Brundage of the International Olympic Committee (IOC) threatened to drop hockey from the Winter Olympic Games due to the increasing professional and commercial nature of the sport. Page did not take the threat seriously, since he believed that profits from hockey actually kept the Olympics going.[49] Page confirmed that the CAHA considered withdrawing from the International Ice Hockey Federation (IIHF) in March 1967, if Canada was not given hosting duties for either the 1969 or 1970 World Ice Hockey Championships. Canada had never hosted the event, and proposed co-hosting with AHAUS at Colorado Springs, Colorado.[50]\n\nThe 1967 CAHA general meeting saw Page re-elected as president, and ratification of the new 5-year professional-amateur agreement. NHL teams agreed to pay $3,000 for each of the first 72 players, and $2,000 per any player drafted thereafter or signed as a free agent. Page and the CAHA would then oversee the distribution of draft fees to teams which developed the player.[51] The agreement also set up a joint player development committee to grow the talent pool and skill level, and Page served as its co-chairman.[1][41] The CAHA constitution was amended at the general meeting to give absolute powers to the executive when needed, which aimed to prevent further court cases. The executive committee also decided on applications by senior teams to play in the Ahearne Cup and the Spengler Cup, and began the process of starting a second Canadian national team based in Ottawa, in addition to the Winnipeg-based national team.[51] Page and the CAHA were also faced with Quebec sovereignty movement sentiments in the QAHA, where some leagues broke away from the English-dominated CAHA. Page and the QAHA intended to use the opportunity to play on the second Canadian national team as a drawing card to stay within the CAHA.[52]\n\nLater in 1967, the IIHF awarded Canada hosting duties for the 1970 World Ice Hockey Championships A pool, and gave permission to use minor league professionals and reinstated amateurs at event.[1][53] Page replied to the Russian protests of professionals by saying that \"it was decided upon by a majority vote, and there was little that the Russians could do to change it\".[54] Page felt that the Canadian national team was typically restricted by the exclusion of professionals at the Olympics. He felt that professional contracts were more lucrative to Canada's best younger players than the $2,500 scholarship which the CAHA offered to cover tuition and living expenses.[55]\n\nThe CAHA invited all cities in Canada with arenas of 10,000 seats or more to bid for hosting games in the 1970 World Ice Hockey Championships. Applications were received from Montreal, Toronto, Winnipeg, and Vancouver.[51] The Winnipeg Free Press speculated that Vancouver and the Pacific Coliseum had a good chance of hosting, due to Page residing in the area.[56] He later anno",
  "concepts": [
    "Fred Page"
  ],
  "findings": [
    "Early life and Thunder Bay hockey",
    "CAHA vice-president",
    "CAHA president",
    "First year",
    "Second year",
    "Post-CAHA presidency",
    "International hockey",
    "British Columbia hockey",
    "Professional life",
    "Personal life",
    "Honours and awards",
    "References",
    "Bibliography"
  ],
  "timestamp": "2025-04-11T10:09:07.056852"
}