{
  "title": "Lasalle & Koch",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Lasalle_&_Koch",
  "content": "Lasalle & Koch Co. or Lasalle's was a department store in Toledo, Ohio, with branches in some nearby communities.\n\nLasalle's traces its beginnings to a store opened in 1865 by Jacob Lasalle and Joseph Epstein, at 51 Summit Street.  In 1883, Joseph Koch joined the business, which relocated to a new store at the corner of Summit and Adams Streets. In 1900, the Lasalle & Koch Co. opened a new store at the corner of Jefferson Avenue and Superior Street.  This store was enlarged several times, and in 1916, ground was broken for a new store at Adams and Huron Streets.[1]\n\nThe Lasalle & Koch Co. opened its flagship downtown Toledo store at 513 Adams Street in 1917.  The company was purchased by R.H. Macy Co. in 1923.[2]\n\nIn November 1927, Lasalle & Koch Co. completed the addition of three upper floors, and to celebrate, commissioned mural artist Arthur Covey to create a series of paintings about Toledo-area industries which were exhibited in the store's display windows.[3][4]\n\nLasalle and Koch retained a great deal of autonomy, with Alfred B. Koch, son of Joseph Koch, serving as president until his untimely death in 1937. He was succeeded by another Lasalle and Koch veteran, Louis Epstein.[5]\n\nDuring the postwar era, Lasalle's expanded by opening branches in the downtown shopping districts of smaller Northwest Ohio cities:  Bowling Green (1945), Tiffin (1947), Sandusky (1949), and Findlay (1955).[6]\n\nIn late 1957 and most of 1958, there was a 13-month-long strike against Lasalle's and two other Toledo department stores, Lamson's and The Lion Store, by the Retail Clerks International Association, which later became the United Food and Commercial Workers. The strike was settled by a \"Statement of Understanding\" under which the striking workers were reinstated to their jobs but the union was not recognized.[7][8]\n\nIn 1962, Lasalle's opened their first suburban Toledo location, a free-standing store at Toledo's Westgate Center.[6]  Lasalle's third Toledo store, in the Woodville Mall, east of Toledo in suburban Northwood, opened in 1969.  It was the first Lasalle's store in an enclosed shopping mall. Their fourth Toledo location, the 162,000 square feet (15,100 m2). North Towne Square store, opened in 1980.[9]\n\nAll Lasalle's stores were converted to the Macy's name in 1981.[10]  At the time of the name change, Lasalle's operated the flagship downtown Toledo store, and suburban branches at Westgate, North Towne Square, and Woodville Mall. Lasalle's also had stores in the downtown shopping districts of Bowling Green, Sandusky, Findlay, and Tiffin.\n\nIn 1981, Lasalle's and Macy's Missouri-Kansas were consolidated into a new division known as Macy's Midwest. Following the name change in 1981, Macy's Midwest closed the Lasalle's executive offices, credit department, and buying department, and moved their functions to Kansas City.  (This earlier incarnation of Macy's Midwest should not be confused with the one headquartered in St. Louis, which followed the Federated acquisition of Macy's.)  After two years of gradually reducing the floor space of the downtown store by closing floors, Macy's Midwest closed the downtown flagship store.[10] The stores in Bowling Green, Sandusky, and Tiffin were closed between 1982 and 1985.\n\nMacy's sold the remaining Toledo area and Findlay stores and their Toledo warehouse to Dayton retailer Elder-Beerman in 1985.[11][12] Elder-Beerman now operates a store at the Westgate Village Shopping Center at 3301 Secor Road in Toledo as well as in communities near Toledo including Bowling Green, Ohio, Monroe, Michigan, Adrian, Michigan, Findlay, Ohio, Sandusky, Ohio and Defiance, Ohio.  The Toledo North Towne Square and Woodville Mall stores have since closed, and Findlay store was relocated to the Findlay Village Mall by Elder-Beerman in the late 1980s.  The only remaining former Lasalle's store was the Elder-Beerman at Westgate Village, which closed in 2018 with the chain and was torn down in 2023.\n\nThe downtown Toledo building stood neglected and vacant for thirteen years.  In 1996, developers converted the store to apartments and retail space.[13] The building is part of the Madison Avenue Historic District.[14]\nThe downtown Sandusky store was converted into offices for Erie County, Ohio in the 1990s.\n\nThe current Macy's store in Toledo's Franklin Park Mall has no connection with the Lasalle's stores.  It was opened in 1971 by the J.L. Hudson Company of Detroit.  Hudson's and Dayton's had merged in 1969, but each division kept their respective identities and divisional management.  All Dayton-Hudson stores adopted the Marshall Field's nameplate in 2001, during which time corporate parent Dayton-Hudson had adopted the name of their former subsidiary, Target.  The May Co. purchased Marshall Field's from Target Corp. in 2004, after some speculation that the department store business was dragging down Target's corporate profits.  In 2005, the May Co. itself was bought by Federated.  On September 9, 2006, the Franklin Park store became a Macy's, as did the rest of the Marshall Field stores.\n",
  "concepts": [
    "Lasalle & Koch",
    "store",
    "lasalle",
    "toledo",
    "macy",
    "stores",
    "koch",
    "downtown",
    "opened",
    "ohio",
    "mall"
  ],
  "findings": [
    "History",
    "Consolidation and sale",
    "Notable employees",
    "Gallery of Historical Images of LaSalle and Koch Company and Store",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:37:02.875894"
}