{
  "title": "Butler, Waukesha County, Wisconsin",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Butler,_Waukesha_County,_Wisconsin",
  "content": "Butler is a village in Waukesha County, Wisconsin, United States. The population was 1,787 at the 2020 census.\n\nThe village of Butler exists due to the railroad. It began in the season of fall in 1909, when people from the Milwaukee, Sparta, and North Western Railway (a division of the Chicago and North Western Railway) visited farmers living on the eastern area of 124th Street and bought their land to start railroad yards around the City of Milwaukee to relieve congestion in the downtown rail yards. These railroad yards were called \"New Butler\".[4] Butler was probably named for William Butler, a large property owner in the area who had emigrated from England in the mid-1840s.[5] In 1911, the settlement of \"New Butler\" was started within Waukesha County, Wisconsin. This community was started by railroad workers and their families and was incorporated with 200 people on May 5, 1913, from what land that was previously parts of the towns of Brookfield and Menomonee. The village grew as more railroad activities started, and allowed real estate speculators to buy parcels of additional land for development. In 1926 the \"New\" was removed from the name of the village.\n\nButler is located at 43°6′26″N 88°4′8″W﻿ / ﻿43.10722°N 88.06889°W﻿ / 43.10722; -88.06889 (43.107310, −88.068963).[6]\n\nAccording to the United States Census Bureau, the village has a total area of 0.79 square miles (2.05 km2), of which, 0.78 square miles (2.02 km2) of it is land and 0.01 square miles (0.03 km2) is water.[7]\n\nAs of the census[2] of 2010, there were 1,841 people, 895 households, and 430 families living in the village. The population density was 2,360.3 inhabitants per square mile (911.3/km2). There were 925 housing units at an average density of 1,185.9 per square mile (457.9/km2). The racial makeup of the village was 92.2% White, 3.0% African American, 0.7% Native American, 1.2% Asian, 0.1% Pacific Islander, 0.9% from other races, and 1.8% from two or more races. Hispanic or Latino of any race were 4.8% of the population.\n\nThere were 895 households, of which 21.2% had children under the age of 18 living with them, 33.9% were married couples living together, 8.8% had a female householder with no husband present, 5.4% had a male householder with no wife present, and 52.0% were non-families. 44.4% of all households were made up of individuals, and 20.1% had someone living alone who was 65 years of age or older. The average household size was 2.06 and the average family size was 2.92.\n\nThe median age in the village was 43.2 years. 17.6% of residents were under the age of 18; 8.8% were between the ages of 18 and 24; 25.7% were from 25 to 44; 29.1% were from 45 to 64; and 18.9% were 65 years of age or older. The gender makeup of the village was 47.5% male and 52.5% female.\n\nAs of the census[9] of 2000, there were 1,881 people, 916 households, and 459 families living in the village. The population density was 2,376.2 people per square mile (919.3/km2). There were 938 housing units at an average density of 1,184.9/sq mi (458.4/km2). The racial makeup of the village was 97.40% White, 0.27% African American, 1.06% Native American, 0.48% Asian, 0.16% Pacific Islander, and 0.64% from two or more races. Hispanic or Latino of any race were 0.85% of the population.\n\nThere were 916 households, out of which 20.7% had children under the age of 18 living with them, 39.0% were married couples living together, 8.1% had a female householder with no husband present, and 49.8% were non-families. 42.5% of all households were made up of individuals, and 25.3% had someone living alone who was 65 years of age or older. The average household size was 2.05 and the average family size was 2.88.\n\nIn the village, the population was spread out, with 19.5% under the age of 18, 6.2% from 18 to 24, 30.8% from 25 to 44, 20.0% from 45 to 64, and 23.5% who were 65 years of age or older. The median age was 41 years. For every 100 females, there were 89.8 males. For every 100 females age 18 and over, there were 86.1 males.\n\nThe median income for a household in the village was $38,333, and the median income for a family was $50,903. Males had a median income of $35,781 versus $26,250 for females. The per capita income for the village was $22,167. None of the families and 2.4% of the population were living below the poverty line, including no under eighteens and 7.8% of those over 64.\n\nIt is in the Hamilton School District,[10] which operates Hamilton High School.\n",
  "concepts": [
    "Butler, Waukesha County, Wisconsin",
    "village",
    "age",
    "living",
    "18",
    "population",
    "km2",
    "butler",
    "years",
    "square",
    "households"
  ],
  "findings": [
    "History",
    "Geography",
    "Demographics",
    "2010 census",
    "2000 census",
    "Education",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:48:47.374672"
}