{
  "title": "Karl Reindler",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Karl_Reindler",
  "content": "Karl William Reindler (born 18 April 1985) is an Australian racing driver, who has previously competed in the Supercars Championship.  He currently shares duties with Bruno Correia as the Medical Car driver for Formula One.\n\nOff the back of winning Rookie of the Year in the 2003 Australian Formula 3 Championship, Reindler went on to win the 2004 Championship in the final round.[1]\nAt the completion of the 2004 season, Reindler competed in his first international event, the one-off Bahrain F3 SuperPrix, racing for the Swiss Racing Team.  He finished 18th in what was regarded at the time as the unofficial World Championship for Formula 3 – select drivers from this event went on to winning championships in Formula 1, WEC, DTM, Super GT and Super Formula to name a few.\n\nReindler moved to Britain in 2005 to complete a part-season of the British Formula 3 Championship with Alan Docking Racing, commencing at round 7 at Monza, Italy, finishing 7th and 10th on debut. A season-best qualifying happened at the final round at the Silverstone Circuit, qualifying 6th and finishing 7th. At the conclusion of the 2005 season, Reindler qualified for and competed in the World-famous Macau Grand Prix, finishing 13th in a competitive field which included Sebastian Vettel, Robert Kubica, Romain Grosjean and eventual winner Lucas di Grassi.  In 2006 he continued with the Alan Docking Racing squad in British F3, again, only completing part of the season and ultimately finishing 14th outright after a season littered with mechanical related retirements.\n\nReindler went on to represent Australia as the rookie driver in the penultimate race of the 2005–06 A1 Grand Prix season at Laguna Seca, then progressed to lead driver at the second round of the 2006–07 A1 Grand Prix season in the Czech Republic.  At the third round of the season, at the demanding Beijing street circuit in China, Reindler fought hard to finish on the podium in the feature race. He continued with Team Australia until the Durban event in South Africa before the team changed their driver line-up. He joined the ranks of the Asian Formula Renault V6 series in 2007, but only ran two rounds, finishing on the podium in Autopolis, Japan.\n\n2008 saw him join Matt Connolly Motorsports Pontiac GTO.R team for the Daytona 24 Hour. Reindler qualified the car 3rd in GT, but had a raft of mechanical drama's during the race and finished 25th in class. This was in addition to a full season in Fujitsu series in 2008, partnering Dean Canto at Howard Racing. 8th outright in the Series earned him the V8 Supercar Mike Kable Rookie of the Year Award. Reindler also participated in that year's Bathurst 1000 replacing Grant Denyer at Ford Rising Stars Racing following his monster truck accident. 2009 saw just a handful of races which included the twin driver Australian Mini Challenge race in Perth where he shared with his younger brother Chris, not to mention partnering with Jason Bright for the V8 Supercar endurance events, which included an 11th-place finish at the Bathurst 1000.\n\nReindler joined V8 Supercars full-time in 2010. Reindler drove a Brad Jones Racing customer Holden Commodore under the banner of Britek Motorsport and Fair Dinkum Sheds Racing.[2]\n\nReindler continued with the Brad Jones Racing team in 2011, and after a season-best qualifying and finish of 6th and 7th on the Saturday at the Barbagallo Raceway round in 2011, he was involved in a major start-line accident with Steve Owen on the Sunday. Reindler's clutch failed on the grid, causing the car to stall and was hit from behind at an estimated 150 km/h by Owen, the resulting impact rupturing the fuel cell, producing a major fireball. The fuel entered the car and starting burning it from the inside out. Reindler walked away suffering burns to his face and hands, was hospitalised and released that evening.[3]\n\nIn 2012 Karl joined Kelly Racing to drive the #11 Car as teammate to Greg Murphy for the 2012 season.\n\nAfter 3 years full-time in V8 Supercars, Reindler took a step back in 2013, competing in a few select rounds of the Australian Carrera Cup Championship and teamed up with Rick Kelly in the factory Jack Daniel's Nissan Altima V8 Supercar for the V8 Supercar PIRTEK Enduro Cup.  Despite being hindered by straight-line speed issues, the duo went on to lead the Gold Coast race and ultimately finish in 6th place.\n\n2014 saw Reindler on a hiatus from the sport competing in only two events; the Bathurst 12hr which saw a pole position and fastest race lap in class, and the Phillip Island 101 of the Australian GT Championship where he took out a class win and fastest lap.\n\nHe made his return to V8 Supercars alongside Tim Blanchard in the #3 Lucas Dumbrell Motorsport Holden Commodore (VF) at the 2015 Wilson Security Sandown 500, finishing 8th.\n\nIn 2016 he joined Team 18 initially for the endurance championship but also filling in for Lee Holdsworth at Sydney Motorsport Park. He continued with the team in 2017.\n\nReindler was educated at Wesley College in South Perth. He is married to Olympic sailor Elise Rechichi, and they have two children.[4]\n\n(key) (Races in bold indicate pole position) (Races in italics indicate fastest lap)\n\n(key) (Races in bold indicate pole position)\n",
  "concepts": [
    "Karl Reindler",
    "reindler",
    "season",
    "racing",
    "championship",
    "v8",
    "team",
    "formula",
    "round",
    "race",
    "finishing"
  ],
  "findings": [
    "Biography",
    "Formula Three",
    "A1 Grand Prix",
    "Sedan Racing",
    "Personal life",
    "Career results",
    "Complete Macau Grand Prix results",
    "Complete A1 Grand Prix results",
    "Complete Grand-Am Rolex Sports Car Series results",
    "24 Hours of Daytona results",
    "Supercars Championship results",
    "Complete Bathurst 1000 results",
    "Complete Bathurst 12 Hour results",
    "Complete Bathurst 6 Hour results",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:40:06.797704"
}