{
  "title": "British Independent Film Award for Best Supporting Actress",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/British_Independent_Film_Award_for_Best_Supporting_Actress",
  "content": "The British Independent Film Award for Best Supporting Actress is a discontinued annual award given by the British Independent Film Awards (BIFA) to recognize the best supporting performance by an actress in a British independent film.\n\nFrom 2003 to 2007, only one award was presented for supporting performances named Best Supporting Actor/Actress. Since 2008, two categories named Best Supporting Actor and Best Supporting Actress are presented.\n\nOlivia Colman is the only actress who has won this award more than once since its creations in 2008 with two wins while Kristin Scott Thomas and Julie Walters hold the record of most nominations in this category with three each.\n\nIn July 2022, it was announced that the performance categories would be replaced with gender-neutral categories, with both Best Supporting Actor and Best Supporting Actress merging into the Best Lead Performance category. Additionally, a category named Best Joint Lead Performance was created for \"two (or exceptionally three) performances that are the joint focus of the film, especially where performances share a large number of scenes and screen time\".[1]\n",
  "concepts": [
    "British Independent Film Award for Best Supporting Actress",
    "best",
    "supporting",
    "best supporting",
    "actress",
    "performance",
    "film",
    "award",
    "supporting actress",
    "supporting actor",
    "performances"
  ],
  "findings": [
    "Winners and nominees",
    "2000s",
    "2010s",
    "2020s",
    "Multiple nominations",
    "Multiple wins",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [
    {
      "subject": "British Independent Film Award for Best Supporting Actress",
      "relationship": "is a",
      "object": "discontinued annual award given by the british independent film awards",
      "sentence": "The British Independent Film Award for Best Supporting Actress is a discontinued annual award given by the British Independent Film Awards (BIFA) to recognize the best supporting performance by an actress in a British independent film."
    }
  ],
  "timestamp": "2025-04-11T17:34:44.751131"
}