{
  "title": "Whangaroa Harbour",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Whangaroa_Harbour",
  "content": "Whangaroa Harbour (/ˈfæŋəroʊ.ə/; Māori pronunciation: [faŋaɾɔa]), previously spelled Wangaroa Harbour, is an inlet on the northern coast of Northland, New Zealand. Whangaroa Bay and the Pacific Ocean are to the north. The small settlements of Totara North and Saies are on the west side of the harbour, Waitaruke on the south side, and Whangaroa on the east. State Highway 10 runs through Waitaruke.[1][2] The name comes from the lament \"Whaingaroa\" or \"what a long wait\" of a woman whose warrior husband had left for a foray to the south.[3] The harbour was formed when rising sea levels drowned a river valley about 6,000 years ago. Steep outcrops remain from ancient volcanic rocks.[4]\n\nThere are extensive mangrove swamps at the head of the harbour,[5] and some of the oldest fossils in the North Island, dating to the Early Permian about 270 million years ago, are in the Whangaroa area.[6]\n\nAccording to Māori traditions, the waka Māhuhu-ki-te-rangi explored the Whangaroa harbour during early Māori settlement of New Zealand.[7] The area was settled by descendants of Te Māmaru and Mataatua waka crews.[8]\n\nWhaling and other ships visited Whangaroa from 1805 to 1809, including the General Wellesley and  Commerce in 1806, and Elizabeth in 1809. Sixty-six members of the crew of the Boyd were killed by local Māori in 1809 after the crew whipped the son of a chief. The visits ceased as a result, resuming when the Dromedary loaded timber in 1819.[9] Southern right whales were severely depleted by the hunts and almost disappeared from the area, while dolphins and killer whales still visit the harbor more frequently.\n\nA Wesleyan mission was founded in June 1823.[10] Hongi Hika attacked local Māori to gain control of millable kauri on 10 January 1827. A party of his warriors, without his knowledge, ransacked the mission and it was abandoned.[11]  In 1828 Hongi Hika died at Whangaroa, from a wound suffered 14 months earlier in the Hokianga.[5]\n\nEuropeans settled the harbour in the 1840s, and a Catholic mission was established at Waitaruke. The harbour was a centre for timber milling and gum digging after the arrival of the immigrant ship Lancashire Witch in 1865. Shipyards were established in Totara North in 1872.[9] Thomas Major Lane and William Brown started a yard at Kaeo in 1870 and moved it to Totara North in 1872. By 1887 they had built 26 ships.[12] The yard closed in 1905,[13] but some buildings remain.[14] Kauri logs were chained together to make rafts, and towed by steamer. It took three days for the logs to reach Auckland.[15] In the early 20th century Sea Sick Bay near the south head was a whaling station, which by the 1920s had moved to Ranfurly Bay, near the north head.[9]\n\nAfter the Mangamuka Gorge road was sealed in 1961 it became the main route from Whangarei to the Far North, bypassing Whangaroa.[5]\n\nTe Kura o Hato Hohepa Te Kamura is a full primary (years 1-8) school in Waitaruke. It has a decile rating of 1 and a roll of 18.[16]\n\nTotara North School is a contributing primary (years 1-6) school with a decile rating of 3 and a roll of 39.[17]\n\nBoth schools are coeducational. Other schools in the area are at Oruaiti, Kaeo and Matauri Bay.\n35°3′0″S 173°44′0″E﻿ / ﻿35.05000°S 173.73333°E﻿ / -35.05000; 173.73333\n",
  "concepts": [
    "Whangaroa Harbour"
  ],
  "findings": [
    "History",
    "Education",
    "Notes",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:23:05.988599"
}