{
  "title": "Rivière-aux-Canards",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Rivière-aux-Canards",
  "content": "Rivière-aux-Canards was an Acadian community located at the west side of the Minas Basin from 1670 until 1755. The community occupied the present-day site of Canard, Port Williams and Starr's Point, Nova Scotia. The village was established in 1670 by the name of Saint-Joseph-de-la-Rivière-aux-Canards, later, it became Rivière-aux-Canards in short form.[1]\n\nAcadians settled along the Canard River in the late 1600s and called it Rivière-aux-Canards after the French word for duck. They first built small dykes to claim salt water marshes for farmland at the upper reaches of the river near the communities now known as Steam Mill Village and Upper Dyke. A large cross dyke was built further down river at Middle Dyke. About 1750 an even larger cross dyke, over a mile long, was built near Port Williams. Known as the Grand Dyke it located where the current highway Route 358 crosses the river.[2] By this date, the Acadian village on both sides of the river totaled 750 people and included the extensive dykeland farms along the river as well as several mills.[3]\n\nA parish was established in 1670 by the name of  Saint-Joseph-de-la-Rivière-aux-Canards, later, Rivière-aux-Canards in short form.  The best farms were located at the mouths of 'rivière aux Canards' river and the 'Saint-Antoine' river.[4] Rivière-aux-Canards was west of Grand-Pré. A schooner landing and ferry at Boudreau's Bank provided a connection between the two settlements.\n\nThe Acadian settlement was destroyed in the 1755 Bay of Fundy Campaign of the Expulsion of the Acadians. On October 27, 1755 fourteen transport ships embarked 1,600 Acadians from the region of Grand-Pré and Rivière-aux-Canards, as well as 1,300 from Pisiguit and Cobequid. Acadian families from Rivière-aux-Canards brought personal possessions to Boudreau's Bank in ox carts where they were loaded on exile ships, leaving 60 ox carts to be found at the landing by later settlers.[5] The deportation vessels joined up with ten other ships in the Bay of Fundy with 1,900 Acadiens from the region of Beaubassin.  Some of the ships were over crowded with standing room only.[6] Governor Charles Lawrence had given the order to prevent the Acadians from returning.  It was for this reason that the villages of  Cobequid, Pisiguit, and Rivière-aux-Canards were burnt to the ground.[7] It is not known when, or if, Grand Pré was burned. With no one to maintain the dykes, a severe storm in November 1759 breached the Grand Dyke and flooded up to the Middle Dyke which was badly damaged, returning hundreds of acres of farmland to tidal marshes.\n\nThe New England Planters took up the Acadian lands along the river in 1760, discovering a handful of Acadian families at Rivière-aux-Canards who had hidden and escaped deportation. Their former lands became part of newly surveyed \"Cornwallis Township\" settled by New England Planters, some of whom employed the remaining Acadians to repair dykes.[8] A government ship bringing supplies up the Canard River for the Planters, the brigantine Montague was wrecked in the lower reaches of the river in December 1760. The Planter settlement on the south bank of the river becoming known as Starr's Point and the settlement on the north becoming known as Canard. The Planters repaired the Middle Dyke and rebuilt the Grand Dyke in 1782. In 1825 they built the Wellington Dyke near the mouth of the Canard River protecting in total over 3,000 acres of farmland along the river from the tides of the Minas Basin.[9]\n",
  "concepts": [
    "Rivière-aux-Canards",
    "river",
    "rivière aux",
    "rivière",
    "canards",
    "aux canards",
    "aux",
    "dyke",
    "grand",
    "acadian",
    "known"
  ],
  "findings": [
    "History",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T14:34:23.556593"
}