{
  "title": "Simit",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Simit",
  "content": "Simit is a circular bread, typically encrusted with sesame seeds or, less commonly, poppy, flax or sunflower seeds, found across the cuisines of the former Ottoman Empire and the Middle East, especially in Armenia, Turkey and the Balkans.[4] Simit's size, crunch, chewiness, and other characteristics vary slightly by region.\n\nIn İzmir, simit is known as gevrek (\"crisp\"), although it is very similar to the Istanbul variety. Simit in Ankara are smaller and crisper than those of other cities.[citation needed]\n\nThe word simit comes from Arabic samīd (سميد) \"white bread\" or \"fine flour\".[5][6]\n\nOther names are based on the Byzantine Greek kollikion (κολλίκιον), or Ancient Greek kollyra (κολλύρα), or Greek koulouri (κουλούρι). In Latin it is known as arculata. Aramaic: ܩܶܠܽܘܪܳܐ/ܩܸܠܘܿܪܵܐ (qeluro/qelora); Turkish: gevrek;[7][8] South Slavic đevrek, ђеврек, gjevrek, ѓеврек, геврек. The Armenian name is բոկեղ (bokegh). In Judaeo-Spanish it is known as roskas turkas.[9] In English it is known as rosca or coulouri.[10]\n\nArchival sources show that simit has been produced in Istanbul since 1525.[11] Based on Üsküdar court records (Şer’iyye Sicili) dated 1593,[12] the weight and price of simit was standardized for the first time. The 17th-century traveler Evliya Çelebi wrote that there were 70 simit bakeries in Istanbul during the 1630s.[13] Jean Brindesi's early 19th-century oil paintings about Istanbul daily life show simit sellers on the streets.[14] Warwick Goble, too, made an illustration of these simit sellers of Istanbul in 1906.[15] Simit and its variants became popular across the Ottoman Empire.[citation needed]\n\nSimit is generally served plain, or for breakfast with tea, fruit preserves, or cheese or ayran. Drinking tea with simit is traditional. Simit (\"Bokegh\" in Armenian) is a traditional Christmas bread in Armenia.[citation needed]\n\nSimit are generally sold by street vendors in Turkey,[16] who either have a simit trolley or carry the simit in a tray on their head. Street merchants generally advertise simit as fresh (\"Taze simit!\"/\"Taze gevrek!\") since they are baked throughout the day; otherwise hot (\"Sıcak, sıcak!\") and extremely hot (\"El yakıyor!\" means \"It burns the hand!\") when they are not long out of the oven.[citation needed]\n\nSimit is an important symbol for lower and middle-class people of Turkey. Sometimes it is called susam kebabı (\"sesame kebab\").[citation needed]\n\nIn other parts of the Middle East, in Egypt it is consumed with boiled eggs and/or duggah, which is a mixture of herbs used as condiments. It is commonly used to break the fast, with yoghurt or buttermilk, in mosques in Mecca and Medina.[citation needed]\n\nToday, many municipalities in Turkey produce simit through their own subsidiaries.[17]\n\nCertain varieties of Romanian covrigi are similar to simit, the places that sell them even being known as \"Simigerii\".\n\nAnother type of bread similar to simit is known as obwarzanek (in particular obwarzanek krakowski) in Poland and bublik in Russia, Ukraine and Belarus. The main difference is that the rings of dough are poached briefly in boiling water prior to baking (similarly to bagels), instead of being dipped in water and molasses syrup, as is the case with simit.[citation needed]\n\nGirde (Uygur: Гирде), is a type of bread baked on the walls of tandoori oven, that is very similar to simit, and that the Uyghurs in China see as a characteristic item in their culture-specific kitchen.[citation needed]\n",
  "concepts": [
    "Simit"
  ],
  "findings": [
    "Name",
    "Origins",
    "Consumption",
    "Similar products",
    "See also",
    "References"
  ],
  "timestamp": "2025-04-11T10:19:31.818060"
}