{
  "title": "Wildlife Conservation Network",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Wildlife_Conservation_Network",
  "content": "The Wildlife Conservation Network (WCN) is a United States–based 501(c)(3) non-profit organization that protects endangered wildlife by supporting conservationists in the field who promote coexistence between wildlife and people. WCN does this by providing its partners with capital, strategic capacity-building services, training, and operational support. WCN has been given a top rating amongst wildlife conservation charities, with a four star rating on Charity Navigator.[2]\n\nFounded in 2002, Wildlife Conservation Network was built on a venture capital fundraising model to identify entrepreneurial conservationists and projects and give them the support they need to effectively run their programs. WCN brings donors together with field conservationists to develop personal relationships and allow donors to see how their support is making an impact for wildlife. WCN’s 100% donation model means every dollar donated to a specific species is guaranteed to go to the conservationists who protect that species.[3]\n\nWildlife Conservation Network forms partnerships with field-based conservation projects committed to protecting endangered wildlife and gives them the support and resources they need for their work.\nPartners as of 2022 include:\n\nWCN's Wildlife Funds tackle the diverse range of challenges that certain species face in a way that a single field organization could not. These Funds invest in projects from many organizations to protect species across the entirety of their habitats.\n\nThe Elephant Crisis Fund (ECF), a partnership between WCN and Save the Elephants, was established in 2013 to bring the ivory crisis to an end and create a better future for elephants in Africa. While there are signs of hope with elephant poaching in decline, the ivory trade continues across Africa and the ECF remains committed to ending it. The ECF has also expanded its strategies to address other threats to elephants by supporting projects that promote human-elephant coexistence and protect elephant landscapes, giving elephants the space to survive and recover.\n\nOrganizations supported by the ECF include Wildlife Conservation Society, Tsavo Trust, and Wildlife Direct, among many others. \n\nThe Lion Recovery Fund (LRF) was created in 2017 by WCN to give conservationists the support they need to address the biggest threats to lions. The LRF invests in projects that protect lions from poaching, retaliatory killing, defend and restore lion habitat, and protect lion prey species from bushmeat poachers and competition with domestic livestock.\n\nOrganizations supported by the LRF include Panthera, Wildlife Conservation Society, WildAid, WildCru, Big Life Foundation, and Ruaha Carnivore Project, to name a few.\n\nPangolins are hunted for their scales, body parts, and meat, making them the most illegally trafficked mammals on Earth. All eight species of pangolins are dangerously close to extinction. To prevent pangolins from vanishing, WCN and Save Pangolins created the Pangolin Crisis Fund (PCF) in 2019 to protect pangolins and their habitats, help combat illegal wildlife traffickers, and reduce the demand for pangolin products in Asia and Africa.\n\nOrganizations supported by the PCF include the Tikki Hywood Foundation, Wildlife Crime Prevention, the African Pangolin Working Group, World Wildlife Fund-Pakistan, and WildAid, among others.\n\nIn 2020, WCN launched the Rhino Recovery Fund (RRF) to protect rhinos from poachers and safeguard their habitats. The RRF supports projects that fight against rhino poaching and the trafficking of rhino horns. The Fund also supports projects that restore rhino landscapes and bolster protected area management for rhinos in the wild.\n\nOrganizations supported by the RRF include the Frankfurt Zoological Society, the Mozambique Wildlife Alliance, Tsavo Trust, Wildlife ACT, Save the Rhino Trust Namibia, and the International Rhino Foundation, to name a few.  \n\nIn response to the upheaval created by the COVID-19 pandemic in 2020, WCN created its Emergency Relief Fund (ERF). The ERF supports struggling conservationists and local communities who protect wildlife during emergency crises, which often generate devastating health, social, economic, and political challenges. This leads to increased pressure on wildlife, halted conservation fundraising, and the destabilization of security for communities.\n\nAs the COVID-19 pandemic begins to subside, the ERF has expanded to help conservationists get through a variety of emergencies, such as drought and civil conflict.\n\nIn 2021, WCN began working in North America by launching the California Wildlife Program (CWP), which connects habitats for fragmented puma populations and other California wildlife. By creating designated wildlife corridors, the CWP will reconnect isolated puma populations and prevent them from vanishing due to urban development. This will also protect many other California species that share the same ecosystems, including deer, foxes, owls, salamanders, and many more. \n\nLocal people are wildlife’s true stewards, so to support conservationists from within these communities, WCN launched its Scholarship Program in 2006. This program focuses on conservation students committed to working on projects in their respective countries. As of 2022, the Scholarship Program has supported 174 emerging conservationists across 46 countries, helping fund their studies so they can take prominent roles as tomorrow’s conservation leaders.\n\nFor local conservationists who are already established as leaders and are looking to expand their skills, WCN established its Career Program in 2021. This program invests in the growth of those already leading conservation efforts in their communities around the world. In its inaugural year, the Career Program has invested in six promising conservationists so they can create longer lasting impacts for wildlife and local communities.\n\nWCN hosts a semi-annual event, the Wildlife Conservation Expo, that brings together donors and conservationists from around the world to hear the latest news from the field, connect with fellow wildlife advocates, and celebrate wildlife. Wildlife Conservation Expos draw thousands of attendees from a global community dedicated to wildlife conservation. Expo features presentations on the latest work from WCN's Conservation Partners, Wildlife Funds, and other programs, and also features other conservation experts and organizations as guest speakers. Through these presentations, conservationists take attendees on a journey into the field, showing them what it takes to defend endangered wildlife and promote coexistence between them and people.\n\nWhile Expo has historically been an in-person event held in the San Francisco Bay Area, it has expanded to also take place online to include a wider global audience. [6] Notable keynote speakers have included Dr. Jane Goodall,[7] Dr. Iain Douglas-Hamilton,[8] Peter Matthiessen[9] Dr. Claudio Sillero-Zubiri[10] and Dr. Greg Rasmussen.[10] Past guest speakers have included African Marine Mammal Conservation Organization, MareCet, and the Tikki Hywood Foundation.\n\nIn 2005, WCN started providing solar electric systems such as solar water pumps, cookers, lighting, hot water and water purification systems to its partner projects in South America, Africa and Asia.[11]\n",
  "concepts": [
    "Wildlife Conservation Network"
  ],
  "findings": [
    "Conservation Partners",
    "Wildlife Funds",
    "Elephant Crisis Fund",
    "Lion Recovery Fund",
    "Pangolin Crisis Fund",
    "Rhino Recovery Fund",
    "Emergency Relief Fund",
    "California Wildlife Program",
    "Rising Wildlife Leaders",
    "Scholarship Program",
    "Career Program",
    "Wildlife Conservation Expo",
    "Other programs",
    "Solar project",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:09:23.652618"
}