{
  "title": "Intuitive Machines",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Intuitive_Machines",
  "content": "Intuitive Machines, Inc. is an American space exploration company headquartered in Houston, Texas. It was founded in 2013 by Stephen Altemus, Kam Ghaffarian, and Tim Crain,[3] to provide commercial and government exploration of the Moon. Today the company offers lunar surface access for transportation and payload delivery, data transmission services, and infrastructure-as-a-service.[not verified in body] Intuitive Machines holds three NASA contracts under the space agency's Commercial Lunar Payload Services (CLPS) initiative, to deliver payloads to the lunar surface. Intuitive Machines is one of three companies selected by NASA to advance Lunar Terrain Vehicle (LTV) capabilities.[not verified in body]\n\nIntuitive Machines, LLC, went public in February 2023 after merging with Inflection Point Acquisition Corp., a special-purpose acquisition company. The company is incorporated in Delaware, and trades on the Nasdaq under the ticker symbol, LUNR.[4]\n\nIntuitive Machines' Lunar Payload Delivery Services (LPDS) program seeks to open commercial access to the Moon. NASA selected Intuitive Machines' LPDS program for four lunar missions, one of which landed the first American spacecraft to the surface of the Moon since the Apollo Program, and the first spacecraft to reach the lunar south pole region.[not verified in body]\n\nIntuitive Machines, Inc. was founded in 2013 by Stephen Altemus, Kam Ghaffarian, and Tim Crain,[3] to provide commercial and government exploration of the Moon.[citation needed] It is incorporated in Delaware,[5] and headquartered in Houston, Texas.[6]\n\nIntuitive Machines merged with the special-purpose acquisition company (SPAC) Inflection Point Acquisition Corp. (IPAX) to become a publicly held company, a transaction that was completed on February 14, 2023,[7][8][9] and its stock began trading on the Nasdaq that day.[10][11]\n\nIntuitive Machines provides infrastructure as a service and is the catalyst for growing a lunar economy by using three pillars of commercialization:[12] Transportation and delivery of payloads (satellites, scientific instruments, cargo), including rideshare delivery and lunar surface access;[13] collection, processing, and interpretation of space-based data, through command, control, communications, reconnaissance, and prospecting;[14] and infrastructure on the lunar surface, including space assets to perform tasks and make decisions without human intervention.[15] These functions may include navigation, maintenance, scientific data collection, and system health monitoring.[citation needed]\n\nIn November 2018, IM was selected by NASA as one of nine companies to bid on the Commercial Lunar Payload Services program (CLPS).[16] Their lander, Nova-C, was NASA CLPS first mission of the program, focused on the exploration and use of natural resources of the Moon.[17]\n\nOn May 31, 2019, NASA announced it had awarded Intuitive Machines $77 million to build and launch their Nova-C Moon lander.[18][19][20][6]\n\nOn April 13, 2020, IM, under contract to carry NASA science instruments to the Moon on a robotic spacecraft,[21] said that its first lunar mission would target a deep, narrow valley named Vallis Schröteri.[citation needed] The mission objective was to place the Nova-C lander at crater Malapert A, near the south pole of the Moon.[22]\n\nAn Intuitive Machines contract with NASA[clarification needed] covered transportation to and operations on the Moon, for five NASA science instruments and several commercial payloads (including Columbia Sportswear[23]).[citation needed] The company launched its first mission based on the contract, with one of its Nova-C class landers spending seven days travelling to the Moon.[when?][citation needed] On February 22, 2024, Intuitive Machines landed Odysseus, its lander from the IM-1 spacecraft, on the Moon, the first U.S. landing in the more than 50 years since Apollo 17 touched down (in 1972).[citation needed]\n\nThe Odysseus lander fell on its side when landing, but its instruments remained partially functional (albeit with a reduced downlink capacity), so the mission was judged a success.[citation needed]\n\nIM-2 Athena was launched on February 27, 2025,[24] carrying Micro-Nova Gracie and other rovers and payloads.[citation needed] This mission is designed to validate water hunting infrastructure (e.g., via its drill), and essential mobility services like its Micro-Nova hopper; the hopper is designed to deploy off the lander and prospect by hopping[clarification needed] across the lunar surface.[citation needed] IM-2 Athena has completed its propulsion system's hot fire test, the most complex integrated test of the lander thus far.[citation needed]\n\nThe Athena lander achieved soft landing on March 6, 2025, but landed on its side, precluding recharging and deployment of payloads.[25] Operations concluded March 7, 2025.[26] On March 13, Intuitive Machines shared that, like on the IM-1 mission, the Athena's altimeter had failed during landing, leaving its onboard computer without an accurate altitude reading. As a result, the spacecraft struck a plateau, tipped over, and skidded across the lunar surface, rolling once or twice before settling inside a crater. The company's CEO compared it to a baseball player sliding into a base. The impact also kicked up regolith that coated the solar panels in dust, further degrading their performance.[27]\n\nThe third lunar delivery mission is undergoing integrated vibration testing with an anticipated mission window in early 2026.[28][29][independent source needed] This planned mission is designed to deploy the first of five data relay satellites under a Near Space Network Services contract.[29][independent source needed]\n\nThe fourth surface delivery mission intends to deliver the next two data relay satellites.[30][independent source needed] NASA awarded Intuitive Machines that $116.9 million mission contract in September.[when?][citation needed] Additional commercial payloads are anticipated to join that mission.[citation needed] This south pole mission includes six NASA payloads in addition to a European Space Agency led drill suite to search for water ice.[citation needed]\n\nIntuitive Machines became the sole awardee for the Near Space Network Services (NSNS) contract in September 2024, which is a step toward data transmission for in-space communications and navigation.[31][independent source needed] The company intends to leverage its contracted surface delivery missions to deploy a constellation of lunar data relay satellites around the Moon.[citation needed] This is central to their strategy of supporting commercial ventures and the Artemis campaign's goal of sustained human lunar presence, as a part of the broader aim of commercializing the Moon.[citation needed] The NSNS contract introduces a pay-by-the-minute service model, focused on scalable data transmission services through a SaaS-type revenue model.[citation needed]\n\nIn April 2023, Space Networks Solution,[32] a joint venture of Intuitive Machines and KBR, was awarded a five year contract worth up to $719 million to support NASA's Joint Polar Satellite System.[33][34]\n\nIn September 2022, Intuitive Machines announced that it would merge into special-purpose acquisition company (SPAC) Inflection Point Acquisition Corp. (IPAX) and incorporate as a publicly held company. The transaction was approved by IPAX's shareholders on February 8, 2023, and the business combination was completed six days later.[8][9]\n\nThe stock of the newly named Intuitive Machines, Inc., began trading on the Nasdaq exchange on February 14, 2023.[10][11]\n\nProject Morpheus was a NASA project that in 2010 began to develop a landing test vehicle similar to the IM Nova-C. Tim Crain had worked on the project and later became the CTO of Intuitive Machines. In an interview with NASA recorded in October 2023, Crain mentioned the possible development of a Nova-D lander.[35][36]\n",
  "concepts": [
    "Intuitive Machines",
    "needed",
    "machines",
    "intuitive machines",
    "intuitive",
    "lunar",
    "citation needed",
    "citation",
    "nasa",
    "mission",
    "moon"
  ],
  "findings": [
    "History",
    "Company overview",
    "Nova-C",
    "Missions",
    "Joint venture with KBR",
    "SPAC merger",
    "Project Morpheus heritage and evolution",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:13.925053"
}