{
  "title": "SingStar Take That",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/SingStar_Take_That",
  "content": "SingStar Take That is a 2009 music video game developed by London Studio and published by Sony Computer Entertainment for the PlayStation 2 and PlayStation 3. It is the third band-specific SingStar game released in the UK and Australia, following up on SingStar ABBA and SingStar Queen.[1]  It was released in 2009.[2]\n\nSingStar games require players to sing along with music in order to score points. Players interface with their console via SingStar USB microphones while a music video plays in the background. The pitch players are required to sing is displayed as horizontal grey bars, which function similar to a musical stave, with corresponding lyrics displayed at the bottom of the screen. The game analyses a player's pitch and compares it to the original track, with players scoring points based on how accurate their singing is. Different modes of SingStar may vary this basic pattern, but the principle is similar throughout.\n\nSingStar includes a variety of game modes. The standard singing mode allows one or two people to sing simultaneously, either competitively or in a duet.\n\nThe PlayStation 3 version of the game supports trophies.\n\nSingStar Take That was launched at the SingStar Take That Extravaganza charity party on Wednesday 25 November 2009 at The Tabernacle in Notting Hill, London. The event was hosted by comedian James Corden and featured a number of celebrity guests including Kate Moss, Kate Nash, Pixie Geldof, Rachel Stevens, Remi Nicole, Paloma Faith and the band Take That themselves.[3] The event came later than originally scheduled and after the game launched in the shops due to the unfortunate death of Gary Barlow's father.[4] The band entertained guests by performing their song \"Rule the World\", which is also in the game.\n\nThe PlayStation 3 version received \"favorable\" reviews, while the PlayStation 2 version received \"average\" reviews, according to the review aggregation website GameRankings.[10][11]\n",
  "concepts": [
    "SingStar Take That"
  ],
  "findings": [
    "Gameplay",
    "Launch",
    "Track list",
    "Reception",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:11:58.842038"
}