{
  "title": "Christian Dahm",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Christian_Dahm",
  "content": "Christian Dahm (born 2 September 1963) is a German politician (SPD). He has been a member of the State Parliament of North Rhine-Westphalia since 2010 and has been deputy chairman of the SPD parliamentary group since May 2017.\n\nDahm was born on 2 September 1963 in Herford.[1] In 1979, Dahm acquired his technical college entrance qualification at the Ernst Barlach secondary school in Herford. From 1979 to 1982 he completed training with the North Rhine-Westphalia Police. He then worked as a police officer at the police headquarters in Cologne until 1983. Between 1983 and 1993 he worked in the same position at the Herford district police authority. In 1990 he acquired his Fachhochschulreife [de] and then studied until 1993 at the Fachhochschule for Public Administration (NRW) [de] in Bielefeld, graduating with a Diplom-Verwaltungswirt (FH). From 1993 to 2006, Dahm was a police officer at the Detmold district government and since 2007 at the Police headquarters in Bielefeld. Dahm holds the rank of Police Chief Inspector [de].[2][1]\n\nDahm has been a member of the SPD since 1989 and a board member in many party branches. He has been a member of the municipal council of Vlotho since 1999 and a member of numerous committees. From 2006 to 2012 he was parliamentary group leader of the SPD in the municipal council of Vlotho.[1]\n\nIn the 2010 North Rhine-Westphalia state election, Dahm was able to win a direct mandate in the state constituency of Herford I with 45.5 percent of the first votes and thus move into the state parliament of North Rhine-Westphalia.[3] In the 2012 North Rhine-Westphalia state snap election, he defended the constituency mandate with 49 percent of the first votes.[4] Until November 2015, Dahm was chairman of the committee for local politics in the state parliament. With 39.4 percent of the first votes in the 2017 North Rhine-Westphalia state election, he entered the state parliament again.[5] In the 2022 North Rhine-Westphalia state election, he entered the state parliament with a constituency result of 36.3 percent of the first votes.[6]\n\nDahm is a member of the Police Union (GdP). He continues to be an active member of local and regional support associations and partnership associations. He is involved in several sports clubs, especially in the soccer club FC Exter.[7]\n\nDahm is married with two sons. He lives in Vlotho's suburb Exter.[1]\n",
  "concepts": [
    "Christian Dahm"
  ],
  "findings": [
    "Early life and career",
    "Politics",
    "Community engagement",
    "Private life",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:48:43.103229"
}