{
  "title": "Rugby union in Germany",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Rugby_union_in_Germany",
  "content": "Rugby union in Germany is a moderately popular and growing sport with 124 men's clubs and 5 women's clubs competing in 4 men's and 1 women's national leagues.[1]\n\nThe German Rugby Federation (German: Deutscher Rugby-Verband or DRV), founded in 1900, is the governing body for all formats of rugby union in Germany, overseeing 12 regional unions. The DRV is a founding member of Fédération Internationale de Rugby Amateur Association Européenne de Rugby (FIRA-AER) (1934), affiliated with the International Rugby Board since 1999, and a member of the German Olympic Sport Federation.\n\n While rugby union probably reached Germany through affluent British students who attended renowned private grammar schools in the German Confederation, studied in Heidelberg, or completed military service in Hannover, there is disagreement about when the game was first played.[3]\n\nHeidelberg's Neuenheim College (now Heidelberg College) lays claim to its students first playing rugby around 1850. By contrast, in Stuttgart William Cail is regarded as having first introduced rugby, in 1865 at Bad Cannstatt.[4] In Dresden rugby is seen as first emerging there in 1873, while Lüneburg and Hannover make similar claims with regards 1875 and 1876, respectively. Whatever the actual date and place that rugby first kicked off in Germany, the first German-language texts about rugby was published in 1875. Early printed efforts to explain \"The Laws of Football Played at Rugby School\" was followed by journals and textbooks mentioning the sport.[3]\n\nRugby enthusiasts worked from within existing clubs serving different sports to establish sections catering to their sport. One of the oldest examples was established on 14 September 1878 by 14-year old schoolboy Ferdinand-Wilhelm Fricke and 24 of his peers at the German Sports Association (Deutsche Sport-Verein von 1878, or DSV 78 Hannover) — the first club in Germany dedicated exclusively to sports played on grass. Fricke's name lives on in Hannover where the German Rugby Federation presently has its offices in a street named for him.[1][5] Similarly, Neuenheim students under guidance of teacher Edward Hill Ullrich founded a rugby department in 1891 within the Heidelberg Rowing Club (Heidelberger Ruderklub von 1872, or HRK 1872).[1][6]\n\nAs a result of such actions taken to establish rugby around them, Heidelberg and Hannover remain centres of the sport.[1]\n\nThe earliest attempt at constituting a national body by merging German clubs occurred when northern clubs initiated the German Rugby Football Federation (Deutschen Rugby-Fußball-Bundes) in 1886. But when that failed, DSV 78 Hannover joined the German Football and Cricket Federation (1891–1902), while clubs in Cannstatt, Frankfurt am Main, Heidelberg and Munich joined the Southern German Football Union (1893–95).[1]\n\nAt a rugby day in Heidelberg on 13 February 1898 for players from that city, Stuttgart, and Frankfurt am Main, Ullrich argued for closer ties with northern clubs and the ultimate establishment of a national body, but found little support. Between August 1898 and September 1899 the issue continued to be discussed. At a rugby day in Hannover on 11 March 1900, 19 clubs committed to joint future action, undertaking to translate English rules into German, to organize the first North-South match in November, and to join the German Football Federation.[1]\n\nAs no federation had been formed by October 1900 on the occasion of the second Olympic Games in Paris, SC 1880 Frankfurt club was assigned to participate in the rugby section on behalf of Germany, winning the silver medal behind France.[1]\n\nOn 4 November 1900 the German Rugby Football Association was established as a separate division within the German football (soccer) association, with Fricke of DSV 1878 Hannover as president. Exactly a year later the rugby association ended its connection with the soccer body and continued independently as the German Rugby Federation (Deutscher Rugby-Verband, or DRV).[1]\n\nThe first national competition was organised in 1900, when on 4 November a South versus North game was held, won 11–3 by northern Germany. This annual game became a fixture until 1967, when it was replaced by a state championship. In 1999 the German Rugby Federation returned to the old north-south game but its importance has not reached former levels.[7]\n\nIn 1909 a national club championship was first organised. The champions of the north, FV 1897 Hannover, met southern club FV 1893 Stuttgart and won 6–3 on 14 November 1909.[7][1]\n\nFive regional rugby associations were established in the 20th century's first three decades, including northern Germany in 1900 (Hannover); southern Germany in 1909 (Baden, Württemberg, Greater Frankfurt am Main); western Germany in 1922 (Düsseldorf, Cologne, Bonn); and Brandenburg Central in 1924 (Berlin, Leipzig), which in 1930 subdivided into the Brandenburg and Central associations.[1]\n\nIn 1927 the German national rugby union team was set up and played its first international on 17 April in Stade de Colombes in Paris. Germany lost 5–30 to France but on 15 May won the return match in Frankfurt 17–16.  In the third international between the two countries on 18 March 1928, a record 14,000 spectators attended the game, still the highest attendance number for an international rugby match in Germany.[8][1]\n\nGerman rugby peaked in the pre-World War II period, when in 1938, Germany beat France 3–0 for the second time.[6] Long the preserve of the German middle classes, the most prominent German rugby fan/player was the controversial Albert Speer.[6]\n\nLike all other German sport federations, the German Rugby Federation was absorbed in the all-powerful Nazi sports organisation, the Nationalsozialistischer Reichsbund für Leibesübungen, as part of \"Department 2\", which also served association football and cricket. Hermann Meister, chairman of the German Rugby Federation, a firm believer in a united Europe and a friend of France, tried to live up to his ideals but rugby by and large offered no more resistance to the Nazis than any other sport.[8]\n\nThe sport was decimated by World War II as most of its players were killed. Germany, at its height of performance in 1939 and second only to France in continental Europe, lost virtually its whole national team during the war, a predicament from which it has never recovered.[8]\n\nThe subsequent post-war social upheaval largely reversed the pre-war successes in German rugby. It came to be seen as a very English game and, as a result, rugby lost the financial support and much of the popularity it had gained in the western and northern cities of Heidelberg, Hanover and Frankfurt.[6]\n\nFollowing the War friendly matches were played against British military teams. \nOf the centres of German rugby, only Heidelberg, future headquarters of the US forces in West Germany, was spared by the bombing raids and the sport of rugby carried low priority in the first post war years. But by the early 1950s the German Rugby Federation (DRV) had re-established itself and the 6 regional associations that had existed before the war.[1]\n\nIn 1948 the German championship was restored and the golden area of the TSV Victoria Linden begun, the team winning the title six times in a row from 1951 to 1956, an achievement matched only recently by Heidelberger RK.[9] The first British team to tour Germany after the war was the Oxford Greyhounds in 1950. In the same year, the DRV was restored in West Germany. With the country now divided into East and West following the post-war occupation, East Germany became the first German team to resume playing international rugby when it toured Romania in 1951.  It was followed by the West German team a year later, which played its first international against Belgium in 1952.  However, neither side was able to achieve the same successes as the pre-war German team.[10]\n\nRugby showed that it was not immune to the Cold War split when Burt Weiss, an East German player, escaped to West Berlin using a snorkel.[11] The DRV continued to offer the East German DTSB to play a rugby friendly, but this was always declined by the East. After a combined team of Lok and Post Berlin happened to play West German side Berliner SC in a tournament in Olomouc in 1985, a ban on participation in international tournaments with West German clubs was issued by the DTSB.[12]\n\nA Rugby-Bundesliga was formed in 1971 to replace the previously existing regional championships. The hoped for increase in interest however did not materialise and rugby remains a minor sport in Germany, almost exclusively played by amateurs.[9]\n\nIn 1989 a German women's national 15s team was founded, initially resorting under Germany's youth rugby organization.\n\nWith German reunification in 1990 a number of clubs from former East Germany joined the German league system.\n\nThe German Rugby Sports Association of the GDR was dissolved in November 1990 and the state associations of Saxony and Brandenburg with their 17 clubs registered with the DRV. This brought about a restructuring of the Rugby-Bundesliga and the introduction of a second division, 2nd Rugby-Bundesliga.\n\nIn 2000 the German Rugby Federation celebrated its centenary. Centenary celebrations included a banquet in the Heidelberg Castle and the hosting of the European leg of the Rugby World Cup Sevens in Heidelberg, in which the German team came close to upsetting Ireland, who had Gordon D'Arcy in their line-up. The tournament was won by the Welsh team, which featured Andy Marinos and Arwel Thomas.\n\nThe highlight of the Centenary season was the Centenary Match against the famous Barbarians. The Barbarians included a host of Welsh, English, Scottish, Irish and Australian internationals including Scott Hastings, Peter Stringer, Shaun Longstaff, Jeff Probyn, Frankie Sheahan, Russell Earnshaw, Shaun Connor, John Langford and Derwyn Jones and won 47–19 against a determined German team.\n\nThe German federation tendered to host the 2010 Women's Rugby World Cup but the event was awarded to England instead.[13] It did however hold the 2008 Hannover Sevens, the European Sevens championship.\n\nAn important part of rugby union outside the structures of the German federation is the Army Rugby Union of the British Army in Germany which holds its own \"German\" championship. The winner of this competition advances to play the UK Army rugby union champion. The British Army also supported development of the sport in the region by a British Army Germany rugby union team playing the national teams of Germany and its neighbouring countries.[14]\n\nThe national German women's 15s team was officially disbanded by the DRV in 2005 for financial reasons. The DRV reversed its decision a year later, but in 2010 again suspended the women's 15s program in favour of concentrating all resources on the women's sevens national team. Unofficial women's sides played against Belgium in 2012 and 2013, and a privately funded women's national team, called G15, was established in 2015. Supported by clubs participating in the women's Rugby-Bundesliga, the initiative was partly to persuade the DRV to again set up a national women's program. The G15 defeated Switzerland 47–13 in their first match. On 16 April 2016 the DRV undertook to rebuild the women's 15s national team for a period of two years, after which its efficiency and affordability would be evaluated.\n\nThe German Rugby Federation (DRV) found itself close to insolvency in 2011 due to being €200,000 in debt. The situation was brought on in 2010 when the German federal ministry of the interior refused to pay out its annual grant to the DRV, due to ministry concerns that the DRV was not using the funds to support the sport. DRV chairman Claus-Peter Bach fought a legal battle with the ministry which worsened the situation. Bach consequently announced he would not stand for another term in July 2011 and was replaced by Ralph Götz. The DRV secured a private loan to survive and hoped to attract the sponsors that had withdrawn under Bach as well as to reach a settlement with the ministry.[15][16]\n\nIn mid-July 2012 at the Deutsche Rugby Tag (DRT), the DRV's annual general meeting approved a league reform proposed by German international Manuel Wilhelm. The number of clubs in the Rugby-Bundesliga was increased from ten to 24, the league was divided into four regional divisions of six clubs each, and play-off berths were expanded from four to eight teams. A major aim of the reform was to minimize the distances that individual teams had to travel and so to reduce travel costs. The DRV announced that it was able to avoid insolvency and regain its annual grants from the German government on condition that it stuck to a strict financial plan that would see the DRV debt free by 2018. Any violation of this plan would see funding withdrawn and the association confronted with insolvency again.[17][18]\n\nIn 2023 there were 20,072 players registered with the German Rugby Federation and 40,470  players in all, according to World Rugby.[19]\n\nRugby union has a large and dedicated following in several university cities such as heidelberg.\n\nGerman players occasionally break through into French or English clubs, such as Robert Mohr at La Rochelle or Sascha Fischer at Périgueux.\n\nThe German men's national 15s team played their first international match in 1927 against France, but have yet to qualify for the Rugby World Cup. With the partition of Germany following the Second World War, the East and West fielded separate teams until the reunification of Germany in 1990. In 2017–18 the men competed in the Championship Division, the top tier of Rugby Europe's International Championships, a European tournament below the Six Nations. As Germany placed last in the competition, they face a relegation match against Portugal in June 2018. The men's national team was ranked 28th out of 105 teams on World Rugby's May 2018 list.[20]\n\nThe German women's national 15s team was founded in 1989 and initially resorted under Germany's youth rugby organization. The team succeeded in qualifying for the 1998 Women's Rugby World Cup as well as the 2002 edition. In 2002 the women's side finished 2nd in the 2002 FIRA Women's European Nations Cup and 4th in 2005. The national women's side was ranked 19th out of 52 teams by World Rugby in March 2018.[21]\n\nBoth Germany's men's and women's national rugby sevens teams participate in the major European sevens competition, the Sevens Grand Prix Series.\n\nIn 2017 the German men finished 5th out of 12 teams. As the series also functioned as a 2018 Rugby World Cup Sevens qualifying tournament, they missed out on a place. Germany did not qualify for the debut of sevens rugby at the 2016 Summer Olympics. Germany reached the 2018 Rugby Europe Men's U18 Sevens Championship's quarter-final matches where they defeated Great Britain 21–10, before losing 21–0 to Ireland in the semi-finals.[22]\n\nThe German national women's side competed in the",
  "concepts": [
    "Rugby union in Germany"
  ],
  "findings": [
    "Governing body",
    "History",
    "From early clubs to a national union",
    "The first half of the 20th century",
    "The post-war period",
    "Financial crises and current situation",
    "Popularity",
    "National teams",
    "Fifteens",
    "Sevens",
    "Fifteens club competitions",
    "Men's leagues",
    "Women's leagues",
    "Rugby positions: German terms",
    "German rugby museum",
    "See also",
    "References",
    "Printed sources",
    "Footnotes",
    "External links"
  ],
  "timestamp": "2025-04-11T10:19:15.532786"
}