{
  "title": "Inge the Younger",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Inge_the_Younger",
  "content": "Inge the Younger was King of Sweden in c. 1110–c. 1125 and probably the youngest son of king Halsten.[1][2] According to unreliable traditions, Inge would have ruled together with his brother Philip Halstensson after the death of their uncle, Inge the Elder.[1][2] In English literature both have also been called Ingold.[3]\n\nHallstein's sons were Philip and Ingi, and they succeeded to the Kingdom of Sweden after King Ingi the elder. (The 13th century Hervarar saga)[4]\nOther sources say that after the death of Philip (1118), Inge the Younger was the sole king of Sweden,[1] but the year of his own death is unknown.[2] According to the regnal list in the Westrogothic law, Inge was poisoned with an evil drink in Östergötland:[2]\n\nNiunði war Ingi konongær, broðher Philipusær konongs, oc heter æptir Ingæ kononge, Halstens konongs brødhær. Hanum war firigiort mæð ondom dryk i Østrægøtlanði, oc fek aff þy banæ. Æn Sweriki for e wæl, mædhæn þer frænlingær rædhu.[5]\n\nThe tenth (Christian king) was king Inge, the brother of king Philip, and he was named after king Inge (the Elder). He was killed by evil drink in Östergötland and it was his bane. But Sweden fared forever well, while these kinsmen ruled.[6]\n\nIt is not known whether Inge was still alive when the Norwegian king Sigurd I of Norway invaded Småland in the Kalmar Crusade in 1123, but when Inge died, it was the end of the House of Stenkil.[1][2]\n\nInge is reported to have been married to Ulvhild Håkansdotter who was the daughter of the Norwegian Haakon Finnsson and who would later marry the Danish king Nils Svensson and even later the Swedish king Sverker the Elder.[2] A story that has her assassinating King Inge with a poisoned beverage[7] cannot be substantiated. According to another tradition, he was also the husband of Ragnhild of Tälje.\n",
  "concepts": [
    "Inge the Younger",
    "king",
    "inge",
    "sweden",
    "philip",
    "elder",
    "king inge",
    "ingi",
    "death",
    "according",
    "östergötland"
  ],
  "findings": [
    "Notes and references"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:34:52.818836"
}