{
  "title": "Republika Srpska–Serbia relations",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Republika_Srpska–Serbia_relations",
  "content": "Republika Srpska–Serbia relations are the foreign relations between Republika Srpska, one of the two entities in Bosnia and Herzegovina, and Serbia. Republika Srpska has an office of representation in Belgrade[1] and Serbia has a consulate-general in Banja Luka.[2] Serbia and Republika Srpska have signed an Agreement on Special Parallel Relations.\n\nThe beginnings of formal cooperation can be traced to the Bosnian War; Republika Srpska got support from Serbia.[3] At the Dayton Agreement, the President of the Republic of Serbia Slobodan Milošević represented the Bosnian Serb interests due to the absence of Radovan Karadžić. The Dayton Agreement ensures the right for entities in Bosnia and Herzegovina to establish special parallel relationships with neighboring countries consistent with the sovereignty and territorial integrity of Bosnia and Herzegovina. An agreement on Special Parallel Relations was signed on February 28, 1997. The Agreement was implemented on December 15, 2010.[4] Until now, a significant number of formal and informal meetings between representatives of both sides have been organized.\n\nOn July 26, 2010, the Serbian Minister of Finance, Diana Dragutinović and her Republika Srpska counterpart Aleksandar Džombić, both signed an Agreement on Cooperation in the Financial Sector, which will further develop mutual relations in the financial system. It will bolster the already good cooperation between both regions, helping to maintain special parallel relations and to enable the exchange of experience, and also to discuss other sections. The working groups will convene at least twice a year.[5]\n\nAll-Serb Assembly between Srpska and Serbia was held in June 2024 in Belgrade. The Declaration on Protection of National, Political Rights, Common Future of Serbian People was adopted.[6]\n\nRepublika Srpska supports the position of Serbia in the dispute over Kosovo. On 21 February 2008 Republika Srpska adopted a resolution through which it denounced and refused to recognise the declaration of independence of Kosovo from Serbia. In addition, the parliament adopted a resolution stating that in the event that a majority of EU and UN states recognise Kosovo's independence, Republika Srpska would cite the Kosovo secession as a precedent and move to hold a referendum on its own constitutional status within Bosnia and Herzegovina. Finally, the resolution called upon all Republika Srpska officials to do everything possible in order to prevent Bosnia and Herzegovina from recognising Kosovo's declaration of independence.[7] Regardless of the part of the Declaration that calls for a referendum in Republika Srpska, Serbia's official position remains unchanged and it continues to support the sovereignty and integrity of Bosnia and Herzegovina.[8][9][10]\n\nOn July 31, 2011, President Milorad Dodik said that the concept of a multi-ethnic state in Kosovo has failed, and that the solving of the Kosovo question has not been dealt with, stressing that Republika Srpska does not accept Kosovo as an independent country. Dodik said \"The peaceful solution is evidently not a possible solution [...] We support Belgrade.\" In relation to the Kosovo Police operation to try to take control of border crossings located in North Kosovo on July 25.[11]\n",
  "concepts": [
    "Republika Srpska–Serbia relations"
  ],
  "findings": [
    "Kosovo question",
    "See also",
    "References"
  ],
  "timestamp": "2025-04-11T10:19:03.636554"
}