{
  "title": "Théodore Grandperret",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Théodore_Grandperret",
  "content": "Michel Etienne Anthelme Théodore Grandperret (26 January 1818 – 6 January 1890) was a French lawyer and politician.  \nHe was a staunch Bonapartist.\nHe served briefly as Minister of Justice and Religious Affairs during the last weeks on the Second French Empire.\nLater he was a Life Senator from 1877 to his death. \n\nThéodore Grandperret was born in Caluire, Rhône, on 26 January 1818.[1]\nHis parents were Claude-Louis Grandperret (1791–1854), a teacher and school inspector, and Caroline Amélie Mollet (1793–1858).\nHe studied Law in Paris and in 1844 joined the bar in Lyon.\nHe became a laureate and then a member of the Académie de Lyon for his first essays on local history and literature.\nHe contributed theatre reviews to the Courrier de Lyon and wrote for the Journal du Rhône, directed by his father.[2]\nIn 1849 he became a magistrate as substitute for the Court of First Instance of Lyon.[2]\n\nOn 2 June 1851 Grandperret married Alexandrine Emanuelle Félicie Martin (1826–1872) at Saint-Jean-le-Vieux, Ain.\nTheir children were Louis Charles Emmanuel Grandperret (1852–1890) and Charles Antoine Grandperret (1856–1931).[3]\n\nIn 1852 Grandperret was attached to the Lyon public prosecutor's office.\nHe was general council at Bourges in 1855 and Toulouse in 1859.\nIn 1861 he was appointed Attorney General at Orléans, where he met Mgr. Félix Dupanloup.\nIn 1867 he was appointed Attorney General at Paris in place of Louis François Chabanacy de Marnas(fr).[2]\nSoon afterwards he was appointed to the Council of State.\nIn 1868 he was awarded the Cross of the Legion of Honour.\nHe was known for his indictment in the Troppmann affair in December 1869.[2]\n\nIn the trial of Prince Pierre Napoléon Bonaparte for homicide on 21 May 1871 Grandperret served as Attorney General at the High Court convened in Tours.\nHis evident bias towards the Bonaparte family caused the lawyers of the Noir family to be called the \"defense lawyers\". \nGrandperret was the author of a report sent to the Keeper of the Seals on 5 May 1870 on a \"conspiracy\" against the life of the emperor discovered shortly before the plebiscite.\nHe was reappointed Attorney General at the high court in Blois convened in July 1870 to investigate the conspiracy.\nThe case was abandoned after the defeat at Wissembourg during the Franco-Prussian War of 1870.\nIn the last weeks of the empire after the resignation of the cabinet of Émile Ollivier he accepted the portfolio of Minister of Justice in the cabinet of the Comte de Palikao, holding office from 10 August to 4 September 1870.[2]\nAs Minister he was Keeper of the Seals (Garde des sceaux).[1]\n\nAfter the fall of the empire Grandperret enrolled at the Paris bar and stayed out of politics for several years.\nAs a lawyer between 1870 and 1877 Grandperret defended Paul de Cassagnac in the defamation suit lodged against him by General de Wimpffen.[2]\nFor a period Louis Le Provost de Launay (1850–1912), future deputy and senator, was Grandperret's secretary.[4]\nGrandperret's first wife died on 26 January 1872 at the age of 45.\nOn 25 September 1872 he married  Claire Gabrielle Hectorine Blanhet (1822–1910).[3]\n\nOn 15 November 1877 Grandperret was elected by the coalition of the right as Life Senator in place of Alphonse Lepetit(fr), who had died.\nSince there was no clear majority the election was annulled, but in a fresh election on 24 November 1877 he was elected by a clear majority against the republican candidate Victor Lefranc.\nHe joined the Bonapartist Appel au peuple group and voted consistently with the right.\nHe voted against the Jules Ferry laws on education, against reestablishment of divorce, against the exile of the princes, against reinstatement of the district poll, against the draft Lisbonne law restricting the freedom of the press and against the prosecution of General Boulanger.[2]\nHe held office until his death.[5]\n\nThéodore Grandperret died in Paris on 6 January 1890.[1]\n\nPublications by Théodore Grandperret include:[1]\n",
  "concepts": [
    "Théodore Grandperret",
    "grandperret",
    "general",
    "lyon",
    "january",
    "1870",
    "théodore grandperret",
    "théodore",
    "paris",
    "louis",
    "attorney general"
  ],
  "findings": [
    "Early years (1818–1851)",
    "Second Empire (1852–1870)",
    "Third Republic (1870–1890)",
    "Publications",
    "Notes",
    "Sources"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T17:32:44.117442"
}