{
  "title": "Angus MacDonald (Liberal Democrat politician)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Angus_MacDonald_(Liberal_Democrat_politician)",
  "content": "Angus Francis MacDonald[1] (born 7 November 1962) is a British Liberal Democrat politician who has served as the Member of Parliament (MP) for Inverness, Skye and West Ross-shire since 2024.\n\nAngus Francis MacDonald was born in London. He is the son of Donald ‘Rory’ MacDonald, descendant of distiller 'Long John' MacDonald, and Nancy MacDonald (nee Hill, of Philadelphia). The second of five children, he was brought up in the Clachaig Inn, Glencoe. \n\nHe was privately educated at two schools; Ampleforth College and Edinburgh Academy.[2]\n\nAfter school, MacDonald attend RMA Sandhurst before joining the Queen's Own Highlanders as a Second Lieutenant. He served in Falklands immediately after the ceasefire, from July – December 1982, where the regiment led the operation to restore normality on the islands, and in Northern Ireland the following year.[3]\n\nMacDonald left the army in 1983 and after a few years at stockbrokers Laing & Cruickshank, ran a number of publishing businesses in the financial services sector, including Edinburgh Financial Publishing, Financial News and eFinancialCareers, the latter two of which he and his co-investors sold in 2007 to a consortium including Dow Jones for £79 million.[4] MacDonald later expanded his business interests to encompass renewable energy, online education and waste management.[5][6][7]\n\nMacDonald was elected as a councillor to Highland Council, representing Fort William and Ardnamurchan in the 2022 Highland Council election, with 37.5% of the vote.[8][9]\n\nHe had previously been a Conservative Party donor, giving £40,000 to the party when the Scottish Conservatives were under the leadership of Ruth Davidson but also previously gifted the Liberal Democrats £5,000 in 2015.[10][11][12]\n\nMacDonald's seat, Inverness, Skye and West Ross-shire, was the final constituency to declare its results in the 2024 general election due to a discrepancy. The result was declared on 6 July.[13][14][15][10][16][17]\n\nMacDonald describes himself as centre-left on social issues and centre-right on economic issues.[18]\n\nMacDonald has been a patron of the National Trust for Scotland since 2009, serving on the strategic review panel in 2010 under Lord George Reid, before serving as Vice-President for almost a decade. \n\nIt was while running Edinburgh Financial Publishing in Hong Kong in the early 1990s that MacDonald took part in a 100km race along the famous MacLehose Trail. Taking this idea he founded the Caledonian Challenge in 1997 with a friend, Alex Blyth, to raise money for Foundation Scotland. More than 17,000 people took part in the 52 mile race down the Scottish West Highland Way and together raised over £13 million for Scottish communities.[19] MacDonald competed in the event eight times himself, though never managed to beat the time of his wife, athlete Michie MacDonald. \n\nIn addition to his charitable and business pursuits, MacDonald been involved with various social enterprises and non-profit endeavours to foster Highland traditions, culture and entrepreneurialism in Lochaber, most notably the Highland Cinema, an independent cinema in Fort William which was voted \"Cinema of the year under 24 screens\" in 2023,[20][21] and Dragon's Glen, an annual competition inspired by the Dragons Den TV show that awarded £10,000 grants to aspiring local businesses.[22][23][24]\n\nIn 2014, MacDonald was awarded an OBE for services to the Highlands.[25]\n\nMacDonald is a practising Christian. He is married to his wife Michie MacDonald, from Ireland, and both live in Fort William which is within his constituency. Together they have four adult sons.[26]\n",
  "concepts": [
    "Angus MacDonald (Liberal Democrat politician)"
  ],
  "findings": [
    "Early life",
    "Career",
    "Business career",
    "Political career",
    "Political positions",
    "Other activities",
    "Personal life",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:12:04.197313"
}