{
  "title": "2023 KNVB Cup final",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/2023_KNVB_Cup_final",
  "content": "The 2023 KNVB Cup Final was a football match between Eredivisie clubs Ajax and PSV, which took place on 30 April 2023 at De Kuip, Rotterdam.[3] It is the final match of the 2022–23 KNVB Cup, the 105th season of the annual Dutch national football cup competition.\n\nPSV won the match 2–3 on penalties, after a 1–1 draw in regular time and extra time.[2] With PSV winning their eleventh title, they secured a place in the 2023–24 UEFA Europa League play-off round and the 2023 Johan Cruyff Shield.\n\nThe 2023 KNVB Cup Final was seen as important for both Ajax and PSV, as they were trailing by resepectively 8 points and 11 points in the Eredivisie to Feyenoord and were expected to miss out on the national championship.[4]\n\nPSV decided before the game to play Joël Drommel, the team's second goal keeper, a move by coach Ruud van Nistelrooy that was heavily criticised.[5] In a final that was described by Dutch media as \"low level\" and \"sloppy\".[6] The first half was characterised by many altercations between players and four yellow cards. In the 42nd minute of the first half, Ajax went ahead 1–0 after an own goal by Jarrad Branthwaite after he touched a shot by Steven Bergwijn. In the 67th minute, Hazard scored the tying goal after receiving the assist from Xavi Simons. There were eleven yellow cards handed out during the playing time, a record for most cards in a cup final.[7] In the following penalty series, Fabio Silva made the winning penalty.\n\nAs a result, PSV won its 11th Cup title, and the team was welcomed by thousands of supporters in the Philips Stadion the same night.[8] For Ajax, at the moment of the final third in the 2022–23 Eredivisie, the final loss meant another disappointing feat to their season, with manager John Heitinga reacting after the game: \"This hurts. We have to process this.\".[9]\n\nAssistant referees:[1]\nJoost van Zuilen\nMario Diks\nFourth official:[1]\nSander van der Eijk\nVideo assistant referee:[1]\nRob Dieperink\nAssistant video assistant referee:[1]\nFreek Vandeursen\n\nMatch rules[10]\n",
  "concepts": [
    "2023 KNVB Cup final",
    "final",
    "psv",
    "cup",
    "2023",
    "match",
    "assistant",
    "ajax",
    "van",
    "time",
    "knvb cup"
  ],
  "findings": [
    "Route to the final",
    "Match",
    "Notes",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:20.462325"
}