{
  "title": "Robert Barbers",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Robert_Barbers",
  "content": "Robert Zabala Barbers[a] (January 19, 1944 – December 25, 2005) was a Filipino police officer and politician. Barbers had served in the police force for almost three decades prior to becoming part of the government of the Philippines. He served in the legislature as the representative of the second district of Surigao del Norte (1992–1996), whose second term was ended by his appointment as secretary of the interior and local government, and as senator (1998–2004).[3]\n\nBarbers was born in the then-municipality of Surigao in the undivided Surigao province, on January 19, 1944,[3] to Felix Barbers of Ilocos, a judge, and Regina Zabala[a] of Surigao, who would serve as division superintendent of schools and vice governor of Surigao del Norte.[1][4]\n\nWhat was then-called the Barbieri clan originally came from Sicily, Italy, with his grandfather being an American soldier. Meanwhile, the family's original roots are in Cabugao, Ilocos Sur.[2] His uncle in the father's side, retired police general James Barbers, was a vice mayor of Manila and superintendent of the Western Police District.[4][5]\n\nBarbers finished elementary (1955) and secondary education (1959, as valedictorian) in his hometown.[3]\n\nWhile serving as a police officer, he studied AB Political Science at the University of the Philippines and Silliman University but completed his degree in 1981 at the Lyceum of the Philippines University, where he also earned his Bachelor of Laws in 1985.[6][7]\n\nHe later went on to earn Master of Science degrees in criminology (Metro Manila College) and in national security administration (National Defense College) in 1992 and 1994, respectively.[6][7]\n\nBarbers was enlisted by his uncle James, then chief of the Integrated National Police – Western Police District (INP–WPD), in the police force, and topped the examinations in the Manila Police Department (MPD).[2] He spent 27 years as a police officer in the city.[2][8][9] He started in 1960s as a patrolman,[1][9] and later rose through the ranks,[2][3] eventually becoming colonel[6] before quitting the police force in 1991 to run for Congress.[1]\n\nBarbers served as chief of the Ermita station[10] and, under the leadership of Alfredo Lim in the WPD,[11] of two WPD divisions handling high-profile crimes.[10] When Lim became the director of the National Bureau of Investigation in 1990,[10][11] he took Barbers and designated him as chief of the NBI Police Special Task Force.[6] He was also the inspector of the National Police Commission.[6]\n\nBarbers was noted for the solution of major crimes and the personal arrest of some of the known gang leaders, particularly when he was with the NBI[2] with his team being known with the arrest of several drug traffickers,[11][12] including Jose \"Don Pepe\" Oyson who was later killed by agents while being escorted to detention.[2][11] He was also credited with the arrest of then military rebel Billy Bibit and communist leader Ignacio Capegsan, for which he was promoted.[9]\n\nBarbers was a bemedaled officer,[3] receiving medals and citations from the United States, such as those from the State Department and the Golden Service Award for Outstanding Law Enforcer in Asia from New York City (the first Filipino to be given the award, in 1991).[8]\n\nBarbers entered politics in 1992 as representative of the second district of Surigao del Norte;[3][6][9] he was re-elected in 1995.[6][8]\n\nHe was the chairperson of the House committee on Effective Law Enforcement, as well as vice chairperson of the committee on Public Order and Security.[8]\n\nBarbers' second term in the 10th Congress was cut short when he became part of the cabinet of president Fidel Ramos, who appointed him as secretary of the interior and local government[3][6][9] which he assumed on April 16, 1996.[13]\n\nWhile focusing on campaign against illegal drugs, he launched programs in relation to fight against criminality,[8] as well as for the reformation and welfare of the Philippine National Police.[13]\n\nBarbers was noted being the supervisor of the PNP, which created the Public Assistance and Reaction Against Crime (PARAC), a 24-hour public assistance group. Among the notable accomplishments of PARAC within a year were the apprehension of drug traffickers and a gambling lord, neutralization of eight of the country's most wanted individuals including a Laguna politician involved in the murder of a human rights lawyer, as well as the eradication of marijuana plantations in northern Luzon.[13]\n\nAnother program, Barangay at Pulisya Laban sa Krimen, was implemented to strengthen community involvement in the peace and order campaign.[13]\n\nBarbers first ran for senator in 1998, where he placed fifth, becoming the first police officer to hold such electoral position.[9] He served a term, in the 11th and 12th Congresses.[14]\n\nIn 1999, Barbers pushed for the creation of the committee on public order and illegal drugs, which he eventually headed. He was also a chairperson of the Commission on Appointments subcommittee on local governments.[14]\n\nBarbers was noted still being active in law enforcement in his term;[6] he authored over a hundred bills mainly focusing on the fight against criminality.[2]\n\nBarbers was the first to file an anti-terrorism bill in the Senate,[6] in late 2001.[8]\n\nBarbers was the principal author of a bill that aimed to strengthen the campaign against drug trafficking, which later became Republic Act No. 9165 (Comprehensive Dangerous Drugs Act of 2002), the law repealing RA No. 6425 (Dangerous Drugs Act of 1972)[14] and creating the Philippine Drug Enforcement Agency to be a member of and the implementing arm of the Dangerous Drugs Board.[15]\n\nBarbers authored as well laws that giving more penalties against jueteng protectors and operators.[9]\n\nHe was an advocate of death penalty for heinous crimes.[9]\n\nFor his campaign against illegal drugs, Barbers was given an award from the International Narcotics Enforcement Officers Association in Orlando, Florida in 2002.[16]\n\nBarbers, a stalwart of the Lakas–CMD party, was twice considered as running mate to then presidential candidates, Jose de Venecia Jr. in 1998 and incumbent Gloria Macapagal–Arroyo in 2004. He was later convinced to give way to Arroyo and to then senator Noli de Castro, respectively.[6] (De Venecia was defeated by Joseph Estrada; Arroyo won and later ascended to the presidency, replacing Estrada who was then ousted.)\n\nIn 2004, Barbers ran for re-election under the ruling party, but lost in the twelfth spot to incumbent Rodolfo Biazon.[6][17][18] Both ran under the administration K-4 coalition.[6] He later filed an election protest against Biazon to contest the slot, accusing the Commission on Elections of hastily proclaiming the latter's victory and demanding the awaiting of the results in his strongholds in Mindanao. However, his petition was denied.[9]\n\nHis name was mentioned in the controversial \"Hello Garci\" tapes, whose transcripts showed him calling then election commissioner Virgilio Garcillano to ensure his victory.[9]\n\nBobby,[19] as Barbers was known to many, was married to Virginia Smith. They had four children—three sons, all also named Robert, and a daughter.[6][9]\n\nBarbers, a Roman Catholic, was a pious devotee of the Santo Niño of Prague.[2] He had a statue in his office, dressed as a policeman and being called \"Sto. Nino de Policia\", which was brought out in a procession every January.[10] In 1995, he formed a group of would-be devotees which composed of workers of a folk music bar in Malate, Manila, where he had used to frequent while being a policeman.[24]\n\nBarbers, who had suffered throat cancer,[6] flew to the United States and underwent surgery in November 2000,[3][9] missing the impeachment trial of then president Estrada in the Senate.[3]\n\nIn July 2005, Barbers left for the same country (for the last time) for a medical checkup. In early December, he was confined at The Medical City in Pasig for a week.[9] His condition later deteriorated[6] until Christmas Eve, when he was rushed to the same hospital due to difficulty on breathing.[3][9]\n\nBarbers died at 10:29 a.m.,[6][9] on Christmas Day, 2005, due to heart failure.[3][6] He was buried at the Manila Memorial Park – Sucat in Parañaque.[24]\n",
  "concepts": [
    "Robert Barbers"
  ],
  "findings": [
    "Early life and education",
    "Police career",
    "Political career",
    "As district representative",
    "As a cabinet chief",
    "As a senator",
    "Personal life",
    "Later life and death",
    "In popular culture",
    "Notes",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:20:31.706561"
}