{
  "title": "Jutok Kaneko",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jutok_Kaneko",
  "content": "Jutok Kaneko (金子寿徳) (1958 – 24 January 2007) was a Japanese guitarist and vocalist, and is best known for his work with Tokyo underground psychedelic rock group Kousokuya (光束夜), who specialised in rock-based soundscapes characterised by the feeling of infinite space, desolate emotion and imminent chaos.\n\nKaneko was born in the city of Maebashi in Gunma prefecture in 1958. He started studying guitar around 1972, and in 1975 he formed a group called Kokugaiso (黒涯槍) with Masayuki Noguchi (野口雅之). The group specialized in multi-media performance, blending poetry with music, art and dance. After moving to Tokyo, Kaneko continued to work perform using the Kokugaiso name. Concurrently, he formed a rock group called Kousokuya in 1978, with Mick (vocals), Hiroshi Yokoyama (synthesizer), and Toshiko Watanabe (drums). The group played their first gig at the Tokyo underground venue Minor in 1979, and became one of the central groups in the improv-noise-rock scene associated with that venue, alongside musicians like Keiji Haino and Tori Kudo (of Maher Shalal Hash Baz).\n\nKousokuya released their first, self-titled album in 1991. The group played their only overseas live date at the Le Weekend Festival in Stirling, Scotland in May 2005. \nIn addition to Kousokuya, in recent years Kaneko had also been involved in several collaborative ventures. Yume no Kage, a duo from 1983 with drummer Atsushi Ishiguro, was one of the earliest examples. In 1997 to 1998 he played in a trio known as Ikon no Kage with drummer Ikuro Takahashi and bassist Takuya Nishimura (from Che-SHIZU). From the late 90s, Kaneko played in a number of duo units with musicians like Masayoshi Urabe, Rinji Fukuoka, Takahisa Kikukawa, Fumio Kosakai (Incapacitants), Wataru Kawai, Koji Shimura, and dancers such as Abe \"M\" Aria. In August and September 2004 Kaneko toured the US with the group LSD March, playing several dates in a duo with Koji Shimura.\n\nKaneko died on January 24, 2007. A memorial concert featuring many musicians from the Tokyo underground was held at Shinjuku Jam on April 30, 2007.\n\nSolo & collaborative:\n\nRotting Telepathies, w/Michio Kadotani (PSF, 1991)\n\nSearchin' For My Layline LP, w/Rinji Fukuoka (Pataphysique, 1997)\n\nV.A., Land of the Rising Noise vol.3 CD (Charnel Music, 1999)\n\nThe Planet I, w/ Chie Mukai, Christophe Charles, Ikuro Takahashi, Yoko Muronoi DVD (There)\n\nEndless Ruins LP/CD (PSF, 2001)\n\nWedged Night, w/Takahisa Kikukawa LP (Siwa, 2004)\n\nV.A., Million Tongues Festival CD (Bastet, 2004)\n\nLive 05/28/04, w/Koji Shimura CDR (no label US tour cdr, 2004)\n\nLive at Jerry Jeff CDR (There, 2006)\n\nWith Kousokuya:\n\nV.A., Heaven Tapes cassette (Heaven, 1979)\n\nKousokuya LP (Ray Night Music, 1991; CD reissue, PSF, 2003)\n\nV.A., Tokyo Flashback (PSF, 1991)\n\nV.A., Tokyo Flashback 2 (PSF, 1992)\n\nRay Night 1991-1992 Live (Forced Exposure, 1995)\n\nThe Dark Spot, w/ Masayoshi Urabe (PSF, 1997)\n\nLive Gyakuryu Kokuu (PSF, 2004)\n\nFirst Live 1979 Kichijoji Minor (PSF, 2006)\n\nEchoes from the Deep Underground (Archive, 2007)\n\nInterview. G-Modern, issue 17, 97-98 Winter. pp. 10–25. (Japanese)\n\nInterview. Ongaku Otaku, issue 3, 1998. pp. 16–22. (English)\n\nStofer, F. (2000). Japanese Independent Music, France: Sonore. ISBN 2-9515644-0-6\n\nKosakai, F. \"金子寿徳：彼方の柱廊を逍遥する旅についての末完の調書\" (Jutok Kaneko: An Incomplete Record of an Ambulatory Journey Down a Distant Colonnade). Liner-notes for Jutok Kaneko, Endless Ruins CD (PSF, 2001) (Japanese, contains a valuable, detailed history of Kousokuya)\n\nKosakai, F. \"Kaneko Jutok - The Year Spent with Ray-Night\". G-Modern, issue 22, 2001. pp. 50–51. (Japanese)\n",
  "concepts": [
    "Jutok Kaneko"
  ],
  "findings": [
    "History",
    "Discography",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:23:51.459738"
}