{
  "title": "Copyright in Ukraine",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Copyright_in_Ukraine",
  "content": "Copyright in Ukraine is based on the Law on Copyright and Related Rights of December 23, 1993, the updated version of which came into force on July 11, 2001.\n\nAfter the establishment of Ukraine as an independent state in 1992, the State Agency for Copyright and Related Rights (GA UARP) under the Cabinet of Ministers of Ukraine was established, whose main task was to develop legislation in the field of copyright. Over the next few years, a number of legislative and regulatory acts regulating certain issues of copyright protection were adopted (such as the Law On Copyright and Related Rights, passed in December 1993 and entered into force in 1994; Decree No. 784 \"On the minimum rates of royalties for the use of works of literature and art\", 1994 and the Decree No. 532 \"On state registration of the author's rights to works of science, literature and art.\", 1995). In 1995, Ukraine acceded to the Berne Convention.[1] The basic principles of copyright were included in the Constitution of Ukraine of 1996. The copyright legislation was updated on July 11, 2001.[1][2]\n\nThe term of protection of personal non-property rights of the author is unlimited. Other rights (property) are subject to protection during the life of the author and 70 years after his death. If the work is co-authored, the term of protection of rights expires 70 years after the death of the last co-author of the work. For works published anonymously or under a pseudonym, the copyright expires 70 years after the work has been published.\n\nIf the work is first published within 30 years after the author's death, the copyright for it is valid for 70 years from the date of publication. Copyright for the works of posthumously rehabilitated authors is valid for 70 years after their rehabilitation.\n\nThe Law deals separately with the case of publication after the expiration of copyright protection of a work that has not been published before - the person who first published it enjoys protection equivalent to the protection of copyright. The term of protection of these rights is 25 years from the first publication.[3]\n\nIn some cases, the use of works is allowed without the permission of the copyright holder and without payment of remuneration (provided that the author's name is indicated and his other rights are respected). Such cases include, for example:\n\nThe law provides for the free reproduction of works in libraries and archives, as well as in the creation of textbooks. A separate article is devoted to the free copying of computer programs.[4]\n",
  "concepts": [
    "Copyright in Ukraine"
  ],
  "findings": [
    "History",
    "Duration",
    "Exceptions",
    "References"
  ],
  "timestamp": "2025-04-11T10:20:10.851855"
}