{
  "title": "Brús",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Brús",
  "content": "Brús is a traditional Icelandic card game for four-players using French-suited cards. It is descended via German Brusbart from Karnöffel, Europe's oldest known card game.\n\nBrús is described as an old Icelandic game, but its rules and terminology suggest that it is descended from the centuries-old German game of Brusbart, now known as Bruus, which was once the national game of Hamburg and which spread across most of northern Europe spawning a family of games such as Russian Bruzbart, Polish Drużbart, Swedish Bräus, Greenlandic Voormsi and others. Brusbart in turn is descended from Karnöffel, the oldest card game in Europe with a continuous tradition of play down to the present day, a fact testified to by \"the wildly disturbed ranking order in the chosen suit and particularly by the special role of the chosen Seven\".[1][2][a]\n\nThe folklore historian, Ólafur Davíðsson, wrote about Icelandic entertainment and published it in the years 1888–1892. There he mentions this game and it is described again in the writings of folklore historians, Ólafur and Jón Árnason, called Íslenzkar gátur, skemtanir, vikivakar og þulur ( \" Icelandic Puzzles, Games, Weekends and Rhymes.\")\n\nIn Iceland, the game has long been popular in Svarfaðardalur and its neighbouring villages, but is less well known elsewhere in the country.\n\nBrús is a four-hand game played as two teams of two with the partners sitting opposite each other.\nIts rules are in many ways peculiar and scoring is based on a so-called 'comb' - a figure that comprises a series of parallel lines divided at right angles down the middle by a longer line. The aim is to take as many tricks as possible.\n\nBrús is an unusual card game in that not all of the cards in the pack are used and the game values are different from normal. The Twists (Twos), Threes, Fours and Fives are removed from the pack, leaving 36 cards. There are three matadors which are the highest cards: the ♣J, ♥K and ♠8 (called Brúnka = the \"Brown One\"), followed by the other 'beaters', the Nines, Aces, Jacks and Sixes in suit order. The Sixes are known as postmen, but this is probably a corruption of \"pope\", since they were historically known in Brusbart as popes.[3]\n\nThe remaining cards - Kings, Queens, Tens, Eights and Sevens - are worthless cards or duds (with the exception of those that are matadors) and can only win a trick if led to a trick that contains four duds.[3]\n\nThe dealer shuffles and the player to his right cuts. If, in cutting, the ♣J or ♥K come up, the opponents score a point. Three cards are then dealt clockwise to each player and the rest of the pack placed face down on the table as the bunkan (\"stock\") [3]\n\nForehand leads to the first trick. The player with the highest card wins the trick, draws the top card from the bunkan and, once the others have done the same in turn, leads to the next trick.[3]\n\nDaring is one of the hallmarks of the game. A player with the ♥K may \"dare the round\" (voga rúntinn), i.e. lead it to a trick and win without it being taken by the ♣J held by an opponent. A player may only dare when not in possession of the ♣J and if the ♣J has not already been played. A player may not dare in the first trick of a deal or if his team is \"on the robber\" i.e. the last line of the scoring comb which means they only need one trick win the comb. If the dare is successful, the darer must show all hand cards to the player on the left to prove the highest card is not held. A dare is also possible when a player is not on lead and there is one opponent to follow. In this case, the player says \"under you\" and shows the opponent all hand cards if successful. Failing to show one's hand after a successful dare forfeits the point.[3]\n\nThe team that is first to take five tricks wins the deal and scores a point. Scoring is recorded by drawing a 'comb' i.e. five horizontal bars divided in the middle by a long vertical bar. Each team has one half of the resulting comb. Every time a point is scored, one bar is crossed on that team's side of the comb. If a team wins five tricks before their opponents have taken one, it is a jana and scores 2 points. A successful dare earns 1 point; a successful daring the round earns 2. If the simple dare is lost it scores 2 points for the opposing team; if daring the round is lost the opponents score 3 points.[3]\n\nThe second last bar on the comb is called the 'robber' and when a team that gets there by erasing it, it is called a 'robbery' (ránni) and they may not then dare.\n\nIf a team succeeds in erasing all the lines on their side of the comb before their opponents erase one, it gives the winners the right to 'scratch' their opponents' heads. This 'scratching' (klórning) apparently causes a lot of commotion and there are accounts of people running from village to village to escape this punishment.[3]\n\nThe Brús World Cup is held annually. The competition is part of the cultural festival, Svarfdælskar marsi, which is held in Dalvík and Svarfaðardalur annually on the last weekend in March. There is a competition for the so-called golden comb, which is the top prize. The world champions each year receive the golden comb for safekeeping until the next tournament. The golden comb was designed and made by Jóhannes Hafsteinsson and is based on the comb that is used for scoring in Brús.[3]\n",
  "concepts": [
    "Brús"
  ],
  "findings": [
    "History",
    "Rules",
    "Cards",
    "Dealing",
    "Play",
    "Scoring",
    "The Brús World Cup",
    "Footnotes",
    "References",
    "Literature",
    "External links"
  ],
  "timestamp": "2025-04-11T10:15:38.462540"
}