{
  "title": "Paul Field (Christian singer)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Paul_Field_(Christian_singer)",
  "content": "Paul Field is a British Christian musician and songwriter who has been active since the mid-1970s, first with Nutshell and later as a solo artist. He has continued to write music and his works have won several awards.\n\nHe began his career in the early 1970s with the folk trio called Jesus Revolution. The group, including Heather Bennett and Pam Thiele, renamed itself Nutshell and recorded two albums. The group was called an English version of 2nd Chapter of Acts.[1] Bennett and Thiele left and were replaced by Annie McCaig and Mo McCafferty and released two further albums. After the release of Believe it or Not in 1979, the band changed its name to Network 3 and released two singles, both produced by Cliff Richard. Between 1979 and 1981, the group toured as backing singers and support act with Cliff Richard.\n\nNetwork 3 disbanded and Field embarked on a solo career, releasing Restless Heart in 1982. He has written six musicals, Daybreak, Visions, Breaking Bread, Burning Questions, Hopes and Dreams and Here and Now. He continued to combine his solo career with production, songwriting and arranging. He has also written music for film, television and advertising,including British Rail, the Cabbage Patch Kids, Astro Farm, Guinness, Australian TV and the Tokyo Motor Show.\n\nField's song \"Testify to Love\", co-written with Ralph van Manen and Henk Pool, reached No. 1 on the Christian songs chart in the US for Avalon.[2] It was later recorded by Wynonna Judd for the double-platinum soundtrack album for the TV show, Touched by an Angel which reached No. 3 in the Billboard Chart. More recently, the song was re-released as the title track on Avalon's Greatest Hits album. Field's songs have been recorded by Cliff Richard. These include \"Thief in the Night\", \"This Love\", \"All That Matters\" and the controversial \"The Millennium Prayer\". In the US, Field's songs have been recorded by artists including Rebecca St James, Jaci Velasquez, Phil Keaggy, Point of Grace, Natalie Grant and Jennifer Knapp and he regularly works in Nashville on various projects.[3]\n\nIn 2001 and 2002, he travelled to India with Garth Hewitt. They co-wrote and produced an album for Christian Aid in support of the Dalit people. The Dalit Drum uses live recordings of Dalit drummers.[citation needed]\n\nIn 2004, one of Field's children's songs, \"Surrounded by His Love\", was used as part of the Queen Elizabeth's Christmas message, broadcast on Christmas Day.[citation needed]\n\nField has written and providing production for Jonathan Veira.[citation needed] He has written songs for a Dutch film and completed two albums of children's songs.[citation needed] He has also provided backing vocals for Brian Houston andwritten lyrics for a BBC project for school assemblies.[citation needed] He produced Beyond Belief with Martin John Nicholls, for Christian Aid.[citation needed] He also worked on Cargo, a project seeking the abolition of the slave trade. This has been developed with Anti-Slavery International, Compassion International, Stop the Traffik and the UK Human Trafficking centre. Throughout 2007, Cargo toured with Coco Mbassi, Mike Haughton, Sadie Chamberlain and Dan Wheeler.[citation needed]\n\nField has won an Ivor Novello Award from the British Academy of Songwriters, Composers and Authors and a Dove Award from the Gospel Music Association in Nashville. He has been nominated for Dove Awards on two other occasions.[citation needed] Many artists around the world have recorded his songs and his production and arrangement credits range from country to gospel to classical and back to rock and pop.[citation needed]\n\nNutshell\n\nNetwork 3\n\nSolo\n\nDesign with Paul Field\n\nGarth Hewitt and Paul Field\n",
  "concepts": [
    "Paul Field (Christian singer)"
  ],
  "findings": [
    "Background",
    "Discography",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:06:23.735546"
}