{
  "title": "Brian Volk-Weiss",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Brian_Volk-Weiss",
  "content": "Brian Volk-Weiss (born May 28, 1976) is an American film and television producer and director. He is the founder and current chief executive officer (CEO) of The Nacelle Company and its subsidiary company, Comedy Dynamics. \n\nVolk-Weiss is the creator, producer, and occasional director of the current Netflix series, The Toys That Made Us and The Movies That Made Us, along with the television specials, Kevin Hart's Guide to Black History and Discontinued (originally on The CW). Through Comedy Dynamics, he has produced and directed numerous stand-up specials and comedy albums for comedians like Kevin Hart, Jim Gaffigan, Ali Wong, Tiffany Haddish, Ilana Glazer, and many others. Volk-Weiss has also produced several television shows including Join or Die with Craig Ferguson, Behind the Attraction on Disney+, A Toy Store Near You, The Center Seat: 55 Years of Star Trek, and Down to Earth with Zac Efron. He also serves as executive producer on the revival of the 1992 TV series, Mad About You.\n\nVolk-Weiss was born and grew up in Queens, New York.[1][2] He has described himself as coming from \"a family of dentists and lawyers\".[3] He attended the University of Iowa and graduated in 1998. Soon after graduation, he moved to Los Angeles to pursue a career in film and television.[2][4]\n\nVolk-Weiss began his career as a production assistant and worked in the wardrobe department for the 2000 film, Cast Away.[5] He later took a job as an assistant at the Barry Katz Entertainment Group (BKEG), a talent management company. While at the company, he eventually began managing comedians, like Whitney Cummings, Jeff Ross, and Dane Cook. In 2003, he was promoted to senior vice president. In the position, he was responsible for producing film and television projects.[2][6][7] BKEG was acquired by New Wave Entertainment in October 2003[8] and it became the new company's talent management and production division.[2]\n\nVolk-Weiss continued to manage comedians and produce films and television shows with Barry Katz as part of New Wave. He was a producer on the Dane Cook films, Employee of the Month,[9] Good Luck Chuck,[10] and My Best Friend's Girl.[11] He also produced the Dane Cook-led HBO documentary series, Tourgasm.[5] During that time, he also began producing comedy specials. In 2007, he produced the first stand-up special for New Wave.[2] In 2008, he founded New Wave Dynamics (which would later become Comedy Dynamics) as a production and distribution company of New Wave Entertainment.[12][13] By 2009, he had become the head of production for New Wave Entertainment.[14]\n\nBy 2012, Volk-Weiss had produced HBO, Comedy Central, Showtime, and Netflix stand-up specials for numerous comedians, including Aziz Ansari, Whitney Cummings, D.L. Hughley, Jim Gaffigan, Tom Papa, Bill Burr, and others.[15][16][17][18] He had also served as a producer on shows like VH1's Stevie TV and Investigation Discovery's True Grime: Crime Scene Clean Up.[15][17] In July 2013, he was named president of production at New Wave.[17] At that time, New Wave Dynamics was renamed \"Comedy Dynamics\" and Volk-Weiss became a partner in the company. It was producing around 20 to 30 stand-up specials per year at that point.[2]\n\nIn 2014, two Volk-Weiss-produced comedy albums (That's What I'm Talkin' About by Bob Saget and I'm Here to Help by Craig Ferguson) were nominated for the Grammy Award for Best Comedy Album. He had also produced a range of other new stand-up specials that year for comedians like Kathleen Madigan, Marc Maron, Mike Birbiglia, Doug Stanhope, and Brian Posehn.[2][19] By July 2014, Comedy Dynamics had produced over 100 stand-up specials and 125 comedy albums. That month, the company also launched its own comedy channel on Hulu, Roku, and Amazon platforms.[2][20] In 2015, Volk-Weiss produced Louis C.K.'s album, Live at Madison Square Garden, which would go on to win the Grammy Award for Best Comedy Album.[21]\n\nIn 2016, he produced several television series through Comedy Dynamics, including History's Join Or Die with Craig Ferguson and Kevin Hart Presents: The Black Man's Guide to History, MTV's Spooning...With Zac Efron, Hulu's Coming to the Stage, and Animal Planet's Animal Nation with Anthony Anderson.[2][21][22] He also produced stand-up specials for Tom Segura and Ali Wong, among others.[2][3][23] In January 2017, Volk-Weiss spun Comedy Dynamics off into a stand-alone company owned by the newly created Nacelle Company (of which Volk-Weiss is also CEO).[24][25]\n\nIn December 2017, his Netflix series, The Toys That Made Us premiered. A second season of the show premiered in May 2018. Volk-Weiss has directed some of the episodes.[1][26] Also in 2018, Dave Chappelle's Volk-Weiss-produced  Netflix Records double album, The Age of Spin & Deep in the Heart of Texas, won the Grammy Award for Best Comedy Album.[27] Volk-Weiss also produced Chappelle's follow-up, Equanimity & The Bird Revelation, which again won the Grammy the following year.[28][29] In December 2018, Discontinued, a television special about discontinued products created by Volk-Weiss, premiered on The CW.[30] Volk-Weiss also created and produced[31] another Kevin Hart television special entitled Kevin Hart's Guide to Black History which began streaming on Netflix in February 2019.[32]\n\nIn March 2019, it was announced that Volk-Weiss would serve as an executive producer with Sony Pictures Television on the revival of Mad About You, the NBC series that aired from 1992 to 1999.[33] The revival began airing on Spectrum Originals in November 2019 with Paul Reiser and Helen Hunt reprising their roles from the original.[34][35] Also in November 2019, the third season of Volk-Weiss' The Toys That Made Us premiered on Netflix.[36] A spin-off series that Volk-Weiss also created, executive produced, and directed called The Movies That Made Us premiered on Netflix later in the month.[37] In May 2020, a new Volk-Weiss-created series entitled A Toy Store Near You debuted as a production of The Nacelle Company on various platforms.[38] Recently, Volk Weiss signed deals with Sony Pictures and MLGPC.[39][40] In January 2024, Volk-Weiss was announced to be co-writing the Marvel Comics series Aliens: What If...? with Adam F. Goldberg, Hans Rodionoff, and Leon and Paul Reiser, to be illustrated by Guiu Vilanova.[41]\n\nThe NacelleVerse is an ongoing American transmedia franchise and shared fictional universe created by Volk-Weiss and presented by The Nacelle Company. It features lines of comics, cartoons and toys based on several brands from the '60s-'90s that the company has acquired the rights to.[71]\n",
  "concepts": [
    "Brian Volk-Weiss",
    "weiss",
    "volk weiss",
    "volk",
    "comedy",
    "produced",
    "company",
    "new",
    "television",
    "series",
    "dynamics"
  ],
  "findings": [
    "Early life and education",
    "Career",
    "Nacelle Company productions",
    "Filmography and discography",
    "Nominations and awards",
    "NacelleVerse",
    "Featured franchises",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:25.470496"
}