{
  "title": "Chandril Bhattacharya",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Chandril_Bhattacharya",
  "content": "\nChandril Bhattacharya (Bengali: চন্দ্রিল ভট্টাচার্য) is a popular Bengali essayist, lyricist, poet, filmmaker and orator from Kolkata.\n\nBhattacharya is one of the main lyricists of the Bengali band Chandrabindoo and also occasionally sings for them. His idiomatic lyrics are laced with satire and critiques of modern society. Chandril, together with Anindya Chatterjee won the 2010 National Film Award for Best Lyrics for the song \"Pherari Mon\" in the film Antaheen (2009).[1]\n\nHe completed his schooling at Ramakrishna Mission Vidyalaya, Narendrapur. He credited his alma mater for the nourishment of his cultural side. \nHe earned an undergraduate degree in economics as a student at Bidhannagar College and subsequently pursued an MSc degree in economics from the University of Calcutta. \nHe studied at Satyajit Ray Film and Television Institute (1st Batch) (1996-2000) and earned a Diploma in Film Direction and Screenwriting.\nHe married Sanchari Mukherjee in 2006.[citation needed]\n\nChandril Bhattacharya formerly wrote the monthly column \"Uttam Madhyam\" for Anandabazar Patrika, contributing to occasional op-eds and Cover stories for Sunday Supplement in the same newspaper. His Uttam Madhyam pieces were collected as a book. Later, he began to air his views in the weekly Robbar Pratidin, in a column entitled \"Du Chhokka Pnaach\" (\"two sixes and a five\" – the highest score you can get in a single turn in the popular board game Ludo). In January 2011 his \"Du Chhokka Pnaach\" became bi-weekly. His satirical viewpoints addressed cultural phenomena, national and international current affairs, human psychology and social norms. He coins peculiar idioms, playful jargon, Spoonerisms and reconstructs colloquial Bengali phrases and expressions to formulate absurdist, humorous puns in most of his articles.\n\nChandril has written and directed these short films: \n\n1. Y2K (Athoba, 'Sex Krome Aasitechhe') (Y2K (অথবা 'সেক্স ক্রমে আসিতেছে')) (30 mins.) (2000) [Diploma Film, Satyajit Ray Film and Television Institute] (Youtube)\n\n2. Talent (ট্যালেন্ট) (19 mins.) (2017) [New Animal Films] (Youtube)\n\n3. Praay Kafka (প্রায় কাফকা) (30 mins.) (2020) (a part of anthology 'Paanch Phoron 2') [SVF] (Hoichoi)\n\n4. Aatpourey (আটপৌরে) (15 mins.) (2024) [Nandanik Studios] (Youtube)\n\n5. Brotokotha (ব্রতকথা) (14 mins.) (2025) [Nandanik Studios] (Youtube)\n",
  "concepts": [
    "Chandril Bhattacharya"
  ],
  "findings": [
    "Music",
    "Education",
    "Writing",
    "Published books",
    "Film",
    "References"
  ],
  "timestamp": "2025-04-11T10:13:05.488518"
}