{
  "title": "Trevor Jacob",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Trevor_Jacob",
  "content": "Trevor Daniel Jacob[1] (born August 6, 1993)[2] is an American Olympic athlete, snowboard cross competitor, extreme sports athlete, YouTuber, and light aircraft pilot. He represented the United States in snowboarding in the 2014 Winter Olympics.[5][6][7]\n\nJacob posted a YouTube video in December 2021 in which he parachuted out of a light aircraft claiming engine failure. The Federal Aviation Administration revoked his pilot certificate after determining that he had intentionally crashed the plane for the sole purpose of filming it.[8][9] In May 2023, Jacob pleaded guilty to a charge of obstruction of justice, having disposed of the aircraft wreckage without authorization or supervision while lying to federal investigators about its disposition.[1][10] He admitted that he intentionally crashed the plane for notoriety and profit.[11][12] He was sentenced to six months in prison.[3]\n\nA native of Mammoth Lakes, California,[13] Jacob competed at the 2014 Winter Olympics in Sochi, Russia.[2] He made it to the semifinal of the men's snowboard cross, where he failed to qualify for the final. He lost by inches to fellow American Alex Deibold, who went on to earn the bronze medal. Jacob ultimately finished ninth.[6][14]\n\nJacob competed in snowboard cross at the Winter X Games in 2014, 2015, and 2016 in Aspen, Colorado, with a best finish of fifth place in the 2016 competition.[7] He also competed in the 2013–14 FIS Snowboard World Cup, winning the Snowboard Cross event held on 11 January 2014.\n\nIn addition to snowboarding, Jacob has participated in skateboarding, surfing, BMX riding, motocross and mixed martial arts, and was part of Travis Pastrana's Nitro Circus collective.[6][7]\n\nJacob produced videos for YouTube and has become known for skydiving, aviation and snowboarding content. By January 2022, his YouTube channel had over 100,000 subscribers.[5]\n\nJacob owned a Taylorcraft BL-65, a 1940 vintage single-engine light aircraft registered as NC29508. On November 24, 2021, he took off from Lompoc Airport alone, claiming that he was flying to Mammoth Mountain to spread ashes of his friend Johnny Strange.[15][16][17] The aircraft was described by sources at Lompoc Airport as \"in need of major maintenance.\"[15] Unusually for Jacob when piloting, indeed for pilots of most civil aircraft, he wore a bulky skydiving parachute, a style that is awkward to wear in a small Taylorcraft with standard seats. The aircraft was outfitted with several digital cameras to film the flight, and Jacob carried a selfie stick.[5][15]\n\nDuring the flight, the engine stopped running and Jacob parachuted to the ground, suffering minor injuries on landing. The unoccupied aircraft crashed into unpopulated scrubland in Los Padres National Forest near New Cuyama, and was substantially damaged.[15][16][17] Jacob walked to the crash site before hiking out and saying that the engine had failed.[15]\n\nA month later, Jacob released an edited, 13-minute video (under the title \"I Crashed My Plane\") depicting many of these events on his YouTube channel.[12][5][18] It does not show the aircraft controls nor engine instruments when the engine stops running.[5][18] Jacob is also not seen carrying out basic aviation emergency procedures such as trying to restart the engine, contacting air traffic control, or initiating a forced landing despite potential landing sites being visible. These and other unusual behaviors led to skepticism from the aviation community, who suspected that the crash was a deliberate publicity stunt.[5][15][18] The video was viewed 1.7 million times before it was removed from YouTube.[12]\n\nJacob denied having purposefully left the aircraft to crash, saying that \"People can believe whatever they choose.\"[5]\n\nTwo days after the crash, Jacob reported the crash to the National Transportation Safety Board (NTSB), which immediately opened an investigation and ordered Jacob to preserve the wreckage for examination and share all of his video footage of the incident; he agreed to do so,[11] but claimed he did not know the location of the wreckage.[12] The NTSB does not normally investigate off-airport general aviation crashes that do not involve serious injuries to persons, flight control problems, or substantial damage to property other than the aircraft itself.[17][18] Three days later, the Federal Aviation Administration (FAA) also opened an investigation. Jacob told the NTSB and FAA that he could not remember exactly where the crash took place despite having hiked to and from the site to recover his cameras.[11] The U.S. Forest Service said that the aircraft wreckage was removed from Los Padres under mysterious circumstances before the YouTube video was posted.[19] Jacob told FAA and NTSB investigators that he could not explain why the wreck seemingly vanished.[11]\n\nIn April 2022, the FAA determined that Jacob had abandoned the aircraft solely to film the crash. The FAA cited his opening of the cabin door prior to the purported engine failure; the lack of any attempt to execute an emergency landing, contact air traffic control, or restart the engine; and his personal unsupervised recovery of the onboard cameras and the aircraft wreckage, which he disposed of, the agency said. The FAA revoked Jacob's private pilot certificate and ruled that he would not be permitted to apply for a new certificate for one year, stating that \"your flight ... [was] careless or reckless so as to endanger life or property of another.\"[8][20]\n\nOn May 11, 2023, the U.S. Attorney's Office for the Central District of California announced that Jacob pleaded guilty to a felony charge of \"destruction and concealment with the intent to obstruct a federal investigation\", a violation of section 1519 of Title 18 of the United States Code.[11] According to prosecutors, Jacob admitted he lied to federal investigators by submitting a false aircraft accident report and by falsely stating to an FAA investigator that he parachuted from his plane because the engine had failed and he could not find a safe place to land.[1][10]\n\nJacob also admitted that he and an unnamed friend used a helicopter to airlift the wreck to the Rancho Sisquoc area on December 10, 2021, where Jacob later loaded it onto a truck trailer, moved it to a hangar at Lompoc Airport, cut it up, and disposed of the pieces in various locations over several days, all without authorization and while telling investigators he did not know the whereabouts of the wreckage.[1][12][10] Jacob admitted that he intentionally crashed the plane \"to gain notoriety and to make money\"[11][12] and said the motive for his scheme was to earn commissions from wallet manufacturer The Ridge, which sponsored his video.[21][22]\n\nJacob entered a plea agreement with federal prosecutors, announced in May 2023.[11] On December 4, 2023, U.S. District Judge John F. Walter sentenced him to six months in prison,[12][23] with a scheduled start date of January 29, 2024.[12] Jacob was incarcerated at USP Lompoc and was released on June 12, 2024.[24]\n\nLess than a week after his December 2023 sentencing, an FAA spokesperson confirmed in a statement to Los Angeles that the agency had granted Jacob a new pilot certificate.[25] FAA regulations allow a pilot whose certificate is revoked to be granted a new certificate, provided that a year has elapsed since the revocation, the applicant had not committed a drug or alcohol offense, and the applicant undergoes the same training and testing regimen as a new applicant; these conditions had been satisfied, the FAA said.[26]\n",
  "concepts": [
    "Trevor Jacob",
    "jacob",
    "aircraft",
    "faa",
    "engine",
    "12",
    "11",
    "crash",
    "youtube",
    "wreckage",
    "video"
  ],
  "findings": [
    "Athletic career",
    "YouTube",
    "Airplane crash",
    "Guilty plea and sentence",
    "New pilot certificate",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:53:24.270215"
}