{
  "title": "Avro 720",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Avro_720",
  "content": "The Avro 720 was an in-development British single-seat interceptor of the 1950s. It was designed and being developed by Avro in competition with the Saunders-Roe-built SR.53. While at least one prototype was partially-constructed, the order for the Avro 720, and quickly thereafter the project entirely, was terminated prior to any aircraft having been completed.\n\nThe Avro 720 was intended to have been a high-performance aircraft that would have utilised mixed propulsion to accomplish this, using a rocket engine to achieve quick acceleration and a high top speed while a more compact jet engine would have been used during more mundane cruising flight. The termination of the aircraft had been partially due to its choice in powerplant, Avro having opted to utilise the in-development Armstrong Siddeley Screamer rocket engine, which used liquid oxygen as oxidant and kerosene fuel; major questions were posed over the oxidant's practicality under operational situations.\n\nThe Second World War had demonstrated the importance of strategic bombing to modern warfare, and as the emerging Cold War developed, the development of new and more effective air defences against large waves of hostile bomber aircraft armed with nuclear weapons became a priority for many nations. During the war, Nazi Germany had extensively developed its own rocket-powered aircraft to augment its interception capabilities, in the final two years of the war, it had been able to deploy aircraft such as the Messerschmitt Me 163 (and design Bachem Ba 349) which, by using rocket propulsion, had been capable of unparalleled rates-of-climb, enabling them to (at least in theory) rapidly sortie to intercept enemy bombers before they reached their targets. As the performance of these aircraft had become increasingly well known to the Allies, RAF experts were eager to explore and understand the underlying technology.[1]\n\nIn the aftermath of the war, German rocket technology was studied extensively by various members of the former Allied nations. Britain had quickly opted to commence a programme to develop liquid-propellant rockets with the aim of boosting aircraft during the take-off phase, known within the RAF as rocket-assisted take-off gear (RATOG), and during the climb-to-altitude phase of flight.[1] In 1946, work began on a pair of new British-built rocket motors, the de Havilland Sprite (5,000 lb thrust) and the Armstrong Siddeley Snarler (2,000 lb thrust); these rocket motors made use of different propellants, the Sprite used a high-test peroxide (HTP) monopropellant while the Snarler harnessed a methanol/water/liquid oxygen mix. During the early 1950s, both engines proceeded to the flight testing phase; however, some of the demand for their role to provide fighters with increased performance was soon being met by the increasing prevalence of  conventional jet engines being equipped with reheat instead.[1]\n\nIn May 1951, faced with reports on the increasingly potential capability of, and thus the threat posed by, the growing Soviet strategic bomber fleet and that nation's newly developed atomic weapons, the British Air Ministry proceeded to draft an Operational Requirement, OR 301, which sought a rocket-powered interceptor that could attain an altitude of 60,000 ft (18,300 m) in just 2 minutes 30 seconds. Many of the performance requirement laid out by OR 301 was due to the anticipation of rapid increases in performance by the opposing Soviet aircraft; by the early 1960s, it was suspected that these bombers might well be capable of supersonic speeds of up to Mach 2 with a potential operational altitude as high as 80,000 ft.[2] Avro's design team promptly set about designing an suitable interceptor that conformed with the specification's requirements, which would result in the Avro 720 proposal. In addition, various other proposals from a number of companies were received, including Bristol, Blackburn, Shorts and Saunders-Roe.\n\nAccordingly, the specification was aimed at providing a capable defence interceptor that could form part of the nation's measures to counter this threat would need to be capable of similar speeds and an exceptionally high rate of climb in order to reach high altitude bombers in time.[3] Conceptually, the envisioned aircraft was to be operated in a similar fashion to that of the German Me 163, it would use its rocket engine to climb rapidly to meet and engage its target prior to gliding back to earth in a fuel-exhausted state before landing upon a retractable skid arrangement. According to aviation author Derek Wood, Saunders-Roe had quickly identified that the unpowered 'glide home' return flight could be a source of danger and expense, and thus approached the Air Ministry to discuss their concept for the adoption of a secondary jet engine, which would be used for the purposes of powering the interceptor's journey home. The Ministry was enthusiastic on this concept; in May 1951, all interested companies were asked to examine this arrangement.[4]\n\nIf designed strictly to deliver the performance required by the original specification, the interceptor would have been forced to glide back to ground from heights of up to 100,000 ft (30,500 m), perform an unpowered landing many miles away, after which it would then have to be recovered and taken back to the airfield by ground vehicle. Revised specifications from the Ministry were issued to Avro and Saunders-Roe, under which the auxiliary turbojet engine had become an official and explicitly-stated requirement. The auxiliary engine was required to provide sufficient power to allow the interceptor to fly back to its base in the aftermath of a combat mission.[5][6] On 12 December 1952, further refinement of the rocket interceptor concept had led to the release of the defined Specification OR 337.[7] The changes contained within the defined specification mainly revolved around armament changes, such as the adoption of the Blue Jay (as it was codenamed at the time) infrared-guided air-to-air missile under development, which replaced the originally-envisaged retractable battery of 2-inch rockets.[8][9]\n\nOn 5 May 1953, an advisory design conference was hosted at the Ministry of Supply, which focused on the Saunders-Roe submission; three days later, a formal contract for the production of three prototypes was received by Saunders-Roe.[10] However, due to doubts within the RAF and the Ministry over the correct fuel/motor combination to select for the interceptor intended to meet the Specification, it was decided to issue a modified specification, which was later led to a development contract, for the competing Avro 720 aircraft as well. Of the six companies that decided to tender proposals, two were selected for development contracts: Avro with their Avro 720 and Saunders-Roe with the SR.53.[7][10]\n\nIn response, a pair of prototypes were ordered by the Ministry.[5] In December 1956, it was reported that the Screamer engine, what had been intended to power the Avro 720, successfully completed flight clearance tests.[11] Early development work on the Avro 720 was also proceeding smoothly; by 1956, the first prototype was claimed to have been virtually completed and that Avro viewed it as being capable of flying up to a year ahead of the rival SR.53.[12] However, neither development programmes had managed to secure the backing of the Royal Air Force (RAF), which had been showing signs of hesitancy and had apparent intentions to wait until after both aircraft flight evaluations had been conducted before the service would expressly make any determination on its preference.[13]\n\nFrom September 1953 onwards, both the Avro 720 and the SR.53 projects were subject to increasing levels of scrutiny amid an overall requirement within the Ministry to implement cuts in order to reduce costs.[14] However, the Avro 720 was dealt an effective death blow when the Screamer rocket engine which was to power the interceptor was cancelled during late 1956. Reportedly, official concerns regarding the practicality of using liquid oxygen, which boils at -183 °C (90 K) and is a fire hazard, within an operational environment had heavily contributed to the Screamer's cancellation. The loss of the main engine in turn ultimately led to the termination of the Avro 720.[14][6][15] One of the reasons for the Ministry's preferment of the SR.53, despite its development programme being comparatively behind and having suffered greater delays, was its rocket engine's use of hydrogen peroxide as an oxidiser had been viewed as less problematic than the Screamer's liquid oxygen oxidiser, and the Ministry did not want to support two separate rocket fuel programmes.[14][16]\n\nAt the time of cancellation, a single structural test airframe was partially complete. According to aviation author Barry Jones, photographs of the structural airframe, with the port wing fitted and the serial number XD696 painted on, have sometimes been mistakenly claimed to have been of the first prototype.[5] The Avro 720 had reportedly cost £1 million by the time of cancellation, while its Screamer powerplant cost a further £0.65 million.[17]\n\nThe Avro Type 720 was a small tailless delta-winged aircraft. It was constructed of metal honeycomb sandwich. The Avro 720's main power-plant was an 8,000 lbf (36 kN) Armstrong Siddeley Screamer rocket engine, using liquid oxygen as oxidant and kerosene fuel. This differed from the competing Saunders-Roe SR.53, which used a de Havilland Spectre rocket engine which was fuelled by kerosene with Hydrogen Peroxide oxidiser. Both types were equipped with a single 1,750 lbf (7.78 kN) Armstrong-Siddeley Viper as the auxiliary turbojet engine; on the Avro design, airflow for the Viper engine was provided via a small chin inlet installed under the aircraft's nose. Operationally, the Avro 720 was to have been armed with a pair of de Havilland Firestreak Infrared homing air-to-air missiles, which could be carried upon under-wing pylons.[6]\n\nData from The British Fighter since 1912[6]\nGeneral characteristics\n\nPerformance\n\nArmament\n\n\nAircraft of comparable role, configuration, and era\n\n\nRelated lists\n",
  "concepts": [
    "Avro 720"
  ],
  "findings": [
    "Development",
    "Origins",
    "Revised specification and selection",
    "Design",
    "Specifications (Performance estimated)",
    "See also",
    "References"
  ],
  "timestamp": "2025-04-11T10:13:53.318716"
}