{
  "title": "Stefan Lysenko",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Stefan_Lysenko",
  "content": "Stefan Lysenko is a Ukrainian American film maker.\n\nLysenko was brought up in California. During the 20 years after traveling the world in 1988/89, he became an actor, writer, editor, director and independent filmmaker.\n\nIn the early 1990s he studied acting at the Playhouse West School and Repertory Theatre. After appearing in a number of New York productions,[which?][when?] \"Twilight Cafe\" EST Theatre New York 1993\n[1] and \"The Seagull\" Actors Theatre, New York 1993.\n\nHe studied at the Actors Studio under the tutelage of Shelley Winters.[citation needed]\n\nIn 1995, he played in Broadway Bound at Lonny Chapman's Lonny Chapman Group Repertory Theatre in Los Angeles.[2]\n\nLysenko acted in the films Mafia!, The Last Will, Interceptors, and The Stray.  In 2000, under his own Bliss Productions, he wrote, produced and directed a feature-length film, Between Christmas & New Year's; the script improvised, and the film shot on 16mm film over 7 days for less than $5,000.[3][4][5]\n\nLysenko is currently[when?] in pre-production on his fourth independent feature film.[6]\n\nLysenko is the only son of Leonid Lysenko, an American Korean War veteran, and E. Contreras Lysenko of New Mexico, and is married to Sophie Moine Lysenko, a graduate of UCLA.\n\nIn 1999, he opened his own Bliss Art House Café at N. Vine Street, Hollywood, which attracted writers, artists, singers, poets, and comedians, and was used for daily Alcoholics Anonymous meetings.[7]\n\nIn 2009, he ran for the U.S. House of Representatives in California's 32nd district.[8] He came 10th out of 12 candidates with 247 votes (0.5% share).[9]\n\nLysenko graduated in Business Management from San Jose State University, and studied on a 1-year master's degree in Conflict Resolution at Antioch University College.[citation needed]\n",
  "concepts": [
    "Stefan Lysenko"
  ],
  "findings": [
    "Career",
    "Personal life",
    "Film credits",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:14:02.582778"
}