{
  "title": "Kazaginac",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Kazaginac",
  "content": "Kazaginac is a village in the Municipality of Tomislavgrad in Canton 10 of the Federation of Bosnia and Herzegovina, an entity of Bosnia and Herzegovina. The village is also part of the smaller Buško Blato micro-region, consisting of those villages and settlements surrounding the lake known as Buško Lake. According to the 2013 census, there were 277 inhabitants.[1]\n\nThe roots of the name Kazaginac are thought to be Turkish in origin. The Turkish word kaza means \"district\" while the Turkish agha refers to \"master\".[2] Kazaginac thus refers to the property owned by the kazaga, a reference to Ottoman times where the landholding class was usually members of the ruling Muslim population.\n\nThe road passing through Kazaginac is an ancient route dating back to Roman times. It was part of a major road system connected to the magistral road between Salona and Hedum castellum - Argentaria, built by the governor of Dalmatia Publius Cornelius Dolabella in 18/19 AD.[3] At the Glavina locality, there are remnants of an unknown building. At the same locality, five milestones from the 3rd century were found as well as Roman coins. Above the Šarića Kuće locality, there are also stone remnants. Near the Catholic cemetery, there's an archaeological locality called Crkvine.[4]\n\nIn literature, Kazaginac is mentioned very late in history.  The name was first mentioned in 1844 when 83 people were living in 7 houses. By 1867, the population rose to 129 people.[2]\n\nDuring the socialist Yugoslavia, until 1953, the administrative territory of Kazaginac encompassed a much wider area of surrounding settlements, not only Kazaginac, and numbered 5,020 people. Of those, 5,308 were Croats, 11 Serbs and 4 others or unidentified.[clarification needed][citation needed]\n\nAccording to the 2013 census, there were 73 households and 319 people registered living in 72 dwellings.[5]\n\nHistorically, this village has traditionally been populated by ethnic Croats of the Catholic faith.[citation needed]\n\nThe village is located in the south band of Buško Lake, an artificial lake created after the construction of the dam in Kazaginac. The village is located at 716 meters above sea level.[6] It is known for the Marinovac beach, located at the Buško Blato lake.[7]\n\nAccording to the 2013 census, its population was 277.[8]\n\n43°36′56″N 17°01′07″E﻿ / ﻿43.61556°N 17.01861°E﻿ / 43.61556; 17.01861\n",
  "concepts": [
    "Kazaginac"
  ],
  "findings": [
    "Etymology",
    "History",
    "Geography",
    "Demographics",
    "Footnotes",
    "References",
    "Books",
    "Journals",
    "News articles"
  ],
  "timestamp": "2025-04-11T10:24:33.071274"
}