{
  "title": "Sweet Dream (Universe Cowards song)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Sweet_Dream_(Universe_Cowards_song)",
  "content": "\"Sweet Dream\" (Korean: 나비잠; RR: Nabijam) is a song by South Korean artists Kim Hee-chul and Min Kyung-hoon, the two stars who are known as Universe Cowards (우주겁쟁이).[1] Their stage name is a mix of Heechul's nickname \"Universe Star\" and Buzz's song \"Coward\".\n\n\"Sweet Dream\" was released digitally by SM Entertainment on November 20, 2016.[2] The song is a part of SM Station and is a collaboration single for the variety show Knowing Bros.[3]\n\nThe song proved successful, topping the South Korean Gaon Digital Chart, an achievement known as \"all-kill\".[4]\n\nThe music video portrays Kim as a high school student who has a crush on Momo Hirai but she only has eyes for his best friend, who is played by Min. The cast of Knowing Bros then come in and kidnap Momo, forcing Heechul and Kyung-hoon to learn martial arts from a master, who is played by Lee Soo-geun. They successfully defeat the gang members, with the help of Momo, who bashes the gang leader's head with a pot. When Kim rushes and hugs Momo, Momo hugs a puzzled Min instead, leaving Kim in distraught.  It is revealed that all the events are Kim's own dream, as Momo appeared in Kim and Min's classroom and introduces herself. At the end of the video, it is shown that Min had been harboring feelings for Kim instead, evidenced by Min's writing on his table. The music video presents LGBT issues to viewers in a lighthearted manner.[5][6]\n",
  "concepts": [
    "Sweet Dream (Universe Cowards song)",
    "kim",
    "momo",
    "min",
    "song",
    "video",
    "korean",
    "dream",
    "universe",
    "sweet dream",
    "sweet"
  ],
  "findings": [
    "Background and release",
    "Reception",
    "Music video",
    "Track listing",
    "Charts and sales",
    "Accolades",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T14:34:25.229829"
}