{
  "title": "Arma, Kansas",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Arma,_Kansas",
  "content": "Arma is a city in Crawford County, Kansas, United States.[1]  As of the 2020 census, the population of the city was 1,407.[3]\n\nArma was founded in 1894.[4] It was named for W.F. Armacost, an original landowner.[5]\n\nA post office was opened at Arma in 1891, and remained in operation until it was discontinued in 1906.[6]\n\nArma was a station on the Missouri Pacific Railroad.[7]\n\nAccording to the United States Census Bureau, the city has a total area of 1.14 square miles (2.95 km2), of which 1.12 square miles (2.90 km2) is land and 0.02 square miles (0.05 km2) is water.[8]  It is located about 6 minutes' drive north of Frontenac, and approximately eight minutes' drive east of Girard.\n\nThe 2020 United States census counted 1,407 people, 632 households, and 357 families in Arma.[9][10] The population density was 1,240.7 per square mile (479.1/km2). There were 708 housing units at an average density of 624.3 per square mile (241.1/km2).[10][11] The racial makeup was 90.19% (1,269) white or European American (89.48% non-Hispanic white), 0.78% (11) black or African-American, 0.71% (10) Native American or Alaska Native, 0.21% (3) Asian, 0.07% (1) Pacific Islander or Native Hawaiian, 1.14% (16) from other races, and 6.89% (97) from two or more races.[12] Hispanic or Latino of any race was 2.7% (38) of the population.[13]\n\nOf the 632 households, 25.6% had children under the age of 18; 37.5% were married couples living together; 32.3% had a female householder with no spouse or partner present. 37.7% of households consisted of individuals and 17.7% had someone living alone who was 65 years of age or older.[10] The average household size was 2.2 and the average family size was 2.9.[14] The percent of those with a bachelor’s degree or higher was estimated to be 12.2% of the population.[15]\n\n21.0% of the population was under the age of 18, 6.3% from 18 to 24, 22.3% from 25 to 44, 27.3% from 45 to 64, and 23.0% who were 65 years of age or older. The median age was 45.2 years. For every 100 females, there were 113.8 males.[10] For every 100 females ages 18 and older, there were 117.4 males.[10]\n\nThe 2016-2020 5-year American Community Survey estimates show that the median household income was $35,707 (with a margin of error of +/- $4,734) and the median family income was $65,313 (+/- $27,733).[16] Males had a median income of $39,773 (+/- $6,934) versus $25,152 (+/- $3,452) for females. The median income for those above 16 years old was $32,500 (+/- $8,286).[17] Approximately, 15.2% of families and 16.8% of the population were below the poverty line, including 24.7% of those under the age of 18 and 12.5% of those ages 65 or over.[18][19]\n\nAs of the census[20] of 2010, there were 1,481 people, 657 households, and 372 families residing in the city. The population density was 1,322.3 inhabitants per square mile (510.5/km2). There were 736 housing units at an average density of 657.1 per square mile (253.7/km2). The racial makeup of the city was 97.0% White, 0.1% African American, 1.4% Native American, 0.1% Asian, 0.5% from other races, and 1.0% from two or more races. Hispanic or Latino of any race were 2.7% of the population.\n\nOf the city' 657 households 27.2% had children under the age of 18 living with them, 41.7% were married couples living together, 11.1% had a female householder with no husband present, 3.8% had a male householder with no wife present, and 43.4% were non-families. 38.1% of all households were made up of individuals, and 14.8% had someone living alone who was 65 years of age or older. The average household size was 2.20 and the average family size was 2.93.\n\nThe median age in the city was 42.1 years. 22.4% of residents were under the age of 18; 7.8% were between the ages of 18 and 24; 23.5% were from 25 to 44; 27.8% were from 45 to 64; and 18.3% were 65 years of age or older. The gender makeup of the city was 48.1% male and 51.9% female.\n\nThere were 669 households, out of which 26.8% had children under the age of 18 living with them, 49.0% were married couples living together, 6.7% had a female householder with no husband present, and 40.4% were non-families. 37.1% of all households were made up of individuals, and 19.7% had someone living alone who was 65 years of age or older. The average household size was 2.20 and the average family size was 2.91.\n\nIn the city, the population was spread out, with 21.4% under the age of 18, 7.9% from 18 to 24, 25.2% from 25 to 44, 22.4% from 45 to 64, and 23.1% who were 65 years of age or older. The median age was 42 years. For every 100 females, there were 88.3 males. For every 100 females age 18 and over, there were 87.8 males.\n\nThe median income for a household in the city was $26,658, and the median income for a family was $36,648. Males had a median income of $27,337 versus $19,821 for females. The per capita income for the city was $15,636. About 8.4% of families and 11.9% of the population were below the poverty line, including 14.4% of those under age 18 and 15.8% of those age 65 or over.\n\nThe community is served by Northeast USD 246 public school district.\n\nPrior to school unification, the Arma High School mascot was Bulldogs.[21] The Arma Bulldogs won the Kansas State High School boys class B Track & Field championship in 1952. The school mascot is now a Viking.[22]\n\nThe Arma City Library provides resources such as literature, movies, and internet access. The library functions as a meeting location for clubs, reading groups, and a local food pantry. The library hosts a wide range of public events.[23]\n\nArma's V-J Homecoming celebration is believed to be the oldest running V-J Day or World War II celebration in the country. Held annually the second weekend of August, Arma's V-J Homecoming Celebration started in 1946 as a way to honor local veterans returning home from World War II, and has evolved into a family festival. The original V-J Day was August 15, 1945, the day the Victory Over Japan was celebrated by the Allied Nations. On September 2, 1945, the Japanese signed the official surrender document. That Labor Day weekend marked the end of nearly four years of devastation, loss and sacrifice for the nation. More than 300,000 Americans in the armed services died in Europe and the Pacific arenas. The very next year, Arma celebrated its VJ Day in connection with homecoming activities, and the V-J Homecoming Celebration was born.[24]\n\nFollowing World War II, the American Legion in Arma wanted to honor local veterans. The Arma Veterans Memorial was built on the southeastern corner of Arma City Park. Constructed shortly after the war, the City of Arma did the construction, maintains and adds new names to the memorial. Names on the plaque represent local veterans who have served the U.S. in any war. Recently, the American flag was added along with flags for the Army, Navy, Air Force, and Marines.[25]\n\nSeveral wood carvings by chain saw artist Ed Babcock are on display at the Arma City Park.[26]\n",
  "concepts": [
    "Arma, Kansas",
    "age",
    "arma",
    "city",
    "18",
    "years",
    "population",
    "median",
    "age 18",
    "65",
    "living"
  ],
  "findings": [
    "History",
    "Geography",
    "Demographics",
    "2020 census",
    "2010 census",
    "2000 census",
    "Education",
    "Public Library",
    "Area events",
    "V-J celebration",
    "Area attractions",
    "Arma Veterans Memorial",
    "Carved statues at City Park",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:09.320725"
}