{
  "title": "Triumph (1924 film)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Triumph_(1924_film)",
  "content": "Triumph is a 1924 American silent drama film directed by Cecil B. DeMille and starring Leatrice Joy and Rod La Rocque.[1] It was based on a 1924 novel of the same name by May Edginton. The novel had previously been serialized in 1923 by The Saturday Evening Post.[2]\n\nAs described in a film magazine review,[3] Anna Land is forewoman of the Garnet Can Works, controlled by William Silver, one of the late owner's sons. Another son, King Garnet, is destitute. Anna's ambition is to be a singer. King extorts $1,000 from Silver and aids Anna in making her debut, which is a success. Silver sends Anna abroad and follows her. She loses her voice as a result of an injury in a fire. King takes a job in the factory and works his way up. On Silver's return, he finds King has obtained control of the company. King makes Silver manager. The latter, knowing Anna really loves his brother, gives her up to King.\n\nDeMille fell out with Adolph Zukor, one of the heads of Famous Players–Lasky, over the production costs of The Ten Commandments (1923). He completed Triumph and Feet of Clay (1924), before he departed Paramount to lead his own production company, Producers Distributing Corporation (PDC). He returned to Paramount only after the introduction of sound in the early 1930s.\n\nComplete prints of Triumph are held by the Library of Congress (on  35 mm) and the George Eastman Museum in Rochester, New York.[4][5]\n\nThis article about a silent drama film from the 1920s is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Triumph (1924 film)",
    "king",
    "silver",
    "anna",
    "triumph",
    "film",
    "1924",
    "works",
    "silent drama",
    "silent",
    "production"
  ],
  "findings": [
    "Plot",
    "Cast",
    "Production",
    "Preservation",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T17:34:45.547291"
}