{
  "title": "New Jalpaiguri–Alipurduar Tourist Express",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/New_Jalpaiguri–Alipurduar_Tourist_Express",
  "content": "New Jalpaiguri–Alipurduar Tourist Express[2] is the tourist Express trains in India that runs between New Jalpaiguri Junction and Alipurduar Junction in the Indian state of West Bengal. The train belongs to the Northeast Frontier Railway zone of Indian Railways. The service was officially started from 28 August 2021 from New Jalpaiguri.[3] The train provides awesome sceneries of the beautiful Dooars region which includes Mahananda Wildlife Sanctuary, Sevoke Railway Bridge, River Teesta, River Jaldhaka, River Torsha, Dooars-Terai tea gardens,  Buxa Tiger Reserve, Jaldapara National Park, Chapramari Wildlife Sanctuary, Rajabhatkhawa, etc. The passengers travelling by this train would also get to see the mesmerizing view of Sub-Himalayas, the glaciated rivers such as Teesta, Torsha, Daina river, Jaldhaka, Kuji Daina, Dima river, etc. The train will also cover many little villages, towns, etc. One of this train's stoppage is Hasimara Railway Station, which lies near the border of Bhutan. The passengers would also get to see views of Jayanti Hills, Sevoke,  Chalsa, Terai–Duar savanna and grasslands and Malbazar. The passengers would also be entertained by dance performed by locals at some specific stations like Chalsa and Hasimara. There is also a selfie point in the Vistadome Coach. The train will cover three districts, which are Jalpaiguri District, Darjeeling District and Alipurduar District.\n\nThe train is hauled by WDP-4/ WDP-4D/ WDP-4B Locomotive of \"Siliguri Diesel Loco Shed\". from New Jalpaiguri to Alipurduar Junction and vice versa.\n\n15777/15778 Alipurduar - New Jalpaiguri /New Jalpaiguri - Alipurduar Tourist Express consists of Two General Class (GS) coaches, One AC Chair Car (CC) coach, One Executive Vistadome (EC) class, WDP-4/WDP-4D/WDP-4B Engine and One End On Generator (EOG) coach.\n\nThis Indian express train article is a stub. You can help Wikipedia by expanding it.\nThis West Bengal related article is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "New Jalpaiguri–Alipurduar Tourist Express"
  ],
  "findings": [
    "Locomotive",
    "Coach composition",
    "Stops",
    "See also",
    "References"
  ],
  "timestamp": "2025-04-11T10:08:55.098415"
}