{
  "title": "Lost Boys (Grimm)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Lost_Boys_(Grimm)",
  "content": "\"Lost Boys\" is the third episode of season 5 of the supernatural drama television series Grimm  and the 91st episode overall, which premiered on November 13, 2015, on the cable network NBC. The episode was written by Sean Calder and was directed by Aaron Lipstadt. In the episode, Nick and Hank must save Rosalee, who was kidnapped by a group of children who want her to be her \"mom\".\n\nThe episode received generally positive reviews from critics, although some criticized the filler aspect.\n\nOpening quote: \"I think I had a mother once.\"\n\nRosalee's (Bree Turner) life is in danger when a group of orphaned Wesen children — Peter, Lily, Big John, and Miguel — in need of a mother-figure to guide them, decide that Rosalee fits the bill. Nick (David Giuntoli) and Hank (Russell Hornsby) find a vital clue in a fairly recent missing-person case. Nick decides to move out of his home to a safer location. Meanwhile, Renard (Sasha Roiz) is informed of the King's \"accident\" and that his daughter is safe with the Resistance. (A basis of Peter Pan & The Lost Boys).\n\nThe episode was viewed by 3.66 million people, earning a 0.9/3 in the 18-49 rating demographics on the Nielson ratings scale, ranking third on its timeslot and ninth for the night in the 18-49 demographics, behind The Amazing Race, Hawaii Five-0, MasterChef Junior, 20/20, Dr. Ken, Blue Bloods, Last Man Standing, and Shark Tank.[1] This was a 4% decrease in viewership from the previous episode, which was watched by 3.78 million viewers with a 1.0/4.[2] This means that 0.9 percent of all households with televisions watched the episode, while 3 percent of all households watching television at that time watched it. With DVR factoring in, the episode was watched by 5.91 million viewers and had a 1.6 ratings share in the 18-49 demographics.[3]\n\n\"Lost Boys\" received generally positive reviews. Les Chappell from The A.V. Club gave the episode an \"A−\" rating and wrote, \"Possibly the smartest decision Grimm made in its first season was the choice to add Bree Turner to its regular cast shortly after her first appearance. Beyond the fact that she's an engaging and charming actress, the character of Rosalee adds something important to the show's team. She's engaged with the Wesen world at a level that expands said world without constant trips to the Grimm diaries, and her level of empathy for those less fortunate helps drag Nick and his cohorts back from more ruthless approaches to problem-solving. Plus her appealing chemistry with Silas Weir Mitchell took a character who was already the strongest part of the ensemble to a new level, producing both the adorable Monrosalee moments and instances of raw emotion when this partnership is threatened.\"[4]\n\nKathleen Wiedel from TV Fanatic, gave a 3.3 star rating out of 5, stating: \"In certain particular ways, 'Lost Boys' definitely felt like a throwback to early-series Grimm. From the unsubtle fairy tale adaptation to the direct references to Adalind's and Nick's 'first times,' it's almost like the writers were feeling sentimental for vintage Grimm Season 1! The only problem is that we've moved well past Season 1, which leaves Grimm Season 5 Episode 3 feeling very much like bland filler in contrast with the heavily serialized stories we've had of late.\"[5]\n\nLiz Prugh from EW wrote, \"'Whatever kind of family you have, reality is relative. Normal is just the middle of the mess.' This quote from Monroe tonight was the underlying theme throughout the entire episode, and it couldn't be more true. We begin learning that Nick has sold his home, and he and Adalind are packing up the last boxes left to move. Nick gets nostalgic, telling Adalind that when he bought the home more than six years ago, he had no idea he was a grimm. He also shares with Adalind that she was 'his first,' meaning the first wesen he ever saw. She shares that he, too, was her first — her first grimm she ever came across.\"[6]\n\nMaryAnn Sleasman from TV.com, wrote, \"Okay guys, Grimm is back. This is the Grimm I've been holding out for the last couple of weeks. 'Lost Boys' was twisted and upsetting and sad with only the faintest glimmer of hope for a world where Wesen, Grimm, and human exist peacefully. It mixed the dissonant worlds of Wesen and non-Wesen and how the current imperfect union harms the most vulnerable citizens of both. Being stuck in the foster care system sucks even when you aren't secretly half of the villain in a nightmare-fueled fairy tale, as Rosalie's wannabe children reminded us all. Teetering between creepy and cute, the clueless kids just wanted a mom to love them, but were too maladjusted by a lifetime in the system to realize that you can't just kidnap a woman off the street, tie her up, and call her mother.\"[7]\n\nChristine Horton of Den of Geek wrote, \"This third episode of the new season of Grimm is, to quite a large degree, a return to the familiar Wesen of the Week storylines that have traditionally been the show's bread and butter. This episode was a little frustrating, for the most, with a fairly pedestrian plot dominating the hour. However, the couple of scraps we were thrown indicate there are better things to come, particularly if Truble is to be let loose.\"[8]\n",
  "concepts": [
    "Lost Boys (Grimm)",
    "episode",
    "grimm",
    "wesen",
    "nick",
    "season",
    "lost boys",
    "lost",
    "boys",
    "wrote",
    "watched"
  ],
  "findings": [
    "Plot",
    "Reception",
    "Viewers",
    "Critical reviews",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:37.693500"
}