{
  "title": "Colin MacIntyre",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Colin_MacIntyre",
  "content": "Colin MacIntyre (born 8 April 1971) is a Scottish musician and novelist. A singer, songwriter, and multi-instrumentalist, he has released five albums under the name Mull Historical Society[1] as well as two albums under his own name. His most successful album, Mull Historical Society's Us (2003), reached number 19 in the UK Albums Chart. His debut novel, The Letters of Ivor Punch, was published in 2015.\n\nMacIntyre's father Kenny Macintyre was born in Oban then moved to Mull, an island off the west coast of Scotland. He was a bank clerk, a gift-shop operator and then BBC Scotland's Political Correspondent for ten years.[2][3] His paternal grandfather, Angus Macintyre, was a poet[4] and his brother Kenny Macintyre is a radio journalist for BBC Scotland Sport.[5]\n\nMacIntyre was born on 8 April 1971[6] on Mull. He wanted to be a musician from a young age and grew up listening to his uncle's covers band. He formed a covers band of his own called Trax, later renamed Love Sick Zombies, while still at Tobermory Primary School.[7] He was influenced by his art teacher at Tobermory High School, and considered going to art school. He also attended Oban High School.[8]  In the late 1980s he and his brother moved to Glasgow, where he attended Glasgow Caledonian University,[8] trained with Queen's Park F.C., worked for a stockbroker, and then for telephone company BT's 192 directory enquiries service for three years.[7][9]\n\nMacIntyre coined the name Mull Historical Society after seeing an advert for an organisation which has since changed its name to the Mull Historical and Archaeological Society.[10][11] His first album under the name, Loss in 2001, was inspired by his upbringing on Mull[5] and the sudden death of his father in 1999.[3] It contains samples from a Caledonian MacBrayne ferry and the waves in Calgary Bay in Mull.[5] Q magazine named Loss as one of its top 50 albums of 2001.[12] \"Public Service Announcer\" is about MacIntyre's time at BT, and is based on the rhythm of a telephone ring tone.[13] \"Barcode Bypass\" is about a small shopkeeper threatened by the supermarkets.[14] \"Watching Xanadu\", a song about watching the film Xanadu,[2] was included on STV's Scotland's Greatest Album as one of the top tracks of the 2000s.[15] In 2000-01 Mull Historical Society played support for Elbow and the Strokes,[2] and in 2002 for R.E.M., the Delgados and The Polyphonic Spree.[16] MacIntyre was named as \"Scotland's Top Creative Talent\" at the Glenfiddich Spirit of Scotland Awards in 2002.[14]\n\nThe second album, Us, came out in 2003 to generally positive reviews;[17] NME called it \"a joyous slice of orchestral prozac\".[18] The track \"The Supermarket Strikes Back\" is a sequel to \"Barcode Bypass\" from Loss.[19][14] After the album his record label, Warners, dropped him.[20] The third Mull Historical Society album, This Is Hope, was released on B-Unique Records in 2004. It was inspired by a two-month visit to the United States, ending in New Orleans. One of its songs is about the death of David Kelly,[1] and the album also includes a recording of MacIntyre's grandmother.[20] The covers of Loss and This Is Hope, and several of the videos and stage sets from this era, feature 'The Giant Dog With The Wig', which MacIntyre created using MS Paint.[21][22] In January 2005, Mull Historical Society was voted the twelfth-greatest Scottish band of all time by The List magazine.[23]\n\nMacIntyre released The Water under his own name in 2008. He had written the album in New York, his wife's home city.[4] It was produced by Nick Franglen from Lemon Jelly; MacIntyre had produced the first three albums himself.[24]  The last track, \"Pay Attention to the Human\", features a poem written and performed by Tony Benn.[25][26]  In 2009, Irvine Welsh used the track \"You're a Star\" from The Water in his comedy Good Arrows.[27] MacIntyre's fifth album Island, the second under his own name, was released in the UK in 2009. It features Kenny Anderson (King Creosote) on backing vocals on \"Out Stealing Horses\"[28] and was recorded in MacIntyre's old primary classroom in Tobermory.[29] In 2012, MacIntyre returned as Mull Historical Society for his sixth album City Awakenings, which is about London, New York and Glasgow.[30] In early 2014 MacIntyre gigged as Mull Historical Society again, playing Loss in its entirety, to promote the best-of album which was released in 2015.[5] In June 2014 MacIntyre's project INK released its first single, \"Control\".[31] Dear Satellite, a new Mull Historical Society record, was released in April 2016.[32] The latest Mull Historical Society album, In My Mind There's A Room, was released in July 2023.[33]\n\nMacIntyre's first novel, The Letters of Ivor Punch, was published in May 2015 by Weidenfeld & Nicolson. It is set on Mull.[34]\n",
  "concepts": [
    "Colin MacIntyre"
  ],
  "findings": [
    "Early life and education",
    "Musical career",
    "Literary career",
    "Discography",
    "Albums",
    "Compilations",
    "Singles",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:49:48.656327"
}