{
  "title": "List of Mister Venezuela runners-up and finalists",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/List_of_Mister_Venezuela_runners-up_and_finalists",
  "content": "This article provides the names of the runners-up in the Mister Venezuela pageant since the pageant's first edition in 1996.\n\nThe contest has announced five finalists from 1996 to 1998, from 2014 to 2016 and from 2019 to 2024. From 1999 to 2005 the number was reduced to three, and in 2017 the group was increased to six (regardless if the pageant post-announces the placements of the other 2/3 delegates who made it to the Top 5/6). Furthermore, the pageant has awarded the winner with the first runner-up from 1996 to 1997, being increased to three with the second runner-up being also awarded from 1998 to 2005 and from 2014 to 2024. In 2006 only the winner was announced. In 2009 and 2012 the winners were appointed without any competition being held.\n\nThis table shows the top-five finalists of each competition, from its inception with Mister Venezuela 1996.\n\nSince raking for contest is usually as follows:\n\nThe first runner-up of each edition of Mister Venezuela is the second placer behind the contestant who is selected as Mister Venezuela (first placer). In some cases, he shall take over the title of Mister Venezuela, if:\n\nThe second-place finisher being designated as 1st runner-up has been awarded fifteen times (1996–2005; 2014–2024).\n\nThis table lists the number of 1st runner-up titles by state/region.\n\nThe current 1st runner-up is Franco Daniel Cova from Miranda, as for the edition that took place on July 13, 2024, in Venevisión Studios, Caracas.\n\nThe second Runner-Up of each edition of Mister Venezuela is the third placer behind the contestant who is selected as Mister Venezuela (first placer) and the first runner-up (second placer).\n\nThe third-place finisher being designated as 2nd runner-up has been awarded fifteen times (1996–2005; 2014–2024).\n\nThis table lists the number of 2nd runner-up titles by state/region.\n\nThe current 2nd runner-up is Leiker Márquez from Táchira, as for the edition that took place on July 13, 2024, in Venevisión Studios, Caracas.\n\nThe third runner-up of each edition of Mister Venezuela is the fourth placer behind the conestant who is selected as Mister Venezuela first placer), the first runner-up (second placer) and the second runner-up (third placer).\n\nThe fourth-place finisher being designated as 3rd runner-up has been awarded three times (1996–1998) (unless not at finals).\n\nThe fourth Runner-Up of each edition of Mister Venezuela is the fifth placer behind the conestant who is selected as Mister Venezuela (first placer), the first runner-up (second placer), the second Runner-Up (third placer) and the third runner-up (fourth placer).\n\nThe fifth-place finisher being designated as 4th runner-up has been awarded three times (1996–1998) (unless not at finals).\n\nThis list shows finalists that had participated at international competitions.\n\nThis list shows semifinilists that had participated at international competitions.\n\nThis list shows remainder contestants that had participated at international competitions.\n\nThe state/region who assumed a position is indicated in boldThe state/region who was dethroned, resigned or originally held the position is indicated in striketroughThe state/region who was dethroned, resigned or originally held the position but was not replaced is indicated underlined\n\nThis list provides the names of the special award winners in the Mister Venezuela pageant.\n",
  "concepts": [
    "List of Mister Venezuela runners-up and finalists",
    "runner",
    "placer",
    "venezuela",
    "mister venezuela",
    "mister",
    "second",
    "1996",
    "edition",
    "place",
    "awarded"
  ],
  "findings": [
    "Runners up and finalists",
    "States/regions by number of runners-up",
    "1st runner-up",
    "2nd runner-up",
    "3rd runner-up",
    "4th runner-up",
    "Finalists",
    "Semifinilists",
    "Contestans",
    "Runners-up and finalists table position",
    "Special awards",
    "Main awards",
    "Other awards",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:48:47.401784"
}