{
  "title": "Michael Levitt (biophysicist)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Michael_Levitt_(biophysicist)",
  "content": "Michael Levitt, FRS[12] (Hebrew: מיכאל לויט; born 9 May 1947) is a South African-born biophysicist and a professor of structural biology at Stanford University, a position he has held since 1987.[13][14] Levitt received the 2013 Nobel Prize in Chemistry,[15] together with Martin Karplus and Arieh Warshel, for \"the development of multiscale models for complex chemical systems\".[16][17][18][19] In 2018, Levitt was a founding co-editor of the Annual Review of Biomedical Data Science.[20]\n\nMichael Levitt was born in Pretoria, South Africa, to a Jewish family from Plungė, Lithuania; his father was from Lithuania and his mother from the Czech Republic.[21] He attended Sunnyside Primary School and then Pretoria Boys High School between 1960 and 1962. The family moved to England when he was 15.[22] Levitt spent 1963 studying applied mathematics at the University of Pretoria.[23] He attended King's College London, graduating with a first-class honours degree in physics in 1967.[24][9][25]\n\nIn 1967, he visited Israel for the first time. Together with his Israeli wife, Rina,[26] a multimedia artist, he left to study at Cambridge, where their three children were born. Levitt was a PhD student in Computational biology at Peterhouse, Cambridge, and was based at the Laboratory of Molecular Biology from 1968 to 1972, where he developed a computer program for studying the conformations of molecules that underpinned much of his later work.[3][27]\n\nIn 1979, he returned to Israel and conducted research at the Weizmann Institute of Science in Rehovot, becoming an Israeli citizen in 1980. He served in the Israel Defense Forces for six weeks in 1985. In 1986, he began teaching at Stanford University, and since then has split his time between Israel and California.[22] He went on to gain a research fellowship at Gonville and Caius College, Cambridge.\n\nFrom 1980 to 1987, he was Professor of Chemical Physics at the Weizmann Institute of Science, Rehovot. Thereafter, he served as Professor of Structural biology, at Stanford University, California.\n\nLevitt was one of the first researchers to conduct molecular dynamics simulations of DNA and proteins and developed the first software for this purpose.[29][30][31][32] He is currently well known for developing approaches to predict macromolecular structures, having participated in many Critical Assessment of Techniques for Protein Structure Prediction (CASP) competitions,[33] where he criticised molecular dynamics for inability to refine protein structures.[34] He has also worked on simplified representations of protein structure for analysing folding and packing,[35][36][37] as well as developing scoring systems for large-scale sequence-structure comparisons.[38][39] He has mentored many successful scientists, including Mark Gerstein and Ram Samudrala.[2][40] Cyrus Chothia was one of his colleagues.\n\nLevitt has served on the Scientific Advisory Boards of the following companies: Dupont Merck Pharmaceuticals, AMGEN, Protein Design Labs, Affymetrix, Molecular Applications Group, 3D Pharmaceuticals, Algodign, Oplon Ltd, Cocrystal Discovery, InterX, and StemRad, Ltd,.[citation needed]\n\nLevitt has been outspoken during the ongoing COVID-19 pandemic, and made a number of wrong predictions on the disease's spread based on his own modelling.[41][42][43] On March 18, 2020, he predicted that Israel would see less than ten deaths from COVID-19, and on July 25, 2020, he incorrectly predicted that the outbreak in the U.S. would be over by the end of August 2020 with a total of fewer than 170,000 deaths.[44][41][45] As of November 2021, the U.S. was recording COVID-19 deaths at the rate of about 1,000 per day,[46] while Israel has reported over 8,000 COVID-19 deaths since the start of the pandemic.[47]\n\nLevitt has also raised concerns about potential damaging effects of COVID-19 lockdown orders on economic activity as well in increasing suicide and abuse rates,[42] and has signed the Great Barrington Declaration,[48] a statement supported by a group of academics advocating for alternatives to lockdowns which has been criticized by the WHO and other public health organizations as dangerous and lacking in sound scientific basis.[49][50]\n\nCritics have expressed concern regarding Levitt's incorrect or potentially misleading predictions as well as his anti-lockdown positions, in part due to his status as a Nobel laureate and his large following on Twitter.[41][51] Maia Majumder, a computational epidemiologist  at Harvard Medical School, stated that \"Michael Levitt has a huge, huge following, so this creates lots of problems when he’s tweeting something that may be misinformative.\"[41] Randy Schekman, a 2013 Nobel Prize in Physiology or Medicine winner, wrote of Levitt's expressed positions that \"in this instance, I believe he crossed a boundary from data to public policy where the impact of his word as a Nobel laureate has undue influence.\"[41]\n\nLevitt was elected an EMBO Member in 1983,[52] a Fellow of the Royal Society (FRS) in 2001,[12] and a member of the National Academy of Sciences in 2002,[53] and received the 2013 Nobel Prize in Chemistry, together with Martin Karplus and Arieh Warshel, \"for the development of multiscale models for complex chemical systems\".[54] He received the DeLano Award for Computational Biosciences in 2014.[55] He was elected an ISCB Fellow by the International Society for Computational Biology in 2015.[56][57]\n\nLevitt holds South African, American, British and Israeli citizenship.\n\nHis wife Rina died on 23 January 2017.\n\nHe is the sixth Israeli to be awarded the Nobel Prize in Chemistry in under a decade.[58][59]\n\n\"All text published under the heading 'Biography' on Fellow profile pages is available under Creative Commons Attribution 4.0 International License.\" --\"Royal Society Terms, conditions and policies\". Archived from the original on 11 November 2016. Retrieved 9 March 2016.{{cite web}}:  CS1 maint: bot: original URL status unknown (link)\n This article incorporates text available under the CC BY 4.0 license.\n",
  "concepts": [
    "Michael Levitt (biophysicist)",
    "levitt",
    "nobel",
    "israel",
    "19",
    "covid 19",
    "covid",
    "biology",
    "41",
    "university",
    "protein"
  ],
  "findings": [
    "Early life and education",
    "Career and research",
    "Industrial collaboration",
    "COVID-19",
    "Awards and honors",
    "Personal life",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:01.928938"
}