{
  "title": "Killington, Vermont",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Killington,_Vermont",
  "content": "Killington is a town in Rutland County, Vermont, United States.  The population was 1,407 at the 2020 census.[3] Killington Ski Resort and numerous vacation lodges are located here.  The town was previously named Sherburne, but was renamed to its original name, \"Killington\", in 1999.\n\nThe town of Killington was chartered on July 7, 1761, by a New Hampshire grant.  In 1800, it was renamed Sherburne[4] after landholder Colonel Benjamin Sherburne.[5]  The town voted to revert to its original name of Killington on March 2, 1999; which was approved by the Vermont General Assembly and became effective July 1, 1999.[6]\n\nThe 2007 town meeting considered a proposal to impose a three-cent surcharge on every dollar of property tax revenue.  The proceeds would have been used to fund a town economic development group.  The surcharge was not approved by the voters.[7]\n\nKillington was one of thirteen Vermont towns isolated by flooding caused by Hurricane Irene on August 28, 2011. Killington was cut off for 19 days.[8]\n\nKillington's voters have twice voted to secede from Vermont and join the State of New Hampshire, 25 miles (40 km) to the east. The movement stems from what some residents perceive as an inequity in taxes sent to the state of Vermont, for services received.  The votes are largely symbolic, as secession is highly unlikely and would require the agreement of both states' legislatures, as well as that of the U.S. Congress.\n\nAccording to the United States Census Bureau, the town has a total area of 46.9 square miles (121 km2), of which 46.6 square miles (121 km2) is land and 0.2 square miles (0.52 km2), or 0.47%, is water.  The Ottauquechee River has its headwaters in the town.[9] The central part of the town, extending along Killington Road from U.S. Route 4 in the north to the Killington Ski Resort in the south, comprises the Killington Village census-designated place. The Appalachian Trail crosses the northern part of the town, then joins the Long Trail to cross the western part.\n\nAs of the census[1] of 2000, there were 1,095 people, 500 households, and 282 families residing in the town.[11]  The population density was 23.5 people per square mile (9.1/km2).  There were 2,528 housing units at an average density of 54.2 per square mile (20.9/km2).  The racial makeup of the town was 97.63% White, 0.37% African American, 0.09% Native American, 0.64% Asian, and 1.28% from two or more races. Hispanic or Latino of any race were 0.91% of the population.\n\nThere were 500 households, out of which 25.2% had children under the age of 18 living with them; 48.6% were married couples living together; 5.6% had a female householder with no husband present; and 43.6% were non-families.  34.2% of all households were made up of individuals, and 5.8% had someone living alone who was 65 years of age or older.  The average household size was 2.19, and the average family size was 2.80.\n\nIn the town, the population was spread out, with 20.5% under the age of 18, 5.8% from 18 to 24, 29.4% from 25 to 44, 33.3% from 45 to 64, and 11.1% who were 65 years of age or older.  The median age was 42 years. For every 100 females, there were 115.1 males.  For every 100 females age 18 and over, there were 116.7 males.\n\nThe median income for a household in the town was $47,500, and the median income for a family was $60,125.  Males had a median income of $36,618 versus $27,368 for females.  The per capita income for the town was $32,066.  About 6.4% of families and 7.0% of the population were below the poverty line, including 12.6% of those under age 18 and 1.7% of those age 65 or over.\n\nOne of the area's major business ventures is the Killington Ski Resort, the largest ski area in the Eastern U.S.\n",
  "concepts": [
    "Killington, Vermont"
  ],
  "findings": [
    "History",
    "Secession referendums",
    "Geography",
    "Demographics",
    "Business",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T12:41:03.715278"
}