{
  "title": "Chi Va Chi Sau Ka",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Chi_Va_Chi_Sau_Ka",
  "content": "Chi Va Chi Sau Ka (translation: Mister And Missus) is a 2017 Indian Marathi-language satirical romantic comedy drama film directed by Paresh Mokashi and produced by Nikhil Sane and Zee Studios.[1] Released in India on 19 May 2017, the film stars Lalit Prabhakar and Mrinmayee Godbole in lead roles[2] and Supriya Pathare, Pradeep Joshi, Jyoti Subhash, Satish Alekar, Purnima Talwalkar, Sunil Abhyankar, Sharmishtha Raut and Pushkar Lonarkar in supporting roles.[3][4] The film trailer was released on 30 April 2017.[5] The film was remade in Gujarati as Sharato Lagu.[6]\n\nThe film is a satire on the institute of marriage in the current changing world of values. Satyaprakash Joshi (Lalit Prabhakar), also known as Satya, is an engineer who manufactures products related to solar energy and lives with his parents (Supriya Pathare and Pradeep Joshi) and his widowed grandmother (Jyoti Subhash). Savitri Kulkarni (Mrinmayee Godbole), also known as Saavi, is a vegan who works as a veterinarian at an animal shelter and lives with her parents (Purnima Talwalkar and Sunil Abhyankar), her pregnant sister, Ragini (Sharmistha Raut), and her younger brother, Tillya (Pushkar Lonarkar). Both of them are satisfied in their fields and have won the youth icon award for their work. They are introduced to each other as prospective marriage partners by their parents, having met earlier at the register marriage of common friends. During the meeting, Saavi puts forth a condition that she wants to stay with Satya at his house for two months in order to test their compatibility and future. Initially, everyone except Satya is against this, whereas Satya believes it will be a good experiment. When they both explain how arranged marriage couples usually do not get along well and may end up in divorce, eventually everyone agrees. \n\nSaavi has two conditions: Firstly, their relationship will be completely platonic, and secondly, Satya will have to give up non-veg food. Satya agrees and hence Saavi moves to his house. Over the next two months, Satya and Saavi get to know each other, their professions and their interests. Satya helps in raising funds for Saavi's animal shelter, while Saavi helps Satya in accquiring important work-related documents and even encourages his grandmother to get remarried with her long-time friend, Haribhau Bhudargadkar (Satish Alekar), and the two soon start falling in love. Despite this, in the success party of Satya's project where he plans to propose to Saavi, she notices non-veg food being cooked inside and gets furious with Satya. Satya is also upset at the fact that she does not want to adjust at all, and tells her that he changed his daily habits only because of Saavi's request, but he cannot force others to give up non-vegetarian food and accept a vegan lifestyle like he did. As a result, both of them get into a heated argument and part ways disheartened. However, as fate would have it, Satya and Saavi meet again at the Youth Icon award ceremony and confess their feelings comically at a press interview, where Satya gifts Saavi an adopted puppy named Galileo. The film ends with Satya and Saavi getting married.\n\nChi Va Chi Sau Ka released on 19 May 2017 with English subtitles in Maharashtra, Gujarat, Goa, Madhya Pradesh, Delhi, Karnataka, Andhra Pradesh and Telangana.[7]\n\nThe songs for the film are composed by Narendra Bhide and lyrics by Paresh Mokashi.[9]\n\nThe film was released on 19 May 2017 all over Maharashtra and received good reception. The film received a huge response at the box office. It completed 100 days run in many centres of Maharashtra.\n\nGanesh Matkari of Pune Mirror gave the film a rating of 2 out of 5 and said that, \"this is not Paresh Mokashi’s best work till date.\" The critic concluded his review saying that, \"the film is not without its moments. It is reasonably amusing for most part.\"[10] Shalaka Nalawade of The Times of India gave the film a rating of 4 out of 5 and said that the film is not without any weak points but the reasons to watch it outnumber the loopholes in the story.[11] Keyur Seta of Cinestaan gave the film a rating of 2 out of 5 saying that, \"Paresh Mokashi's film, though loud in parts, does have its moments. Overall, Chi Va Chi Sau Ka is a decent family entertainer.\"[12] Ulhas Shirke of Marathi Movie World gave the film a rating of 2 out of 5 saying that, \"Performances from the artistes are just fine, but all of them are too loud and quarreling with each other most of the time, which has taken away the interest from the subject of ‘Chi Va Chi Sau Ka‘ film.\"[13] Aditya Savnal of Marathi Stars gave the film a rating of 3 out of 5 saying that, \"Despite its shortcomings, Chi Ka Va Sau Ka has several enjoyable and laugh out loud moments.\"[14]\n\nThe film was remade in 2018 Gujarati film Sharato Lagu.\n",
  "concepts": [
    "Chi Va Chi Sau Ka"
  ],
  "findings": [
    "Plot",
    "Cast",
    "Main",
    "Supporting",
    "Release",
    "Soundtrack",
    "Reception",
    "Critical reception",
    "Remake",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:15:28.931926"
}