{
  "title": "Mark Prothero",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Mark_Prothero",
  "content": "Mark Wayne Prothero (1956 – April 19, 2014) was an American attorney in Kent, Washington.[1] He was best known for serving as defense co-counsel for the Green River Killer, serial killer Gary Ridgway from 2001 to 2003.\n\nMark Wayne Prothero was born in Seattle, Washington. He grew up in Renton, where his family operated a boat-building business. He graduated from Renton High School in 1974.[2] He attended the University of Washington on an athletic scholarship, and earned a bachelor's degree in American History in 1978.[3] Prothero attended University of San Diego School of Law in California.[4]\n\nUpon completion of his Juris Doctor in 1981,[5] Prothero returned to Washington State to work in private practice. In 1983, he joined the Associated Counsel for the Accused (ACA), which provides legal representation for indigent defendants in King County, Washington. Prothero moved into the felony unit of ACA in 1987, and ultimately became an expert in the areas of forensic DNA evidence, offender sentencing, and the death penalty.\n\nProthero was co-lead counsel in State v. Ridgway, the Green River Killer, the largest serial murder case in United States history. Prothero was co-lead counsel in State v. Proctor, the falsely accused Seattle youth.\n\nAfter the Green River case, Prothero joined the Kent, Washington law firm of Hanis, Greaney PLLC (now Hanis Irvine Prothero, PLLC).\n\nAt Hanis Irvine Prothero, PLLC, Prothero headed the Criminal Defense Department. He wrote legal opinions, free legal advising, and was actively involved in local politics. He testified, presented on, and wrote about his support of Washington State Senate Bill 6340 and Senate Bill 5476 efforts to enhance state crime lab oversight and end the death penalty, respectively.[citation needed] He is published in such works as Washington Criminal Defense Magazine.\n\nProthero practiced criminal defense his entire career, representing people accused of all types of crimes, from driving without a license to aggravated murder. He was on the Washington Supreme Court's Panel for Death-Penalty qualified trial attorneys since the panels inception in 1998. He was on the Board of Governors, Washington Association of Criminal Defense Lawyers. He lectured at law schools and continuing legal education programs.\n\nIn 2006, Prothero and Carlton Smith published a book entitled Defending Gary, which details Prothero's experience serving as Ridgway's lawyer.\n\nFrom 1982 through 1985, dozens of young women, most of whom were known prostitutes, turned up dead or missing in King County, Washington. These deaths and disappearances were attributed to the so-called \"Green River Killer,\" because the first five victims were found in or around the Green River. For almost twenty years, law enforcement officials were unable to identify the person who was responsible for the Green River murders.\n\nIn the fall of 2001, however, science was able to do the job that law enforcement never could. DNA evidence which was found in or on four of the Green River victims was matched to a long-standing suspect in the case, Gary Leon Ridgway. Ridgway, a truck painter from Auburn, Washington with a measured I.Q. of 85, was charged with multiple counts of murder.  Prothero first met Ridgway at the Regional Justice Center in Kent, Washington on November 30, 2001.  At first, Prothero was incredulous that the mild-mannered, self-effacing Ridgway could be the elusive Green River Killer. Nevertheless, Prothero was appointed to serve as Ridgway's lead defense attorney.\n\nProthero and his colleagues ended up negotiating a plea bargain, whereby Ridgway would give authorities information about his crimes and lead them to the bodies of his victims which had never been found. In exchange, Ridgway would be spared the death penalty. On November 5, 2003, Prothero stood at Ridgway's side as the former truck painter pleaded guilty to forty-eight counts of aggravated murder. A month later, King County Superior Court Judge Richard A. Jones sentenced Ridgway to life in prison without the possibility of parole. Legal experts agree that without the plea bargain Prothero and his colleagues brokered, Ridgway may have been sentenced to die.[citation needed]\n\nHe lived in King County, Washington with his wife Kelly. They have two children, Sean and Marley. Prothero was a swimming coach for Kentwood High School in Covington, Washington from 1997 through 2007.[6][7]\n\nProthero spoke at academic, legal, and community functions on topics from the judicial system, constitutional rights, academia, and swimming. Prothero served as judge Pro tempore until his death from lung cancer at his home near Kent, Washington on April 19, 2014.[8]\n",
  "concepts": [
    "Mark Prothero"
  ],
  "findings": [
    "Early life and education",
    "Career",
    "The Green River Case",
    "Personal life",
    "Honors and awards",
    "Book",
    "External links"
  ],
  "timestamp": "2025-04-11T10:24:54.237349"
}