{
  "title": "San Ġwann",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/San_Ġwann",
  "content": "San Ġwann (transl. Saint John) is a town in the Northern Region of Malta, with a population of 14,244 as of 2021.[2]  Prior to its establishment as a distinct municipality, it was a fragmented community comprising parts of Birkirkara and St. Julian's. San Ġwann emerged as a new parish in 1965 and was officially recognised as a town in 1968. [3]The Local Councils Act of 1993 identified San Ġwann as a separate district with its own statutory local government authority, marking its transition from being part of the neighbouring localities.[3] With the first San Ġwann Council was elected on 16 April 1994.\n\nSan Ġwann is a suburb characterised predominantly by modern buildings, reflecting its contemporary development. However, its geographical context reveals a more ancient history interwoven with Malta's national heritage. The oldest known human traces in San Ġwann are the prehistoric cart ruts near the Sant Andrija area, which likely date back to the period between 2300 and 1000 BC, predating the Punic era.[4]\n\nThese cart ruts imply that the region once supported an agricultural community that cultivated the fertile valleys of Wied Għomor, Wied il-Ballut, and Wied Għollieqa. The early inhabitants may have utilized natural caves in the vicinity for shelter. In addition to these cart ruts, megalithic stone blocks found in Wied Għomor suggest the presence of a Neolithic structure.[4]\n\nThe area's agricultural significance persisted over the centuries. Roman-era excavations have uncovered tombs and a covered cistern, indicating continued use of the land. The \"Roman Tower\" of Ta' Ċieda, one of eight such defensive structures erected across Malta around the 3rd century AD, is a notable archaeological feature. During the Arab period, the region was repurposed as a cemetery.[4]\n\nSan Ġwann's historical tapestry is rich and varied, reflecting its strategic importance and changing dominions over the centuries. The region's Arab heritage is evident in the Semitic names recorded in medieval documents, such as Tal-Għorgħar and L-Imsieraħ. During the medieval era, San Ġwann was inhabited by at least two communities located between Tal-Għorgħar and Naxxar, specifically at Raħal Tigan and Raħal Ger.[4]\n\nThe medieval period also saw the establishment of the parochial church of St. Helena in Għorgħar, which was abandoned in the 14th century and was likely situated near the Ta' Ċieda Tower. The cave-chapel of San Leonardo, now known as the Chapel of the Annunciation (Lunziata Chapel), is another historical site.[4]\n\nThe arrival of the Order of St. John in 1530 and the subsequent Great Siege of 1565 marked a period of relative safety from Turkish raids, leading to increased population and construction. The era saw the erection of chapels and other structures, including Torri ta' Lanzun, a protected farm-building dating around 1713.[4]\n\nDuring the late 18th century, specifically between 1798 and 1800, the Għorgħar area played a crucial role as an outpost for Maltese troops blockading French forces within the capital. The Ta' Xindi Farmhouse served as the headquarters for Captain Vincenzo Borg (Brared).[4]\n\nIn the 20th century, the area experienced minimal impact from World War II, although Torri Lanzun was damaged during enemy action. Post-war developments included strategic planning by the British Colonial Office, which initiated the construction of underground flour mills in Malta and Gozo, with one such mill, including a silo, situated behind the San Ġwann State Primary School.[4]\n\nThe 1950s brought further development with the construction of a convent by the Capuchin Friars and a new church, which was completed in December 1959 and became the Parish Church in 1965. This church adopted its name from the old chapel of San Ġwann tal-Għorghar.[4]\n\nSan Ġwann's population saw significant growth in the 1970s, reaching 12,630 by 2005 and with a population of 14,244 as of 2021.[2]\n\nThe Local Councils Act of 1993 recognised San Ġwann as a separate district with its own local government authority, and the first San Ġwann Council was elected on April 16, 1994.[5]\n\nAt the initiative of the parish priest, Fr Bertrand Vella, the newly composed hymn Innu San Ġwann (Imsieraħ) was introduced and performed for the first time on Saturday, 28th September 2024, at the Parish Church of Our Lady Mary of Lourdes, San Ġwann. This event marked a significant milestone for the community, serving as a profound expression of the locality's cultural and spiritual identity.\n\nThe hymn's lyrics were authored by Fr Mario Attard OFM Cap, a native of San Ġwann, while the musical composition was crafted by Mro Raymond Storace, the Choir Master of the local Parish Church. Their collaboration resulted in a piece that embodies the essence and heritage of the locality.\n\nThe inaugural performance was graced by the presence of the Mayor and Councilors of San Ġwann, together with parishioners and residents, who came together to celebrate this moment of unity. The hymn was performed by the Our Lady of Lourdes - San Ġwann Parish Choir, under the  direction of Mro Raymond Storace, filling the church with a deep sense of reverence and joy.\n\nLi tmur lura fi żminijiet,\n\nKemm fis-skiet seħħlek li torbot\n\nĠnus u popli taħt is-smewwiet.\n\nL-arja friska li sawritek\n\nTant siġar żejnuk lejl u nhar,\n\nSbuħitek ħilet id-dgħajjef\n\nĦlewwitek tħeġġeġ daqs in-nar.\n\nRitornell:\n\nInt Imsieraħ ilkoll insejħulek\n\nMimlija bl-imħabba fil-qlub,\n\nInt għallimtna ngħixu t'aħwa\n\nGħalhekk lilek qlubna jħobbuk.\n\nTaħt il-ħarsien ta' Ommna Marija\n\nNitgħallmu ngħixu ta' wlied,\n\nTa' Alla li hu Missierna\n\nU bit-talb ta' Ġwanni l-Għammied.\n\nGħajnuna, rispett u mħabba\n\nF'qalbek jinstabu fil-milja,\n\nO raħal tagħna ibnina\n\nFl-isbaħ u fl-aqwa familja.\n\nImsieraħ ħannieqa mżewqa\n\nB'kulturi w reliġjonijiet,\n\nAgħllimna ngħixu lkoll bejnietna\n\nFis-sliem qalb kotra ta' fehmiet.\n\nRitornell:\n\nInt Imsieraħ ilkoll insejħulek\n\nMimlija bl-imħabba fil-qlub,\n\nInt għallimtna ngħixu t'aħwa\n\nGħalhekk lilek qlubna jħobbuk.\n\nTaħt il-ħarsien ta' Ommna Marija\n\nNitgħallmu ngħixu ta' wlied,\n\nTa' Alla li hu Missierna\n\nU bit-talb ta' Ġwanni l-Għammied.\n\nGoing back to past times,\n\nSilently it managed to connect\n\nNations, peoples under the heavens.\n\nThe air so fresh, shaped you\n\nThe trees adorned you day and night,\n\nYour beauty comforted the weak\n\nAnd your sweetness a kindling flame.\n\nChorus:\n\nImsieraħ, we do call you\n\nLove abounding from our hearts,\n\nAs you taught us to live as kin\n\nThe reason why our hearts love you.\n\nUnder the protection of Mother Mary\n\nAs children, we learn to live,\n\nOf God, who is our Father\n\nAnd prayers of John the Baptist.\n\nHelp, respect, and love\n\nIn abundance fill your heart,\n\nBuild us, O village of ours\n\nInto the most beautiful, united family.\n\nImsieraħ, an embracing haven\n\nWith cultures and religions adorned,\n\nTeach us to live amongst each other\n\nIn peace amidst different opinions.\n\nChorus:\n\nImsieraħ, we do call you\n\nLove abounding from our hearts,\n\nAs you taught us to live as kin\n\nThe reason why our hearts love you.\n\nUnder the protection of Mother Mary\n\nAs children, we learn to live,\n\nOf God, who is our Father\n\nAnd prayers of John the Baptist.\n\nThese Cart Ruts are prehistoric marks carved into natural rock formations. They are believed to date back to the Bronze Age and provide evidence of early transportation and agricultural practices in the area.\n\nThe Punic-Roman tower in San Ġwann, Malta, is a historical structure whose origins are shrouded in mystery. While the exact date of its construction is uncertain, it is suggested that the tower may have predated Roman times and could potentially have Punic origins, with later Roman adaptations. During the medieval period, under the Muslim Caliphate, the site was used as a cemetery. After the Muslims' expulsion from Malta, a church dedicated to St. Helen was constructed on the site.\n\nToday, approximately one-third of the tower remains, though it is in a neglected state. The tower is part of a network of defensive structures built to protect against sea invasions. Eight coastal towers are believed to have existed in Malta and none on the nearby island of Gozo, with six identified as Punic-Roman tower. Nearby, the remains of a rural villa, including a cistern and Roman wall, can also be found.\n\nAn 18th-century farmhouse in San Ġwann, Malta, originally built during the Order of St. John, has undergone various adaptations over the centuries. Constructed as a farmhouse, it served this purpose for approximately two hundred years in the suburb of Kappara. During the brief French occupation of Malta, the building gained historical significance when it was used as the headquarters for the Maltese resistance, known as the Għorghar Rise, led by its owner, Vincenzo Borg. A commemorative plaque installed on the façade during the British period honours Borg's role in the revolt.\n\nThe farmhouse came into national prominence when it was mentioned by Prime Minister Lawrence Gonzi, in the Maltese Parliament, leading to its scheduling as a protected site by the Malta Environment and Planning Authority. Today, the building, which is privately owned, has been refurbished and is used as a residential home. It is recognised as a national cultural monument, reflecting its historical and cultural significance.\n\nThe distinguished example of traditional Maltese vernacular architecture and an important medieval building dating back to the 15th century. Originally built as a farmhouse, it is linked to the legend of the Mensija cave-church. The residence, also known as \"it-Torri ta' Lanzun\" or \"Castle of the Lance,\" acquired its name from Vincenzo 'Wenzu' Lanzun, a wealthy merchant from Birgu who purchased and fortified the property in the 17th century. Lanzun used the farmhouse to quarantine himself and his surviving son during the devastating plague epidemic of 1676, which claimed the lives of his wife and three children.\n\nLocated on the edge of the Mensija area in San Ġwann, Malta, Castello Lanzun stands on Triq is-Santwarju, across from the Mensija sanctuary cave-chapel. Its elevated position offers panoramic views of St. George's Bay, St. Julian's Bay, Spinola Bay, and Valletta, making it ideal for monitoring approaching threats. Fortified in 1713 by Lanzun to defend against pirate raids, it later served as a hunting lodge for the Grand Master of the Order of St. John and, during World War II, as an observation post. Today, the building, which was restored in the 1970s, includes a small, active chapel and continues to be the headquarters for the Malta-Paris obedience of the Military and Hospitaller Order of Saint Lazarus of Jerusalem.\n\nThe World War II observation post on Emvin Cremona Street in San Ġwann has sparked controversy due to its integration into a new apartment complex. Initially constructed by the Royal Engineers, this bomb-proof structure, characterised by its ashlar masonry walls and vernacular roof, was a crucial part of Malta's wartime defense system. Heritage Malta has highlighted it as an integral element of the island's historical fortifications.[6]\n\nRecent developments have led to public outcry as the observation post has been overshadowed by the new building, which many residents and history enthusiasts feel diminishes the site's historical value. Concerns about the structure's preservation emerged in 2016 when it was discovered that developers had omitted it from their initial plans. The Superintendence of Cultural Heritage intervened, ensuring that the historical site was acknowledged in the revised project plans.[6]\n\n\nIn the 1950s, as Malta was recovering from the devastation of World War II and facing the uncertainties of the Cold War, the British colonial administration initiated a significant civil defense project to ensure a stable food supply in the event of a nuclear attack. As part of this effort, a network of eight underground flour mills was constructed between 1954 and 1955. These mills were strategically located across Malta and Gozo to ensure accessibility while being hidden from potential aerial attacks. In San Ġwann, one of these underground flour mills was built to provide a secure and self-sufficient supply of flour. These underground mills were designed to be fully operational independently, with each facility equipped with its own power generation capabilities. However, the anticipated threat of nuclear conflict never materialised, leading to the abandonment of most of these mills.[7]\nAlso known as the Millennium Monument, is a striking 21st-century column located in San Ġwann, Malta. Designed by Maltese artist Paul Vella Critien, who honed his craft in Italy and Australia, the column stands as a commemoration of the third millennium. Inaugurated in 2003 by Prime Minister Eddie Fenech Adami, the monument was part of a local initiative by the San Ġwann Local Council.\n\nThe column, situated in front of the Santa Margerita Chapel, gained national attention due to its abstract design, which some commentators have noted resembles a phallic symbol. Despite this, it remains a prominent feature of the local landscape and a testament to the millennium celebrations.\n\nKarin Grech Garden is also known as Karin Grech Playing Field, located on Vjal ir-Riħan in San Ġwann, Malta, is dedicated to Karin Grech, a victim of a letter bomb attack. Prior to its transformation into a public garden in 1981, the site was characterized by natural vegetation and served as agricultural land from Roman times until the mid-20th century. The establishment of the garden responded to a growing demand for recreational spaces due to San Ġwann's expanding population. It was the first urban public garden in the locality, providing essential green space, and remains a cherished area for the community despite the development of additional gardens in San Ġwann.[8]\n\nThe present design of the garden is a modest design. The playing field was last refurbished by the San Ġwann Local Council who took care to adapt it with contextual modernisation.\n\nA previously neglected 1,000-square-metre area on the outskirts of San Ġwann has been rejuvenated into a vibrant public garden dedicated to the crucial role of pollination and the Maltese honeybee. This transformation, known as Pollinator Garden, was spearheaded by the San Ġwann council and Project Green. Situated off Tal-Balal road, the garden is conveniently located within a short walk from the homes of approximately 570 families in the area. [9]\n\nIt features a variety of high-pollen trees and shrubs designed to attract and support bee populations. Notable plantings include 92 trees and 276 shrubs, such as cypress, carob, chaste, fan palms, oak, and jacaranda trees, as well as aromatic herbs that enhance pollination. The garden also boasts honeybee enclosures, creating a sanctuary for bees and offering visitors an educational experience about the importance of the Maltese honeybee.[9]\n\nThe garden's design includes a hexagonal layout, with wooden platforms fo",
  "concepts": [
    "San Ġwann"
  ],
  "findings": [
    "Geography",
    "History",
    "Local council",
    "Previous Legislations",
    "Current Legislation",
    "Inauguration of a new anthem",
    "National monuments",
    "- Tal-Mensija Cart Ruts",
    "- Torri ta' Ċieda (Ta' Ċieda Roman Tower)",
    "- Ir-Razzett ta' Xindi (Ta' Xindi Farmhouse)",
    "- Castello Lanzun (Lanzun Tower)",
    "- Rural Structure with WWII Observation Post",
    "- Underground Flour Mill",
    "- Kolonna Eterna (Eternal Column by Paul Vella Critien)",
    "Squares, gardens and other notable places",
    "Gardens",
    "Squares",
    "Valleys",
    "Educational Buildings",
    "- St Clare College - San Ġwann Primary School",
    "- St Michael's Foundation",
    "- Chiswick House School",
    "- St. Francis School",
    "Notable places",
    "L-Ambaxxata Russa (Embassy of the Russian Federation)",
    "Parish Church, Chapels and Convents",
    "Parish Church",
    "Convents and Parish Centre",
    "Chapels",
    "Religious groups",
    "Kunsill Pastorali Parrokkjali (Parish Pastoral Council)",
    "Cultural, Social and Sport Organisations",
    "Cultural and Social Organisations",
    "Sport Organisations",
    "Locality Zones and Streets",
    "1. Ta' Żwejt",
    "2. Wied Għomor (Għomor Valley)",
    "3. Misraħ Lewża (Almond Square)",
    "4. Santa Margerita (Saint Margaret)",
    "5. The Village",
    "6. Monterosa",
    "7. Kappara",
    "8. San Andrija (Saint Andrew)",
    "9. Tal-Għorgħar",
    "Twin Towns – Sister Cities",
    "References"
  ],
  "timestamp": "2025-04-11T10:16:21.662204"
}