{
  "title": "William Henry Bliss",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/William_Henry_Bliss",
  "content": "\nWilliam Henry Bliss (26 April 1835 – 8 March 1909[1]) was an English scholar and Anglican convert to Catholicism.\n\nBliss was born in Newton St Loe, Bath, Somerset.[2] He was the son of Rev. William Bliss and Jane Monck (born Jane Bridges). Bliss was the grandson of Dr John Bliss M.D., a physician who specialised in the treatment of gout. The family owned a tweed mill (Bliss Tweed Mill) at Chipping Norton, Oxfordshire.\n\nHe was educated at Winchester from 1847 to 1852. He then went up to Magdalen College, Oxford, graduating with a Bachelor of Arts in 1859 (receiving his M.A. in 1863. In 1868 he was awarded a BCL.[3]\n\nIn 1854, he edited The Parson.\n\nOn 4 May 1859 he married Mary Jane Wray, daughter of Rev. Cyril Wray of St. Martin's, Liverpool. Over twenty years they were to have eleven children.\n\nBliss had a stammer. He therefore spent more than the usual time as a deacon. He was finally ordained by the Church of England in 1865.[3] He served as Curate of Honington for four years from 1858, then moved to St James, Plymouth until 1865 and took the Vicarage of North Hinksey on the outskirts of Oxford in 1866.\n\nIn 1867 Bliss published his first major work, The Canons of the First Four General Councils, in Greek and English. It warranted a second edition in 1869.\n\nBliss appeared to have very good prospects within the established church. He was the son of a clergyman, had a good education and very useful contacts. He was being published. However, at Oxford he came into contact with the Oxford Movement. This group of High Churchmen originally attempted to show that the Church of England was a direct descendant of the Church established by the apostles. Many members of the group converted to Catholicism, including John Henry Newman.  Bliss became curate to his uncle James at Plymouth. His uncle was a leading Anglo-Catholic.\n\nBliss was increasingly turning towards Catholic theology and doubting the historical legitimacy of the Church of England. In 1869 he followed Newman into the Roman Catholic faith.[4] He then secured the position of Keeper of Periodicals at the Bodleian Library in Oxford.\n\nIn 1877 the Public Record Office asked Bliss to go to Rome to do research in the Vatican Archives on its behalf.[3] He accepted the offer and spent most of his time searching the mediaeval Papal Registers in order to find all the dealings between the Papacy and Great Britain and Ireland. This job required Bliss to spend nine months of each year in Rome and this became Bliss' habit until he died at the Via Delphini in 1911. His wife raised the children in England and remained an Anglican.\n\nAt first the Papal bureaucrats were suspicious of an Englishmen.[5] He won them over and by 1886 he was the English Tutor to Victor Emmanuel, heir to the Italian crown. He enjoyed cordial relations with the Italian Royal family.[6]\n\nIn the Vatican Bliss produced a series called the Calendar of The Entries in the Papal Registers Relating to British Isles Volumes I and II. These were entirely Bliss's work. He edited volumes III, IV, and V with collaborators.\n\nBliss also studied the transcripts of manuscripts in Milan and Stockholm. His work from these cities is still available in the Public Record Office. Overall, his output is an important source of material for mediaeval historians.\n\nBliss is buried in Rome. His papers are kept at Downside Abbey.[7]\n",
  "concepts": [
    "William Henry Bliss",
    "bliss",
    "oxford",
    "church",
    "england",
    "work",
    "st",
    "rome",
    "papal",
    "jane",
    "english"
  ],
  "findings": [
    "Early life and education",
    "Clergyman",
    "Contact with Catholicism",
    "Work in the Vatican",
    "Other work",
    "Publications",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:34:47.553991"
}