{
  "title": "While the City Sleeps (1956 film)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/While_the_City_Sleeps_(1956_film)",
  "content": "While the City Sleeps is a 1956 American film noir directed by Fritz Lang and starring Dana Andrews, Rhonda Fleming, George Sanders, Howard Duff, Thomas Mitchell, Vincent Price, John Drew Barrymore and Ida Lupino. Written by Casey Robinson, the newspaper drama was based on The Bloody Spur by Charles Einstein, which was inspired by the case of Chicago serial killer William Heirens (a.k.a. the \"Lipstick Killer\"). (The film even alludes to the crimes of Heirens in the script's dialogue, suggesting that the film's antagonist, also known as the \"Lipstick Killer\", is a copycat killer.)[1] Five decades after the film's release, critic Dennis Schwartz wrote, \"Fritz Lang ('M') directs his most under-appreciated great film, more a social commentary than a straight crime drama.\"[2]\n\nThe film opens with a vicious killer attacking an innocent woman in her apartment. It soon becomes apparent this murderer is a serial killer.\n\nThe scene switches to elderly Amos Kyne, a news media mogul, who is on his deathbed (in his office) talking to the men in charge of his company's divisions: wire-service chief Mark Loving, newspaper chief Jon Day Griffith, and television chief \"Honest\" Harry Kritzer; Edward Mobley, TV anchorman for Kyne Inc., is also present. After Kyne dismisses the others, he talks with Mobley about his concerns regarding his empire after his death; Mobley has refused the top job many times and does so again during this conversation. He is due on the air in four minutes and walks over to turn on Kyne's TV. When he looks back, he sees the old man has died.\n\nAfter Kyne's death, the corporation goes to his son, Walter Kyne, whom his father resented and has never allowed into the business.\n\nDue to his lack of knowledge, and not wanting to take on all the work at the top by himself, Walter Kyne decides to create a new second-in-command position of Executive Director. He challenges Loving, Griffith and Kritzer to catch the serial killer who has been dubbed the \"Lipstick Killer\". The man who does will get the new job.\n\nThe job is a very lucrative and prestigious prize, and in order to secure it Griffith attempts to ally with his friend Mobley, who agrees to help although not interested in the job himself. Loving manipulates star writer Mildred Donner to cozy up to and get information out of Mobley. Kritzer may have an inside track, as he is having a secret affair with Walter Kyne's wife, Dorothy.  She is both his confidante and sweet-talks her husband on his behalf. Their love nest, however, happens to be across the hall from the apartment of Loving's secretary, Nancy Liggett, to whom Mobley becomes engaged.\n\nMobley receives inside information from his police friend, Lt. Kaufman. After a new murder, the two men devise a plan to set a trap by using Nancy as the bait, with Mobley taunting the Lipstick Killer on TV in order to bring him out into the open.\n\nTaking the bait, the Lipstick Killer follows Nancy to her apartment to attack her, but fails to get in. Mrs. Kyne happens to arrive just then and enters her apartment. The killer takes advantage of the open door and succeeds in attacking her. She fights him off and runs screaming to Nancy's apartment. The killer runs away, and after a chase that includes Mobley the police catch him. Through Kaufman, Mobley provides the scoop to Griffith, who makes sure to release it first in an extra-edition newspaper and only then on the Kyne wire service, but still ahead of any competitors.\n\nIn all the commotion, Dorothy is recognized at the secret apartment and the adulterous affair is exposed. \"Honest\" Harry Kritzer wins the promotion because of the threat of blackmail against Kyne. As Mobley and Griffith discuss the aftermath of these events in a bar, Mobley announces that he has resigned. Kyne comes in and Mobley tells him what he thinks of him.\n\nThe movie ends with Mobley and Nancy having married in Florida, and learning from a local paper of an unexpected shakeup in the Kyne organization. Kritzer is out; the promotion has gone to Griffith; and Mobley is to be promoted in turn to replace him. The happy couple kiss, ignoring a ringing telephone.\n\nThe film was based on the Charles Einstein novel Bloody Spur, which had been optioned by the producer Bert Fiedlob.[3] The script was originally known as News is Made at Night.[4] It was made for United Artists.[5]\n\nThe city in the film is supposed to be New York, but the film was shot in Los Angeles. In so doing, they used the Pacific Electric Belmont trolley tunnel under downtown LA and interurban cars with steps and trolley poles to represent the heavyweight cars of the New York City Subway rolling stock, which are drastically different in appearance.\n\nSeveral props—some of which featured a large K in a circle—were recycled from Citizen Kane, which RKO had made 15 years earlier, and may have prompted the use of the name \"Kyne.\"\n\nThe film was reportedly sold outright to RKO for a profit of $500,000.[6]\n\nOn its release, film critic Abe Weiler liked the film, especially the acting. He wrote: \"Since it is full of sound and fury, murder, sacred and profane love and a fair quota of intramural intrigue, a viewer is left wondering if the tycoons of the giant Kyne publishing combine ever bother to cover such mundane stories as the weather. But while this journalistic jamboree is more flamboyant than probable, a tight and sophisticated script by Casey Robinson and a clutch of professional performances make While the City Sleeps a diverting and workmanlike fiction.\"[7]\n\nDecades after the film's release, it continues to attract critical attention. In 1998, Jonathan Rosenbaum of the Chicago Reader included the film in his unranked list of the best American films not included on the AFI Top 100.[8] Time Out film reviews wrote of the film, \"Lang makes inspired use of glass-walled offices, where all is seen and nothing revealed, and traces explicit parallels between Andrews and the murderer. Lang's most underrated movie.\"[9] Emanuel Levy wrote in 2019, \"One of Fritz Lang’s best noir crime films of the 1950s, 'While the City Sleeps' is a significant film in anticipating future trends of the genre.\"[10]\n\nUnavailable on home video for many years following a VHS release in the 1990s, in 2010 While the City Sleeps became available on DVD in the UK by Exposure Cinema. In 2011 it was released in the U.S. on DVD-R by the Warner Archive Collection (WAC). Internet review site DVD Beaver compared these releases, citing the Exposure release as superior due to the Warner Archive release being \"Single-layered and significantly softer. It also has some brightness boosting.\" The reviewer, Gary Tooze, also states that \"There are no extras, not even the trailer that is available on [the] Exposure disc\". The Exposure Cinema release is open-matte, while the Warner Archive release is in Superscope. Warner Archive released a region-free Blu-ray on March 13, 2018, about which Tooze concludes, \"I love the film, but the HD - superior in quality - is a part of an underwhelming package - yet we must own it with no signs of a more complete Blu-ray release in the future, unless it comes from the UK or France.\"[11]\n",
  "concepts": [
    "While the City Sleeps (1956 film)"
  ],
  "findings": [
    "Plot",
    "Cast",
    "Background",
    "Reception",
    "Home media",
    "See also",
    "References",
    "Further reading",
    "External links"
  ],
  "timestamp": "2025-04-11T10:16:02.448446"
}