{
  "title": "Hairan I",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Hairan_I",
  "content": "Septimius Herodianus or Hairan I (Palmyrene Aramaic: 𐡧𐡩𐡴𐡭‎, Ḥairan; c. 240 – 267) was a son and co-king of Odaenathus of Palmyra. Through his father's marriage to Zenobia, Hairan I had two half-brothers, Hairan II[1] and Vaballathus.\n\nHairan was born to Odaenathus and his first wife, whose name is unknown, and he was chosen early in his father's career to be his successor. In 251 he was mentioned in an inscription together with his father as senators and exarchs of Palmyra. Hairan was crowned king by his father; the evidence for the crowning is a dedication found inscribed on a statue base from Palmyra which is undated.[2] However, the dedication was made by Septimius Worod as the duumviri of Palmyra, an office occupied by Worod between 263 and 264. Hence, the coronation took place c. 263.[3] The dedication implied that Hairan defeated a Persian army on the Orontes River.[4]\n\nThe inscription celebrating Hairan's coronation called him Herodianus.[5] It is possible that Hairan of the 251 inscription is not the same as Herodianus of the 263 dedication,[5] but this is not accepted by Udo Hartmann who concludes that the reason for the difference in the spelling is due to the language used in the inscription (Herodianus being the Greek version),[6] meaning that Odaenathus' eldest son and co-king was Hairan Herodianus.[7]\n\nHairan was probably murdered with his father in 267. It is uncertain who murdered them. The Byzantine chronicler Joannes Zonaras wrote that a cousin Maeonius was the murderer while the unreliable Historia Augusta suggested that Odaenathus' wife Zenobia was an instigator. Another possibility is that the murders were organized by Emperor Gallienus who feared that Odaenathus was becoming too powerful.\n",
  "concepts": [
    "Hairan I",
    "hairan",
    "odaenathus",
    "herodianus",
    "father",
    "palmyra",
    "inscription",
    "dedication",
    "king",
    "263",
    "zenobia"
  ],
  "findings": [
    "Life",
    "See also",
    "References",
    "Sources"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:55:20.219098"
}