{
  "title": "Suresh Navaratnam",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Suresh_Navaratnam",
  "content": "Suresh Navaratnam (born 7 October 1975) is a Malaysian cricketer.[1] A right-handed batsman and right-arm medium pace bowler,[2] he has played more than 100 times for the Malaysia national cricket team[3] since making his debut in 1993,[4] scoring more runs and taking more wickets than any other player for Malaysia.[1]\n\nBorn in Selangor in 1975,[2] Navaratnam made his debut for Malaysia in 1993, playing in that year's Saudara Cup match against Singapore.[5] He represented Malaysia at the 1994 ICC Trophy in Nairobi, Kenya,[6] also playing again in the Suadara Cup match that year.[5]\n\nHe played in the Stan Nagaiah Trophy series against Singapore for the first time in 1995, also playing in the Saudara Cup match that year. He repeated these tournaments the following year, also playing for a Malaysia Invitation VIII in the International Super 8s[5] and in the first ACC Trophy.[7] Malaysia hosted the ICC Trophy in 1997 and Navaratnam played in seven matches in the tournament.[6] He also played in that year's Saudara Cup match.[5]\n\nIn 1998, after played in the Stan Nagaiah Trophy and Saudara Cup[5] Navaratnam made his List A debut, playing matches against Sri Lanka, Zimbabwe and Jamaica as part of the cricket tournament in the 1998 Commonwealth Games, hosted in Kuala Lumpur.[8] This was followed by the ACC Trophy in Nepal. His last appearance for Malaysia in the 1990s was in the Stan Nagaiah Trophy series of 1999.[5]\n\nIn 2000, Navaratnam played two matches in the Stan Nagaiah Trophy series and the Saudara Cup before playing in that year's ACC Trophy. He played in the Saudara Cup match and ICC Trophy in 2001, and played in both the Saudara Cup and Stan Nagaiah Trophy in 2002, also playing in the ACC Trophy that year,[5] an event for which he was named man of the series.[9] He missed the Suadara Cup match in 2003, but did play in the Stan Nagaiah Trophy, also representing Malaysia against the ECB National Academy.[5]\n\nHe made his first-class debut in 2004, playing ICC Intercontinental Cup matches against Nepal and the UAE.[10] He also played in that year's Stan Nagaiah Trophy, Saudara Cup and ACC Trophy, in addition to an ACC Fast Track Countries Tournament match against Hong Kong.\n\nIn 2005, he again played in both the Stan Nagaiah Trophy and Saudara Cup in addition to ACC Fast Track Countries Tournament matches against Singapore, Hong Kong and Nepal. He missed the Saudara Cup match in 2006, but did play in that year's Stan Nagaiah Trophy, also playing in the ACC Trophy that year as well as ACC Fast Track Countries Tournament matches against Hong Kong and Nepal. The following year, he played an ACC Premier League match against the UAE and the Saudara Cup match against Singapore. He most recently represented his country at the 2007 ACC Twenty20 Cup.[5]\n\nDuring the off season in Malaysia, Suresh have featured as a professional player for Mulgrave Cricket Club in the eastern suburbs of Melbourne, Victoria.\n\nSuresh Navaratnam is the highest capped player for Malaysia and he has scored more runs and took more wickets than anyone in representative matches for Malaysia.[11] He then continued to represent the country in the World Cricket League & Asian Cricket Council tournaments from 2009 - 2014.\n\nIn 2014 upon the completion of World Cricket League division 3 in Kuala Lumpur, Suresh finally bid farewell to international cricket and is to be said being involve in various development programs to help the growth of the game in Malaysia.\n\nBy the end of 2006, Navaratnam had played more than 100 matches for the national team, scoring more runs and taking more wickets than any other player for Malaysia. In 25 two-innings matches, he had scored 918 runs at an average of 22.39 and took 83 wickets at an average of 21.91. In 94 limited overs matches he had scored 2,444 runs at an average of 35.94 and taken 141 wickets at an average of 17.61.[3]\n",
  "concepts": [
    "Suresh Navaratnam"
  ],
  "findings": [
    "Biography",
    "Early career",
    "Later career",
    "Statistics",
    "References"
  ],
  "timestamp": "2025-04-11T10:07:40.105162"
}