{
  "title": "Molly Tuttle",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Molly_Tuttle",
  "content": "Molly Rose Tuttle (born January 14, 1993)[1] is an American vocalist, songwriter, guitarist, banjo player, recording artist, and teacher in the bluegrass tradition. She is noted for her flatpicking, clawhammer,[2] and crosspicking[3] guitar prowess. She has cited Laurie Lewis, Kathy Kallick, Alison Krauss and Hazel Dickens as role models.[4] In 2017, Tuttle was the first woman to win the International Bluegrass Music Association's Guitar Player of the Year award.[5] In 2018 she won the award again, along with being named the Americana Music Association's Instrumentalist of the Year. In 2023, Tuttle won the Best Bluegrass Album for Crooked Tree and also received a nomination for the all-genre Best New Artist award at the 65th Annual Grammy Awards.[6]  Also in 2023, Tuttle and Golden Highway won International Bluegrass Music Awards for album Crooked Tree and the title track in the categories of Album of the Year and Song of the Year, respectively, while Tuttle won Female Vocalist of the Year.[7]\n\nBorn in Santa Clara, California and raised in Palo Alto, Tuttle began playing guitar at age 8.[8][9][10] At age 11, she played onstage with her father Jack Tuttle, a bluegrass multi-instrumentalist and instructor.[10] At age 15, she joined her family band The Tuttles with AJ Lee. Her siblings Sullivan (guitar) and Michael (mandolin), and mandolist AJ Lee[11] are also in the band.[12]\n\nIn 2006, at age 13, Tuttle recorded The Old Apple Tree with her dad, an album of duets.[13] Tuttle graduated from Palo Alto High School in 2011.[14][15]\n\nIn 2011, the Tuttles self-released their Introducing the Tuttles album,[16] and the Endless Ocean album in 2013.[17]\n\nIn 2012, Tuttle was awarded merit scholarships to the Berklee College of Music for music and composition,[18] received the Foundation for Bluegrass Music's first Hazel Dickens Memorial Scholarship,[19] won the Chris Austin Songwriting Competition at the Merlefest Music Festival,[20] and appeared with her dad on A Prairie Home Companion.[21]\n\nWhile studying at the Berklee College of Music, in 2014, Tuttle met and joined the all-female bluegrass group the Goodbye Girls.[20] They combine bluegrass, jazz, and Swedish folk music.[22] Other members are Allison de Groot (banjo), Lena Jonsson (fiddle), and Brittany Karlson (bass). They released an EP Going to Boston in 2014, and the album Snowy Side of the Mountain in 2016.[23] The band has also toured Jonsson's home country Sweden several times.[24]\n\nTuttle also recorded Molly Tuttle & John Mailander, a duet EP with fiddler John Mailander.[25]\n\nIn 2018, she joined Alison Brown, Missy Raines, Sierra Hull, and Becky Buller in a supergroup. The quintet performed at the Rockygrass Festival in Lyons, Colorado on July 27, 2018. Initially known as the Julia Belles, the group later became known as the First Ladies of Bluegrass. Additional gigs were booked at Analog at the Hutton Hotel in Nashville on September 18, 2018 and the IBMA Wide Open Bluegrass Festival on September 28, 2018. She also collaborated with Billy Strings on the songs \"Sittin' on Top of the World\" and \"Billy in the Lowground.\"\n\nThe First Ladies of Bluegrass are featured on the first single from a full-length CD by Missy Raines titled Royal Traveler released in 2018 on Compass Records.[26]\n\nIn 2015, Tuttle moved from Boston to Nashville.[27] Her EP Rise was released in 2017 after a crowdfunding campaign. She wrote all of the songs on the 7-song album, which was produced by Kai Welch.[28] Guests included Darrell Scott, the Milk Carton Kids, Kathy Kallick, and Nathaniel Smith.[29] She formed The Molly Tuttle Band, which included Wes Corbett (banjo), Joe K. Walsh (mandolin), and Hasee Ciaccio (bass).[20] Tuttle was selected by Buddy Miller to join his \"Cavalcade of Stars\" section of Hardly Strictly Bluegrass on the Rooster Stage on October 6, 2018.\n\nIn 2017, Tuttle signed with Alison Brown's Compass Records.[30][31]  Tuttle released her debut album When You're Ready via Compass Records on April 5, 2019. Next she released ... but I'd rather be with you again on Compass Records in August 2020.[32]\n\nIn 2021, Tuttle assembled with her new \"dream\" band, Golden Highway, including Shelby Means on bass, Kyle Tuttle on banjo, Bronwyn Keith-Hynes on fiddle, and Dominick Leslie on mandolin, with everyone sharing or supporting vocals. In January 2022, Nonesuch Records announced a release by Molly Tuttle & Golden Highway titled Crooked Tree on April 1, 2022. Their follow-up album, City of Gold, was released in July 2023.[33]\n\nTuttle was diagnosed with alopecia areata when she was three years old, which quickly progressed to alopecia universalis, resulting in total body hair loss.[34]\n\n^ A. with Missy Raines, Alison Brown, Becky Buller and Sierra Hull\n^ B. Molly Tuttle (artist), Molly Tuttle/Sarah Siskind (writer)\n^ C. with Roland White, Justin Hiltner, Jon Weisberger and Patrick McAvinue \n^ D. with Peter Rowan and Lindsay Lou\n",
  "concepts": [
    "Molly Tuttle"
  ],
  "findings": [
    "Biography",
    "Early career",
    "Collaborations",
    "Solo career",
    "Golden Highway",
    "Personal life",
    "Discography",
    "Solo albums",
    "The Goodbye Girls",
    "Molly Tuttle and John Mailander",
    "The Tuttles With AJ Lee",
    "Molly and Jack Tuttle",
    "As a featured artist",
    "Awards and nominations",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:08:50.465343"
}