{
  "title": "Arthur N. Young",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Arthur_N._Young",
  "content": "Arthur Nichols Young (November 21, 1890 – July 19, 1984) was an American economist and U.S. government official who specialized in international economics. He served as an economic adviser to foreign governments, including Argentina, Burma, China, Germany, Honduras, Indonesia, Mexico, Peru, and Saudi Arabia. Young also served as a technical consultant to the Chinese delegation at the 1944 Bretton Woods Conference.[1]\n\nYoung was born in Los Angeles, California and attended Occidental College (A.B., 1910), which his father helped to establish.[2] He conducted attended Princeton University's Department of Economics (A.M., 1911; Ph.D., 1914) where he studied under monetarist economists, Frank Fetter and Edwin Kemmerer.[3] Following graduation, he became a professor of economics at Presbyterian College (1912–1913) before returning to Princeton as an instructor (1915–1917). He also attended graduate school at the George Washington University (L.L.B., 1927).[4]\n\nHis brother, John Parke Young, was a notable economist and a secretary at the Bretton Woods Conference.[5]\n\nYoung worked in various government agencies, including the War Trade Board and the Department of Commerce. In 1922, Young began working as an economist in the State Department. He resigned in 1929 to conduct a financial mission to China with Kemmerer.[6]\n\nIn 1918, Young worked as an adviser on taxation and public finance to the government of Mexico. While helping to reform the tax system, he also sought to improve relations between Washington and President Venustiano Carranza.[7]\n\nHe also served as an adviser to the government of Honduras (1920–1921). The Honduras government, operating on two currency systems (the U.S. dollar and the local silver currency), asked Young to write a rehabilitation plan for the domestic economy.[8]\n\nIn 1924, Young advised the Dawes Commission, which was tasked with reforming Germany's public finance. At the request of Secretary of State Charles Evans Hughes, he began work as an economic adviser for the Reparations Commission in Paris.[9] He served as a technical adviser to the members of the 1924 Dawes Commission, which focused on renegotiating German reparation payments. His goal was to facilitate reparation payments, while also appeasing Franco-Belgian demands following the occupation of the Ruhr.[10]\n\nYoung served as an economic adviser to help establish the Central Reserve Bank of China in 1936.[4] He served as a permanent adviser to Chiang Kai-shek from 1929 to 1947.[11] During World War II, he served as Chairman of the Commission on Relief and Rehabilitation. He also served as the director of the China National Aviation Corporation. He also worked at various institutions and organizations in China, including as Vice President of the Chinese-American Institute of Cultural Relations, Trustee of the China Foundation, and Chairman of the American Relief and Red Cross. Young left China in part due to several health conditions for which he sought treatment in the United States and in part due to his pessimism regarding China's financial position and its financial policies under Chiang's Nationalist government.[12]: 111  Young became particularly disillusioned with T.V. Soong, who in Young's view spent money recklessly.[12]: 114 \n\nIn 1951, Young conducted an advisory mission to Saudi Arabia, where he was appointed Director of the Point Four program, a series of technical recommendations for developing countries outlined by President Harry S. Truman in January 1949. King Abd al-Aziz appointed him and a commission of economists to reform the budgetary and monetary systems.[13] While Young's original plan was to create a central bank, he later drafted a charter for the creation of a currency board, the Saudi Arabian Monetary Agency, in 1952.[14] He believed that the monetary arrangement would have helped to prevent the government from printing more money, thereby causing inflation.[15]\n\nYoung later served as a consultant to the government of Argentina (1962–1963).\n\nFollowing his return to the US in 1958, Young served as a financial consultant and lecturer at Occidental College.\n\nHe died on July 19, 1984, in a retirement home in Claremont, California.\n",
  "concepts": [
    "Arthur N. Young",
    "young",
    "served",
    "government",
    "china",
    "adviser",
    "commission",
    "financial",
    "young served",
    "worked",
    "technical"
  ],
  "findings": [
    "Early life and education",
    "Government service",
    "Foreign adviser",
    "Retirement",
    "Publications",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:19.185355"
}