{
  "title": "Jack McGee (actor)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jack_McGee_(actor)",
  "content": "Jack McGee (born February 2, 1949) is an American television and film character actor. He has appeared in over 100 films and television series.[1]\n\nKnown for his gravelly raspy voice, McGee tends to play gruff, blue-collar type characters. He is best known as Chief Jerry Reilly on the television series Rescue Me. He was a regular cast member on the FX series for three seasons. In 2010, he co-starred as Hickey on the Spike TV comedy series Players.\n\nMcGee was born in the South Bronx, New York, the youngest of eight children. He attended Cardinal Hayes High School in the Bronx, where he was class president and also played on the Football team, and appeared as a member of the background harmony in The Young Rascals. In 1977, he became a firefighter for the New York City Fire Department in order to pursue his acting career.[citation needed] As a firefighter, he served with FDNY Engine Company 38 and Ladder Company 51 in the Bronx. In the TV Series Rescue Me, he portrayed FDNY 15th Battalion Chief Jerry Reilly. His first wife was Eileen. His first major role was in the 1985 firefighter film Turk 182.[1][2]\n\nMcGee provided the voice for Mr. White in the 2006 Reservoir Dogs video game. He also is the voice of Big Ed in the game Real Heroes: Firefighter, as well as Otis Schmidt, the driver and engineer in the movie Backdraft.\n\nMcGee is a colon cancer survivor, and is committed to several cancer organizations, particularly the WeSpark Cancer Support Center, where his wife Stephanie serves as Guest Services Manager.[3] McGee also supports Autism Speaks, the American Cancer Society, Susan G. Komen for the Cure, the Michael J. Fox Foundation and the Leary Firefighters Foundation.[1]\n",
  "concepts": [
    "Jack McGee (actor)",
    "mcgee",
    "series",
    "firefighter",
    "cancer",
    "voice",
    "television",
    "bronx",
    "york",
    "wife",
    "tv"
  ],
  "findings": [
    "Life and career",
    "Filmography",
    "Films",
    "Television",
    "Public service announcements (PSAs)",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:37:00.257142"
}