{
  "title": "1999 All-Ireland Senior Camogie Championship",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/1999_All-Ireland_Senior_Camogie_Championship",
  "content": "The 1999 All-Ireland Senior Camogie Championship—known as the Bórd na Gaeilge All-Ireland Senior Camogie Championship for sponsorship reasons—was the high point of the 1999 season and the first final to be played with 15 players a side. The championship was won by Tipperary who defeated Kilkenny by a single point margin in the final. It was Tipeprary's first success after seven previous final losses. The attendance, a then record of 15,084, included President Mary McAleese and Taoiseach Bertie Ahern.[1][2]\n\nAfter Tipperary's humiliating 9-19 to 2-4 defeat to Cork in the National Camogie League final in Thurles in May, Biddy Phillips called in Michael Cleary and Colm Bonnar as team coaches to help rebuild the team's confidence. They bounced back with a 1-18 to 1-6 championship opening round victory over Clare.\n\nWinners of the All-Ireland intermediate championship in 1998, Donna Greeran‘s Down were heavily defeated in the semi-final against Tipperary at Parnell Park. The second 15-a-side semi-final between Cork and Kilkenny at Nowlan Park was one of the best in the game's history and a great advertisement for the 15-a-side game. Cork held the lead until seconds from the final whistle. Sinéad Millea sent a fifty-five metre free through three Cork defenders into the net to give Kilkenny a two-point victory.\n\nSinead Millea created the only goal in the final, four minutes before half-time, that, unjustly, had Tipp behind at the interval (1-5 to 0-7). Her free was blocked by a cluster of bodies, and in the scramble, 16-year-old Lizzie Lyng managed to guide the sliotar to the net.\n\nIn first half injury time, Niamh Harkin's drive was inches away from the Kilkenny net. Eleven minutes into the second period, as Kilkenny led by two points 1-7 to 0-8 Kilkenny introduced Ann Downey who was seeking her 13th All-Ireland medal. Tipperary were again denied a goal after 43 minutes when Emer McDonnell's strike came back off the bar.\n\nA point from Deirdre Hughes from a tight angle just in front of the New Cusack Stand and another from Noelle Kennedy tied up the scores at 1-7 to 0-10. The teams remained level  for 13 minutes. Two minutes from time, a deflected free from Catherina Hennessy produced the save of the day from Kilkenny goalkeeper, Miriam Holland, at the expense of a '45.\n\nTwo minutes into additional time, Catherina Hennessy, from some 30 yards, and to the left of the posts, sent over the winning point. Millea had a difficult, last chance of forcing a replay, but her free from the half-way line dropped short and the glory went to Tipperary.\n\nAnn Downey announced her retirement after the match having won 12 All-Ireland senior medals, 9 National Camogie League medals, seven All-Ireland club medals and 10 Gael Linn Cup medals, having represented Ireland at squash and played inter-provincial hockey.\nTipperary manager Biddy Phillips said after the match:\n\n\"It was everyone's dream in Tipperary to win the All-Ireland camogie title, and this will be a major boost to the game in the county. I felt it was one of the best All-Irelands that I have seen, and at half-time we told the girls just to keep digging in there and it would come right.\"",
  "concepts": [
    "1999 All-Ireland Senior Camogie Championship"
  ],
  "findings": [
    "National League",
    "Semi-finals",
    "Final",
    "Aftermath",
    "Final stages",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:14:28.413806"
}