{
  "title": "Kwamie Lassiter",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Kwamie_Lassiter",
  "content": "Kwamie Lassiter (December 3, 1969 – January 6, 2019) was an American professional football safety. He was signed by the Arizona Cardinals as an undrafted free agent in 1995. He played college football at Kansas.\n\nBorn in Hampton, Virginia, Lassiter graduated from Menchville High School in Newport News, Virginia in 1989.[1]\n\nLassiter played his first two years of college football at Butler County Community College in 1989 and 1990 before transferring to the University of Kansas in 1991. He sat out the 1991 season, played at Kansas from 1992 to 1994, and graduated with a degree in communications.[1][2] After Lassiter suffered a broken collarbone by the third game of the 1993 season, the NCAA granted Lassiter a sixth year of eligibility.[2]\n\nLassiter played for the Arizona Cardinals from 1995 to 2002, San Diego Chargers in 2003 and St. Louis Rams in 2004. He finished his career with 609 tackles (437 solo tackles), 25 interceptions, and four sacks.[3]\n\nIn the Cardinals' final regular season game of the 1998 season, a 16-13 victory over the San Diego Chargers that clinched the Cardinals' first playoff berth in 15 years, Lassiter intercepted Chargers quarterback Craig Whelihan four times.[4]\n\nAfter the 2001 season, Lassiter was selected as an alternate for the 2002 Pro Bowl after reaching career highs with 112 tackles and 9 interceptions.[1]\n\nLassiter spent the 2003 season with the Chargers, but he was cut during the 2004 preseason. The St. Louis Rams signed Lassiter on September 21, 2004.[1]\n\nFrom 2006 to 2008, Lassiter was a pregame and postgame host for the Arizona Cardinals Radio Network.\n\nFrom 2009 until his death, Lassiter hosted Kwamie Lassiter's Sports Talk on the VoiceAmerica Internet radio network.[5]\n\nFrom 2010 until his death, Lassiter was president of the NFL Alumni chapter in Arizona.\n\nFrom 2009 to 2010, Lassiter was defensive backs coach at Mesa Community College.[6][7] In 2012, Lassiter became defensive backs coach for the Las Vegas Locomotives of the UFL.\n\nThree of Lassiter's sons, Kwamie II, Darius and Kwinton, have played college football or in the NFL. Kwamie II plays for the Cincinnati Bengals, having played college football at his father's alma mater Kansas. Kwinton also plays at Kansas,[8] while Darius plays for BYU[9]\n\nLassiter's daughter, Darian, is a professional dancer who was on the Arizona Cardinals cheerleaders, the Phoenix Suns dance team, and ultimately a member of the Dallas Cowboys Cheerleaders, appearing on season 15 of their reality television show Dallas Cowboys Cheerleaders: Making the Team.\n\nOn January 6, 2019, Lassiter died unexpectedly at age 49. He succumbed to a heart attack suffered while working out.[10]\n",
  "concepts": [
    "Kwamie Lassiter",
    "lassiter",
    "season",
    "played",
    "college",
    "cardinals",
    "kansas",
    "football",
    "arizona",
    "kwamie",
    "college football"
  ],
  "findings": [
    "Early life",
    "College career",
    "Professional career",
    "NFL statistics",
    "Post-playing career",
    "Personal life",
    "Death",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:34:47.524991"
}