{
  "title": "Straight to the Point (Art Porter album)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Straight_to_the_Point_(Art_Porter_album)",
  "content": "Straight to the Point is the second album by jazz saxophonist Art Porter Jr., released in June 1993.[3] The album represents a continuation of the smooth jazz and jazz fusion sound that Porter established in 1992 with Pocket City, which he would continue on both of his subsequent albums: Undercover and Lay Your Hands On Me.[4] Zan Stewart reviewed the album for Los Angeles Times, saying it had \"solid moments... but just not enough of them.\"[5]\n\nStraight to the Point entered Billboard's Top R&B chart on July 10, 1993, at number 75,[6] at the same time it was listed on the Top Contemporary Jazz Albums chart, where it stayed for the next 26 weeks.[7] The album sold almost 100,000 units by October 1993. Porter said, \"this music is entertaining and it has energy. It definitely has a groove, and we play it with integrity.\"[8] He said he was not choosing to play smooth jazz simply because it was profitable. \"This kind of music is more popular than mainstream jazz is now, and there may be more of a financial return playing it, but I do this because I enjoy playing this stuff. I’ve always liked Earth, Wind & Fire and Stevie Wonder. I’m open about music. I think you can love one kind as much as the other.\"[8]\n\nIn late 1992, Porter recorded two saxophone tracks for Jeff Lorber's Worth Waiting For album, and he began his new 1993 album project with Lorber as producer. Porter started the year by playing \"Amazing Grace\" with his father, Art Porter Sr., at the inaugural prayer breakfast for Bill Clinton on January 20, 1993.[9] Porter's father was fighting lung cancer and was too weak to travel to the Pacific Palisades neighborhood of Los Angeles to record at Lorber's JHL Sound studio, but he recorded a piano part for \"Autumn in Europe\" in Arkansas, where he lived. The completed album was released in June, and Porter started touring, opening for the Neville Brothers to support the album.[10] Porter's father died of cancer on July 22, 1993.[9] Porter canceled tour dates to attend to his family and established a nonprofit group called Art Porter Sr. Music Education to provide scholarships to music students, and to honor the memory of his father. The foundation changed its name in 2011 to Art Porter Music Education, to honor both father and son.[11]\n",
  "concepts": [
    "Straight to the Point (Art Porter album)",
    "porter",
    "album",
    "music",
    "jazz",
    "1993",
    "father",
    "art porter",
    "art",
    "playing",
    "lorber"
  ],
  "findings": [
    "Track listing",
    "Personnel",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:20.316681"
}