{
  "title": "USS General W. C. Langfitt",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/USS_General_W._C._Langfitt",
  "content": "USS General W. C. Langfitt (AP-151) was a General G. O. Squier-class transport ship for the U.S. Navy in World War II. She was named in honor of U.S. Army general William Campbell Langfitt. She was transferred to the U.S. Army as USAT General W. C. Langfitt in 1946. On 1 March 1950 she was transferred to the Military Sea Transportation Service (MSTS) as USNS General W. C. Langfitt (T-AP-151). She was later sold for commercial operation under the name SS Transindiana,[2] before ultimately being scrapped in 1983.[1]\n\nGeneral W. C. Langfitt (AP-151) was launched under Maritime Commission contract (MC #703) 17 July 1944 by the Kaiser Co., Inc., Yard 3, Richmond, California; sponsored by Mrs. William E. Lynd; acquired by the Navy and simultaneously commissioned 30 September 1944.\n\nAfter shakedown, General W. C. Langfitt embarked marines and departed San Diego 10 November 1944 for Eniwetok and Saipan via Pearl Harbor. Returning to San Francisco 5 January 1945, she embarked troops and sailed 19 January for the Western Pacific where she shuttled troops to Finschhafen and Hollandia, New Guinea; Leyte, Philippines; Ulithi, Caroline Islands; and Kossol Roads, Palaus. Loaded with medical patients and returning veterans, she departed Hollandia for the United States 22 March and arrived San Francisco 10 April. On the 21st, the busy ship again sailed for the Western Pacific; and, after steaming via Pearl Harbor to the Admiralty Islands, the Philippines, and the Marshalls, she returned 2,302 passengers to San Francisco, arriving 11 June. Having contributed so much to the rising tide of victory in the Pacific, she sailed 15 June for Norfolk, reaching there 30 June.\n\nGeneral W. C. Langfitt departed 16 July for France, where on the 26th she embarked troops at Marseilles for redeployment to the Pacific. She departed 28 July and sailed via the Panama Canal to Hollandia and points in the Philippines. As a unit of the \"Magic Carpet\" fleet, she departed Leyte 18 September, arriving Seattle 3 October. The transport departed again for the Western Pacific 25 October; carried occupation troops to Nagoya, Japan; and steamed to the Philippines before returning to San Francisco 10 December. Between 22 December and 16 April 1946 General W. C. Langfitt made two more \"Magic Carpet\" voyages to the Philippines and back bringing home thousands of veterans. After returning to San Francisco 16 April, she steamed to New York where she arrived 20 May. She decommissioned there 6 June 1946 and was returned to WSA for use by the Army Transport Service.\n\nIn February 1949 the General W. C. Langfitt left Bremerhaven with European immigrants and arrived in Buenos Aires on 25 March 1949.\nOn 22 May 1949 USAT General W. C. Langfitt left Naples with 826 displaced persons from Europe and arrived in Melbourne on 17 June 1949.[3] This voyage was one of almost 150 \"Fifth Fleet\" voyages by some 40 ships bringing refugees of World War II to Australia.[4] General W. C. Langfitt made two more such trips to Melbourne with 826 refugees on 22 September 1949, and with 1,282 on 14 January 1950.[4]\n\nThe fourth and final group taken to Australia by General W. C. Langfitt arrived in Fremantle on 18 February 1950 and consisted of 1,118 displaced persons of Polish descent. The group embarked on their voyage in Mombasa, Kenya in late January and early February 1950. This particular group of migrants, referred to as \"The General Langfitt Group\", was chronicled in the 1995 book The General Langfitt story: Polish refugees recount their experiences of exile, dispersal, and resettlement. The book tells the story of the group's exile in the Soviet Union and journeys that took them from that country to Iran, India, East Africa, and finally Australia.[5]\n\nGeneral W. C. Langfitt was reacquired by the Navy 1 March 1950 for assignment as an overseas transport under MSTS.[citation needed] She undertook the job of carrying troops, dependents, and even refugees to the far corners of the world, making round-the-world voyages in 1952 and 1953. Between 24 November 1954 and 30 April 1957 she made 32 voyages from New York to Bremerhaven, Germany, and back, carrying European refugees to the United States under the Refugees Relief Act.[citation needed] Following the 1956 Hungarian Revolution, she operated with MSTS transport USNS General Harry Taylor (T-AP-145) and brought over 45,000 Hungarian refugees to the United States. Since she was making the trips back to Europe empty she was used to carry American Field Service students to Europe during early summer of 1955.\n\nAfter carrying additional refugees from Europe to Australia during May and June 1957, General W. C. Langfitt arrived New York 13 July and was inactivated there 30 September. Transferred to the Maritime Administration on 13 May 1958, she was berthed with the National Defense Reserve Fleet, James River, Virginia.\n\nIn 1968 the ship was sold to Hudson Waterways Corporation of New York and rebuilt as a 13,489-ton, 633-foot (193 m) container vessel by the Maryland Shipbuilding and Drydock Co. of Baltimore. She entered commercial service as SS Transindiana, USCG ON 513582, IMO 6904844, in December 1969.[1] and began hauling containerized cargo for Seatrain Lines. The ship can be seen in the Hawaii 5-0 episode \"The Odd Lot Caper\" which aired 30 January 1973. The ship was laid up at New York in November 1978,[2] and scrapped at Brownsville, Texas in 1983.[1][6]\n",
  "concepts": [
    "USS General W. C. Langfitt",
    "general",
    "langfitt",
    "general langfitt",
    "refugees",
    "san",
    "new",
    "june",
    "departed",
    "arrived",
    "york"
  ],
  "findings": [
    "Operational history",
    "References",
    "Further reading",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:30:50.278739"
}