{
  "title": "Kathleen Syme",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Kathleen_Syme",
  "content": "Kathleen Alice Syme O.B.E. (15 February 1896 –  3 September 1977) was an Australian journalist, company director and welfare worker.[1][2]\n\nSyme was born on 15 February 1896 in Lilydale, Victoria. Her parents, Arthur Edward Syme and Amy Syme (née Horne), were both born in Victoria. Alice received her education at Lauriston Girls' School and went on to attend the University of Melbourne. She obtained her Bachelor of Arts degree in 1919, followed by a Master of Arts in 1921, and a Bachelor of Laws in 1923. Following in the footsteps of her grandfather, David Syme, Alice pursued a career in journalism and editing at The Age newspaper.[3][4]\n\nIn 1943, she retired from her editing career and assumed the role of trustee for the David Syme and the David Syme Charitable trusts, taking over her father's position. From 1967, she chaired both trusts. Additionally, she became a director of David Syme & Co. Ltd in 1948. Throughout her time on the board, she was highly regarded and respected by the staff of the Age. She remained an active member until 1971.[5]\n\nUntil the end of her life, Syme took pride in identifying herself as a journalist. However, she dedicated her later years to institutions that focused on the well-being of others, particularly women. During her time as a student, she played a significant role in advocating for a residential college for female students by signing a petition. Her persuasive efforts eventually led to the establishment of University Women's College two decades later. Serving as a council member from 1943 to 1974 and as president from 1947 to 1954, she gained valuable experience that would support her second career. She was also a founding member of the Victorian Women Graduates' Association, which honored her contributions to advancing educational opportunities for women by naming a research scholarship after her in 1967.[6][7]\n\nSyme became a member of the (Royal) Women's Hospital board in 1949 and later served as president from 1956 to 1959. Additionally, she took on the role of trustee for the Vera Scantlebury Brown Child Welfare Memorial Trust, an organization that provided funding for medical professionals and welfare workers to pursue overseas studies. Driven by her desire to assist individuals throughout their entire lives, from infancy to old age, Syme then directed her efforts towards the elderly. She joined the board of Greenvale Village for the Aged when it was established in 1954 and held the position of vice-president from 1961 to 1975. Recognized for her astute and effective leadership, she firmly believed that the voluntary committees she served on embodied the most valuable aspects of humanity.[8]\n\n'Kathleen Syme Library and Community Centre' The library was named after Kathleen Alice Syme.[9] The education centre at the Royal Women's Hospital was named after her.[10]\n\nSyme was appointed O.B.E. in 1968.[11]\n\nSyme died on 3 September 1977 in East Melbourne and was cremated with Anglican rites. \n",
  "concepts": [
    "Kathleen Syme",
    "syme",
    "women",
    "member",
    "david syme",
    "david",
    "alice",
    "welfare",
    "role",
    "president",
    "later"
  ],
  "findings": [
    "Early life and education",
    "Life",
    "Legacy",
    "Awards",
    "Death",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:31.769835"
}