{
  "title": "Divestment",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Divestment",
  "content": "In finance and economics, divestment or divestiture is the reduction of some kind of asset for financial, ethical, or political objectives or sale of an existing business by a firm. A divestment is the opposite of an investment. Divestiture is an adaptive change and adjustment of a company's ownership and business portfolio made to confront with internal and external changes.[1]\n\nFirms may have several motives for divestitures:\n\nOften the term is used as a means to grow financially in which a company sells off a business unit in order to focus their resources on a market it judges to be more profitable, or promising. Sometimes, such an action can be a spin-off. In the United States, divestment of certain parts of a company can occur when required by the Federal Trade Commission before a merger with another firm is approved. A company can divest assets to wholly owned subsidiaries.\n\nIt is a process of selling an asset. \nThe largest corporate divestiture in history was the 1984 U.S. Department of Justice-mandated breakup of the Bell System into AT&T and the seven Baby Bells.\n\nOf the 1000 largest global companies, those that are actively involved in both acquiring and divesting create as much as 1.5 to 4.7 percentage points higher shareholder returns than those primarily focused on acquisitions.[2]\n\nExamples of divestment for social goals include:\n\nSome firms are using technology to facilitate the process of divesting some divisions. They post the information about any division that they wish to sell on their website so that it is available to any firm that may be interested in buying the division. For example, Alcoa has established an online showroom of the divisions that are for sale. By communicating the information online, Alcoa has reduced its hotel, travel, and meeting expenses.\n\nFirms use transitional service agreements to increase the strategic benefits of divestitures.\n\nDivestment execution includes five critical work streams: governance, tax, carve-out financial statements, deal-basis information, and operational separation.[6] Companies often create cross-disciplined teams composed of IT, HR, legal, tax, and other key business units, to implement a business separation.[7]\n\nWith economic liberalization of the Indian economy, India's Ministry of Finance set up a separate Department of Disinvestments.\n",
  "concepts": [
    "Divestment",
    "divestment",
    "business",
    "company",
    "information",
    "firms",
    "firm",
    "divestiture",
    "tax",
    "separation",
    "sale"
  ],
  "findings": [
    "Motives",
    "Divestment for financial goals",
    "Divestment for social goals",
    "Method of divestment",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:26:51.528342"
}