{
  "title": "Durgavati Canal",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Durgavati_Canal",
  "content": "Durgavati Canal also known as Kudra Wier Canal or Kudra Project Canal, is a canal located in Kaimur District in Bihar (India). During the British Raj, after Punjab and Agra and Uttarakhand, the government focused on the regions of Buxar, Gazipur and Kaimur, which grew the most crops in Bihar, and Uttar Pradesh. The British and Indian governments built many canals in the 1870s-1950s to increase the irrigation of these regions, especially the parganas of Kamsar, Zamania, Sherpur, Ramgarh, Durgawati, Chainpur, Bhabua, Kudra, Kochas, Buxar and Chausa. In these regions mostly Kamsaar Raj and later Chainpur estate and Jagdishpur estate existed. These places also (excluding Buxar) made up the pargana of the Nawab of Ghazipur. These regions had 20 rivers, so irrigation was easy and many canals and tributaries were built to support and improve agriculture there.[1][2][3]\n\nThe project comprises an earthen dam on the River Durgawati (Karmanasha basin), joining Shergarh Hills on the right and Rajdeo Hills on the left. The ultimate irrigation potential of the project is 36,317 hectares. It has a width of 185 ft. The command area of this project is spread through five blocks of Kaimur and Rohtas districts. A feeder outlet in the spillway of the dam releases water to stabilize irrigation due to an old scheme viz. Kudra Weir Scheme. The command of Kudra Weir scheme (16,020 ha) has now been internalized under the command of Durgawati Reservoir Project ( 16,020 + 20,297 ha = 36,317 ha). Kudra weir project (Durgavati canal) construction began in the year 1954-55 and was completed in 1964–65. The Kudra weir and distribution system was remodelled and completed in the year 2006, in order to make available the storage of Duravati reservoir.\n\nThe Kudra weir on Durgawati river downstream of the dam is 59.741 meters long and its height above river bed level is 2.286 meter and the canal taking off from the weir is 34.778 km long with head discharge capacity of 9.34 cumec. The CCA is 21,100 hectare and potential is 16,020 hectare.\n\nThe Durgawati dam is an earthen dam whose length is 1616 meter and the height is 46.66 meter. Two canals take off from the dam. the left bank canal is 25.27 km and head discharge capacity is 6.46 cumec. The right bank main canal is 32.07 km with head discharge capacity of 13.88 cumec. The CCA from these canal system is 17,890 hectare and potential is 20,297 hectare.\n\nThe project is receiving CLA under AIBP and so far irrigation potential of 3300 hectare has been created under this project, other than that of from existing Kudra Weir.\n\nThe project has received investment clearance of Planning Commission in the year 2000 for an estimated cost of Rs 231.41 crore (1998 price level).[4][5]\n",
  "concepts": [
    "Durgavati Canal"
  ],
  "findings": [
    "Description",
    "References"
  ],
  "timestamp": "2025-04-11T10:19:29.247942"
}