{
  "title": "Ervin Nyiregyházi",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Ervin_Nyiregyházi",
  "content": "Ervin Nyiregyházi[1] (January 19, 1903, Budapest – April 8, 1987, Los Angeles) was a Hungarian and American pianist and composer. After several years on the concert stage in the 1920s, he descended into relative obscurity before briefly reemerging in the 1970s. His highly distinctive playing style, which has been seen by some as linked to the kind of Romantic pianism associated with Franz Liszt, divided critical opinion.\n\nFrom ages six to twelve, Nyiregyházi was observed by the psychologist Géza Révész and was the subject of an article and a book, published in 1911 and 1916, respectively.[2] Nyiregyházi's father, Ignácz, was a singer in the Royal Opera Chorus in Budapest; he was also very encouraging and caring but died when Ervin was twelve.  Before Ignácz's death, he reported several extraordinary things about his son: that Ervin had tried to sing before he was one year old; reproduced tunes correctly before he was two; began to compose at the age of two; played almost every song he heard correctly on a mouth-organ by the time he reached age three; and could identify any note or chord that was played for him by the age of seven.[3] He was known for his musicality just as much as his technique. On tests of general intelligence, Ervin scored a few years above average. His mother, Mária, was a stage mother who tried to dissuade him from studying opera and symphonic music and pushed her son to study the standard piano repertoire so he could concertize and make money for their family.[4] (In later years, Ervin claimed that his mother sexually molested him.)[5] Ervin eventually broke with his mother, and later expressed pleasure that she had died in a Nazi concentration camp.[6]\n\nNyiregyházi studied with Ernő Dohnányi and Frederic Lamond. At age 15, he performed Liszt's Piano Concerto in A major with the Berlin Philharmonic under Arthur Nikisch. His Carnegie Hall debut in 1920 was controversial: Richard Aldrich of the New York Times wrote of Nyiregyházi's \"brilliant technical equipment, great strength of arm and fingers, remarkable dexterity, a fine feeling for piano tone\" but criticized his \"often erratic and misleading\" conceptions of \"some of the most familiar compositions for the piano\".[7] H. T. Finck of the Evening Post praised Nyiregyházi's \"originality\" but criticized his \"arbitrary disregard of the obvious intentions of great composers.\"[8] Olin Downes, writing in the Boston Post, described Nyiregyhazi as a \"phenomenal performer\" with \"the white heat of sincerity, conviction and faith.\"[9] In a 1935 letter to Otto Klemperer, Arnold Schoenberg called Nyiregyházi:\n\na pianist who appears to be something really quite extraordinary. I had to overcome great resistance in order to go at all, for the description I'd heard from Dr. Hoffmann and from Maurice Zam had made me very skeptical. But I must say that I have never heard such a pianist before... First, he does not play at all in the style you and I strive for. And just as I did not judge him on that basis, I imagine that when you hear him, you too will be compelled to ignore all matters of principle, and probably will end up doing just as I did. For your principles would not be the proper standard to apply. What he plays is expression in the older sense of the word, nothing else; but such power of expression I have never heard before. You will disagree with his tempi as much as I did. You will also note that he often seems to give primacy to sharp contrasts at the expense of form, the latter appearing to get lost. I say appearing to; for then, in its own way, his music surprisingly regains its form, makes sense, establishes its own boundaries. The sound he brings out of the piano is unheard of, or at least I have never heard anything like it. He himself seems not to know how he produces these novel and quite incredible sounds – although he appears to be a man of intelligence and not just some flaccid dreamer. And such fullness of tone, achieved without ever becoming rough, I have never before encountered. For me, and probably for you too, it's really too much fullness, but as a whole it displays incredible novelty and persuasiveness. And above all he's only [sc. 33 years] old, so he's still got several stages of development before him, from which one may expect great things, given his point of departure...  it is amazing what he plays and how he plays it. One never senses that it is difficult, that it is technique – no, it is simply a power of the will, capable of soaring over all imaginable difficulties in the realization of an idea. – You see, I'm waxing almost poetic.[10]\nIn 1925, Nyiregyházi sued his concert manager, R. E. Johnston, alleging that accompanying singers and instrumentalists were treating him as an inferior artist. He lost the suit, and thereafter had difficulty finding concert work. In addition, Nyiregyházi, fearing comparison with other pianists, was reluctant to play standard repertoire, preferring his own transcriptions of orchestral and operatic works. By the time of Schoenberg's letter, Nyiregyházi's career seemed to be effectively over.\n\nNyiregyházi was married ten times. His first wife allegedly attacked him with a knife, leading to a messy publicized divorce. Though born into comfortable circumstances (his mother insisted that the servants tie his shoes and feed him by hand so as to relieve him of mundane concerns), he nonetheless spent the better part of his life in poverty, at times reduced to sleeping in subways.\n\nIn 1928, Nyiregyházi moved to Los Angeles and worked for a film studio, initially playing piano reductions of film scores, and later as a hand double. His hands are shown playing piano in A Song to Remember and Song of Love, among others.[11] He became friends with Bela Lugosi and Gloria Swanson, among others, but his inability to manage his affairs led not only to financial crises but also to unusual career decisions. In the 1930s, he played piano as part of a Works Progress Administration project[which?]. But the most unusual appearance was likely a 1946 recital[where?] where he was billed as \"Mr. X\" and played while wearing a black silk hood. Several listeners were able to identify Nyiregyházi by his distinctive sonority.[12] Although he continued to play occasionally, he did not own a piano for roughly 40 years.\n\nSeveral public appearances[where?] in 1972 and 1973 led to studio recordings made in 1974 and 1978 under the auspices of the International Piano Archives and the Ford Foundation. Some of these recordings were released between 1977 and 1979 on albums on the Desmar and Columbia Masterworks labels, which briefly brought Nyiregyházi back into public view.[13] An all-Liszt double album won Stereo Review's 1978 Record of the Year award.[14]\n\nCritical reaction to the recordings was sharply divided, with some claiming to hear an authentic 19th-century pianist (Harold C. Schonberg wrote, \"some critics wonder if Franz Liszt had been reincarnated\"[15]). Others denounced Nyiregyhazi's \"incredibly slipshod\" technique, \"ridiculously amateurish\" fortissimo playing,[16] \"glacial tempos and total dissociation from contemporary performance styles. But Romantic revivalists were enthralled.\"[17] In 1978, he was offered concerts at Carnegie Hall, but declined. Recitals in Japan[where?] in 1980 and 1982 were his last public appearances.\n\nNyiregyházi was also a prolific composer, writing in a Romantic style reminiscent of Liszt. Events often moved him to compose, and his works have titles such as Goetz Versus the Punks, It’s Nice to be Soused, Shotgun Wedding, and Vanishing Hope. Only a few of his compositions have been published or performed.[18]\n\nErvin Nyiregyházi died of colon cancer in 1987. He was buried in Forest Lawn Memorial Park in Glendale, California.\n\nA few of Nyiregyházi's recordings, including some live performances, have been issued on CD on the VAI, Music and Arts, and Sonetto Classics labels.\n",
  "concepts": [
    "Ervin Nyiregyházi",
    "nyiregyházi",
    "piano",
    "ervin",
    "years",
    "mother",
    "liszt",
    "heard",
    "recordings",
    "playing",
    "played"
  ],
  "findings": [
    "Childhood and early career",
    "Descent into obscurity and reemergence",
    "Death and burial",
    "Recordings",
    "Discography",
    "Biographies",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:16.323699"
}