{
  "title": "Jerwin Ancajas",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jerwin_Ancajas",
  "content": "Jerwin Juntilla Ancajas (born 1 January 1992) is a Filipino professional boxer. He held the IBF junior-bantamweight title from 2016 to 2022.\n\nJerwin was born and raised in Panabo, a suburb of Davao City, Philippines.[1] He was introduced to boxing in the second grade by his brother, Jesar. Jerwin would go on to win several national championships, including a gold medal at the Palarong Pambansa, before turning pro in 2009, at the age of 17.[2] Jerwin Ancajas has a 90–5 record in the Amateur Boxing.[3] Jerwin Ancajas currently lives in Brgy. Ramirez, Magallanes, Cavite together with his brother, Jesar Ancajas.\n\nAncajas made his professional debut in July 2009. He won his first major title; WBO Asia Pacific Youth junior-bantamweight title against Rex Tito scheduled in SM City Lipa. Jerwin Ancajas suffered a loss in his fifteenth pro bout, losing a majority decision to Mark Anthony Geraldo.\n\nHe became the IBF junior bantamweight champion when he defeated McJoe Arroyo on September 3, 2016.[4]  Ancajas earned just $3,750 for the fight.[5] He entered the fight on an 11-fight win streak.[6] Ancajas comfortably outboxed Arroyo, and dropped him in round 8 to win a unanimous decision.[7]\n\nAncajas made his first defense on January 29, 2017, beating José Alfredo Rodríguez by technical knockout, after Rodríguez was unable to continue due to injury.[8] Ancajas made a further defense in July 2017, on the undercard of Manny Pacquiao-Jeff Horn against Teiru Kinoshita. Ancajas battered Kinoshita, opening a cut over his right eye and pummeling him to the body, before dropping him in round 7 with a right hook to the body. Kinoshita beat the count but the referee stopped the fight, giving Ancajas a TKO win.[9] On November 18, 2017, Ancajas defeated Jamie Conlan with a round 6 TKO. Conlan was battered from the first round, going down after a body shot. He was dropped three more times until the referee stopped the fight. Ancajas was deducted a point in round 5 by referee Steve Gray, following a legitimate shot to Conlan's abdomen. With the win, Ancajas made his third successful title defense in 2017, all by technical knockout and in different countries.[10]\n\nIn December, it was announced that Ancajas had signed with Top Rank and would make his U.S. debut in February 2018, defending his title against Israel González in Corpus Christi, Texas.[11] On 3 February 2018, Ancajas would successfully defend his IBF belt in his US debut.[12]\n\nIn his next title defence, Ancajas faced IBF #1 ranked title contender Jonas Sultan. Ancajas won the fight comfortably, winning by a wide margin on all three scorecards, namely 119–109, 119-109 and 117–111.[13]\n\nOn 29 September 2018, Ancajas battled IBF #14 Alejandro Santiago Barrios.[14] Barrios proved a tough opponent for the IBF champion, but could only fight to a draw as Ancajas was able to keep his belt.[15]\n\nIn his next fight, Ancajas fought #1 IBF contender Ryuichi Funai.[16] Ancajas overmatched Funai for most of the fight, as Funai was able to take some of his best shots, but did not counter Ancajas with any of his own. Ancajas finished his opponent in round seven.[17]\n\nOn 7 December 2019, Ancajas had another successful title defence, this time against IBF #14 Miguel Gonzalez. Ancajas won via a sixth-round TKO.[18]\n\nAncajas was scheduled to make his ninth IBF title defense against Jonathan Javier Rodriguez on April 10, 2021.[19] He won the fight by unanimous decision, with scores of 115-112, 116-111, and 117-110.[20]\n",
  "concepts": [
    "Jerwin Ancajas"
  ],
  "findings": [
    "Personal life",
    "Professional career",
    "Professional boxing record",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:08:38.340290"
}