{
  "title": "Benue Trough",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Benue_Trough",
  "content": "The Benue Trough is a major geological structure underlying a large part of Nigeria and extending about 1,000 km northeast from the Bight of Benin to Lake Chad. It is part of the broader West and Central African Rift System.[1]\n\nThe trough has its southern limit at the northern boundary of the Niger Delta, where it dips down and is overlaid with Tertiary and more recent sediments.\nIt extends in a northeasterly direction to the Chad Basin, and is about 150 km wide.\nThe trough is arbitrarily  divided into lower, middle and upper regions, and the upper region is further divided into the Gongola and Yola arms.\nThe Anambra Basin in the west of the lower region is more recent than the rest of the trough, being formed during a later period of compression, but is considered part of the formation.[2]\n\nThe Benue Trough was formed by rifting of the central West African basement, beginning at the start of the Cretaceous period.[fn 1]\nAt first, the trough accumulated sediments deposited by rivers and lakes. \nDuring the Late Early to Middle Cretaceous, the basin subsided rapidly and was covered by the sea.\nSea floor sediment accumulated, especially in the southern Abakaliki Rift, under oxygen-deficient bottom conditions.[1] In the Upper Cretaceous, the Benue Trough probably formed the main link between the Gulf of Guinea and the Tethys Ocean (predecessor of the Mediterranean Sea) via the Chad and Iullemmeden Basins.[3]\nTowards the end of this period the basin rose above sea level, and extensive coal forming swamps developed, particularly in the Anambra Basin.[1] The trough is estimated to contain 5,000 m of Cretaceous sediments and volcanic rocks.[4]\n\nA common explanation of the trough's formation is that it is an aulacogen, a residual, inactive branch of a three-branched radial rift system. The other two branches continued to spread during the break-up of Gondwana, as South America separated from Africa.[5]\nThe two continents seem to have started to split apart at what are now their southern tips, with the rift extending northward along the modern coastlines to the Benue Trough, then later split along what is now the southern coast of West Africa and the north eastern coast of South America. As the continents were wedged apart, the trough opened. When separation was complete, the southern part of Africa swung back to some extent, with the sediments in the Benue Trough compressed and folded.[6]\nDuring the Santonian age, about 84 million years ago, the basin experienced intense compression and folding, forming more than 100 anticlines and synclines. The deposits in the Benue Trough were displaced westwards at this time, causing subsidence of the Anambra Basin.[2]\n\nA refinement of the model involves the rise of a mantle plume, where abnormal heat results in melting of the upper mantle, thinning and stretching the crust, followed by rifting of the weakened crust. This may have been repeated several times, with the Benue Trough deformed between rifting episodes.[7]\nThe same plume may be responsible for the line of volcanoes in Cameroon along the Central African Shear Zone and for the volcanic island of St. Helena in the Atlantic Ocean.[8]\n\nThree periods of magmatic activity (volcanic action) have been identified, 147–106 Ma, 97–81 Ma and 68–49 Ma.\nThe first is prominent in the north of the trough, and contemporary with magmatism in Brazil, probably occurring during a period of crustal extension before the Atlantic started to open. The second is found only in the south of the trough, and may belong to a period when the extension of the Atlantic had slowed, ending with a period of compression. The third and last period is also found only in the south of the trough, and may be related to an isostatic response to the earlier crustal thinning.[9]\n\nThe mantle plume activity was probably limited in its effect, with most of the basins in the trough being created from a combination of extension and strike-slip faults. The faults extend into the ocean with the Chain and Charcot fault zones, and have their counterparts in northeastern Brazil.[10]\n\nNigeria is rich in coal deposits derived from terrestrial organic matter, most of which lie in the Benue Trough. These are mined in Enugu State.[11] The Enugu deposits formed in brackish marshes during the Late Campanian – early Maastrichtian ages, around 70 Ma.[2]\nDuring this time, the Anambra Basin became silted up with thick vegetation growing in low-lying marshes on a broad delta fan deposited by rivers from the interior. Later, the deep layer of vegetation became buried under coarse sands.[3]\nCoal is potentially a source for oil and natural gas.\nAn exploratory well drilled in the Gongola Basin of the upper region in 2003 found no oil, although there was a narrow layer of coal between 4,710 ft and 4,770 ft.[12]\n",
  "concepts": [
    "Benue Trough"
  ],
  "findings": [
    "Location",
    "Rifting and sedimentation",
    "Mantle plume theory",
    "Economic importance",
    "Explanatory notes",
    "References"
  ],
  "timestamp": "2025-04-11T10:09:01.041757"
}