{
  "title": "Lisa M. Diamond",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Lisa_M._Diamond",
  "content": "Lisa M. Diamond is an American psychologist and feminist. She is a professor of developmental psychology, health psychology and gender studies at the University of Utah.[1] Her research focuses on sexual orientation development, sexual identity, and bonding.[2]\n\nShe is best known for her 2008 book, Sexual Fluidity: Understanding Women's Love and Desire.[3] In this book, she discusses the fluidity of female sexuality, based on her study of 100 nonheterosexual women over a period of 10 years.[4]\n\nDiamond became interested in feminism after Betty Friedan gave a talk at her high school.[3] She studied feminist theory at the University of Chicago and joined the board of the Chicago National Organization for Women.[3][5][6] During this time, she came out as gay and decided to pursue research into homosexuality instead of activism.[3]\n\nIn 1993, she received her B.A. in psychology from the University of Chicago.[3] She then started graduate work with Ritch Savin-Williams at Cornell University,[7] where she earned her M.A. in 1996, and her Ph.D. in 1999, both in human developmental psychology.[3]\n\nAt the University of Utah, Diamond was an assistant professor from 1999 to 2005, and an associate professor from 2005 to 2012. She became a professor of psychology and gender studies in 2012.[2] She serves on the editorial boards of Developmental Psychology, Archives of Sexual Behavior, and various other journals.[2] Her research focuses on homosexuality, adolescent females and human bonding.[2][3]\n\nIn her studies of sexual fluidity, she has found that some women report variability in their sexual orientation identity. Diamond is clear that sexual orientation is not chosen, but that identity can shift involuntarily for some women.[3][8] The sexually fluid women she studied did not \"experience those changes as willful\", and some even resist them.[8] Diamond says that conversion therapy cannot remove same-sex attraction.[8]\n\nDescribing herself as a feminist scientist, Diamond says \"there are a lot of scientists who just cling to the scientific method and believe they are totally objective and I think they are full of bunk. But, I have met a lot of feminists who say there is not a way to collect data without being oppressive, that data has no meaning, the world is socially constructed and I think that is bunk too.\"[3] Diamond has also researched attachment theory as the basis for love and sexual orientation, and the association between relationships and psychobiological health.[3]\n\nDiamond was awarded the Outstanding Achievement Award by the APA Committee on Lesbian, Gay, Bisexual, and Transgender Concerns in 2011; the Distinguished Book Award by the International Association of Relationship Research (IARR) in 2010; and the Distinguished Book Award for her book Sexual Fluidity by the American Psychological Association, Division 44 in 2009.[2][9][better source needed] Sexual Fluidity was also a finalist for the Lambda Literary Award for Bisexual Literature.[10]\n",
  "concepts": [
    "Lisa M. Diamond"
  ],
  "findings": [
    "Early life",
    "Work",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:06:52.393287"
}