{
  "title": "2013–14 Liga Nacional de Básquet season",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/2013–14_Liga_Nacional_de_Básquet_season",
  "content": "The 2013–14 Liga Nacional de Básquet season was the 30th season of the top professional basketball league in Argentina. The regular season started on 9 October 2013. Peñarol won their fifth title, defeating defending champions Regatas Corrientes in the finals. This was the first season without relegations to the Torneo Nacional de Ascenso.[1]\n\nTorneo Nacional de Ascenso Champions from the previous season Estudiantes Concordia and runners-up Quilmes were promoted.\n\nThe first stage took place between 10 October and 24 November 2013. Teams were divided into two zones. The top four teams from each zone competed in the Torneo Súper 8 that took place in December.\n\nThe ninth edition of Torneo Súper 8 took place on 18–21 December 2013 in the city of San Martín, Mendoza. Peñarol won their fourth title, defeating Quimsa in the Final, and were granted a berth in the 2014 Liga Sudamericana de Básquetbol.\n\nThe second stage started on 28 November 2013. All 16 teams were ranked together. Each team carried over half of the points obtained in the first stage. \n\nThe Playoffs started on 9 April 2014 and ended on 5 June 2014. Peñarol defeated Regatas Corrientes in the Finals and won their fifth title. Both teams were qualified for the 2015 FIBA Americas League. Since Peñarol had also qualified to the 2014 Liga Sudamericana de Básquetbol after winning the Torneo Súper 8, their berth was given to the next best team that was not qualified yet, in this case Libertad.\n",
  "concepts": [
    "2013–14 Liga Nacional de Básquet season",
    "torneo",
    "season",
    "2013",
    "teams",
    "peñarol",
    "2014",
    "won",
    "torneo súper",
    "took place",
    "took"
  ],
  "findings": [
    "Promotions and relegations",
    "Clubs",
    "Regular season",
    "First stage",
    "Torneo Súper 8",
    "Second stage",
    "Playoffs",
    "Clubs in international competitions",
    "Awards",
    "Yearly Awards",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:26:33.796230"
}