{
  "title": "Elisa Ortiz de Aulestia",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Elisa_Ortiz_de_Aulestia",
  "content": "Elisa Ortiz de Aulestia (1909–1991) was an Ecuadorian teacher and writer. Her ideas reflected the principles of the feminist movement in the 60´s. Women´s development through education is the main topic of many of her pedagogical reflections. As an active socialist, she was a member of the PSE (Partido Socialista Ecuatoriano) as she believed it to be the national revindication movement, that represented principles to fulfill Ecuadorian needs. She and her husband invested  their intellectual effort, as well as their own economic resources, to change the methodology that teachers used in Ecuadorian schools. Her work is considered a milestone in the struggle to reach quality education for women.\n\nElisa Ortiz was born on September 12, 1902, in Guayaquil, Ecuador. Her parents were Ángel Jorge Ortiz Montufar and Victoria Guadalupe Garcés Salazar. She grew up in a changing time when Eloy Alfaro had begun a period of liberalism in Ecuador.\n\nWhen Elisa was eight, her family had to move to Ambato due to her mother’s illness. There, she studied in a private school where she was severely punished. Because of this traumatic event, she refused to attend an educational institution. She and her siblings were home-schooled. At the age of sixteen, she went back to Guayaquil to finish her education. She studied at “Normal Rita Lecumberri”, being one of the most brilliant students. She got a scholarship at  “Normal Manuela Cañizares” High School. On July 25, 1921, she graduated and began to work as a Spanish teacher in the same High School at the age of nineteen. In 1924, she met Alfonso Aulestia Bravo, a coworker, and they got married. Sponsored by the German Mission, he got a scholarship to study in the “Tecnische Universität Berlin” in Berlin. Back from Germany, they both implemented new methodologies to improve technical education and try to contribute to the country’s development. She dedicated her life to her convictions of empowering women through education. On November 27, 1991, she died peacefully among her children at the age of 89.\n\nPoetry Book\n\nBooklets\n\nArticles: published by “El Día” newspaper: \n",
  "concepts": [
    "Elisa Ortiz de Aulestia"
  ],
  "findings": [
    "Life",
    "Professional",
    "Educational field",
    "Political field",
    "Works",
    "1928",
    "1938",
    "References"
  ],
  "timestamp": "2025-04-11T10:08:21.578956"
}