{
  "title": "Three Chords from the Truth",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Three_Chords_from_the_Truth",
  "content": "Three Chords from the Truth is a Canadian television series created by Steve Cochrane, Phyllis Ellis and Adriana Maggs that aired on the Canadian CMT network in 2009, and was also available on Movie Central. This program was CMT's first original comedy series and was nominated for two Gemini Awards.\n\nThe program starred Phyllis Ellis as Helena Delaney, a fortyish network executive for a struggling country music television station run by her former lover. The series provides a tongue-in-cheek look at the music industry, as Helena strives to improve network ratings and prove herself as the new boss. Her attempts generally result in humiliation, and witty, but subtle, remarks from the network staff. The staff is an ensemble cast of characters, including Joel Stewart, Helena's work-nemesis, comedic foil, and eventual love-interest, who is a genuine music lover, and views Helena as a sell-out; Rusty Katz (Jordan McClosky), and Calvin Bates (Paul Snepsts), the sarcastic on-air personalities. Ellis Dukes (George Komorowski) is Helena's boss and former lover who is now dating Amber (series writer Adriana Maggs), his much younger assistant. Mick McCafferty (series director Steve Cochrane) is a talent agent whose views on status and corporate-climbing mirror Helena's and lead to a mutual attraction. Mick represents Tommy Mountain, an up-and-coming Iraqi singer.\n\nThe show is a spin-off of the CMT's TV series The Wilkinsons, in which Ellis also appeared as the character of Helena. Many real life musicians made cameo appearances on the show. The satirical style of the show, and its ensemble cast has drawn online comparisons to The Office .\n\nThe show was executive produced and created by Steve Cochrane, who directed the majority of episodes and Adriana Maggs, who is credited as the writer on all ten episodes.\n\nThis article relating to a comedy television series in Canada is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Three Chords from the Truth"
  ],
  "findings": [
    "External links"
  ],
  "timestamp": "2025-04-11T10:14:04.774742"
}