{
  "title": "Star Trek: Voyager season 4",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Star_Trek:_Voyager_season_4",
  "content": "The fourth season of the American science fiction television series Star Trek: Voyager commenced airing on UPN in the United States on September 3, 1997, and concluded on May 20, 1998, after airing 26 episodes. Set in the 24th century, the series followed the adventures of the Starfleet and Maquis crew of the starship USS Voyager after they were stranded in the Delta Quadrant, far from the rest of the Federation. Season Four featured the debut of new main cast member Jeri Ryan as Seven of Nine, nicknamed Seven, and the departure of Jennifer Lien, who portrayed Kes during the first three seasons of the show. At the end of the season, co-creator and executive producer Jeri Taylor retired.\n\nWith the addition of Seven, a series of episodes focused on her backstory and relationship with other characters. The season opened with a Nielsen rating of 8.8% for \"Scorpion\", which was higher than any episode since the pilot. \"Unforgettable\" received the lowest rating with 3.4%. \n\nThe fanbase initially responded negatively to Ryan's addition to the cast, raising concerns over Seven's sexual attractiveness, which had the potential to overshadow the story. But following the airing of the episodes, critics applauded Ryan's acting skills and her role as Seven, noting that it would improve the quality of the stories and the series itself.  Acclaimed episodes like  \"Scorpion\", \"Year of Hell\", and \"Hope and Fear\", led critics to describe the fourth season as one of the best.  The episode \"Living Witness\", directed by Tim Russ, received special critical accommodation as one of the best episodes of the entire series.\n\nThe fourth season of Voyager introduces Seven of Nine (Seven) as a new crew member as she becomes separated from the Borg collective after the crew help the Borg to defeat Species 8472. Captain Kathryn Janeway mentors Seven and helps her to rediscover her individuality and her humanity. Kes leaves the vessel after her powers increase, but pushes Voyager ten years closer to home as she departs. B'Elanna Torres faces her Klingon heritage, while the Doctor confronts the rights of sentient holograms for the first time.\n\nAfter the construction of a new Astrometrics lab, the crew enter Krenim space and go through the \"Year of Hell\" foretold in the season three episode \"Before and After\". But the events of this year are undone with the destruction of the Krenim timeship. Voyager continues to encounter the Borg and enters Hirogen space, establishing contact with Starfleet for the first time since being stranded in the Delta Quadrant. The crew are cloned by an intelligent silver liquid on a demon class planet and the season ends with an alien seeking revenge who tries to trick the crew with a fake Starfleet vessel that can take them home to Earth.\n\nAn audition process was held for  Seven of Nine (Seven), a new character in the fourth season.  Jeri Ryan attended for readings, and was cast in the role.[26][27] She previously appeared in the science fiction television series Dark Skies on NBC, and found the change of characters amusing. \"I was fighting the collective, the Hive on 'Dark Skies'. Now I'm part of the collective, the Borg\", she remarked.[28] Ryan described Seven as \"a dark character, stronger and more forceful than many female characters have been on Star Trek so far.\"[29] The initial fan reaction to Seven was mixed.  Some fans accused the show of adding her to attract more 18–35 male audience members, which co-executive producer Brannon Braga denied.[28]\n\nThe original Borg costume Ryan wore during the second part of \"Scorpion\" took approximately two and a half hours to apply.[26] When Ryan was first measured for the outfit, the costume designers failed to take into account the full head prosthetic required for the first and second episodes of the season.[28] Because of this error in measurement, the costume cut off Ryan's carotid artery, causing her to pass out.[30] After a nurse was called twice to supply oxygen, the costume was modified to prevent it from happening again.[28]\n\nA new costume was required for Ryan once Seven had the majority of her Borg implants removed. She wore a new silver jumpsuit for the following several episodes. During the filming of the episode \"Day of Honor\",  director Jesús Salvador Treviño criticized the outfit, saying that \"almost any camera angle inevitably winds up emphasizing her sexuality.\"[27] Ryan described the new costume as \"a little snug\"; she wore a corset-like device which gave her the appearance of mechanical ribs.[28] Treviño praised Ryan's third costume, which replaced the silver jumpsuit, noting how it reduced her sexual characteristics: \"It is much more sensible, because she's still an attractive person but then you get away from that titillation stuff which I think is so demeaning not only to the audience, but it's kind of demeaning to what Star Trek is about\".[27]\n\nSeason four also saw the departure of Jennifer Lien as Kes after her contract was not renewed.[31] Lien appeared in the first two episodes of the season before being written out.[32] Braga said that the character was not working on the show and that they needed to make room for Ryan in the cast.[28] Lien later reprised her role as Kes in the season six episode \"Fury\".[31] Robert Picardo thought that the writers were partly responsible for the problems with Lien's character due to the limitations they placed on Kes in the original concept for Voyager. As a member of the Ocampa species, for example, Kes was only allowed a short, nine-year lifespan.[33] Tim Russ, who portrays Tuvok, described the departure of Kes from the series as \"gracious\" and \"poignant\".[34]\n\nMichael Piller had left the staff of Voyager a year previously at the beginning of the third season to work on other projects, leaving Jeri Taylor to take over as executive producer.[35][36] Brannon Braga was promoted to co-executive producer at the beginning of the fourth season after Taylor sought to reduce her involvement on the show.[37] Braga originally joined the franchise when he was an intern on Star Trek: The Next Generation; he went on to write more than 40 episodes as well as Star Trek Generations (1994) and Star Trek: First Contact (1996).[38] After Taylor left the show at the end of the season, Braga became the executive producer.[39]\n\nWith the addition of Seven to the crew, the writers incorporated the character's backstory into the show.   \"The Raven\" explores how Seven arrived in the Delta quadrant, while a variety of episodes show Seven rediscovering her humanity.[30] Seven also brought a third-party view of humanity that had previously been missing from Voyager.[40] This outsider perspective was used earlier in the franchise, with the roles of Spock in Star Trek: The Original Series, Data in Star Trek: The Next Generation as well as Odo in Star Trek: Deep Space Nine.[28] Russ felt that the majority of the episodes during the fourth season concentrated on the new character of Seven.[34]\n\nThe writers also introduced relationships between Voyager's crew, focusing on developing the connection between Tom Paris and B'Elanna Torres, Tuvok and Neelix, and Kathryn Janeway and Chakotay.[37] Both Russ and Kate Mulgrew believed that the writing improved during the fourth season.[34][39]\n\nThe season opened to a Nielsen rating of 8.8 percent for the second part of \"Scorpion\" when it aired on September 3, 1997. A Nielsen rating of 8.8 percent means the episode was watched by 8.8 percent of those watching television at the time of broadcast.[30][41] This was the highest rating for the series since \"Caretaker\", the original pilot episode.[30] Ratings for \"The Gift\", the second episode of the fourth season, dropped to 5.6 percent. However, only two other episodes during season four had ratings of 5 percent or higher, with \"Revulsion\" and the second part of \"Year of Hell\" gaining ratings of 5 percent and 5.2 percent respectively. \"Unforgettable\" received the lowest rating of the season with 3.4 percent. The season closed with \"Hope and Fear\", which received a Nielsen rating of 4.1%.[13]\n\nThe series remained UPN's highest rated show.[42] In September 1997, Dean Valentine, the incoming chief of the network, promised to increase  promotion of the show.[43] In November 1997, Voyager swapped timeslots with The Sentinel, moving from a 9 p.m. to 8 p.m. slot.[44] The timeslot was changed because Voyager received higher ratings.  It was hoped that the swap would have a lead-in effect into The Sentinel.[45] This timeslot change placed Voyager in direct competition against 3rd Rock from the Sun on NBC, The Drew Carey Show on ABC and Party of Five on Fox.[46] Nevertheless,  local providers started to swap from UPN to The WB in early 1998, and ratings suffered.  To combat this problem, the series was moved back to 9 p.m. from May onwards.[47]\n\nSome members of the online Star Trek community complained about the addition of Seven of Nine (Seven) to the show before the season premiere, referring to Voyager as \"Melrose Space\". The nickname amused Ryan, who hoped the fans would be won over during the course of the season.[29] Once the episodes started to air for the first time, Ryan's  character increased in popularity amongst the fan base.[48][49] Two months after the start of the season, Ryan attended her first science fiction convention; she was overwhelmed by the fan response.[50] The critics credited Seven's presence on Voyager as a significant  improvement, with the Seattle Post-Intelligencer concluding that Voyager had \"finally...found its groove\".[51] Writing for Dreamwatch, Gary Russell said that Ryan's character worked well on the season from her first appearance.[52] However, the Boston Herald argued that the show had swapped \"sci-fi for sex appeal\" during the fourth season, but acknowledged Ryan was a good actress. It gave the season three out of five stars at the time of the DVD release.[53]\n\nIn a review of \"Scorpion, Part II\", the first episode of the fourth season, Tony Norman of the Pittsburgh Post-Gazette noted several new elements.  The episode, according to Norman, established the first ideological debate between Janeway and Chakotay since the original series pilot. Norman also noted that the new character of Seven would create a \"source of tension\" and \"infuse the show with the edginess it desperately needs\". The addition of a Borg crew member, Norman argued, was the same type of \"bold move\" that occurred when Worf was added to the USS Enterprise in Star Trek: The Next Generation.[54]\n\nWriting for Den of Geek,  Juliette Harrisson described the fourth season as the best of the series. She praised Seven's introduction as an opportunity for existing characters, such as Tuvok.  Harrisson highlighted several of the episodes of the season, pointing to \"Living Witness\" as a candidate for the best of the entire series.  She criticized \"Mortal Coil\" and \"Retrospect\" for concentrating too much on the relationship between Seven and Janeway, to the detriment of other characters.[55]\n\nOn the website Blastr, Lisa Granshaw included \"Scorpion\", \"Year of Hell\", \"Living Witness\" and \"Hope and Fear in an unordered list of the top ten episodes of Voyager.[56]\n\nIn 2019, CBR rated Season 4 of Star Trek: Voyager as the 8th best season of all Star Trek seasons up to that time, noting the introduction of the character Seven of Nine (played by Jeri Ryan).[57]\n\nThe series was nominated for two Emmy Awards following the fourth season: \"Year of Hell\" was nominated for Outstanding Special Visual Effects for a Series,[58] while \"The Killing Game\" received a nomination for Outstanding Hairstyling for a Series.[59]  Kate Mulgrew won the Saturn Award for Best Actress on Television for her performance as Captain Janeway.[60] The Satellite Award for Best Performance by an Actress in a Television Series – Drama was awarded to Jeri Ryan at the 3rd Golden Satellite Awards.[61]\n",
  "concepts": [
    "Star Trek: Voyager season 4"
  ],
  "findings": [
    "Plot overview",
    "Cast",
    "Main cast",
    "Recurring cast",
    "Episodes",
    "Production",
    "Casting",
    "Writing",
    "Reception",
    "Ratings",
    "Reviews",
    "Accolades",
    "Home media release",
    "Notes",
    "External links"
  ],
  "timestamp": "2025-04-11T10:50:12.495686"
}