{
  "title": "Margaret Sinclair (nun)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Margaret_Sinclair_(nun)",
  "content": "Margaret Anne Sinclair, PCC (29 March 1900 – 24 November 1925), religious name  Mary Francis of the Five Wounds, was a Scottish Catholic nun of the Colettine Poor Clares. She was declared venerable by Pope Paul VI on 6 February 1978.\n\nAndrew Sinclair, from Edinburgh, husband to Elizabeth ('Leebie') Kelly, from Dundee, moved to Edinburgh in 1897 from Dundee. They had six children. The eldest male, John, the eldest female, Isabella (Bella). \n\nMargaret Sinclair was their third child, and second eldest female. Born on 29 March 1900, at nine in the evening, in the two roomed flat beneath the ground floor, at 24 Middle Arthur Place, Edinburgh.\n\nShe had three younger siblings: Andrew, the second eldest male; the youngest female Elizabeth (Lizzie); and, finally, Lawrence. Before Lawrence was born, Margaret's parents lost two children. First, James, who died aged only one year old; then, Mary, alive for only a matter of days.\n\nAndrew and Elizabeth were married on New Year's Day, or the Solemnity of Mary, the Holy Mother of God, in the Church, in 1896. St. Joseph's Church in Dundee was the venue for the wedding, but Margaret's parents left Dundee within a year, so that Andrew returned to Edinburgh with his wife. Elizabeth was Catholic from birth, but Andrew converted so that they could marry.\n\nAndrew had gone to Dundee to search for work, and whilst Elizabeth worked manufacturing jute in a mill from thirteen years of age onward, Andrew became a tanner. On returning to Edinburgh, he found work with the town council as a road-sweeper, rising early and being paid a low wage.\n\nMargaret Sinclair was baptised at St Patrick's Church on 11 April, 1900. On 8 May 1910, she was confirmed in St Patrick's Church, Edinburgh and received the Eucharist for the first time.[1]\n\nBoth her older brother John and her father served in World War I. Sinclair left school at the age of fourteen and, from 1914 to 1918, worked full-time at Waverley Cabinet Works as an apprentice French polisher, and became an active member of her trade union.[2]\n\nThe Scottish economy had been heavily dependent upon the war; a depression followed the end of the Great War. Many activities necessary for the war economy, such as arms production and ship construction, no longer played a major role in the Scottish Economy; the skills required to undertake these tasks were not easily transferable to the civilian economy. Margaret was unemployed, and by 1918 the Waverley Cabinet Works had shut its doors. She would later find work in a biscuit factory run by McVitie.[1]\n\nIn 1922, seeking a life of solitude and prayer, Margaret applied to join the Poor Clares in Notting Hill, London.[2]\n\n\nOn 21 July 1923, Margaret and her brother Andrew travelled to London. The two would say goodbyes; Andrew was emigrating to Canada while Margaret would enter the convent of the Colettine Poor Clares in Notting Hill. Upon entrance to the convent, she took the name Mary Francis of the Five Wounds after Mary Frances of the Five Wounds. Many members of the religious community doubted Sinclair's ability to live a cloistered life owing to her humble heritage.[2][3]\nMargaret contracted laryngeal tuberculosis and was admitted to a sanatorium run by the Sisters of Charity at Warley, Essex, on 9 April 1925, where she remained until her death on 24 November that same year,[3] and was buried at Kensal Green in north west London. On 22 December 1927 her body was re-interred at Mount Vernon, Liberton, Edinburgh.[1] On 25 October 2003 her remains were again removed and now lie in her home parish church, dedicated to Saint Patrick, in Edinburgh.\n\nThe marble slab covering her body has a low relief sculpture of her head in the centre of a cross, but is hard to view unless directly above, as it is white on white.\n\nSinclair's cause of beatification was introduced to the Sacred Congregation of Rites in 1942 by Pope Pius XII.[1] On 6 February 1978, 100 years after Scotland's Roman Catholic hierarchy was restored Margaret Sinclair was declared venerable by Pope Paul VI.[3] The process has continued since then; on 1 June 1982, Pope John Paul II said, \"Margaret could well be described as one of God's little ones, who through her very simplicity, was touched by God with the strength of real holiness of life, whether as a child, a young woman, an apprentice, a factory worker, a member of a Trade Union or a professed Sister of religion'\".[4]\n\nSt. Patrick's Church in Old Town, Edinburgh contains the National Shrine of the Venerable Margaret Sinclair.[1]\n",
  "concepts": [
    "Margaret Sinclair (nun)"
  ],
  "findings": [
    "Life",
    "Family",
    "Parents",
    "Church Life",
    "Religious life",
    "Veneration",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:06:12.813960"
}