{
  "title": "Vestamager station",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Vestamager_station",
  "content": "Vestamager station (Danish pronunciation: [ˈvestɑˌmɑˀ], lit. West Amager) is a rapid transit station of the Copenhagen Metro in Copenhagen, Denmark. The terminus of the M1 line, it is located in zone 3 in the southwestern section of the island of Amager.\n\nVestamager is the southernmost station of the Copenhagen Metro, located in the southern part of Amager. Specifically, the station lies on a viaduct paralleling Ørestads Boulevard at its intersection with Asger Jorns Allé. Vestamager station is close to Kalvebod Fælled (Kalvebod Common) and next to the Metro's control and maintenance centre.\n\nVestamager is the last of six stations within the Ørestad redevelopment area on the M1 Line beginning at Islands Brygge and, as a result, has witnessed significant transit-oriented development. The vast majority of new construction around Vestamager is to the west of Ørestads Boulevard and south of the Øresundsmotorvejen. This area is classified by the master plan as Ørestads Syd (Ørestad South) and is one of four key planning and development districts in Ørestad.\n\nIn general, the northern half of Ørestads Syd will be dedicated to office projects, while the southern half will be focused on residential development. The first major residential project to be completed in the area - 8TALLET, a 61,000 square metres (660,000 sq ft), figure-eight shaped apartment complex - was awarded the title of \"best residential development\" at the World Architecture Festival in 2011.[1]\n\nVestamager station opened on 19 October 2002 as part of the first phase of the Copenhagen Metro, known as the Ørestadsbanen (lit. the Ørestad track). At the time, trains operated between Vestamager and Nørreport, with the M2 Line also running between Nørreport and Lergravsparken. Service westward to Vanløse began in 2003 and continues to this day.\n",
  "concepts": [
    "Vestamager station"
  ],
  "findings": [
    "Location",
    "Transit-oriented development",
    "History",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:07:17.093311"
}