{
  "title": "N. M. Kelby",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/N._M._Kelby",
  "content": "N. M. Kelby (Nicole Mary Kelby) is an American short-story and novel writer.\n\nBrought up in Florida, Kelby has worked as a reporter, editor and educator.  Initially a playwright, she later turned to novels and short stories. She is the author of Murder at the Bad Girl’s Bar and Grill, Whale Season,[1] In the Company of Angels,[2] and Theater of the Stars.[3]\n\nHer short stories have appeared in many publications including Zoetrope All-Story Extra, One Story, Minnesota Monthly, Verb, and The Mississippi Review. One was recorded by actress Joanne Woodward for the NPR CD Travel Tales, and included in New Stories from the South: Best of 2006.[citation needed]\n\nKelby took part in a month-long cultural exchange at Tyrone Guthrie Centre in County Monaghan, Ireland and will be the Artist-in-Residence at the Santa Fe Art Institute in May 2008.[citation needed]\n\nKelby is working on the movie version of Whale Season along with actor/singer/songwriter Dwight Yoakam.\n\nN.M. Kelby's books have been reviewed in Entertainment Weekly, New York Times Book Review, San Francisco Chronicle, Minneapolis Star Tribune, Atlantic Monthly, Baltimore Sun, Publishers Weekly, New York Post, New York Times Sunday Book Review, Kirkus Reviews and The Philadelphia Inquirer.[citation needed]\n\nKelby has been the recipient of a Bush Artist Fellowship in Literature, the Heekin Group Foundation's James Fellowship for the Novel, both a Florida and Minnesota State Arts Board Fellowship in fiction, two Jerome Travel Study Grants, and a Jewish Arts Endowment Fellowship. She was named \"Outstanding Southern Artist\" by The Southern Arts Federation and her work has been translated into several languages. She has been a Pirate's Alley Faulkner Award finalist for fiction three times and placed twice in the Nelson Algren Award for the Short Story.[citation needed]\n",
  "concepts": [
    "N. M. Kelby",
    "kelby",
    "story",
    "short",
    "new",
    "needed",
    "fellowship",
    "citation needed",
    "citation",
    "york",
    "times"
  ],
  "findings": [
    "Awards and honors",
    "Selected works",
    "References",
    "Sources",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:48:51.088984"
}