{
  "title": "Pelin Gündeş Bakır",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Pelin_Gündeş_Bakır",
  "content": "Pelin Gündeş Bakır (born March 13, 1972, in Kadıköy) is a Turkish politician and a professor at Istanbul Technical University. She was elected to Parliament in the 2011 general election as a Justice and Development Party (AK Party) deputy.[1]\n\nPelin Gündeş Bakır was born in Kadıköy in 1972. Her father's name is Erhan and her mother's name is Maral. She is originally from Melikgazi district of Kayseri. Pelin Bakır completed her high school education at Kadıköy Anatolian High School with first place. In 1993, she graduated from the Civil Engineering Department of Yıldız Technical University. In England, she received a diploma in civil engineering from Imperial College London and a master's degree in concrete structures from the same university. In 2000, she received training on disaster management and earthquake issues at FEMA for seven months. She then completed her PhD in earthquake engineering at Istanbul Technical University.[2]\n\nBakır became an associate professor in earthquake and structural engineering at ITU in 2004 and a professor in April 2010. In addition to ITU, he gave lectures at Boğaziçi University and Technische Universität Berlin in Germany.\n\nPelin Gündeş Bakır was a candidate for Kayseri 5th place in the 2011 general elections from the Justice and Development Party. With the AK Party winning 7 out of 9 parliamentary seats in Kayseri in the June 12 elections, Pelin Bakır was also entitled to enter the parliament. Thus, she became the third female deputy of Kayseri after Ferruh Güpgüp, a 3rd term deputy, and Sevgi Esen, a 21st term deputy. In October 2011, Bakır was elected as a member of her party's Public Works, Zoning, Transportation and Tourism Commission and the Parliamentary Assembly of the Council of Europe.[3] In 2023, she joined the İYİ Party.[4] She became a parliamentary candidate from Kayseri, but could not enter the list. Later, she resigned from İYİ Party.[5]\nOn 3 August 2024, Pelin Gündeş Bakır was elected as the party's chairperson at the Extraordinary General Congress of the Centre Party.[6]\n\nThis article about a Turkish politician is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Pelin Gündeş Bakır"
  ],
  "findings": [
    "Biography",
    "Education and academic career",
    "Political career",
    "External links",
    "References"
  ],
  "timestamp": "2025-04-11T10:16:19.687410"
}