{
  "title": "Hardy Brown",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Hardy_Brown",
  "content": "Hardy Brown (May 8, 1924 – November 8, 1991) was an American football linebacker in the National Football League (NFL), All-America Football Conference (AAFC), and the American Football League (AFL).  He played college football at the University of Tulsa and then professionally for the San Francisco 49ers, Washington Redskins, and the Denver Broncos.  He was one of only two men who played in the AAFC, NFL, and the AFL (the other was Ben Agajanian).[1]\n\nWhen Brown was four years old, he witnessed the murder of his father.  He was then sent, along with his brothers and sisters, to live at the Texas Masonic Home, an orphanage for the children of deceased Freemasons in Fort Worth, Texas.[2]  At the Masonic Home, Brown became friends with Tex Coulter.[3] Brown was a standout football player for the Mighty Mites, leading them to the state semi-finals his senior year.  He then enlisted in the United States Marine Corps, serving as a Paramarine during the Second World War, before playing football at Tulsa and eventually professionally.[4] Brown became known as one of the roughest defensive players in the game, knocking out numerous opponents with his trademark shoulder push.[5] The Rams once offered a $500 bounty to any player who could take him out, and he had his shoulder pads checked before a game once to make sure he did not have metal plating or other such material stuffed in them. His reputation was such that supposedly, on one occasion, when future Hall of Fame quarterback Bob Waterfield was hit by a motorist, his first response was, \"I didn't know that Hardy Brown was in town.\"[6]\n\nHall of Famer Art Donovan had this to say of Brown: \"How about San Francisco's Hardy Brown; ever heard of him?  He was one tough bastard.  I can't count how many people Hardy put in the hospital.  His style was an intent to maim.  He had this knack, this technique of slamming a shoulder into a running back's face; to this day I don't know how he did it.  He was like a snake uncoiling.  He'd get under your chin and, bang, you'd be seeing stars.  Ball carriers looked for Hardy, rather than an opening, coming around that corner.\"[7]\n\nBrown died in 1991 in a mental institution after suffering from dementia,[8] emphysema, and arthritis in his right (knockout) shoulder so bad he couldn't lift his arm to scratch his head.[1]\n\nOn the show NFL's Top 10, Hardy was marked as #5 on \"The Most Feared Tacklers of All Time\" segment.[9]\n",
  "concepts": [
    "Hardy Brown"
  ],
  "findings": [
    "NFL Network",
    "See also",
    "References"
  ],
  "timestamp": "2025-04-11T10:49:46.105496"
}