{
  "title": "Pertinax",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Pertinax",
  "content": "Publius Helvius Pertinax (/ˈpɜːrtɪnæks/ PER-tin-ax; 1 August 126 – 28 March 193) was Roman emperor for the first three months of 193. He succeeded Commodus to become the first emperor during the tumultuous Year of the Five Emperors.\n\nBorn to the son of a freed slave, Pertinax became an officer in the army. He fought in the Roman–Parthian War of 161–166, where his success led to higher positions in both the military and political spheres. He achieved the rank of provincial governor and urban prefect. He was a member of the Roman Senate, serving at the same time as the historian Cassius Dio.\n\nFollowing the death of Commodus, Pertinax was proclaimed emperor. He instituted several short-lived reform measures, including the restoration of discipline among the Praetorian Guard. This led to resistance that culminated in Pertinax's assassination by the Guard. Pertinax would later be deified by the emperor Septimius Severus. His historical reputation has been largely positive, in line with Cassius Dio's assessment.\n\nHis career before becoming emperor is documented in the Historia Augusta as well as Cassius Dio's History of Rome, and confirmed in many places by existing inscriptions. He was born in Alba Pompeia in Italy,[5] the son of freedman Helvius Successus. Cassius Dio writes that Helvius was not of noble birth but was at least able to earn enough money to allow Pertinax education to gain a livelihood.[5][6] Through this as well as patronage from Lucius Avitus (or Tiberius Claudius Pompeianus according to Dio), Pertinax was commissioned as an officer in a cohort.[7][5]\n\nIn the Parthian War that followed,[8] he distinguished himself, which resulted in a string of promotions, and after postings in Britain (as military tribune of the Legio VI Victrix)[9] and along the Danube, he served as a procurator in Dacia.[10] He suffered a setback as a victim of court intrigues during the reign of Marcus Aurelius, but shortly afterwards, he was recalled to assist Claudius Pompeianus in the Marcomannic Wars.[5] In 175, he received the honour of a suffect consulship[11] and until 185, Pertinax was governor of the provinces of Upper and Lower Moesia, Dacia, Syria, and finally governor of Britain.[9]\n\nDuring the 180s, Pertinax took a pivotal role in the Roman Senate until the praetorian prefect Sextus Tigidius Perennis forced him out of public life.[12] He was recalled after three years to Britain, where the Roman army was in a state of mutiny.[13] He tried to quell the unruly soldiers there but one legion attacked his bodyguard, leaving Pertinax for dead.[14] When he was forced to resign in 187, the reason given was that the legions had grown hostile to him because of his harsh rule.[15]\n\nHe served as proconsul of Africa from 188 to 189,[16] and followed this term of service with the urban prefecture of Rome,[17] and a second consulship as ordinarius with the emperor Commodus as his colleague.[14]\n\nWhen Commodus' actions became increasingly erratic in the early 190s, a conspiracy led to his assassination on 31 December 192.  The plot was carried out by the Praetorian prefect Quintus Aemilius Laetus, Commodus' mistress Marcia, and his chamberlain Eclectus.[18]  After the murder had been carried out, Pertinax, who was serving as urban prefect at this time, was hurried to the Praetorian Camp and proclaimed emperor.[19] His short reign of 87 days[20] was an uneasy one. He attempted to emulate the restrained practices of Marcus Aurelius and made an effort to reform the alimenta, but he faced antagonism from many quarters.[21]\n\nAncient writers detail how the Praetorian Guard expected a generous donativum on his ascension, and when they were disappointed, agitated until he produced the money, selling off Commodus' property,[22] including the concubines and youths Commodus kept for his sexual pleasures.[23][24] He reformed the Roman currency dramatically, increasing the silver purity of the denarius from 74% to 87% – the actual silver weight increasing from 2.22 grams to 2.75 grams.[25]\n\nPertinax attempted to impose stricter military discipline upon the pampered Praetorians.[26] In early March he narrowly averted one conspiracy by a group to replace him with the consul Quintus Sosius Falco while he was in Ostia inspecting the arrangements for grain shipments.[27] The plot was betrayed; Falco himself was pardoned but several of the officers behind the coup were executed.[28]\n\nOn 28 March 193, Pertinax was at his palace when, according to the Historia Augusta, a contingent of some three hundred soldiers of the Praetorian Guard rushed the gates[29] (two hundred according to Cassius Dio).[30] Ancient sources suggest that they had received only half their promised pay.[27] Neither the guards on duty nor the palace officials chose to resist them. Pertinax sent Laetus to meet them, but he chose to side with the insurgents instead and deserted the emperor.[31]\n\nAlthough advised to flee, Pertinax then attempted to reason with the insurgents and was almost successful before being struck down by one of the soldiers.[32] Pertinax must have been aware of the danger he faced by assuming the purple, for he refused to use imperial titles for either his wife or son, thereby protecting them from the aftermath of his own assassination.[18]\n\nAfter Pertinax's death, the Praetorians auctioned off the imperial title; the winner was the wealthy senator Didius Julianus, whose reign would end mere weeks later with his assassination on 1 June 193.[33] Julianus was succeeded by Septimius Severus.[34] After he entered Rome, Septimius recognized Pertinax as a legitimate emperor, executed the soldiers who had killed him, and not only pressured the Senate to deify him and provide him a state funeral,[35] but also adopted his cognomen of \"Pertinax\" as part of his own name.[36] For some time, he held games on the anniversary of Pertinax's accession and on his birthday.[37]\n\nPertinax's historical reputation is largely a positive one, beginning with the assessment of Cassius Dio, a historian and senator who was a colleague of Pertinax. Dio refers to him as \"an excellent and upright man\"[38] who displayed \"not only humaneness and integrity in the imperial administrations, but also the most economical management and the most careful consideration for the public welfare\".[23]\n\nDio's approval is not unqualified, however. He acknowledges that while some would call Pertinax's decision to confront the soldiers that would wind up killing him \"noble\", others would call it \"senseless\".[30] He is also critical of Pertinax's judgment when it came to the speed with which he tried to reform the excesses of the reign of Commodus by suggesting that a more tempered approach would have been less likely to result in his murder.[39]\n\nPertinax is discussed in The Prince by Niccolò Machiavelli. Discussing the importance of a prince not being hated, Machiavelli provides Pertinax as an example of how it is as easy for a ruler to be hated for good actions as for bad ones. Though describing him as a good man, Machiavelli considered Pertinax's attempt to reform a soldiery that had become \"accustomed to live licentiously\" a mistake, as it inspired their hatred of him, which led to his overthrow and death.[40]\n\nPertinax is described in David Hume's essay Of the Original Contract as an \"excellent prince\" possessing an implied modesty when, on the arrival of soldiers who had come to proclaim him emperor, he believed that Commodus had ordered his death.[41]\n\nDuring the debate over ratification of the United States Constitution, Virginia politician John Dawson, at his state's ratifying convention in 1788, spoke of the \"atrocious murder\" of Pertinax by the Praetorian Guard as an example of the danger of establishing a standing army.[42][43]\n\nPertinax was the pseudonym of the French journalist André Géraud (1882–1974).[44]\n\nIn Romanitas, a fictional alternate history novel by Sophia McDougall, Pertinax's reign is the point of divergence. In the history as established by the novel, the plot against Pertinax was thwarted, and Pertinax introduced a series of reforms that would consolidate the Roman Empire to such a degree that it would still be a major power in the 21st century.[45]\n",
  "concepts": [
    "Pertinax",
    "pertinax",
    "emperor",
    "dio",
    "commodus",
    "roman",
    "praetorian",
    "soldiers",
    "cassius dio",
    "cassius",
    "reign"
  ],
  "findings": [
    "Early life",
    "Emperor",
    "Aftermath",
    "Historical reputation",
    "In popular culture",
    "References",
    "Sources",
    "Primary sources",
    "Secondary sources",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T14:45:04.912813"
}