{
  "title": "Haredim and Zionism",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Haredim_and_Zionism",
  "content": "From the founding of political Zionism in the 1890s, Haredi Jewish leaders voiced objections to its secular orientation, and before the establishment of the State of Israel, the vast majority of Haredi Jews were opposed to Zionism, like early Reform Judaism, but with distinct reasoning.[1] This was chiefly due to the concern that secular nationalism would redefine the Jewish nation from a religious community based in their alliance to God for whom adherence to religious laws were \"the essence of the nation's task, purpose, and right to exists,\"[2] to an ethnic group like any other as well as the view that it was forbidden for the Jews to re-constitute Jewish rule in the Land of Israel before the arrival of the Messiah. Those rabbis who did support Jewish resettlement in Palestine in the late 19th century had no intention to conquer Palestine and declare its independence from the rule of the Ottoman Turks,[3] and some preferred that only observant Jews be allowed to settle there.[4]\n\nDuring the 1930s, some European Haredi leaders encouraged their followers not to leave for Palestine, where the Zionists were gaining influence. When the dangers facing European Jewry became clear, the Haredi Agudath Israel organization decided to co-operate with Zionist leaders to an extent, in order to allow religious Jews the possibility of seeking refuge in Palestine. Some Agudah members in Palestine preferred to form an alliance against the Zionist movement with Arab nationalists, but this never occurred. After the creation of the state of Israel, each individual movement within ultra-Orthodox Judaism charted its own path in their approach to the State of Israel.\n\nA study in late 2006 claimed that just over a third of Israelis considered Haredim to be the most hated group in Israel.[5] According to a 2016 Pew survey, 33% of Israeli Haredim say that the term \"Zionist\" describes them accurately.[6]\n\nIn the hope of winning over the Hasidic masses to the Zionist Organization, Theodor Herzl endeavoured to garner support from one of the most prominent rabbis in the Austro-Hungarian Empire, David Moshe Friedman (d. 1903), the Rebbe of Chortkov. He maintained contact with him for over three years,[7] during which time he tried to convene a conference of rabbis in order to promote Zionism; however, nothing ever materialized.[8] Friedman had been a long-time supporter of efforts to settle Jews in Palestine on the strict condition that they adhere to Jewish law. He had in fact been an early member of Ahavath Zion, a Zionist organization that was established in 1897 with the specific purpose of informing religious Galician Jews about the plan to establish a Jewish national home. Although Ahavath Zion was successful in attracting thousands of members and numerous rabbis from smaller communities, it could not stem the rising anti-Zionist sentiment among the majority of Orthodox leaders. Besides Friedman, they simply could not persuade any of the other great Hasidic leaders to support the Zionist project.[9] The Hasidim were particularly vociferous in their opposition to Zionism and they often protested against the Zionists. They even went so far as to ban the Star of David, originally a religious symbol which only appeared in synagogues, but it had now become \"defiled\" by the Zionists.[10]\n\nIn 1889, Rabbi Joseph Dov Soloveichik proclaimed that early Zionist initiatives resembled the 17th-century false messianic sect which was headed by Sabbatai Zevi. His son Rabbi Hayyim Soloveichik further warned: \"The people of Israel should take care not to join a venture that threatens their souls, to destroy religion, and is a stumbling block to the House of Israel.\"[11] When the Zionists in Brisk claimed that Zionism would stem the tide of Jewish assimilation, Soloveichik felt that what mattered most for Judaism was the quality, not the quantity of it.[12]\n\nPowerful condemnations of political Zionism continued into the twentieth century. In 1903, Rabbi Sholom Dovber Schneersohn of Lubavitch published Kuntres Uma'ayan, which contained a strong polemic against Zionism. He opposed the Religious Zionist movement, and was deeply concerned that secular nationalism would replace Judaism as the foundation of Jewish identity.[13] Rabbi Baruch Halberstam (d. 1906) took a leading role in opposing Zionism, in line with the position held by his father, Hayyim Halberstam of Sanz.[14]\n\nIn 1912, Haredi leaders in Europe founded the Agudath Israel organisation which hoped to find a \"solution to all the problems facing the Jewish people in the Spirit of the Torah.\" From the outset, the Agudah vehemently opposed the Zionist movement's replacement of the historic religious bond to the land of Israel with secular nationalism.[15] Israel Meir Kagan stated that the fate of the Jewish nation was to remain in exile until the arrival of the Messiah.[16] But with the spread of anti-Semitism in Europe, some Orthodox leaders became more favourable towards the aims of Zionism. Rabbi Isaac Breuer implored Agudah members in 1934 \"not to leave Jewish history to the Zionists\", hoping that religious Jews would assist in establishing a Jewish homeland.[17] Others remained staunchly opposed, chief among them the rabbi of Munkács, Chaim Elazar Spira (d. 1937), who was the fiercest opponent of Zionism among Hasidic rabbis.[18] Spira saw Zionism as a denial of the Divine Redemption and faith in the Messiah. He even objected to Agudath Israel because of its support for immigration to Palestine. In 1936, he initiated a publication against the Zionist enterprise which was endorsed by 150 rabbis.[19] During the wartime period, Rabbi Elchonon Wasserman (1875–1941) of Baranowicze wrote a pamphlet in which he blamed the Zionists for the persecution of Jews in Europe.[20] He rejected the notion that a secular Jewish state could be considered the \"advent of Redemption.\" The goal of Zionism was to uproot religion and Jewish tradition.[21][22] At the 1937 Agudath Israel Great Assembly in Marienbad, most discussions were devoted to the question of the Jewish State and the Nazi rise to power in Germany, and increasing anti-Semitism in Poland and Lithuania. Palestine beaconed as a refuge for the religious European masses whose situation was gradually worsening. While the majority of attendees rejected the establishment of a secular Jewish State on principle as well as on practical grounds, a minority, which was influenced by the dire situation, was in favour of it.[21]\n\nWithin Palestine itself, the local Ashkenazi Haredi community of the Old Yishuv was opposed to Zionism.[23] As Zionist settlement was underway during the 19th and 20th centuries, they were alarmed by the influx of predominantly non-religious Jews who wished to establish a secular state in the Holy Land[24] and threatened the peaceful relations the Orthodox community had enjoyed with their Arab neighbors until this point.[25] The chief rabbi of the Ashkenazi community in Jerusalem, Rabbi Yosef Chaim Sonnenfeld, often referred to the Zionists as \"evil men and ruffians\" and claimed that \"Hell had entered the Land of Israel with Herzl.\"[26] Sonnenfeld did not want the Orthodox Jewish community to become subject to secular Zionist authority.[27] The spokesman for the anti-Zionist Ashkenazi community in Jerusalem, Dr Jacob Israël de Haan, endeavoured to form an alliance with the Arab nationalist leadership and hoped to reach an agreement that would allow unrestricted Jewish settlement in Arab lands in return for the relinquishment of Jewish political aspirations. In June 1924, de Haan was assassinated by the Haganah after having conveyed his proposals to King Hussein and his sons, Faisal and Abdullah.[28]\n\nThe 1929 Palestine riots and the Nazi rise to power led to a crisis within the anti-Zionist Agudah camp. Some still hoped for a Jewish-Arab alliance against the Zionists, while others, such as Yitzhak-Meir Levin and Jacob Rosenheim faced a difficult dilemma. They felt that such an alliance would not be accepted by the masses of Haredi European Jews, yet they did not wish to cooperate with the Zionists.[26] Moshe Blau, another Agudah member, contended that, \"No matter how much the Haredi hates the non-religious, heretical, apostate Zionists, he hates the despicable Arab a hundred times over.\" The brutal murder by Arabs of dozens of Haredi Jews in Hebron and Safed damaged the already difficult relationships between the communities.[29] In 1937, the Central Committee of Agudath Israel in the Land of Israel issued a declaration claiming that secular Jewish rule would pose a danger to Orthodox Jewry, while indicating potential acceptance of a Jewish state if it were a Halachic state. It stated:\n\nAgudath Israel in the Land of Israel rejects outright any attempt at despoiling the Land of Israel of its sanctity and considers the proposal to establish a secular Jewish state in Palestine as a hazard to the lofty role of the Jewish People as a holy nation. Agudath Israel in the Land of Israel declares that Orthodox Jewry could only agree to a Jewish state in all the Land of Israel if it were possible for the basic constitution of this state to guarantee Torah rule in the overall public and national life.[21]\nThe Agudah in Europe grudgingly began to cooperate with the Jewish Agency and other Zionist bodies in an effort to alleviate the situation facing European Jews.[30] In response to this, Amram Blau and Aharon Katzenellenbogen of Jerusalem broke away from Agudah in 1938 to form Neturei Karta who refused to have any dealing with the Zionists.[24] During the 1940s the Neturei Karta became increasingly critical of the Agudah's position and in 1945 they succeeded in expelling Agudah members from the Edah HaChareidis.[31] In 1947, Chief Rabbi of Jerusalem Yosef Tzvi Dushinsky petitioned the UN on behalf of his 60,000 strong community that Jerusalem not be included in the Jewish state and pleaded that the city be placed under international control.[32]\n\nBefore and during the Second World War, Haredi opposition to the Zionists persisted. But after the war, the devastating consequences of the Holocaust softened the position of many towards Zionism. The ultra-orthodox in Eastern Europe had been murdered in vast numbers; whole communities had been wiped out.[33] One rabbi, Yisachar Shlomo Teichtal, hiding in Budapest in 1942 and witnessing the persecution of the Jews, renounced his previous hostility to the Zionist movement, and instead strongly criticized the Orthodox establishment for not taking the lead in re-establishing the Jewish homeland.\n\nAfter World War II, many Jewish refugees found themselves in displaced person camps. The Zionists controlled a camp for Jewish refugee children near Haifa, Israel where, according to the Haredi-affiliated newspaper Hamodia, they operated an anti-religious policy in an effort to cut off Haredi children from their spiritual roots. To a large extent they were successful, and many children from Haredi homes were \"poisoned against religion\".[34]\n\nThe relationship between Haredim and Zionism became more complex after the founding of the State of Israel in 1948. Some Haredi groups \"with great reluctance permitted\"[35] being involved in the political process of the state by voting in elections and accepting state funding. They maintained that since the government is not an ideological Zionist organization (as is the WZO, for example), and also they are not voluntarily choosing to join the Zionists, but  rather it is like a partnership that already exists - \"and if one wouldn’t participate, the other partner would take over his rights as well.\"[36] Others have maintained a more hardline rejectionist position, refusing all funding from the Israeli state and abstaining from taking part in the political process. The positions of specific Haredi groups are discussed in greater detail in the remainder of the article.\n\nThere is also a growing group of Orthodox Jews known as Hardalim. They are Religious Zionists who moved in their religious observances towards Haredi Judaism. Philosophically, however, they form a part of the Religious Zionist world, and not of the Haredi world.\n\nUnited Torah Judaism and Shas, which advocate for a halachic state, are the only two Haredi parties in the Israeli Knesset.\n\nHaredim who do not consider themselves Zionists fall into two camps: Non-Zionists and Anti-Zionists. Non-Zionists do not object to the existence of the State of Israel but see no religious significance in it and do not believe that it has anything to do with the messianic redemption. In their eyes, the redemption cannot be brought about through human hands. Anti-Zionists are opposed to the existence of any Jewish state prior to the coming of the Messiah. According to Aharon E. Wexler and Moshe Krakowski, Non-Zionists constitute a majority of the Haredi world.[37][38]\n\nAnti-Zionist Haredim believe that the existence of a Jewish state prior to the Messianic era is a violation of the Three Oaths.[39] They believe that voting in Israeli elections causes one to become a “partner” in all the sins committed by the government, which includes enabling it to violate the Three Oaths.[40]\n\nThere are many different ideological reasons for religious opposition to Zionism; however, the main two are most widely expressed by Hasidim and Lithuanian Haredim.[citation needed][dubious – discuss]\n\nThe overarching motive behind many Haredim's opposition to Zionism stems from a traditional and religious view of Jewish identity and peoplehood which runs counter to Zionism's nationalist ideology.[41][42][43] Haredim often cite the 10th century rabbinic sage Rav Saadia Goan as spelling out their national identity in terms irreconcilable with modern nationalism; as he wrote in his seminal work Emunah v’Deos (אמונה ודעות), \"Our nation, the B’nei Yisrael, is a nation only by virture of its Torah (collective religious teachings).\"[44] The opposition extends to ancillary parts of Zionist ideology, such as militarism[45] and organic nationalism, which they hold are incongruous with Jewish religious teachings.[46]\n\nHowever, there is also an Halachic standpoint which makes the case against Zionism even if Israel would - hypothetically - have been a theocracy, where Israel would have been governed under strict Jewish laws.\n\nHistorically, many dynasties in Hasidism have expressed anti-Zionist opinions because of the \"Three Oaths\". The Talmud, in Ketubot 111a, mentions that the Jewish people have been bound by three oaths: 1) not to ascend to Eretz Yisrael (the Land of Israel) as a group using force; 2) not to rebel against the nations of the world; and 3) that the nations of the world would not persecute the nation of Israel excessively.[47][failed verification] Some consider the establishment of the State of Israel to be a violation of these oaths. The first Haredi anti-Zionist movement was Agudath Israel, established in Poland in 1912.[48] Haredi groups and people actively",
  "concepts": [
    "Haredim and Zionism",
    "israel",
    "rabbi",
    "jewish",
    "zionist",
    "zionism",
    "state",
    "haredi",
    "religious",
    "israeli",
    "land"
  ],
  "findings": [
    "History",
    "Early opposition to Zionism",
    "Concern in Palestine",
    "Aftermath of the Holocaust",
    "Post-1948",
    "Ideological reasons",
    "Current positions of Haredi groups",
    "Groups which do not recognize the State of Israel",
    "Groups which do recognize the State of Israel",
    "Haredi newspapers in Israel",
    "Haredim outside of Israel",
    "America",
    "Europe",
    "Haredi books about Zionism",
    "Eim HaBanim Semeicha",
    "Sefer Vayoel Moshe",
    "Kuntres Al HaGeulah VeAl HaTemurah",
    "Ikvesa D’Meshicha",
    "B’ayos Hazman",
    "I Will Await Him",
    "The Empty Wagon: Zionism’s Journey from Identity Crisis to Identity Theft",
    "Involvement with the State of Israel",
    "See also",
    "References",
    "Further reading"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:37:16.709207"
}