{
  "title": "USS S-48",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/USS_S-48",
  "content": "USS S-48 (SS-159) was the first submarine in the fourth group of S-class submarines of the United States Navy.\n\nS-48 was one of only five submarines—along with USS S-14 (SS-119), USS S-15 (SS-120), USS S-16 (SS-121). and USS S-17 (SS-122)—built by the Lake Torpedo Boat Company to see service in World War II. She was the second-to-last of them to be decommissioned.\n\nS-48's keel was laid down on 22 October 1920 by the Lake Torpedo Boat Company in Bridgeport, Connecticut. She was launched on 26 February 1921, sponsored by Mrs. James O. Germaine.\n\nOn 7 December 1921, the still-uncommissioned submarine conducted a dive off Penfield Reef in Long Island Sound as part of builder's trials. A manhole plate in one of the aft ballast tanks was left unsecured, several aft compartments flooded, and S-48 sank in 80 feet (24 meters) of water.[1] The crew, contractor's personnel, and naval observers brought the bow to the surface and escaped through a torpedo tube to a tug which took them to New York City.[1]\n\nOn 20 December 1921, the submarine was raised and taken back to the builder's yard, where repairs were begun. The work was completed ten months later.\n\nOn 14 October 1922, S-48 was accepted by the Navy and commissioned the same day at Bridgeport. S-48 was fitted out at the New York Navy Yard, visited Peekskill, New York, for Navy Day, returned to Bridgeport, and at the end of October arrived at her home port, New London, Connecticut. Two weeks later, she was towed to the Portsmouth Naval Shipyard in Kittery, Maine, for further yard work and in late January 1923 she returned to New London to commence operations with Submarine Division 4 (SubDiv 4). Through May, she operated in the New London area. Then in early June she moved south for sound exercises and a visit to Washington, DC. At mid-month, she returned to southern New England. In August she proceeded back to Portsmouth for the installation of new crankshafts and a general ship and machinery overhaul.\n\nIn mid-January 1924, S-48 departed Portsmouth for New London and continued south to the Caribbean Sea for winter maneuvers. By mid-March 1924, she was back at Portsmouth for another five months of yard work. In early August 1924 she resumed operations in the New London area, and in November 1924, after being transferred to SubDiv 2, she visited Annapolis, Maryland. In December 1924 she returned to Connecticut, and toward the end of January 1925 she headed back to Portsmouth.\n\nOn the night of 29 January 1925, S-48 arrived off the New Hampshire coast. At about 18:30, the wind picked up and a heavy snowstorm developed. Visibility was reduced to zero. Soon after 19:34, the S-boat grounded on rocks off Jeffrey Point, pulled herself off, then grounded again in Little Harbor. Messages requesting assistance were dispatched. By midnight, the storm had worsened, seas were coming \"clean [sic] over the S-48\" and she was rolling – 15 degrees to port, 60 degrees to starboard. Violent rolling lasted for a little over thirty minutes but a heavy list developed. By 03:30 on 30 January, the battery compartment was taking in water and chlorine gas was forming. The storm continued but help arrived at 05:00, and Coast Guardsmen manning lifeboats rescued the crew. After receiving treatment for exposure and gas at Fort Stark, the crew members were transferred to the Portsmouth Navy Yard in Kittery, Maine.\n\nOn 1 February 1925, salvage operations began. A week later, the S-boat was freed and towed to the navy yard for repairs. However, the damage was severe and funds were lacking. On 7 July 1925, S-48 was decommissioned. Nearly a year later, on 25 June 1926, repairs and alterations were authorized, and on 3 February 1927 the work began. Three Boston & Maine locomotives, G-Class Switchers numbered 426, 413, and 222 respectively, hauled the submarine into a boathouse at the Portsmouth Naval Shipyard in Kittery, Maine, where work on mending her hull could begin.[2] But, again, a shortage of funds stopped the project. In 1928, the repair and modernization was carried out. In hopes of improving habitability and increasing her range, her hull was extended 25½ feet. Her displacement was increased to 1165 tons and her engines were replaced by German M.A.N. types. On 1 December 1928, the work was finally completed. On 8 December 1928, almost four years after her accident, S-48 was recommissioned.\n\nAssigned to SubDiv 12, she departed Portsmouth on 11 January 1929 and headed south. After operations off southern Florida she returned to New London in March 1929 and, in April 1929 commenced a series of test exercises. A casualty to the main motor, however, forced postponement of the exercises, and S-48 returned to Portsmouth. On 5 June 1929, she resumed the exercises.\n\nOn 1 June 1929, S-48 had been reassigned to SubDiv 4, with which she operated through the end of 1929. Then assigned to SubDiv 3, later SubDiv 5, and then Squadron 3, she continued operations off the New England coast, with an interruption for winter maneuvers to the south. During this time, Lieutenant Hyman G. Rickover was assigned to her. He later credited S-48's \"faulty, sooty, dangerous and repellent engineering\" with inspiring his obsession for high engineering standards.[3] She was transferred to the Panama Canal Zone in 1931. On 1 March, she arrived at Coco Solo, where she operated for four years.\n\nThe first gravity measurements at sea had been made in 1926 from a submarine of the Royal Navy. The first U.S. gravity measurements at sea had been made from the submarine USS S-21 (SS-126), assisted by the Eagle Boats USS Eagle No. 35[4] and USS Eagle No. 58.[5][6] S-48 was assigned at the request of the Hydrographer of the Navy by the Secretary of the Navy to assist with the second U.S. expedition on the Navy-Princeton gravity expedition to the West Indies (February–March 1932), to obtain gravity measurements at sea using a gravimeter, or gravity meter, designed by Dr. Felix Vening Meinesz. Meinesz, joined by Dr. Harry Hammond Hess of Princeton University, and a U.S. Navy technician, participated in the expedition.[3] The submarine was accompanied and assisted by the minesweeper USS Chewink (AM-39) in a route from Guantanamo Bay, Cuba to Key West, Florida and return to Guantanamo through the Bahamas and Turks and Caicos region from 5 February through 25 March 1932. The description of operations and results of the expedition were published by the U.S. Navy Hydrographic Office in The Navy-Princeton gravity expedition to the West Indies in 1932.[7]\n\nIn July 1933, S-48  was assigned to the Rotating Reserve and in 1935 she was ordered inactivated. On 20 March 1935, she departed Coco Solo and on 1 June 1935 arrived at Philadelphia, Pennsylvania. On 16 September 1935, she was decommissioned and berthed at League Island.\n\nOn 1 September 1939, World War II broke out in Europe. In 1940, S-48 was ordered activated. She was recommissioned on 10 December 1940, but remained at Philadelphia until mid-March 1941. She then moved up to her home port of New London, Connecticut.\n\nAs a unit of Submarine Squadron One (SubRon 1), she provided services to submarine and antisubmarine warfare training commands at New London and Portland, Maine, until the end of European hostilities in early May 1945. Overhaul and repairs during that time were frequent and in the summer of 1945, the World War I-design submarine was finally designated for disposal.\n\nOn 21 August 1945, S-48 departed New London for the last time and was decommissioned at Philadelphia on 29 August 1945. On 17 September 1945, her name was struck from the Naval Vessel Register, and on 22 January 1946 her hulk was sold to the North American Smelting Company in Philadelphia for scrapping.\n\n This article incorporates text from the public domain Dictionary of American Naval Fighting Ships. The entry can be found here.\n\nList of submarine classes of the United States Navy\n",
  "concepts": [
    "USS S-48",
    "48",
    "new",
    "navy",
    "submarine",
    "uss",
    "portsmouth",
    "new london",
    "london",
    "march",
    "january"
  ],
  "findings": [
    "Construction and commissioning",
    "1921 diving accident",
    "Service history",
    "1st commission, 1922–1925",
    "2nd commission, 1929–1935",
    "3rd commission, 1940–1945",
    "Fate",
    "Awards",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:30:50.197532"
}