{
  "title": "City of Kensington and Norwood",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/City_of_Kensington_and_Norwood",
  "content": "The City of Kensington and Norwood, originally the Corporate Town of Kensington and Norwood, was a local government area in South Australia from 1853 to 1997, centred on the inner eastern Adelaide suburbs of Kensington and Norwood. In November 1997 it amalgamated with the City of Payneham and the Town of St Peters to form the City of Norwood Payneham & St Peters.\n\nIt was proclaimed on 7 July 1853 as the Corporate Town of Kensington and Norwood, covering the then villages of Kensington, Norwood and Marryatville. The town extent was defined as sections 260, 261, 276, 277, 289, and 290 of the Hundred of Adelaide, corresponding to land beside First Creek and Second Creek enclosed by the modern suburbs of Norwood, Marryatville, Kensington and Heathpool. It was the first municipal corporation in South Australia after the City of Adelaide.[2]\n\nThe council was divided into three wards at its inception: West Norwood, East Norwood and Kensington.[3] Charles Bonney was unanimously elected as the first mayor.[2]\n\nOn 18 September 1856, it gained Kent Town from the District Council of Burnside, which was then incorporated as Kent Ward.[4] This was the only change ever made to the council's boundaries.[2] These boundaries were defined as Dequetteville Terrace, Kensington Road, Portrush Road, the southern and eastern boundaries of section 290, Shipster's Road, East Parade, Kensington Terrace (as a section of Portrush Road between Kensington and Norwood was then named), Magill Road, and North Terrace.[1] In 1878, the municipality had a population of 6500, which had doubled by the mid-1880s.[2]\n\nThe original Kensington and Norwood Town Hall was built in 1859 and demolished in 1897. The present Norwood Town Hall was opened in 1883, and received extensive additions in 1914.[5][1] The council undertook a significant program of tree planting in its early years, and managed three municipal plantations.[1] In 1905, the council was given Norwood Oval as a gift in trust, and managed it thereafter.[2]\n\nIt was granted city status on 7 July 1953, the date of its centenary, becoming the City of Kensington and Norwood. The council elected its first woman member, Pamela Meade, in 1975. In 1977, it adopted a general policy \"to preserve the historic character of the City\", and undertook a heritage survey in 1980; in the mid-1980s it was reported to have \"the greatest density of heritage buildings [per hectare] recognised by heritage authorities in the state\".[2]\n\nIn 1985, it was responsible for an area of 3.92 square kilometres, with a population of approximately 9,500, having declined from a peak of 17,000 in the mid-1950s. It had a budget of only $3 million in that year. Each of the four wards was represented by two councillors, with four aldermen representing the whole council area and a directly elected mayor. 23% of the population was over the age of 65 – the second-highest in metropolitan Adelaide. The council sponsored the Christmas Pageant and Mardi Gras each November, the second-largest in South Australia. It also operated a swimming pool complex and a caravan park.[2]\n\nThe council had been deemed to be too small for economic survival as early as the 1970s, and on 1 November 1997 it amalgamated with the City of Payneham and the Town of St Peters to form the City of Norwood Payneham & St Peters.[6][2]\n",
  "concepts": [
    "City of Kensington and Norwood"
  ],
  "findings": [
    "History",
    "Mayors",
    "Other notable figures",
    "See also",
    "Footnotes",
    "References"
  ],
  "timestamp": "2025-04-11T10:16:10.356744"
}