{
  "title": "Claudia Cowan",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Claudia_Cowan",
  "content": "Claudia Lynn Cowan[1] (born July 31, 1963) is an American television journalist who is a news reporter for Fox News.\n\nCowan is the daughter of actress Barbara Rush (who also attended UC Santa Barbara) and publicist Warren Cowan, co-founder of Rogers & Cowan, a worldwide public relations firm.[2] She attended the University of California, Santa Barbara prior to graduating from the University of California, Los Angeles.[3]\n\nCowan’s father married Barbara Crane Gilbert Abeles Udko in 1995 and they remained married until his death in 2008.  He was her fourth husband. Barbara Crane was the daughter of The Honeymooners comedy writer Harry Crane and along with her first husband actor Paul Gilbert, adopted Melissa and Jonathan Gilbert of Little House on the Prairie fame.  She is also the mother of actress Sara Gilbert with Harold Abeles, but Sara adopted the family’s famous acting surname. At age 32, Claudia became a stepsister to Melissa, Jonathan and Sara Gilbert.\n\nShe began her career at KTTV-TV (FOX) in Los Angeles, where she worked her way up from being a messenger to an on-air reporter.  She then moved to KMST-TV in Monterey, California as a desk assistant, and worked her way up to reporter, anchor of the noon news, then co-anchor of the weekend evening news where she also spent time producing and editing.  From there, she spent seven years at KOVR-TV13 (CBS) in Sacramento, California, covering breaking news and state politics, and anchoring the morning and midday newscasts.  In 1995, she moved to KRON-4 (NBC) in San Francisco to report for the evening news.\n\nIn April 1998, she was hired by the newly launched Fox News, as their Bay Area correspondent.  While reporting on the 2014 Isla Vista shootings on a May 26, 2014, Fox News newscast, she says she went to UCSB where the shootings occurred.\n\nCowan was previously married to sports agent Steve Baker and has twin children.[4][5]\n",
  "concepts": [
    "Claudia Cowan",
    "news",
    "cowan",
    "gilbert",
    "barbara",
    "fox",
    "california",
    "sara",
    "reporter",
    "married",
    "fox news"
  ],
  "findings": [
    "Early life and education",
    "Career",
    "Personal life",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T15:38:24.975714"
}