{
  "title": "Charles March-Phillipps",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Charles_March-Phillipps",
  "content": "Charles March-Phillipps (28 May 1779 – 24 April 1862)[1] was a British Radical[2] politician from Garendon Park in Leicestershire.[3] He sat in the House of Commons in two periods between 1818 and 1837.\n\nHe was the eldest son of Thomas March Phillipps (formerly March) of More Critchell, Dorset, and was educated at Sherborne School (until 1791), Eton College (1793–1796) and Sidney Sussex College, Cambridge (1800–02).[4] He was a captain in the Leicestershire Yeomanry from 1803 to 1807. He succeeded his father to Garendon Hall, Leicestershire, in 1817.\n\nHe married Harriet, the daughter of John Gustavus Ducarel of Walford, Somerset, and had two sons and a daughter. His son Ambrose Charles Lisle March Phillipps De Lisle converted to Roman Catholicism and founded Mount St Bernard Abbey.\n\nHe was elected in the 1818 general election as one of the two Members of Parliament (MPs) for Leicestershire,[5]\nand held the seat until 1820,[1] when he did not contest the election.[6] He returned again for the 1831 general election,[3] and held the seat until the 1831 general election, when the county was divided under the Reform Act. He was then elected for the new Northern division of Leicestershire,[7] and held the seat until he stood down at the 1837 general election.[8]\n\nHe was appointed High Sheriff of Leicestershire from 1825 to 1826.\n\nThis article about a member of Parliament representing an English constituency is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Charles March-Phillipps",
    "leicestershire",
    "election",
    "march",
    "general election",
    "general",
    "seat",
    "phillipps",
    "march phillipps",
    "held seat",
    "held"
  ],
  "findings": [
    "Personal life",
    "Political career",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T15:38:24.870711"
}