{
  "title": "Josateki Nawalowalo",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Josateki_Nawalowalo",
  "content": "Ratu Josateki Tuivanuavou Nacagilevu Nawalowalo (1950 – 27 August 2010), commonly known as Ratu Jo Nawalowalo, was a Fijian chief, businessman, and the chairman of the Kadavu Provincial Council.  He also chaired the Fiji Kava Council, which promotes the sale of yaqona locally and internationally.\n\nAs chairman of the Provincial Council, Nawalowalo promoted aggressive infrastructural development programs.  He also strongly supported the central government of Prime Minister Laisenia Qarase, and refused to let Military teams tour Kadavu to campaign against the government's controversial Reconciliation, Tolerance, and Unity Bill, which Nawalowalo strongly supported.\n\nOn 29 March 2006, Nawalowalo expressed interest in contesting the Kadavu Fijian Communal Constituency for the ruling Soqosoqo Duavata ni Lewenivanua Party (SDL), but ended up withdrawing in favour of the incumbent, Konisi Yabaki.\n\nIn the aftermath of the military takeover of 5 December 2006, Nawalowalo changed his views, and threw his support behind the new regime.[1]  This provoked an angry reaction from some of his fellow chiefs, who were reported by Fiji Television on 9 December as instructing him to refrain from making any further public statements without their approval.[2] In May 2008, he was not returned as chairman of the Kadavu Provincial Council.[3]\n\nNawalowalo co-chaired the task force focusing on economic growth within the National Council for Building a Better Fiji.[4]\n\nNawalowalo died 27 August 2010, aged 60.[5]\n\nThis biography of a Fijian is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Josateki Nawalowalo",
    "nawalowalo",
    "council",
    "kadavu",
    "provincial council",
    "provincial",
    "fijian",
    "fiji",
    "chairman",
    "supported",
    "strongly supported"
  ],
  "findings": [
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:19.102229"
}