{
  "title": "Christopher Wilder",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Christopher_Wilder",
  "content": "Christopher Bernard Wilder (March 13, 1945 – April 13, 1984), also known as the Beauty Queen Killer and the Snapshot Killer, was an Australian-American serial killer[1] who abducted at least twelve young women and girls, killing eight of them during a six-week, cross-country crime spree in the United States in early 1984. Wilder's series of murders began in Florida on February 26, 1984, and continued across the country through Texas, Oklahoma, Colorado, Nevada and California, with attempted abductions in Washington and New York. Wilder victimized attractive young women, most of whom he would entice by promising to take their photographs. After subduing his victims, he would torture and rape them before shooting, stabbing, or strangling them to death. Two or more of his victims were electrocuted using a makeshift electrical cord.[1]\n\nAfter being named a suspect in the disappearances of his first two victims, both of whom were women he knew and whose bodies were never found, Wilder began to target random women, many of whom were abducted from shopping malls. He accidentally killed himself during a struggle with police in New Hampshire on April 13, 1984.[2] Since his death, Wilder has been suspected in the additional rapes, murders and disappearances of many other women, including the unsolved 1965 Wanda Beach Murders in his native city of Sydney, as well as the suspected murder of missing 18-year-old beauty queen Tammy Lynn Leppert. The 1986 made-for-television movie Easy Prey dramatizes Wilder's crimes.[3]\n\nChristopher Wilder was born on March 13, 1945, in Sydney, New South Wales,[4] the oldest of four sons to an American father, Coley Chapman Wilder (August 27, 1919 – January 29, 1992), a naval officer, and an Australian mother, June Wilder (née Decker; June 18, 1925 – April 26, 1986). Wilder nearly died at birth and reportedly almost drowned in a swimming pool when he was aged 2.[5][6] On January 4, 1963, at age 17, Wilder raped a 13-year-old girl in a Freshwater quarry, in the company of two other men, both of whom denied being involved in the assault. Wilder was sentenced to probation and claimed later in life that he also received electroshock therapy.[6][7] It has been suggested that this therapy aggravated Wilder's violent sexual tendencies.[8] However, journalist Duncan McNab claims that there is no evidence that Wilder underwent electroshock therapy and that the story of his near-drowning was an invention of Wilder himself.[9]\n\nWilder married in 1968, but his wife left him after one week when Wilder was taken in for questioning over a series of sexual assaults at Manly Beach.[10] After their divorce, Wilder's ex-wife told law enforcement that he had attempted to seduce both his mother-in-law and sister-in-law, and that she had found pictures of young women in their underwear in a briefcase inside his car. She also admitted to police that Wilder had twice attempted to kill her.[10] In November 1969, Wilder used nude photographs to extort sex from an Australian student nurse; she complained to police, but charges were ultimately dropped when she refused to testify in court. Wilder emigrated to the United States in 1969 and settled in Boynton Beach, Florida, in an upscale waterfront home twenty-five miles south of affluent Palm Beach, becoming successful in the real estate business. He frequently traveled to Hawaii and the Bahamas and also developed an interest in photography, which resulted in his converting a bedroom of his home into a darkroom.[10]\n\nBetween 1971 and 1975, Wilder faced various charges related to sexual misconduct.[11] He raped a young woman he had lured into his truck on the pretense of photographing her for a modeling contract.[7] This was to become part of his modus operandi during his later crime spree. Despite several convictions, Wilder was never jailed for any of these offenses.[12] In 1977, a psychologist deemed Wilder a \"mentally disordered sex offender\" and \"not safe except in a structured environment and should be in a resident program\" and also noted his need to dominate women and turn them into slaves for his pleasure.[10] He had expressed interest in white slavery and spoke of his sexual fantasies which involved twisting a woman's nipples during sex and slapping and kicking sexual partners. While visiting his parents in Australia in 1982, Wilder was charged with sexual offenses against two 15-year-old girls whom he had forced to pose nude after luring them from Manly Beach. His parents posted bail and he was allowed to return to Florida to await trial, but court delays prevented his case from ever being heard, as the eventual initial hearing date of April 1984 came after his death.[13][14] Two other young girls, aged 10 and 12, later identified Wilder from mugshots as the man who had abducted them in Boynton Beach in 1983 and forced them to perform oral sex on him.[1]\n\nThe first murder attributed to Wilder was that of 20-year-old Rosario Teresa Gonzalez, who was last seen on February 26, 1984, at the Miami Grand Prix, where she was employed as a spokesmodel at a temporary job distributing samples of aspirin for a pharmaceutical company.[15] Witnesses stated that she left the Grand Prix track between noon and 1:00 p.m. with a Caucasian man in his thirties. Her blue 1980 Oldsmobile Cutlass was found parked near Dupont Plaza. Wilder was a race car driver who frequented the Miami Grand Prix racetrack and was also at the race, where he raced in the IMSA GTU class in a Porsche 911.[16]\n\nOn March 5, 1984, Wilder's former girlfriend, Miss Florida finalist Elizabeth Ann Kenyon, 23, went missing. She dated Wilder for a period of time, and was proposed to by him, but she declined due to their age difference; she is believed to have been last seen with him at a gas station near Miami. Her car was found six days later abandoned at the Miami Airport.[17] Gonzalez was an aspiring model at the time of her disappearance and had participated in the Miss Florida beauty contest along with Kenyon. Neither woman's remains have ever been found. On March 18, Wilder led 21-year-old Theresa Anne Ferguson away from the Merritt Square Mall in Merritt Island, Florida. He murdered Ferguson and dumped her body at Canaveral Groves, where it was discovered on March 23.\n\nWilder's next victim was 19-year-old Linda Grover from Florida State University, whom he abducted from the Governor's Square Mall in Tallahassee, Florida, and transported to Bainbridge, Georgia, on March 20, 1984. She had declined his offer to photograph her for a modeling agency, after which he assaulted her in the mall parking lot. Wilder tied Grover's hands, wrapped her in a blanket, and put her in the trunk of his car. Grover was taken to Glen Oaks Motel and was raped. Wilder blinded her with a blow dryer and super glue. He applied copper wires to her feet and passed an electric current through them. When she tried to get away, he beat her, but she escaped and locked herself in the bathroom, where she began pounding on the walls. Wilder fled in his car, taking all of Grover's belongings with him.[18]\n\nOn March 21, 1984, Wilder approached Terry Diane Walden, a 23-year-old wife, mother, and nursing student at Lamar University in Beaumont, Texas, about posing as a model. She turned him down, but ran across him again two days later, March 23, and he kidnapped her then. Wilder raped her, stabbed her to death and dumped her body in a canal, where she was found on March 26. \n\nAfter killing Walden, Wilder fled in her rust-colored 1981 Mercury Cougar. On March 25, Wilder abducted 21-year-old Suzanne Wendy Logan at the Penn Square Mall in Oklahoma City. Wilder took her 180 miles north to Newton, Kansas, and checked into room 30 of the Interstate 35 Inn. After breakfast the next morning, he drove to Milford Reservoir, 90 miles northeast of Newton near Junction City, Kansas, where he stabbed her to death and dumped her body under a cedar tree.\n\nWilder took 18-year-old Sheryl Lynn Bonaventura captive in Grand Junction, Colorado, on March 29, 1984. They were seen together at a diner in Silverton, where they told staff they were heading for Las Vegas with a stop in Durango on the way. On March 30, they were seen at the Four Corners Monument, after which Wilder checked into the Page Boy Motel in Page, Arizona. Wilder shot and stabbed Bonaventura to death around March 31 near the Kanab River in Utah, but her body was not found until May 3. \n\nWilder killed 17-year-old Michelle Lynn Korfman, an aspiring model, who disappeared from a Seventeen magazine cover model competition at the Meadows Mall in Las Vegas on April 1, 1984. A photograph was taken of Wilder stalking her at the competition. Her body remained undiscovered near a Southern California roadside rest stop until May 11, and was not identified until mid-June via dental X-rays.[19]\n\nOn April 4, 1984, near Torrance, California, Wilder photographed 16-year-old Tina Marie Risico before abducting her and driving her to El Centro, where he assaulted her. Wilder apparently believed that Risico would be of use in helping him  get other victims,[20] so he kept her alive and took her with him as he traveled back east through Prescott, Arizona, Joplin, Missouri, and Chicago, Illinois. Wilder had been on the FBI's ten most wanted fugitives list since the second week of April.\n\nHe and Risico went to Merrillville, Indiana, on April 10, where she helped him abduct 16-year-old Dawnette Sue  Wilt at the Southlake Mall. Wilder raped Wilt several times as Risico drove to New York. Near Penn Yan, Wilder took Wilt into the woods and attempted to suffocate her before stabbing her twice and leaving her. Wilt managed to tie a pair of jeans around herself and flag down help. A truck driver, Charlie Laursen, took her to Soldiers and Sailors Hospital in Penn Yan. Wilder had doubled back and returned to the spot where he left her to make sure she was dead. He panicked on seeing she had fled.[21] Following surgery Wilt survived, and she recuperated at Soldiers and Sailors Hospital. She told local police that Wilder was heading for Canada. \n\nAt the Eastview Mall in Victor, New York, Wilder forced 33-year-old Beth Elaine Dodge into his car and had Risico follow him in Dodge's Pontiac Firebird. After a short drive, Wilder shot Dodge and dumped her body in a gravel pit. Risico and he then drove the Firebird to Logan Airport in Boston, where he bought her a ticket to Los Angeles.[21] Wilder then headed north, and in Beverly, Massachusetts, he attempted to abduct a woman at gunpoint, but was unsuccessful.[22]\n\nOn April 13, 1984, Wilder stopped at Vic's Getty service station in Colebrook, New Hampshire to ask directions to Canada.[12]  Two New Hampshire state troopers, Leo Jellison and Wayne Fortier, approached Wilder, who retreated to his car to arm himself with a Colt Python .357 Magnum.[49] Jellison was able to grab Wilder from behind and in the scuffle, two shots were fired. The first bullet hit Wilder and exited through his back and into Jellison. The second bullet hit Wilder in the chest. Wilder died; Jellison was seriously wounded, but recovered and returned to full duty.[50] A copy of the novel The Collector by John Fowles, in which a man keeps a woman in his cellar against her will until she dies, was found among Wilder's possessions after his death.[51] Wilder was cremated in Florida, leaving a personal estate worth more than $7 million. In June 1986, a court-appointed arbitrator ruled that the after-tax balance was to be divided among the families of his victims.[52][53][54]\n",
  "concepts": [
    "Christopher Wilder"
  ],
  "findings": [
    "Early life and criminal history",
    "Crime spree in US",
    "Florida and Georgia murders",
    "Texas and Kansas murders",
    "Utah and California murders",
    "New York murder",
    "Suspected victims",
    "Death",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:20:48.572318"
}