{
  "title": "Carl Schiøtz Wibye",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Carl_Schiøtz_Wibye",
  "content": "Carl Schiøtz Wibye (born January 7, 1947, in Moss, Norway) is a Norwegian diplomat. He was Norway's ambassador to Saudi Arabia from 2009 to 2014. Carl Schiøtz Wibye has a military background in the Norwegian Army Corps of Engineers. He is a master of Political Sciences from Oslo University. His diplomatic career includes work in the Norwegian embassies in Warsaw, Belgrade, Bern, Cairo, Tehran, Macedonia, Tirana, Pristina and Saudi Arabia. He has been decorated with the Norwegian order of Commander.\n\nIn his time as the Norwegian Ambassador to Saudi Arabia Carl Schiøtz, Wibye rode around large areas of the country incognito on a motorcycle, and got extensive knowledge of local details of the Saudi society, religion and history.\n\nIn early spring 2017, his book Terrorens Rike (Kingdom of Terror) was published in Norwegian.\n\nIn the book he claims that the Saudi Arabian Wahhabism-religion is a cult rather than a religion, built on fanatical fantasies of a 16th-century preacher Ibn Abd al-Wahab, founder of the Wahhabi branch of Salafi Islam. Salafism is extreme and calls for holy war on all infidels including Jews, Christians, Shia-Muslims, Sufi-Muslims and even some Sunni-Muslims who are believed not to be pure enough.\nHe claims the Saudi leaders have exchanged stability internally in Saudi Arabia for large sums of money to fund Koran-schools all over the world, and these have created instability by preaching and promoting terrorism.\n\nHe suggests the banning of regimes which do not subscribe to the United Nations’ Universal Declaration of Human Rights. He is not against Islam, which in its other forms is largely peaceful, but suggests shutting down extremist Koran-schools. He does not want paint a picture of a large clash of civilizations between Islam and the West but that of an extremist cult within Islam and the catastrophic effects of the support of Saudi Arabia to that cult.\n",
  "concepts": [
    "Carl Schiøtz Wibye"
  ],
  "findings": [
    "Sources"
  ],
  "timestamp": "2025-04-11T10:09:09.384968"
}