{
  "title": "Michael Zimbalist",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Michael_Zimbalist",
  "content": "Michael Zimbalist is an American filmmaker.[1] He is a three-time Emmy Award and a Peabody Awards winner.[2]\n\nMichael Zimbalist was born in Northampton, Massachusetts. He graduated from Wesleyan University and trained as an actor at the New York University Tisch School of the Arts.[3] He is a director, producer, and writer whose films have been broadcast on HBO, Netflix, Apple, Fox, Showtime, PBS, ESPN and the BBC, as well as theatrically distributed worldwide. He has also produced and directed commercial work for RealTruck, Gatorade, Pepsi, Verizon, and the NFL.[4]\n\nIn 2010, Michael wrote, directed and produced The Two Escobars with his brother  Jeff Zimbalist. The film was an official selection at the Cannes Film Festival, the Tribeca Film Festival, the Los Angeles Film Festival, the IDFA International Film Festival, and was released by Disney / ESPN Films.[5]\nSports Illustrated named the film the Documentary of the Year alongside The Tillman Story.[6]  The New York Post and Vulture ranked it as the best of the 150 films in the Academy Award-winning and Emmy Award-winning 30 for 30 series.[7]\n\nBetween 2010 and 2014, Michael produced four entries in the 30 for 30 series, including Arnold's Blueprint with Arnold Schwarzenegger, The Myth of Garrincha, and Youngstown Boys, about Maurice Clarett and Jim Tressel.[8] Youngstown Boys, which Michael also co-wrote and directed, won the Sports Emmy Award in 2014.\n\nIn 2016, Michael co-wrote and directed Pelé: Birth of a Legend, a scripted feature film about the soccer legend for Imagine Entertainment with Academy Award winner Brian Grazer producing and an original score from Academy Award winner A. R. Rahman.[9] The film premiered at the Tribeca Film Festival and was released theatrically worldwide.[10] In 2017, Michael wrote the story for and associate produced Loving Pablo, starring Javier Bardem and Penelope Cruz, which premiered at the Venice International Film Festival and the Toronto International Film Festival and was released by Universal Studios.[11]\n\nIn 2018, Michael co-wrote, produced and directed Nossa Chape, the critically acclaimed story of the Chapecoense soccer club airplane crash, which premiered at SXSW and was released in theaters and later broadcast by Fox.[12] The same year, Michael co-wrote, produced and directed Momentum Generation, about the world’s most legendary surf crew, starring Kelly Slater and Rob Machado and executive produced by Robert Redford. It also won the Sports Emmy Award for Best Feature Documentary, and a Tribeca Film Festival Audience Award.[13] Also in 2018, Michael co-wrote, produced and directed the feature documentary Give Us This Day, about three police officers and three residents in East St. Louis, the city with the highest homicide rate in the country, executive produced by Vince Vaughn.[14] Additionally, in 2018, Michael produced and directed 6 episodes of Fox's series Phenoms, about young footballers in the lead up to the World Cup.[15]\n",
  "concepts": [
    "Michael Zimbalist",
    "film",
    "michael",
    "produced",
    "film festival",
    "festival",
    "directed",
    "award",
    "wrote",
    "michael wrote",
    "produced directed"
  ],
  "findings": [
    "Life and career",
    "The Two Escobars",
    "Youngstown Boys and 30 for 30",
    "Pelé and Loving Pablo",
    "Nossa Chape, Momentum Generation, Give Us This Day, and Phenoms",
    "Filmography",
    "Awards and nominations",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:30:52.632978"
}