{
  "title": "Biomarkers of diabetes",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Biomarkers_of_diabetes",
  "content": "Diabetes mellitus (DM) is a type of metabolic disease characterized by hyperglycemia. It is caused by either defected insulin secretion or damaged biological function, or both. The high-level blood glucose for a long time will lead to dysfunction of a variety of tissues.[1]\n\nType 2 diabetes is a progressive condition in which the body becomes resistant to the normal effects of insulin and/or gradually loses the capacity to produce enough insulin in the pancreas.[2]\n\nPre-diabetes means that the blood sugar level is higher than normal but not yet high enough to be type 2 diabetes.[3]\n\nGestational diabetes is a condition in which a woman without diabetes develops high blood sugar levels during pregnancy.[4]\n\nType 2 diabetes mellitus and prediabetes are associated with changes in levels of metabolic markers, these markers could serve as potential prognostic or therapeutic targets for patients with prediabetes or Type 2 diabetes mellitus.[5]\n\n[5]\n\n-Biomarkers with insulin-sensitizing properties (irisin, omentin, oxytocin)[5]\n\n-Biomarkers of metabolic dysfunction (HGF, Nesfatin and Betatrophin)[5]\n\nOxytocin (OXT), a hormone most commonly associated with labor and lactation, may have a wide variety of physiological and pathological functions, which makes Oxytocin and its receptor potential targets for drug therapy.[6]\nOXT may have positive metabolic effects; this is based on the change in glucose metabolism, lipid profile, and insulin sensitivity. It may modify glucose uptake and insulin sensitivity both through direct and indirect effects. It may also cause regenerative changes in diabetic pancreatic islet cells. So, the activation of the OXT receptor pathway by infusion of OXT, OXT analogues, or OXT agonists may represent a promising approach for the management of obesity and related metabolic diseases as well as diabetes and its complications.[6]\n\nOxytocin improves insulin sensitivity by:[6]\n\nOxytocin may cause β-cell regeneration by:[6]\n\nOxytocin levels:[5]\n\nOmentin is an anti-inflammatory adipokine produced preferentially by visceral adipose tissue. Plasma omentin-1 levels are significantly decreased in patients with obesity, insulin resistance and diabetes that contribute to the major components of the metabolic syndrome. Insulin resistance contributes to the changes of cholesterol synthesis and absorption as well. However, nothing is known about the relationship between Omentin and metabolic risk factors. So a study were held in Japan comprised 201 Japanese men who underwent annual health check-ups. Plasma Omentin levels were determined by enzyme-linked immunosorbent assay. They divided the subjects into 4 groups according to Omentin levels. A reduction of plasma Omentin levels significantly correlated with an increase in the mean number of metabolic risk factors such as increased waist circumference, Dyslipidemia, high blood pressure and glucose intolerance. They concluded that Circulating Omentin levels are negatively correlated with the multiplicity of metabolic risk factors, suggesting that Omentin acts as a biomarker of metabolic disorders.[1]\n\nIrisin, a newly identified hormone, was first reported by Bostromet al. in 2012, is a novel myokine which plays an important role in the homeostasis, metabolism and energy balance. Irisin is reported to be involved in insulin resistance in both humans and animal models. Circulating irisin levels progressively decrease with the worsening of the glucose tolerance.[7]\nA recent study conducted a comparative cross-sectional evaluation of baseline circulating levels of the novel hormone Irisin and the established adipokine adiponectin with metabolic syndrome, cardio-metabolic variables and cardiovascular disease risk, and they found out that the baseline irisin levels were significantly higher in subjects with metabolic syndrome than in subjects without metabolic syndrome.[7]\n\nNesfatin-1 is a peptide secreted by peripheral tissues, central and peripheral nervous system. It is involved in the regulation of energy, homeostasis related with food regulation and water intake.[8]\nNesfatin-1 can pass through the blood-brain barrier in both directions. It suppresses feeding independently from the leptin pathway and increases insulin secretion from pancreatic beta islet cells. this is demonstrated by in-vitro studies that Nesfatin-1 stimulates the Preproinsulin mRNA expression and increases the glucose induced insulin release. That is why nesfatin-1 has drawn attention as a new therapeutic agent, especially for the treatment of obesity and diabetes mellitus.[8]\n\nIn T2DM patients Nesfatin-1 is elevated and this could possibly be as a result of a resistance. Thus, Nesfatin-1 acts as a potent Anorexigenic factor (anti-obesity) that improves insulin resistance and opposes weight gain.[8]\n\nHepatocyte growth factor (HGF) is a mitogen and insulin tropic agent for the β cell. Inadequate β-cell mass can lead to insulin insufficiency and diabetes. During times of prolonged metabolic demand for insulin, the endocrine pancreas can respond by increasing β-cell mass, both by increasing cell size and by changing the balance between β-cell proliferation and apoptosis.[9][10]\nIt is important to know the effects of high glucose on the factors that may influence endothelial cell growth. A novel member of endothelium-specific growth factors, hepatocyte growth factor (HGF), is produced in vascular cells. In diabetic patient's, levels of the hepatocyte growth factor (HGF) were found in high levels, thus independently associated with increased the incidence of diabetes.\nThere is a study that indicate that HGF/c-Met signalling is essential for maternal β-cell adaptation during pregnancy and that its absence/attenuation leads to gestational diabetes mellitus.[10][9]\n\nBetatrophin:\n\nis a novel protein predominantly expressed in human liver and adipose tissues. Increasing evidence has revealed an association between betatrophin expression and serum lipid profiles, particularly in patients with obesity or diabetes, Thus betatrophin is closely related to diabetes treatment, it promotes greatly the proliferation of pancreatic beta cells, plays an important role in modulating glycolipid metabolism, and maybe replaces insulin in the effective treatment of diabetes.[11]\nstudies showed that betatrophin could increase the quantity of cells that produce insulin in mice quickly. Others showed that the circulating level of betatrophin in T2DM patient blood was higher than that in control groups.[11]\nExpression of betatrophin correlates with β cell proliferation. Transient expression of betatrophin in mouse liver significantly and specifically promotes pancreatic β cell proliferation, expands β cell mass, and improves glucose tolerance. Thus, betatrophin treatment could augment or replace insulin injections by increasing the number of endogenous insulin-producing cells in diabetics.[11]\n\nIs a vasoconstrictor peptide released from vascular endothelial cells. At the cellular level, the balance between vasodilator (Nitric oxide) and vasoconstrictor (ET-1) actions determines the vascular response to insulin. So, high levels of ET-1, which achieved in insulin resistance states that includes patients that have T2DM or metabolic syndromes or they are obese, have inhibitory effect on nitric oxide production which results in low nitric oxide and heightened levels of ET-1.[12] \nET-1 activity is also enhanced secondary to abnormalities in vascular insulin signalling, In addition to its direct vasoconstrictor effects. Furthermore, ET-1 induces a reduction in insulin sensitivity and may take part in the development of the metabolic syndrome.[12]\n\nET-1 In addition to its direct vasoconstrictor effects, it causes changes in visceral and perivascular adipose tissue (PVAT), and may contribute to the pathogenesis of both insulin resistance and vascular dysfunction/damage. Perivascular adipose tissue seems to have anti contractile effect and this dilator effect was lost in obese patients.\nsecondary to obesity, ET-1 high level changes on PVAT will lead to PVAT hypertrophy which will be associated with reduced partial oxygen pressure, an increase in the production of inflammatory cytokines such as TNF-α and IL-6, and elevation of reactive oxygen species. Thus, oxidative stress and hypoxia may promote imbalance in the production of vasoactive compounds and may affect vascular homeostasis by activating the ET-1 system.[9]\n\nfibroblast growth factor (FGF-21) has been recently characterized as a potent metabolic regulator. Systemic administration of FGF-21 reduced plasma glucose and triglycerides to near normal levels in genetically compromised diabetic rodents.[13]\n\nFGF21 can function as a crucial regulator mediating beneficial metabolic effects of therapeutic agents such as metformin, glucagon/glucagonlike peptide1analogues, thiazolidinedione, sirtuin 1 activators, and lipoic acid. A study showed that when fibroblast growth factor-21 administered daily for 6 weeks to diabetic rhesus monkeys, it caused a dramatic decline in fasting plasma glucose, fructosamine, triglycerides, insulin and glucagon. In a significant point during the study, FGF-21 administration also led to significant improvements in lipoprotein profiles and a beneficial changes in the circulating levels of several cardiovascular risk markers. And the induction of a small but significant weight loss. These data support the development of FGF-21 for the treatment of diabetes and other metabolic diseases.[13]\n",
  "concepts": [
    "Biomarkers of diabetes"
  ],
  "findings": [
    "Metabolic markers",
    "Biomarkers with insulin-sensitizing properties",
    "Oxytocin",
    "Omentin",
    "Irisin",
    "Biomarkers of metabolic dysfunction",
    "Nesfatin-1",
    "Hepatocyte growth factor (HGF)",
    "Others",
    "Endothelin-1(ET-1)",
    "PVAT AND ET-1",
    "Fibroblast growth factor",
    "References"
  ],
  "timestamp": "2025-04-11T10:19:10.872299"
}