{
  "title": "Malcolm Whitman",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Malcolm_Whitman",
  "content": "Malcolm \"Mal\" Douglass Whitman (March 15, 1877 – December 28, 1932) was an American tennis player who won three singles titles at the U.S. National Championships.\n\nHe graduated from The Roxbury Latin School, where he is celebrated as one of its greatest athletes. Whitman was American intercollegiate singles tennis champion in 1896[3] and doubles champion in 1897 and 1898[4] as a student at Harvard University. He graduated from Harvard Law School in 1899 and received his bachelor in law degree in 1902.[5]\n\nIn 1896, Whitman entered his first U.S. National Championships at the Newport Casino and lost in the quarterfinals to Bill Larned. In 1897, he lost in the quarterfinals, this time against Harold Nisbet.[6] Whitman is best known for this hat-trick of singles titles at the U.S. National Championships. Between 1898 and 1900, he stayed undefeated there. In 1901, he did not compete and in the 1902 Championships, and he lost in the All-Comers final to Englishman Reginald Doherty. According to the Doherty brothers, Malcolm Whitman and Bill Larned were at the time the best American singles players.\n\nHe played on the inaugural American Davis Cup squad in 1900 and beat Englishman Arthur Gore in Boston, Massachusetts to help his US team win the trophy.[7] In the 1902 Davis Cup final against Great Britain in Brooklyn,  he contributed to his team's win by defeating Joshua Pim and Reginald Doherty in the singles.[8]\n\nWhitman retired from tennis in 1902 at the age of 25. He was a member of the executive committee of the U.S. National Lawn Tennis Association and held management positions in several companies.[5]\n\nIn 1932, he wrote a book on the origin of tennis titled Tennis - Origins and Mysteries.\n\nIn their book R.F. and H.L. Doherty - On Lawn Tennis (1903) multiple Wimbledon champions Reginald and Lawrence Doherty described Whitman's playing style:\n\nWhitman is very safe everywhere, and has not a weak point. We believe he has only been beaten once in the last five years. Perhaps his backhand is almost as good as his forehand. He plays the volleying game, as nearly all the Americans do, and gets up to the net on every possible occasion, and when at the net is very hard to pass. He is wonderfully sure on his volley and, besides, has an enormous reach, and is very active and severe overhead. On the ground he plays rather a soft but still an accurate game, and gets more pace on the ball than he seems to. His length is always excellent. He hits the ball rather low, and passes well. And he has that supreme merit - that he rarely misses easy strokes.\nWhitman married his first wife, Janet McCook in 1907. She died in December 1909 after the birth of their second child.[11] In July 1912, Whitman married Jennie Adeline Crocker but they divorced in 1924. In 1926, Whitman married Lucilla Mara de Vescovi, known as the Countess Mara. In December 1931, his daughter Mary, 16, from his second marriage, died of pneumonia.[12] On December 28, 1932, Whitman committed suicide by jumping off an apartment building in New York after a nervous breakdown.[13]\n",
  "concepts": [
    "Malcolm Whitman",
    "whitman",
    "tennis",
    "singles",
    "doherty",
    "national",
    "december",
    "championships",
    "american",
    "1902",
    "whitman married"
  ],
  "findings": [
    "Biography",
    "Grand Slam finals",
    "Singles: 3 titles",
    "Playing style",
    "Personal life",
    "Bibliography",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:39.487042"
}