{
  "title": "1971 Winston 500",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/1971_Winston_500",
  "content": "The 1971 Winston 500 was a NASCAR Winston Cup Series race that took place on May 16, 1971, at Alabama International Motor Speedway (now Talladega Superspeedway) in Talladega, Alabama.[2]\n\nGeorge Altheide, Doc Faustina and David Sisco would make their NASCAR Winston Cup Series debuts in this race.[3]\n\nTalladega Superspeedway, originally known as Alabama International Motor Superspeedway (AIMS), is a motorsports complex located north of Talladega, Alabama. It is located on the former Anniston Air Force Base in the small city of Lincoln. The track is a Tri-oval and was constructed by International Speedway Corporation, a business controlled by the France family, in the 1960s. Talladega is most known for its steep banking and the unique location of the start/finish line - located just past the exit to pit road. The track currently hosts the NASCAR series such as the NASCAR Cup Series, NASCAR Xfinity Series, and the NASCAR Truck Series. Talladega Superspeedway is the longest NASCAR oval with a length of 2.66 miles (4.28 km), and the track at its peak had a seating capacity of 175,000 spectators.[4]\n\nTwenty-nine thousand people saw Donnie Allison (racing for the Wood Brothers racing team) defeat his brother Bobby (racing for Holman-Moody) by six car lengths in the first official race for new sponsor Winston.[2] Both of them were driving 1969 Mercury Cyclones.[2][3] The race took three hours and thirty-two minutes to complete.[2][3] Seven cautions slowed the race for forty-five laps.[2][3]\n\nOther finishers in the top ten included: Buddy Baker (driving for Petty Enterprises), Pete Hamilton, Fred Lorenzen, Jim Vandiver, James Hylton, Bill Dennis, Dave Marcis, and Larry Baumel. There were 45 lead changes between four drivers and Dave Marcis made his first race with the car #71.[2][3] Marcis was a contender for the win until his engine blew on lap 181; marking the first good finish of a NASCAR Winston Cup Series race on live television.[2][3]\n\nNotable drivers in the race included: Richard Petty, J.D. McDuffie, Coo Coo Marlin, Benny Parsons, Neil Castles, and Ron Keselowski (uncle of current NASCAR driver Brad Keselowski).[2][3] Bobby Isaac was hospitalized and could not compete in the race due to kidney stones.\n\nThe prize purse was $145,040 ($1,126,115.83 when adjusted for inflation); Donnie Allison received $31,140 for winning ($241,776.38 when adjusted for inflation) while last-place finisher Bub Strickler got $1,000 ($7,764.17 when adjusted for inflation).[5]\n",
  "concepts": [
    "1971 Winston 500",
    "race",
    "nascar",
    "series",
    "talladega",
    "winston",
    "superspeedway",
    "cup series",
    "cup",
    "alabama",
    "winston cup"
  ],
  "findings": [
    "Background",
    "Qualifying",
    "Race report",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:19:10.052033"
}