{
  "title": "Michael Klar",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Michael_Klar",
  "content": "Michael Klar (1943 – 2 September 2023) was a German graphic artist, designer and professor for visual communication.\n\nMichael Klar was born in Berlin in 1943. He qualified as a photographer at the Lette-Verein in Berlin. From 1963 to 1966 he studied at the Visual Communication Department of the renowned \"Hochschule für Gestaltung Ulm\", Germany. Among his tutors were Otl Aicher, Herbert W. Kapitzki and Tomás Maldonado.\n\nBetween 1966 and 1967 he worked as assistant in the Kapitzki/Ohl project group for the pavilion of the Federal Republic of Germany at the world exhibition EXPO 67 Montreal, Canada.[1] He graduated in 1968 obtaining his diploma from the HfG (Hochschule für Gestaltung) Ulm. He acted as student spokesman during the year in which the school was forced to close.\n\nFrom 1968 to 1970 he was involved in the development of a design lab, the \"Holzäpfel Projekt Institut\". In 1970 together with architect Bernd Meurer he initiated the \"Project Co'\", a design studio in Ulm.\n\nIn 1972 Klar was called as professor for Visual Communication to the \"Hochschule für Gestaltung Schwäbisch Gmünd\" where he was to influence the concepts and programme of the college.[2] Furthermore, during the same period, he held several guest professorships in various design schools, among which the Ohio State University, USA, the Emily Carr University of Art and Design Vancouver, Canada and the Università Iuav di Venezia, Italy.[3]\n\nBetween 1992 and 1994 Klar also served as founding dean of the \"Faculty of Gestaltung\" at the Hochschule für Technik und Wirtschaft in Dresden, Germany.\n\nFrom 1992 till 2008 Klar taught at the \"Hochschule der Künste Berlin\", which was later named \"Universität der Künste\" and held the position of Professor for Visual Communication at the \"Institut für Transmediale Gestaltung\".[4][5]\n\nMichael Klar lived last in Berlin where he worked as a designer. He died there on 2 September 2023, at the age of 80.[6]\n",
  "concepts": [
    "Michael Klar"
  ],
  "findings": [
    "Life and work",
    "Publications",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:48:58.046140"
}