{
  "title": "On the Tender Spot of Every Calloused Moment",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/On_the_Tender_Spot_of_Every_Calloused_Moment",
  "content": "On the Tender Spot of Every Calloused Moment (stylized in lowercase) is the fifth studio album, and sixth album overall, by American jazz trumpeter Ambrose Akinmusire.[11] The album was released on June 5, 2020 (2020-06-05) by Blue Note Records.[3] It was Akinmusire's fifth release on the Blue Note label.\n\nThe album title refers to a trip that Akinmusire took to his hometown of Oakland, California in 2016, during which he witnessed the changes caused by gentrification. The local population substantially changed due to the expansion of Silicon Valley, and long-term, often impoverished residents were driven out of the city.[2] He himself grew up in a culturally rich community that now has turned into an unrecognizable place for him, an emergency that hit many black communities in big cities. Akinmusire says, \"In a way, I was thinking about this as a sequel to my first record. I'm returning to the landmarks in my first album.\"[12] The album contains eleven compositions by Akinmusire, which he recorded with his quartet consisting of pianist Sam Harris, bassist Harish Raghavan, and drummer Justin Brown. The album also features guest vocalists Genevieve Artadi and Jesus Diaz.\n\nThom Jurek in his review for AllMusic wrote, \"While this outing is no less brimming with creative and provocative ideas for jazz by Akinmusire, it is perhaps, his most emotionally searing and satisfying studio outing.\"[2]\n\nWill Layman of PopMatters stated, \"Akinmusire seems particularly mature as an artist and particularly within the \"jazz\" tradition because his work, daring and modern and moving easily across boundaries, is still grounded in some of the core jazz values. Those are the primacy of blues playing, the vitality of distinctive and individual sound, and healthy and creative engagement within the popular music of the time, and engagement with his culture, socially politically. He is individual enough to evade facile comparisons to his predecessors.\"[13]\n\nSteve Futterman of The New Yorker commented, \"The trumpeter Ambrose Akinmusire insures that the joys and the anxieties of current African-American life stay at the forefront of his aesthetic through written statements and spoken-word collaborations. But he doesn’t always need words. On his new album, “on the tender spot of every calloused moment,” the short, reflective track “reset (quiet victories & celebrated defeats)” speaks Akinmusire’s heart and mind in the anguished intensity of his horn, recalling the great Booker Little, one of Akinmusire’s stated influences.\"[14]\n\nJazzwise included On the Tender Spot of Every Calloused Moment in its list of the best new jazz albums, stating \"Ambrose Akinmusire’s fifth studio album finds the 38 year-old trumpeter in as reflective a mode as ever, asking questions about black identity and avoiding clichéd pathways just as he opts for musical roads less travelled.\"[15]\n\nJazziz Magazine included the album in its list of \"10 Albums You Need to Know: June 2020\", commenting that the album \"asserts Ambrose Akinmusire as one of the top trumpeters in the world and affirms his talents as a composer via eleven originals, which present a contemporary and compelling blend of modern jazz that powerfully aims to dissect the complexity of black life in America.\"[16]\n\nAll tracks are written by Ambrose Akinmusire except track 3 written by Ambrose Akinmusire and Genevieve Artadi",
  "concepts": [
    "On the Tender Spot of Every Calloused Moment"
  ],
  "findings": [
    "Background",
    "Reception",
    "Accolades",
    "Track listing",
    "Personnel",
    "References"
  ],
  "timestamp": "2025-04-11T10:20:20.235467"
}