{
  "title": "Jagdgeschwader 4",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jagdgeschwader_4",
  "content": "Jagdgeschwader 4 (JG 4) was a Luftwaffe fighter wing of World War II.\n\nJagdgeschwader 4 became one of only three Luftwaffe Geschwader to operate the specialised 'bomber-killer' gruppen designated Sturmgruppe. On 7 August 1942, 1./JG 4 was formed in Mizil, Romania from Ölschutzstaffel/JG 77. By 1943, the I./JG 4 was complete with 2./JG4 formed in December 1942, and 3./JG 4 formed in January 1943. The Romanian 53rd Fighter Squadron was assigned to JG 4 as 4./JG 4 until 1944. A new 4./JG 4 was created in August 1944.[1]\n\nII./JG 4 Sturmgruppe was formed on 12 July 1944 at Salzwedel from I./Zerstörergeschwader 1 (ZG 1) and from elements of Major Hans-Günter von Kornatzki's Sturmstaffel 1. The gruppe was equipped with the modified and heavily armoured FW 190A-8/R2. While the heavily armoured fighters proved effective against the heavy bombers of the USAAF, they proved vulnerable to the numerous escort fighters and hence suffered heavy losses. III./JG 4 was also formed in July 1944 from III./ZG 1 in Rotenburg. \n\nIn common with other fighter units engaged in Reichsverteidigung operations the Geschwader were sported unique coloured rear fuselage banding markings in mid 1944, with differing color combinations unique to each wing. JG 4's marking was a black-white-black band on the rear fuselage. \n\nOn 11 September 1944 II.(Sturm)/JG 4 escorted by III. Gruppe intercepted a USAAF bombing raid near Chemnitz. Attacking the 100th and 95th Bomb Groups the Geschwader claimed some 13 destroyed bombers. Intercepted by the 339th and 55th Fighter Groups JG 4 was severely mauled, and lost 21 pilots killed and 9 more were seriously injured during the mission.\n\nIn October 1944 IV./JG 4 was formed from elements of II./JG 5 in Finsterwalde, equipped with the Messerschmitt Bf-109G and K.\n\nOn 2 November the Sturmgruppe, in conjunction with IV./JG 3, intercepted American bomber formations  in the Leipzig area. II./JG 4 attacked the 457th Bombardment Group and destroyed nine B-17s, although the Gruppe lost 16 Fw 190s out of 22 committed to the massed US fighter escorts.\n\nFrom November 1944 onwards the Geschwader, operating from Frankfurt took heavy losses flying against the Allied air offensive. Apart from for II.(Sturm)/JG 300, heavy losses meant the Sturmgruppen had virtually ceased to exist by late November 1944, and with the transfer to Babenhausen in December 1944 the remnants of II./JG 4 would carry out the same fighter and ground attack operations as their sister units for the rest of their existence, and would not claim another heavy bomber.[2] In early 1945 II. Gruppe re-equipped with the Focke Wulf Fw 190A-9 and later D-9 fighters.\n\nDuring Operation Bodenplatte on 1 January 1945 JG 4, along with all other units taking part, again took very heavy losses. With 75 JG 4 aircraft tasked with various targets, including an attack on Le Culot Airfield, I., II. and IV. Gruppen were hit by heavy anti-aircraft fire and the massed formation became scattered and therefore impossible to co-ordinate an effective attack, with only 12 or so aircraft locating or attacking any intended objective. Overall, some 26 fighters were lost and 6 damaged; with nearly half the participating aircraft lost, JG 4 suffered the highest percentage losses of all the units taking part in the operation.[3]\n\nBy late January 1945 JG 4 was deployed in Guben-Jüterbog until the end of the war in May.\n\nOn 21 January 1945 the four Gruppen of JG 4 were switched to Luftlotte 6 on the Eastern Front and pitchforked wholesale into ground-attack missions, for which the unit was ill-equipped and pilots untrained. By early February 1945 II.(Sturm)/JG 4 were located at Neuhausen under Major Gerhard Schroeder in defence of Cottbus. \n\nAlthough nearly 400 vehicles were claimed destroyed, losses during the month inevitably emasculated the unit, with some 57 aircraft lost, with 26 pilots killed or missing and 14 wounded.[4]\n\nI./JG 4 was dissolved during March 1945 and the remustering of the unit personnel as infantry followed. Elements of JG 4 flew their last sorties against the Soviet armies and air forces around Berlin and in late April 1945 the unit withdrew to the Schleswig-Holstein area and disbanded on 8 May 1945.\n\nSome JG 4 aircraft displayed on the engine cowling the Geschwaderzeichen, a blue escutcheon with a grey or silver knight’s helmet with a red (red-white) plume.\n\nThis insignia was first used by II. Gruppe, but later also appeared on other JG 4 Gruppen aircraft.\n",
  "concepts": [
    "Jagdgeschwader 4",
    "jg",
    "ii",
    "1944",
    "1945",
    "heavy",
    "aircraft",
    "losses",
    "formed",
    "fighter",
    "lost"
  ],
  "findings": [
    "History",
    "Insignia",
    "Commanding officers",
    "Geschwaderkommodore",
    "Gruppenkommandeure",
    "Notes",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:26:26.278205"
}