{
  "title": "Athletics at the 2016 Summer Olympics – Women's triple jump",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Athletics_at_the_2016_Summer_Olympics_–_Women's_triple_jump",
  "content": "The Women's triple jump competition at the 2016 Summer Olympics in Rio de Janeiro, Brazil. The event was held at the Olympic Stadium on 13–14 August.[1]\n\nBefore the competition, 2015 World Champion Caterine Ibargüen of Colombia had the longest jump of the season with 15.04 m. Kazakhstan's Olga Rypakova entered as the defending Olympic champion from 2012 and had been the first athlete to beat Ibargüen that year, ending her rival's 34-meet-long winning streak. Twenty-year-old Venezuelan Yulimar Rojas was the only other athlete over fifteen metres that season and had won the 2016 World Indoor Championships. The remaining top challengers formed the 2016 European Championships podium – Patrícia Mamona of Portugal, Greek jumper Paraskeví Papahrístou (third on the world rankings), and 2015 world medallist Hanna Knyazyeva-Minenko of Israel.[2][3]\n\nIbargüen topped qualifying with her sole jump of 14.52 m. Papahrístou and Rypakova were the only other automatic qualifiers, both requiring two attempts. It took 14.08 m to make the final. All the main contenders progressed with Germany's Kristin Gierisch and Finn Kristiina Mäkelä posting the next best marks. A 2012 Olympic medallist and former world champion, Olha Saladuha of Ukraine, failed to progress.[4][5]\n\nIn the final, on the third jump of the competition, Keturah Orji took the lead with an American record 14.71 m (48 ft 3 in).  Four jumps later, defending champion Olga Rypakova edged ahead with 14.73 m.  The final jumper in every round of the competition, Caterine Ibargüen moved into bronze medal position with 14.65 m.  In the second round, Ibargüen took the lead she would never relinquish, with a 15.03 m.  In the third round Yulimar Rojas jumped 14.87 m to take over the silver medal position she would not relinquish.  Rojas jumped her best in the fourth round, 14.98 m (49 ft 1+3⁄4 in) and Ibargüen followed that with her best of 15.17 m (49 ft 9 in).  In the fifth round, Rypakova jumped her best of 14.74 m  but the tiny improvement was not enough to improve the color of her medal.\n\nThe competition consisted of two rounds, qualification and final. In qualification, each athlete jumped three times (stopping early if they made the qualifying distance). At least the top twelve athletes moved on to the final; if more than twelve reached the qualifying distance, all who did so advanced. Distances were reset for the final round. Finalists jumped three times, after which the eight best jumped three more times (with the best distance of the six jumps counted).\n\nAll times are Brasília Time (UTC−3)\n\nPrior to the competition[update], the existing world record, Olympic record, and world leading jump were as follows:\n\nThe following national records were established during the competition:\n\nProgression rules: Qualifying performance 14.30 (Q) or at least 12 best performers (q) advance to the Final[6]\n",
  "concepts": [
    "Athletics at the 2016 Summer Olympics – Women's triple jump",
    "14",
    "world",
    "final",
    "competition",
    "best",
    "round",
    "jumped",
    "ibargüen",
    "jump",
    "times"
  ],
  "findings": [
    "Summary",
    "Competition format",
    "Schedule",
    "Records",
    "Results",
    "Qualifying round",
    "Final",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T17:10:06.083741"
}