{
  "title": "Owen Moxon",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Owen_Moxon",
  "content": "Owen James Moxon (born 17 January 1998) is an English footballer who plays as a midfielder for  club Stockport County.\n\nMoxon has previously played for Queen of the South, Gretna 2008, Annan Athletic and Carlisle United.\n\nBorn in Carlisle, Cumbria, Moxon played in Carlisle United's academy, before being released in 2014.[2]\n\nMoxon began his senior career at Queen of the South. Moxon was first included in a senior match-day squad on 1 August 2015, remaining an unused substitute for their 4–3 extra-time win over Annan Athletic in the first round of the Scottish League Cup.[3]\n\nIn the next round, on 25 August 2015, Moxon made his debut, replacing Kyle Hutton for the final 14 minutes of a 1–0 defeat to Greenock Morton at Palmerston Park.[4] Moxon played his first league game on 5 September 2015, appearing for the final seven minutes, replacing Mark Millar as Queens lost 2–0 at Palmerston versus St Mirren in the Scottish Championship.[5]\n\nMoxon's contract was not renewed by Queen of the South, so after two seasons he was released by the club in May 2017.[6]\n\nOn 30 January 2017, Moxon moved on loan to Lowland League club Gretna 2008, for the remainder of the season.[7]\n\nOn 22 June 2017, Moxon signed for Scottish League Two club Annan Athletic.[8]\n\nMoxon signed for Carlisle United in 2022, and was named in the EFL League Two Team of the Season in his first season with the club.[9] He also received the Carlisle United player of the season award.[10] Following promotion, the club confirmed that they had received a transfer offer for the midfielder which they had rejected.[11]\n\nIn January 2024, Moxon was subject to transfer speculation following manager Paul Simpson's admission that the midfielder had rejected the offer of a new contract.[12]\n\nOn 1 February 2024, Moxon signed for League One leaders Portsmouth on a three-and-a-half-year deal for an undisclosed fee.[13]\n\nCarlisle United\n\nPortsmouth\n\nIndividual\n",
  "concepts": [
    "Owen Moxon",
    "moxon",
    "league",
    "club",
    "carlisle",
    "united",
    "carlisle united",
    "season",
    "south",
    "signed",
    "scottish"
  ],
  "findings": [
    "Career",
    "Queen of the South",
    "Annan Athletic",
    "Return to Carlisle United",
    "Portsmouth",
    "Career statistics",
    "Honours",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:37:05.778306"
}