{
  "title": "Benburb Street",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Benburb_Street",
  "content": "Benburb Street (Irish: Sráid na Binne Boirbe)[1] is a street in Dublin, Ireland.\n\nBenburb Street runs parallel with the River Liffey from Queen Street to Parkgate Street, running along the southern side of Collins Barracks. The LUAS red line runs along the street\n\nThe street was originally named as Barrack Street as it was close to the former Royal Barracks. The section closest to Queen Street was known as Tighe Street, but previously known as the Gravel Walk up to circa 1780. Both streets were amalgamated and renamed Benburb Street in 1890.[2] It was named for the Battle of Benburb in County Armagh in 1646.[3]\n\nHistorically, the street was associated with prostitution due to its proximity to Collins Barracks. This association continued up until the late 1990s.[4]\n\nThe housing scheme in Benburb street was the first housing scheme project undertaken by the Dublin Artisans' Dwellings Company (DADC), affiliated with Dublin Corporation in 1884. In 1880, the Dublin Corporation's Executive Sanitary Officer took a visit to Benburb Street and surrounding areas, creating a report of his findings. As a result, 27 tenement houses, housing 488 people would be demolished. These buildings were decayed, the floors were saturated, roofs were beyond repair, and the soil was soaked with foul matter. He described them as being in a 'rotten state' and 'utterly incapable of repair'. These houses were occupied by the working-class due to their proximity to factories such as Courtney and Stephens' Irons Works. \n\nAccording to the report, the working class were deserving of better housing. The officer believed that with a suitable range of housing and combination of small shops, a benefit would be felt by the whole community. However, there was a lack of funding for this project and no private entity would take on the scheme. This would also influence the quality of housing due to the profit margin as a result of the very low rents. Benburb Housing Scheme would therefore become the corporations first ever social housing scheme. Daniel Freeman was hired as the architect in July 1884, he was also the city architect at that time. Freeman adopted previous designs by an engineer called Arthur Dudgeon. This was a report and survey of working class accommodation in the area containing Benburb Street and was published in 1883. He was a civil engineer to the Dublin Artisans' Dwellings Company on the Plunkett Street Scheme and had a lot of experience from visiting working-class housing schemes in Glasgow and London.[5]\n\nThere were two spaces available in Benburb street. These plots were originally leased from the period of Charles II but had recently become under possession of the state in 1883. The areas available had a frontage of 240 feet, and 160 feet.[6]\n\nFeatures of Dudgeons report include:\n\nDudgeon favoured the idea of building taller houses. He believed that people preferred living in taller buildings, as they had access to clean air. Freeman used Dudgeon's report as a guide but suggested some changes. This included the proposal of three blocks of four-storeys instead of two. Improved sanitary conditions and larger rooms.[5] Freeman also proposed that all water supply, dust shoot and sanitary accommodation be provided outside, to allow for easy access from all blocks. Freeman suggests that this would be more hygienic as it would prevent foul smells entering the lodgings as a result of an out of order unit. \n\nOther proposals included a men's lodging house containing a wash house, 15 shops, 66 double rooms, and 50 single rooms. The double room would cost 6d a week, while the single room would cost between 1s. 6d. and 2s. Freeman's report facilitated accommodation for 600 people at the cost of £20,000, while Dudgeon's report planned for accommodation for 708 people at the cost of £25,000. Although there were no architectural drawings in Dudgeon's report it was favoured by the co-operation due to its high density of rooms. Therefore the report was sent back to the Dublin Artisans' Dwellings Company for further consideration. \n\nDublin Cooperation's recommendations included reducing the number of shops and double rooms while increasing the number of single rooms. However, there would now be an annual loss of £30. The committee stated that further changes would be made to cover for this loss.[6]\n\n144 four-storey tenements were built, five of these were ground floor shops.[6] These shops cost 10s. per week. The shops were a far more lucrative return for the corporation, rather than the rooms which ranged between 1s 6d and 5s.The smaller block located along Eilis street contained 1 large shop and 43 dwellings which had one or two rooms. The larger block had 14 ground floor shops and 73 dwellings. There was also a men's lodging house that had 72 beds and a wash house.[7]\n\nAn additional women's lodging house was also built, it had 16 beds and cost 4d. per night. Cooking facilities were provided for lodgers and food could also be stored for a small fee. Lodgers had to follow certain regulations such as no entrance to the building until 6pm, up by 8am and vacate the building by 10am. However, permanent lodgers were often allowed to enter during the day to cook dinner. The roof space was used for social and leisurely activities.[6]\n\nThe Benburb Housing Scheme quickly developed a bad reputation. Dr Cameron reported in 1892 a large problem with the sanitary conditions in the housing. He noted an uncleanly state in the hallways. Toilets and sinks beyond repair, and a lack of toilets available to the residents. This deteriorating reputation created a fear that the Dublin Cooperation were building new slums. \n\nWithin ten years the death rate was higher in the Benburb Housing area when compared with the Dublin City area. This is however slightly more complex due to the connection of higher deaths among lower socio-economic groups. When Lily O'Conner moved into the flats in 1930 she noted that the 'hall itself was cold, drab and stank of urine'.[8]\n\nIn 1971, 87 years after the completion date, 50 women and children protested the poor conditions of Benburb Housing at the Department of Local Government offices according to the Irish Times newspaper. Details of these conditions are found in the Deputation letter. Women reported that there were 11 families sharing one toilet and tap, while one floor did not have access to a toilet or water. The lack of available affordable housing and discrimination against residents due to their postal address were also mentioned.[9]\n\nEllis Court was one of the original blocks built and began to be vacated in the early 2000s to allow for refurbishment. However due to a fire that broke out in December of 2005 this refurbishment was halted. Five of the remaining seven residents were brought to hospital as a result of smoke inhalation. The damage from the fire and the economic crash that followed resulted in the building lying derelict up until 2019. \n\nDublin City Council sold the building to the organisation An Tuath. They had already secured planning permission to refurbish the building, adding 22 flats at the cost of 6 million.[10] There is also the addition of west facing balconies and 22 bicycle spaces. New brickwork and an entrance gate is provided to ensure a secure entrance.[11][12] These homes will be allocated to people on the housing waiting list.[13] Oak House is one of the original blocks but is not part of An Tuath's re-development scheme. This block in comparison holds most of its original qualities.[14] The final block in Blackhall Place has been largely refurbished, with the addition of a 5th floor. The windows and railings remain original.[15]\n\nEllis Court has been entirely re-developed with new materials but the aesthetic remains similar to the original architectural designs of the Benburb Housing Scheme. The windows, railings and red brick have all been replaced. It has 5 bays and four floors with a flat rooftop. The railings are new but hold the same decorative qualities as the original. In comparison, Oak House has many of its original features. It is a four storey building with a cut granite and red brick flat roof. There is also a decorative cast iron railing and a round arched entrance through the central door. The windows are arched with a decorative design in the brick work.[16]\n\nBuildings of Ireland refers to the buildings as having a 'pleasing sense of symmetry'. Blackhall Place was also part of the original three buildings in the Benburb Housing Scheme and has similar architectural qualities to the other two. The ground floor is being utilised as a shop unit.[17] However, there has been some refurbishment and the addition of a fifth floor. Other examples of architecture outside the housing scheme includes Dice Bar, a three-storey building currently being used for commercial use and built around 1860. It has a pitched slate roof and a decorative red brick. The dating plaque on the building suggests it was constructed in 1770 but if that is correct it has had significant works done since then.[18]\n",
  "concepts": [
    "Benburb Street"
  ],
  "findings": [
    "Location",
    "History",
    "Benburb Housing Scheme",
    "History of the Benburb Housing Scheme",
    "Housing Proposals",
    "Outcome of the Housing Scheme",
    "Aftermath and Reputation of the Housing Scheme.",
    "The Housing Scheme Today",
    "Architecture",
    "See also",
    "References"
  ],
  "timestamp": "2025-04-11T10:08:48.224365"
}