{
  "title": "Angus Mackay (Queensland politician)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Angus_Mackay_(Queensland_politician)",
  "content": "Angus Mackay (15 August 1834 – 8 February 1910) was a journalist, trade commissioner, agricultural researcher and lecturer, and a member of the Queensland Legislative Assembly.[1]\n\nMackay was born in Wick, Caithness, Scotland,[1] more specifically, Strathnaver in the Mackay county,[2] to John Mackay and Ann née Gordon.[1]  He was educated in Helmsdale.\n\nAt some time he had been a bridge worker in London, a compositor for the New-York Tribune, an overseer for a cotton plantation in Georgia, US, and with the NSW Department of Agriculture.[1]\n\nHe arrived in Queensland in 1862,[2] and at one time, lived at Milton.[3]\n\nMackay was the first editor of The Queenslander (published from 1866 to 1939),[4] and was listed as the agricultural editor.[5]\n\nAfter 1877 on return to Queensland from Philadelphia, he became the editor c. 1884 of the Australian Town and Country Journal.[6][7]\n\nConcluding as an agricultural professor in Sydney by 1897,[6] and briefly working in Victoria, he returned to Scotland for his health, and became ajournalist with The Celtic Monthly: A magazine for Highlanders (published from 1876 to 1912) in Glasgow, Scotland.[8]\n\nHe published several works including:\n\nHe also presented various articles at the annual Queensland Exhibition, including on cotton in 1875.[14]\n\nMackay was made the Queensland trade commissioner to the 1876 Centennial International Exhibition in Philadelphia, Pennsylvania.[15][2][16]  Leaving in January 1876, he was tasked with promoting Queensland mining and industry, and authorised to purchase labour-saving and other devices at the Exhibition.[2]  Exhibits included 200 specimens, 3 feet (0.91 m) long and 6 inches (150 mm) square, of Queensland timber, and ores such as tin and copper.[17]\n\nA NSW orchardist and businessman attending the Exhibition in July observed:[18]\n\nMackay returned in February 1877 to a warm reception and praise.[19]  Many of the devices purchased were displayed at the Queensland Exhibition in September 1877.[20]\n\nHe also made notes about constructing low-cost railways across Queensland, and tabled a report to government in March 1877;[21] reviewed the lines from Rockhampton to the Comet River;[22] and continued in his persistent views when a politician, which were credited with informing the public.[23][4]\n\nHaving lived in the electoral district of South Brisbane for sixteen years, and after waiting for the dissolution following the death of sitting member T. B. Stephens MLA, he came forward as a candidate in October 1878.[24]  One of his interests was to see a railway line come to the electorate, and where placed, could \"obviate the necessity of increasing taxation\", as well as tramways.\n\nHe was the member for the state seat of Brisbane South from 1878 until 1880.[1]\n\nMackay resigned in March 1880, although the party leader of the liberal faction, Samuel Griffith had waited some days before tabling the document to Parliament, where:[25]\n\nMackay was later a lecturer when agricultural classes were commenced in 1887,[6] becoming the highly respected Professor of Agriculture at the Sydney Technical College c. 1880.[26][27][1]  (He was given to be a lecturer by November 1886, so he may have started earlier.)[28]  He used the post-nominals FCS, indicating he was a Fellow of the Chemical Society.[13]\n\nDuring his time he delivered a lecture on \"dairy farming\" (1888),[29] a series of lectures on \"Irrigation as a means of improving our agricultural prospects\" (1888),[30] and looked at the gumming disease in sugar cane in the Clarence River area in the north of the State in 1893.[31][32]  He occupied the position until 1897,[6] given \"the state of his health led him to seek change and rest in his mother land\".[8]\n\nResiding in Balmain,[33] it appears the former \"Chief Instructor in Agriculture for New South Wales Government\"[34] did not immediately return to Scotland, as in April 1897 he left \"to fill an important position at the Wesley College, under the Victorian Government\".[35]\n\nMackay married Marjory Ross in London, and together had one son and six daughters (including William d. 1912, John Ross 1863–1864, Marjory b. 1865,[36] Angus b. 1876, Johanna b. 1869, Angus b. 1871, Elizabeth Catherine b. 1867, Jean b. 1879).[1]\n\nFor the newly-formed Highland Society of Queensland in 1866, Mackay was designated \"first chieftain (treasurer)\".[37]  He was a member of Clan Mackay, and the Southampton Caledonian Society.[8]\n\nHe died in Portobello, Edinburgh, in February 1910.[27]\n",
  "concepts": [
    "Angus Mackay (Queensland politician)",
    "mackay",
    "queensland",
    "exhibition",
    "agricultural",
    "scotland",
    "member",
    "1877",
    "1876",
    "time",
    "state"
  ],
  "findings": [
    "Early life",
    "Careers",
    "Journalist",
    "Researcher",
    "Trade commissioner (1876 World Fair)",
    "Politician, Queensland (1878–1880)",
    "Professor of agriculture, Sydney",
    "Later life",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:37:19.215914"
}