{
  "title": "Stephanie Zimbalist",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Stephanie_Zimbalist",
  "content": "Stephanie Zimbalist (born October 8, 1956) is an American actress best known for her role as Laura Holt in the NBC detective series Remington Steele.\n\nStephanie Zimbalist was born in New York City, the daughter of Loranda Stephanie (née Spalding) and actor Efrem Zimbalist Jr.. The family soon moved to Los Angeles, where Stephanie grew up. She was educated at the Marlborough School (Los Angeles) and graduated from Foxcroft School in Middleburg, Virginia. She attended the Juilliard School before commencing her acting career.[2]\n\nZimbalist's early television and film appearances include The Gathering (1977, with Edward Asner), In the Matter of Karen Ann Quinlan (1977), Forever (1978), The Magic of Lassie (1978), Long Journey Back (TV, 1978), The Triangle Factory Fire Scandal (1979), The Awakening (1980, with Charlton Heston), The Golden Moment (1980), in which she played a Soviet Olympic gymnast, The Babysitter (1980) and Tomorrow's Child (TV, 1982). She co-starred with her father, Efrem Zimbalist Jr., in the tragic 1979 television film The Best Place to Be.\n\nAnother early role for Zimbalist was that of Elly Zendt in the mini-series Centennial, based on James Michener's epic novel of the same name, which was first televised on NBC between October 1978 and February 1979. She also guest starred as Josephine \"Josie\" Collins in the television series Family episode \"Ballerina\" (1979).\n\nIn her TV work, Zimbalist is best known in the TV role of sleuth Laura Holt in the NBC series Remington Steele (1982–87) opposite Pierce Brosnan and Doris Roberts, on which her father also guest-starred.\n\nSince then, Zimbalist has taken leading roles in several television films such as The Man in the Brown Suit (1988), the Emmy Award winning Caroline? (1990), The Great Elephant Escape (1995), and some guest roles in television series such as Touched by an Angel and Diagnosis Murder.[citation needed]\n\nIn 1979, she appeared as Miranda in John Hirsch's production of The Tempest with Anthony Hopkins (as Prospero), Brent Carver, and Michael Bond at the Mark Taper Forum in Los Angeles.\n\nZimbalist played opposite Tommy Tune in the touring musical My One and Only, taking the featured role of \"Edith Herbert\". She has made several appearances with the Rubicon Theatre Company in Ventura, California, winning the local critics' \"Robby Award\" for Best Actress in a Drama in The Rainmaker, at the Rubicon community theatre in 2001. Throughout the 2000s, Zimbalist took roles in plays concerning nineteenth-century artists including Chopin, Tchaikovsky and Van Gogh.[citation needed]\n\nShe also played Christa McAuliffe in the play Defying Gravity in 2003, written by Jane Anderson.[3]\n\nIn 2009 she portrayed actress Katharine Hepburn in Tea at Five.[4]\n\nOther work\n\nZimbalist has also released audiobooks, including The Girls, which won a Listen-Up award in 2006,[5] and Queen of the Underworld.[6]\n\nShe appeared in the 2006 documentary Christa McAuliffe: Reach for the Stars.[7]\n\nZimbalist's paternal grandfather, Efrem Zimbalist, born in Rostov-on-Don, Russia, was a symphony conductor, concert violinist and music teacher at the Curtis Institute in Philadelphia, and composer. Her paternal grandmother, Alma Gluck, born in Romania, was a leading soprano of her day.[8]\nZimbalist's aunt, Marcia Davenport, was a prominent author, music journalist and historian.[9]\n\nIn a 2016 interview she described attending a Billy Graham crusade over 15 years prior with Dean Butler, and both going down to \"accept the Lord.\" She expressed, \"I have a personal connection with my Savior... I feel very beholden to Him--for me it's a him--I feel He's there for me in my darkest moments.\" In the same interview she mentioned years ago moving out of an \"inappropriate relationship\" with a married man, though still remaining friends.[10]\n",
  "concepts": [
    "Stephanie Zimbalist",
    "zimbalist",
    "television",
    "series",
    "1979",
    "tv",
    "stephanie",
    "role",
    "born",
    "best",
    "1978"
  ],
  "findings": [
    "Early life",
    "Acting career",
    "Television and film career",
    "Theater",
    "Personal life",
    "Stage roles",
    "Filmography",
    "Film",
    "Television",
    "Awards and nominations",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:29.569921"
}