{
  "title": "Windows Phone 7",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Windows_Phone_7",
  "content": "Windows Phone 7 is the first release of the Windows Phone mobile client operating system, released worldwide on October 21, 2010, and in the United States on November 8, 2010. It runs on the Windows CE 6.0 kernel.[2]\n\nIt received multiple large updates, the last being Windows Phone 7.8, which was released in January 2013 and added a few features backported from Windows Phone 8, such as a more customizable start screen.\n\nMicrosoft ended support for Windows Phone 7 on January 8, 2013, and for Windows Phone 7.5 on October 14, 2014.[1] It was succeeded by Windows Phone 8, which was released on October 29, 2012.\n\nMicrosoft officially unveiled the new operating system, Windows Phone 7 Series, at the Mobile World Congress in Barcelona on February 15, 2010,[3] and revealed additional details at MIX 2010 on March 15, 2010. The final SDK was made available on September 16, 2010.[4] HP later decided not to build devices for Windows Phone, citing that it wanted to focus on devices for its newly purchased webOS.[5]  As its original name was criticized for being too complex and \"wordy\", the name of the operating system was officially shortened to just Windows Phone 7 on April 2, 2010.[6]\n\nOn October 11, 2010, Microsoft CEO Steve Ballmer announced the 10 launch devices for Windows Phone 7 with HTC, Dell, Samsung, and LG Support, with sales beginning on October 21, 2010 in Europe and Australia and November 8, 2010 in the United States. The devices were made available on 60 carriers in 30 countries, with additional devices to be launched in 2011.[7] Upon the release of Windows Phone 7's \"Mango\" revision, additional manufacturers became partners, including Acer, Fujitsu, and ZTE.[8]\n\nWindows Phone initially supported twenty-five languages, with applications being available through Windows Phone Store in 35 countries and regions. Support for additional languages and regions were subsequently brought through both the Mango and Tango updates to the OS respectively.[9][10]\n\nWindows Phone 7 is the only version of Windows Phone that features the Windows CE kernel, which was also used in Windows Mobile and Pocket PC systems.\n\nWindows Phone 7 features a user interface based on a design system codenamed and commonly referred to as Metro.[11] The home screen, called \"Start screen\", is made up of \"Live Tiles\". Tiles are links to applications, features, functions and individual items (such as contacts, web pages, applications or media items). Users can add, rearrange, or remove tiles.[12] Tiles are dynamic and update in real time – for example, the tile for an email account would display the number of unread messages or a tile could display a live update of the weather.[13]\n\nSeveral key features of Windows Phone 7 are organized into \"hubs\", which combine local and online content via Windows Phone's integration with popular social networks such as Facebook, Windows Live, and Twitter.[13] For example, the Pictures hub shows photos captured with the device's camera and the user's Facebook photo albums, and the People hub shows contacts aggregated from multiple sources including Windows Live, Facebook, and Gmail. From the Hub, users can directly comment and 'like' on social network updates. The other built-in hubs are Xbox Music and Video, Xbox Live Games, Windows Phone Store, and Microsoft Office.[13] Due to Facebook Connect service changes, Facebook support is disabled in all bundled apps effective June 8, 2015.[14]\n\nWindows Phone uses multi-touch technology.[13] The default Windows Phone user interface has a dark theme that prolongs battery life on OLED screens as fully black pixels do not emit light.[15] The user may choose a light theme instead, and can also choose from several accent colors.[16] User interface elements such as tiles are shown in the user's chosen accent color. Third-party applications can be automatically themed with these colors.[17]\n\nUsers input text by using an on-screen virtual keyboard, which has a dedicated key for inserting emoticons,[18] and features spell checking[18] and word prediction.[19] App developers (both inhouse and ISV) may specify different versions of the virtual keyboard in order to limit users to certain character sets, such as numeric characters alone. Users may change a word after it has been typed by tapping the word,[20] which will invoke a list of similar words. Pressing and holding certain keys will reveal similar characters. The keys are somewhat larger and spaced farther apart when in landscape mode. Phones may also be made with a hardware keyboard for text input.[21]\n\nWindows Phone 7's messaging system is organized into threads. This allows a conversation with a person to be held through multiple platforms (such as Windows Live Messenger, Facebook messaging, or SMS) within a single thread, dynamically switching between services depending on availability.\n\nWindows Phone 7.5 features a version of Internet Explorer Mobile with a rendering engine that is based on Internet Explorer 9.[22]\n\nThe built-in web browser allows the user to maintain a list of favorite web pages and tiles linking to web pages on the Start screen. The browser supports up to 6 tabs, which can all load in parallel.[23] Other features include multi-touch gestures, a streamlined UI, smooth zoom in/out animations, the ability to save pictures that are on web pages, share web pages via email, and support for inline search which allows the user to search for a word or phrase in a web page by typing it.[24] Microsoft has announced plans to regularly update the Windows Phone web browser and its layout engine independently from the Windows Phone Update system.[25]\n\nContacts are organized via the People hub, and can be manually entered into contacts or imported from Facebook, Windows Live Contacts, Twitter, LinkedIn and Gmail. Contacts may be manually imported from Outlook using Windows Live Contacts or Gmail. A \"What's New\" section shows a news feed and a \"Pictures\" section shows pictures from contacts on those social networks. A \"Me\" section shows the phone user's own social networks status and wall, allows the user to update their status, and allows checking into Bing and Facebook Places. Contacts can be added to the home screen by pinning them to the start. The contact's \"Live Tile\" displays their social network status and profile picture on the homescreen and the contact's hub displays their Facebook wall as well as all of the rest of their contact information and information from their other social networks.\n\nIf a contact has information stored on multiple networks, users can link the two separate contact accounts, allowing the information to be viewed and accessed from a single card.[26] As of Windows Phone 7.5, contacts can also be sorted into Groups. Here, information from each of the contacts is combined into a single page which can be accessed directly from the Hub or pinned to the Start screen.\n\nWindows Phone supports Outlook.com, Exchange, Yahoo! Mail, and Gmail natively and supports many other services via the POP and IMAP protocols. For the native account types, contacts and calendars may be synced as well. Users can also search through their email by searching in the subject, body, senders, and receivers. Emails are shown in threading view and multiple email inboxes can be combined or kept separate.\n\nThe Music + Videos hub allows the user to access music, videos, and podcasts stored on the device, and links directly to the Xbox Music Store to buy music, or rent with the Xbox Music Pass subscription service. When browsing the music by a particular artist, users are able to view artist biographies and photos, provided by the Xbox Music.[18] This hub integrates with many other apps that provide video and music services, including, but not limited to, iHeartRadio, YouTube, and Vevo. This hub also includes Smart DJ which compiles a playlist of songs stored on the phone similar to the song or artist selected. Purchased movies and other videos can be played through Xbox Video.\n\nThe Pictures hub displays the user's Facebook and SkyDrive (Now OneDrive) photo albums, as well as photos taken with the phone's built-in camera. Users can also upload photos to social networks, comment on others photos, and tag photos on social networks.[18] Multi-touch gestures permit zooming in and out of photos.\n\nWindows Phone 7 supports WAV, MP3, WMA, AMR, AAC/MP4/M4A/M4B, and 3GP/3G2 standards. The video file formats supported include WMV, AVI, MP4/M4V, 3GP/3G2, and MOV (QuickTime) standards. These supported audio and video formats would be dependent on the codecs contained inside them. It has also been previously reported that the DivX and Xvid codecs within AVI are also playable on the system.[27][28] Unlike the previous Windows Mobile operating system, there are currently no third-party applications for handling other video formats. The image file formats that are supported include JPG/JPEG, PNG, GIF, TIF and Bitmap (BMP).[29][30]\n\nAfter the \"Mango\" update, Windows Phone 7 added the ability for users to have custom ringtones. Ringtone audio files must be under 1MB and less than 40 seconds long. Custom ringtones still cannot be used for text messages, IMs or emails.\n\nThe Games hub provides access to games on a phone along with Xbox Live functionality, including the ability for a user to interact with their avatar, view and edit their profile, see their achievements and view leaderboards, and send messages to friends on Xbox Live. The Games hub also features an area for managing invitations and turn notifications in turn-based multiplayer games.[31]\n\nMicrosoft's hardware requirements stipulate that every device running Windows Phone 7 must have a dedicated Search button on the front of the device that performs different actions.[13] Pressing the search button while an application is open allows users to search within applications that take advantage of this feature; for example, pressing Search in the People hub lets users search their contact list for specific people.[32] This has been changed in Windows Phone 7.5 however – as the search button is reserved for Bing – so applications that previously used this feature (such as the Marketplace) now include soft search buttons.\n\nIn other cases, pressing the Search button will allow the user to perform a search of web sites, news, and map locations using the Bing application.[33]\n\nWindows Phone also has a voice recognition function, powered by TellMe, which allows the user to perform a Bing search, call contacts or launch applications simply by speaking. This can be activated by pressing and holding the phone's Start button.\n\nBing is the default search engine on Windows Phone handsets due to its deep integration of functions into the OS (which also include the utilization of its map service for location-based searches and queries). However, Microsoft has stated that other search engine applications can be used.[33][34]\n\nAside from location-based searches, Bing Maps on Windows Phone 7 also provide turn-by-turn navigation service to Windows Phone users, and Local Scout shows interest points such as attractions and restaurants in the nearby area. Bing Audio also allows the user to match a song with its name, while Bing Vision allows the user to read barcodes, QR codes, and tags.\n\nThe Office hub organizes all Microsoft Office apps and documents. Microsoft Office Mobile provides interoperability between Windows Phone and the desktop version of Microsoft Office. Word Mobile, Excel Mobile, PowerPoint Mobile, OneNote Mobile, and SharePoint Workspace Mobile allow most Microsoft Office file formats to be viewed and edited directly on a Windows Phone device.\n\nMicrosoft Office can also open files from SkyDrive and Office 365, as well as files stored locally on the phone. Office files on Windows Phone 7 are sorted by tiles: Word documents (blue tile), Excel spreadsheets (green tile), PowerPoint presentations (red tile), and OneNote documents (purple tile).\n\nWindows Phone 7 features a card-based task switcher which can be accessed by pressing and holding the back button. The screenshots of last five open apps are shown as cards. Apps can be kept running even when out of view through \"Live Agents\".[35]\n\nZune software is used to manage and sync content on Windows Phone 7 devices with PCs. Windows Phone 7 can wirelessly sync with the software. In addition to accessing Windows Phone devices, Zune software can also access the Zune Marketplace to purchase music, videos, and apps for Windows Phone and Zune products. While music and videos are both stored locally on the PC and on the phone, apps are only stored on the phone even if purchased from the Zune software. Zune software is also used to deliver software updates to all Windows Phone 7 devices.\n\nThe Zune software is unavailable for Mac OS X, but Microsoft has released Windows Phone Connector, which allows Windows Phone devices to sync with iTunes and iPhoto.[36][37][38] This has since been succeeded by the Windows Phone App, which is designed for Windows Phone 8 but can sync with Windows Phone 7 devices as well.\n\nWhile Windows Phone contains many new features, a number of capabilities and certain programs that were a part of previous versions up to Windows Mobile 6.5 were removed or changed.[39][40]\n\nThe following is a list of features which were present in Windows Mobile 6.5 but were removed in Windows Phone 7.0.\n\nTo provide a more consistent experience between devices, Windows Phone 7 devices are required to meet a certain set of hardware requirements, which Andy Lees, Microsoft's senior vice president of mobile communications business, described as being \"tough, but fair.\"[75] All Windows Phone 7 devices, at minimum, must include the following:[76][77]\n\nPreviously, Windows Phone 7 devices were required to have 512 MB of RAM. As of the \"Tango\" update, the requirements were revised to allow for chipsets with slower processors, and for devices to have a minimum of 256 MB of RAM. Certain features of the operating system, and the ability to install certain resource-intensive apps are disabled on Windows Phone devices with under 512 MB of RAM.[78]\n\nWhat Engadget and Gizmodo felt were notable omissions in a modern smartphone OS[citation needed] have largely been addressed in the Mango update.[citation needed] ZDNet praised the OS's virtual keyboard and noted the excellent touch precision as well as powerful auto-correct and revision software.[18][79] The touch responsiveness of the OS has also been universally praised by all three sites with reviewers noting the smoothness of scrolling and gestures like pinch to zoom in web browsing.[80]\nPCWorld ran an article called \"Windows Phone 7: Microsoft's Disaster\" citing what they call a \"lack of security, shockingly bad Office apps, an interface not backed up under the hood and abandonment of the full Microsoft customer base.\"[81]\n\nThe reception to the \"Metro\" UI (also called Modern-Style UI) and overall interface of the OS",
  "concepts": [
    "Windows Phone 7"
  ],
  "findings": [
    "History",
    "Features",
    "Core",
    "User interface",
    "Text input",
    "Messaging",
    "Web browser",
    "Contacts",
    "Email",
    "Multimedia",
    "Games",
    "Search",
    "Office suite",
    "Multitasking",
    "Sync",
    "Removed features",
    "Calling",
    "Sync",
    "Other",
    "Features subsequently implemented in Windows Phone 7.5",
    "Features subsequently implemented in Windows Phone 8.0",
    "Features subsequently implemented in Windows Phone 8.1",
    "Hardware",
    "Version history",
    "Reception",
    "Awards",
    "See also",
    "Notes",
    "References",
    "External links"
  ],
  "relationships": [
    {
      "subject": "Windows Phone 7",
      "relationship": "are",
      "object": "organized into",
      "sentence": "[13]\n\nSeveral key features of Windows Phone 7 are organized into \"hubs\", which combine local and online content via Windows Phone's integration with popular social networks such as Facebook, Windows Live, and Twitter."
    },
    {
      "subject": "Windows Phone 7",
      "relationship": "are",
      "object": "sorted by tiles",
      "sentence": "Office files on Windows Phone 7 are sorted by tiles: Word documents (blue tile), Excel spreadsheets (green tile), PowerPoint presentations (red tile), and OneNote documents (purple tile)."
    }
  ],
  "timestamp": "2025-04-11T13:23:35.874909"
}