{
  "title": "Walter Vermeulen",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Walter_Vermeulen",
  "content": "Dr. Walter J. Vermeulen is a Samoan / Belgian surgeon, farmer and environmentalist. He was born in Belgium and trained as a surgeon at the University of Brussels and the University of Hawaii.[1]\n\nAfter training as a surgeon, Vermeulen emigrated to Samoa in 1966.[1] He worked as a surgeon-specialist until 1975, when he became deputy director of health.[1] A change of government at the 1976 election resulted in an employment dispute and legal action for wrongful dismissal, resulting in the landmark decision in Vermeulen v. A-G & Others.[2]\n\nAfter he left the Health Department he became involved in environmentalism, first as Executive Director of O Le Siosiomaga Society, Inc., and then as Executive Director of Matuaileoo Environment Trust Inc. (METI). He is a proponent of a sustainable development system known as the Integrated Biomass System (IBS). He was married to the former member of parliament Matatumua Maimoana.\n\nVermeulen was appointed an honorary member of the Order of Merit of Samoa in the 2014 Samoa Honours and Awards.[3]\n\nOn 13 February 2018 he was bestowed with the Knights Cross of the Order of Leopold in recognition for his work in medical and community development.[4] This bestowal was made by his Excellency Marc Mullie the Belgian Ambassador to Samoa.[5]\n\nThis biography of a Samoan is a stub. You can help Wikipedia by expanding it.\nThis biographical article about a Oceanian activist is a stub. You can help Wikipedia by expanding it.\nThis article about an environmental activist or conservationist is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Walter Vermeulen",
    "vermeulen",
    "surgeon",
    "samoa",
    "wikipedia expanding",
    "wikipedia",
    "stub help",
    "stub",
    "help wikipedia",
    "help",
    "expanding"
  ],
  "findings": [
    "Career",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:07:28.929108"
}