{
  "title": "Johannes Crabbe",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Johannes_Crabbe",
  "content": "Johannes Crabbe (c. 1420 – 1 November 1488) was abbot of Ten Duinen Abbey in present-day Belgium, an imperial counsellor and bibliophile.\n\nJohannes Crabbe was born in a middle-class family in Hulst. He made a career within the Catholic church, entering the Cistercian Order and joining the Ten Duinen Abbey. At one point he was secretary for the abbot of the monastery, and held an official position relating to the settlement of Veurne. In 1457, he was elected abbot of Ten Duinen Abbey by the other monastics, following the death of his predecessor. The choice was however contested by Duke Philip the Good and not least his wife, Isabella of Portugal, who had designs to install her nephew James of Portugal as abbot of the same monastery. Crabbe therefore travelled to Rome to gain the support of the Pope. The case was settled when James of Portugal died, and Isabella accepted Crabbe as abbot in exchange for a large sum of money. While in Italy, Crabbe had made contacts with the Medici Bank which helped him finance the settlement. Though thus initially incurring large debts on behalf of the abbey, he managed in a short time to bring its finances into balance and reinvigorated the religious life there. In Italy he also encountered the dawning Renaissance of the Quattrocento.[1][2]\n\nAs abbot, he worked to increase discipline in his own abbey as well as in Roosendael Abbey, Bijloke [nl] and other female monasteries through his role as vice-general of the abbot of Citeaux. He was also employed as a valued counsellor to Mary of Burgundy and Emperor Maximilian I, and from 1477 functioned as the president of the Imperial council several years.[2] A tangible legacy of his work as abbot was in his enlarging the abbey library.[1][2] From c. 1470, he began ordering illuminated manuscripts for the collection, often adorned with his own coat of arms.[1] Initially his purchases were focused on Christian religious works, but from 1472 pivoted towards Classical authors and Renaissance humanists. He employed workshops in Bruges for the manuscripts he commissioned, including bookbinder Antonius van Gavere, Florentine but Bruges-based copyist Francesco Florio [fr] and copyist and Greek translator George Hermonymus. Colard Mansion also produced a large, French translation of Valerius Maximus for Crabbe.[1] At least 18 manuscripts from Crabbe's library are still extant, of which 11 are still in Bruges. They constitute \"an important witness to the spread of modern Italian culture in Bruges from about 1470 onwards.\".[1]\n",
  "concepts": [
    "Johannes Crabbe",
    "abbot",
    "crabbe",
    "abbey",
    "bruges",
    "portugal",
    "manuscripts",
    "large",
    "duinen abbey",
    "duinen",
    "settlement"
  ],
  "findings": [
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:09.418503"
}