{
  "title": "Checkout (Israeli TV series)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Checkout_(Israeli_TV_series)",
  "content": "Checkout, also known as Cash Register, (Hebrew: קופה ראשית, romanized: Kupa Rashit, lit. 'Main Register') is an Israeli mockumentary-style sitcom that premiered on 21 February 2018.\n\nThe show takes place in the Yavne branch of the fictional Israeli supermarket \"Shefa Isaschar\" and follows the routine interactions between the store's workers and customers.\n\nOriginally produced for the Israeli Educational Television channel, the show was later acquired by Kan 11 and renewed several times, with the fourth season set beginning on 26 April 2023.\n\nThe first season began airing on 21 February 2018 on the Israeli Educational Television and continued until the closure of the channel, and was also broadcast by Channel 10. After the Educational Channel's closure, Kan 11 acquired the rights to the show and, starting on 31 August 2018, began airing reruns of the show before renewing it for a second season on 12 February 2019.[1] The season ran for 20 episodes, plus one behind the scenes episode.\n\nThe second season began on 3 January 2020 on Kan 11 and ran through May of that year. In addition to broadcasts on television, it was also streamed on the Kan 11 YouTube channel.\n\nThe third season began on 26 July 2021 and ran through November of that year. In addition to broadcasts on television, it was also streamed on the Kan 11 YouTube channel.\n\nThe fourth season began on 26 April 2023 and ran through September of that year. In addition to broadcasts on television, it was also streamed on the Kan 11 YouTube channel.\n\nThe fifth season began on 12 November 2024 and ran through the first quarter of 2025. In addition to broadcasts on television, it was also streamed on the Kan 11 YouTube channel.\n\nShira Steinbuch (Noa Koler) - Manager of the \"Shefa Issachar\" supermarket branch in Yavne. She served as a liaison officer in the IDF. Disliked by all employees except Ramzi. Shira views Steve Jobs as a role model, and his portrait hangs in her office\n\nRamzi abd-Ramzi (Amir Shurush) - A senior employee of Arab-Israeli origin who began working at the branch at age 13, and since then he has devoted his entire life to the supermarket. He often speaks in a combination of standard language and flowery language. Admires Shira and calls her \"big boss\" [boss gadol] or \"Bosga\" for short.\n\nKochava Shavit (Keren Mor) - A lazy, cunning, and cynical cashier, who tends to get angry easily and aggressively and quarrels with the customers, even in front of the cameras. Kochava is proud of these qualities, even when they are perceived as negative. She's a good friend of Nissim and Anatoly. Mother of four, three of whom are named Jessica, Otsar, and Ku-Sital\n\nNissim Shimony (Yaniv Swissa) - Works in the branch's butchery together with his good friend Anatoly. A baal teshuva, who sometimes \"receives approval from the rabbi\" for all kinds of things for his own benefit and interests. Lazy and likes to prank the supermarket's employees together with Kochava\n\nAnatoly (Sergei) Kirilenko (Daniel Stiopin) - An oleh from Moldova. Works in the supermarket's butchery together with his best friend Nissim, with whom he plays pranks. Married to Masha. Represented Moldova in Eurovision 1998\n\nEsty (Esther) Tzegai (Aviva Nagosa) - A cashier of Ethiopian origin. Cynical, beautiful, witty, and savvy\n\nMordechai Cibotero (Yaakov Bodo) - The supermarket security guard, a very old man who reacts slowly to the events that happen in the supermarket, even though he considers himself an excellent boxer. Former national boxing champion\n\nAvichai Grazian (Yigal Adika) - Short-tempered manager of the \"Shefa Issachar\" chain. Dislikes Shira, gets her name wrong a lot, and calls her \"Riki\", and tends to take credit for ideas that she initiated. Often compliments Esty, which makes her uncomfortable.\n\nNaomi \"Butcher\" Levi (Mia Landsman) - Warehouse worker. Admires Esty and is willing to do anything for her. Also known as \"Butch\", though she is not out to her father.\n\nAmnon Titinsky (Dov Navon) - A single, irritable customer in his sixties, lives with his mother, Sonia Titinsky. Senior Professor of History at the Technion. Stingy, egotistical, and stubborn. Often confronts Kochava.\n\nShuni Stretiner (Weiss) (Dorit Lev-Ari) - An affluent and arrogant life coach who tends to get involved in everything that happens in the supermarket, and likes to shame people. Married to Mosh (Moshe Ferster) and mother to Suf, Gomeh, and Nilus. Her character represents a typical Karen.\n\nNathan Franko (Rudy Saada) - A cunning but very sociable customer. Married to Shirley. Often tries to please his wife and at the same time finish the shopping as quickly as possible to watch football with his friends.\n\nMrs. Itzhaki (Anat Petalski) - A disgruntled customer who often says \"disgusting\" about various situations that occur in the supermarket.\n\nThe show received strongly positive reviews, praising the quality of the comedy[2] as well as the show's portrayal of \"social commentary...rooted in the unglamorous realities of Israeli culture.\"[3]\n\nThe show has been popular with all ages, initially airing on the family-friendly Educational Channel[4] but also reportedly one of the most watched TV series on Kan 11.[5]\n\nThis is a podcast that appears on the series page on the Kan 11 website,[6] produced as part of \"Kan Hesketim\" (Kan Podcasts), as a kind of spin-off of the series. The podcast was produced in 2021. The hosts of the podcast are Nissim and Anatoly, the butchers, who learn how to edit and present a podcast as they present it. Other characters from the series appear as guests on the podcast, and occasionally, guests who are not part of the series join. The theme music of the podcast is taken from the song performed by Anatoly's band, representing, according to the series, Moldova in Eurovision 1998 (in reality, Moldova participated in Eurovision for the first time only in 2005).\n\nClose to the filming of the third season, a special episode of the series was broadcast during the Israeli parliamentary elections called \"Democracy in Harmony\".[7] In addition, on Valentine's Day, after the conclusion of the third season, a special episode titled \"Valentine in Harmony\"[8] was uploaded, and on the next Independence Day, another episode was uploaded called \"Independence in Harmony\".[9] Additionally, toward the new school year, an episode was uploaded titled \"Back to School in Harmony\".[10]\n\nAn advertisement for \"Dor Alon\" (an Israeli energy company) was produced in collaboration with the program's team and based on the show.[11] In November 2021, a commercial for Bezeq was produced in collaboration with the program's team and based on the characters of the series. In December 2022, a board game was released following the series.[12]\n\nFollowing the Iron Swords war, Kan 11 began releasing videos featuring most of the main actors in the series (including Noa Koler, Dov Navon, Amir Shorosh, Keren Mor, Yaniv Swissa, Daniel Styopin, Aviva Nagosa, Yaakov Bodo, Moshe Ferster, Dorit Lev-Ari, Anat Patlatsky, and Rudi Saada), intended to relieve stress and try to bring a smile, especially on the southern and northern fronts.\n\nThe series has been nominated for several awards, both at home in Israel and abroad. The show was nominated for 10 awards at the Israeli Television Academy Awards in 2020, taking home the prize for Best Sitcom Series, and in 2021,[13] the show was nominated for 13 awards, again winning Best Sitcom Series as well as Best Lead Actor in a Comedy Series (for Amir Shurush) and Best Supporting Actor in a Comedy Series (for Dov Navon).\n\nThe series was also one of the nominees for Best Comedy Series at the International Emmy Awards in 2019.[14]\n",
  "concepts": [
    "Checkout (Israeli TV series)",
    "series",
    "kan",
    "11",
    "season",
    "kan 11",
    "supermarket",
    "israeli",
    "channel",
    "began",
    "television"
  ],
  "findings": [
    "Series summary",
    "Season 1",
    "Season 2",
    "Season 3",
    "Season 4",
    "Season 5",
    "Characters",
    "\"Shefa Issachar\" staff",
    "Customers",
    "Reception",
    "Derived Production",
    "The-Butcher-Shop Podcast",
    "Skits",
    "Advertisements",
    "Hug to everyone from...",
    "Awards",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:53:24.337346"
}