{
  "title": "Phrynichus Arabius",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Phrynichus_Arabius",
  "content": "Phrynichus Arabius (/ˈfrɪnɪkəs/; Ancient Greek: Φρύνιχος Ἀράβιος, lit. 'Phrynichus “the Arab”')[1][2] or Phrynichus of Bithynia (Ancient Greek: Φρύνιχος ὁ Βιθυνός) was a grammarian of the Greek language who flourished in 2nd century Bithynia, writing works on proper Attic usage. His name is also transliterated as Phrynichos or Phrynikhos. His ethnic background is disputed, mainly between an Arab and Bithynian Greek descent.[3][4]\n\nThe Suda states:[5][6]\n\nΦρύνιχος, Βιθυνός, σοφιστής. Ἀττικιστὴν ὑπ' Ἀττικῶν ὀνομάτων βιβλία β#, Τιθεμένων συναγωγήν, Σοφιστικῆς παρασκευῆς βιβλία μζ#, οἱ δὲ οδ#.\n\nPhrynichus of Bithynia, sophist. He wrote\n\n(Of the Sophistic Preparations only some fragments and Photius' summary survive.)[7] The work was learned, but prolix and garrulous. A fragment contained in a Paris MS. was published by B. de Montfaucon, and by I. Bekker.[8] Another work of Phrynichus, not mentioned by Photius, but perhaps identical with the Atticist mentioned by Suidas, the Selection (Ἐκλογὴ) of Attic Words and Phrases, is extant. It is dedicated to Cornelianus, a man of literary tastes, and one of the imperial secretaries, who had invited the author to undertake the work; it is a collection of current words and forms which deviated from the Old Attic standard, the true Attic equivalents being given side by side. The work is thus a prescriptive and reforming lexicon antibarbarum,  and is interesting as illustrating the changes through which the Greek language had passed between the 4th century B.C. and the 2nd century A.D.[6] As models of Attic style Phrynichus assigns the highest place to Plato, Demosthenes, and Aeschines the Socratic,[6] and also uses the other Attic orators, Thucydides, Sophocles, Aeschylus, and Euripides, though he does not accept their usage uncritically: in the letter to Cornelianus which forms the introduction to the Eclogē, he criticizes some words used by classical Attic authors as un-Attic \"mistakes\" (Ancient Greek: διημαρτημένα).[7]\n\nEditions of the Eklogê, with valuable notes, have been published by C. A. Lobeck (1820) and W. G. Rutherford (1881); Lobeck devotes his attention chiefly to the later, Rutherford to the earlier usages noticed by Phrynichus. See also J. Brenous, De Phrynicho Atticista (1895).\n",
  "concepts": [
    "Phrynichus Arabius",
    "attic",
    "phrynichus",
    "greek",
    "work",
    "φρύνιχος",
    "words",
    "century",
    "bithynia",
    "ancient greek",
    "ancient"
  ],
  "findings": [
    "Life",
    "Notes",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:07.971345"
}