{
  "title": "Main Ground Combat System",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Main_Ground_Combat_System",
  "content": "The Main Ground Combat System (MGCS) is a project launched in 2017 by Germany and France, aiming to replace their current Leopard 2 and Leclerc main battle tanks.[1][2][3][4] Coordinated by Germany, in contrast to the other major Franco-German program launched in 2018 (the Future Combat Air System implemented under French lead), the MGCS will not be a single armoured fighting vehicle, but a series of systems conceived around said vehicle.\n\nIt is to be developed and manufactured by KNDS (a holding company founded in 2015 by German arms producer KMW and the French defence firm Nexter Systems) and Rheinmetall, which joined the project in 2019. Rheinmetall's addition to the MGCS did not go without tensions between Paris and Berlin, as development leadership of the various pillars of the program as well industrial production were supposed to be equally split between the two countries. Ultimately, an agreement was reached, with Nexter, KMW and Rheinmetall leading the development of 1/3 of the program's pillars each, with a guarantee that Nexter will manufacture 50% of the systems as originally agreed, while the remaining half is shared between the two German contractors.[5] The first production unit is expected to roll off the assembly line in 2045.[6]\n\nAccording to Frank Haun, CEO of KNDS, various countries have shown interest in joining the MGCS, including Italy, Norway, Poland, Spain, Sweden and the United Kingdom. Discussions are still ongoing on the matter as of 2022.[7]\n\nIn December 2014, the Bundestag approved the development of a new generation of tanks while Ursula von der Leyen was Minister of Defence. The decision came amid the war in Donbas, where the Leopard 2A6 tanks that the Bundeswehr aimed to maintain until 2030 seemed inadequate. One analyst wrote \"One of the Leopard 2's key disadvantages stems from the fact that it uses tungsten instead of depleted uranium for tank rounds. The choice of material affects performance. Because of the limitations of tungsten ammunition, the Bundeswehr has some doubts as to the ability of its penetrator rounds to punch through the armour of the latest Russian tanks. Specifically, there might be instances where German ammunition might not have enough kinetic energy to ensure a kill against the T-80, T-90 and obviously the Armata,\" which was to be shown at the 9 May Victory Day Parades in 2015.[8]\n\nNegotiations between Krauss-Maffei Wegmann, Nexter and the German and French governments started in Summer 2014 over the amalgamation of the two companies that would eventually obtain the contract to produce the MGCS. Presenting the project to French lawmakers in January 2015, the CEOs of both companies assumed that the new holding would boost production for both manufacturers by avoiding export restrictions, especially in Germany.[9] In July 2015, the National Assembly voted in favour of a measure that permits the privatisation of state-owned defence companies, paving the way for KMW and Nexter to join forces.[10] On 29 July 2015, the merger between the two companies had been officially signed in Paris.[11] The merger was completed in December 2015, when the supervisory board appointed the new CEO of Nexter Systems, Stéphane Mayer, and the chairman of the executive board of KMW, Frank Haun, as CEOs of the holding company.[12]\n\nIn 2016, the MGCS programme was in the concept phase which was projected to be completed by 2017.[13]\n\nAt the 2016 Eurosatory, Rheinmetall presented an MBT Advanced Technology Demonstrator on the basis of a Leopard 2A4 Evolution hull.[8] This would later become the Panther KF51.\n\nMeanwhile, at the 2018 Eurosatory, KNDS unveiled the European Main Battle Tank (E-MBT), a hybrid combining the hull of a Leopard 2A7 with the lighter, two-man turret of a Leclerc.[14] The previously independent companies KMW and Nexter intended to demonstrate that both could cooperate and jointly develop a next generation tank.[15]\n\nThe contract for the first part of the System Architecture Definition Study was signed in May 2020 by the German armed forces' procurement office on behalf of both nations to a consortium consisting of Rheinmetall, Nexter and KMW (KNDS),[16] with the aim of assessing different aspects of the programme such as interoperability with national systems, harmonising requirements and defining a multi-platform architecture for the future MGCS. The study is to be conducted over 18 months. The workshare during this phase is split between French and German companies.[17]\n\nThe System Architecture Definition Study is part of the Technology Demonstration Phase (TDP), which is to be completed by 2024 and is to be followed by the overall system demonstrator phase (GSDP) until 2028, after which initial production and testing is to occur.[17]\n\nIn June 2018, while von der Leyen was still in command of the German MoD, it was revealed that deployment of the new vehicles and systems is scheduled for 2035 with full operational capability to be achieved by 2040.[6] At the time it was said that full-scale development of the tank could be launched if export customers were found.[18]\n\nIn August 2019, the French media reported that the Italian and Polish ministries of defence voiced their interest in joining the project and hoped to see its inclusion in the EU's PESCO programme and other forms of EU defence funding.[19][20]\n\nIn September 2019, the Spanish Army expressed interest in replacing its fleet of Leopard 2E MBTs with the MGCS once the MGCS became available.[21]\n\nDuring a state visit to Warsaw in February 2020, French president Emmanuel Macron appeared open to Polish participation in the MGCS project, even though the idea of adding new partners to the program was previously met with French hostility. It was indeed Paris that imposed not to consider additional partners for the program until the study phase which will determine the architecture and the structuring functionalities of the MGCS was completed. This was to avoid risks of further delays in a project already stalled by disputes between the KNDS consortium and Rheinmetall.[22] Meanwhile, South Korean manufacturer Hyundai Rotem was reportedly in advanced negotiations to produce a version of the K2 Black Panther tank in Poland under licence for the \"Wilk\" (Wolf) Program; Poland was interested to replace its aging T-72s and PT-91s.[23][24]\n\nDuring June 2020 bilateral talks with his German counterpart, the Italian Undersecretary for Defence Giulio Calvisi said that the possibility of allowing Italy to participate in the MGCS programme had emerged.[25]\n\nIn December 2020, frustrated with the slow pace of the MGCS project,[26] Italy offered participation in its own development of a different tank to Poland, and potentially to Spain.[27]\n\nIn November 2021, the Netherlands government asked France and Germany to become an observer. However, the Franco-German partners were still negotiating conditions under which other countries should be allowed to take part in the project. The MGCS principals emphasised that the Dutch are seen as an important partner in the project.[28]\n\nIn January 2022, the Belgian government increased defence spending. Part of these plans includes participation in the MGCS programme.[29]\n\nIn July 2022, in the context of the Russian invasion of Ukraine, the Polish government signed an agreement to acquire 1000 K2PL Black Panther tanks for the \"Wilk\" (Wolf) Program and announced cooperation with South Korea on next generation K3 tank,[30] and due to the MGCS project schedules and planned implementations, Poland decided not to join the project.[31]\n\nIn 2025 Germany announced the approval of MGCS-Project Company as the joint-venture for the development of the new vehicle.[32]\n\nAccording to the French-German state research Institute of Saint-Louis (ISL), MGCS is to result in a future land warfare system which may include uncrewed, including autonomous ground and aerial vehicles, and crewed assets in the light, medium or heavy weight class as well as associated weaponry. As such, the aim of the MGCS development is to produce a means to deliver a set of capabilities currently provided by main battle tanks – yet not necessarily a typical \"single platform\" MBT; and requires the development of new tactics and collaborative combat capabilities in addition to new vehicles.[4]\n\nFor KNDS' exhibition at Eurosatory 2018, the hull, engine and entire chassis of a Leopard 2A7 which can carry 68 tons were modified to host the lighter, more compact, autoloader-equipped turret of the Leclerc.[33]\n\nAccording to Nexter's head of tracked and armour programmes, Francois Groshany, the benefit of the tank is the combination of the \"very high capability\" Leopard 2 chassis with the lighter Leclerc turret.[18] The 2-man Leclerc turret is approximately 6 tons lighter than the 3-man Leopard 2 turret. The lower weight of the vehicle enables it to traverse bridges that might not be able to support heavier tanks.[34]\n\nOn 26 April 2024, the French and German defence ministers announced the designation of the technology pillars and national responsibilities. Accordingly, MGCS is divided into:\n\n Media related to Main Ground Combat System at Wikimedia Commons\n\nBackground: History of the tank, Tank classification\n",
  "concepts": [
    "Main Ground Combat System",
    "mgcs",
    "project",
    "german",
    "tank",
    "french",
    "nexter",
    "leopard",
    "new",
    "development",
    "defence"
  ],
  "findings": [
    "History",
    "Design",
    "Project members",
    "Potential members",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T14:26:26.249339"
}