{
  "title": "Lawrence Freedman",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Lawrence_Freedman",
  "content": "Sir Lawrence David Freedman, KCMG, CBE, PC, FBA (born 1948) is a British academic, historian and author specialising in foreign policy, international relations and strategy.[1] He has been described as the \"dean of British strategic studies\"[2] and was a member of the Iraq Inquiry.[3] He is an Emeritus Professor of War Studies at King's College London.\n\nFreedman, who is of Jewish heritage, was educated at Whitley Bay Grammar School, the University of Manchester (BA), University of York (BPhil), and University of Oxford, where he was a student of Nuffield College (Fellow 1974–75) and the Faculty of Social Studies.[4] [3] His DPhil thesis, submitted in 1975, was The definition of the Soviet threat in strategic arms decisions of the United States: 1961–1974.[5] He also then held a part-time lectureship at Balliol College.[6]\n\nFreedman held positions at the International Institute for Strategic Studies and Royal Institute of International Affairs (Chatham House) before he was appointed, in 1982, Professor of War Studies at King's College London. He was head of the department until 1997. In 2000, he was the first head of the college's School of Social Science and Public Policy. From 2003 to December 2013, he was a Vice Principal at King's College London. He retired from King's in December 2014. He was appointed a Fellow of the college in 1992. He was appointed a visiting professor at the University of Oxford in the Blavatnik School of Government in 2015.[7]\n\nFreedman helped to prepare the 1999 Chicago speech in which Tony Blair set out the 'Blair doctrine'.[8][9]\n\nFreedman was the official historian of the Falklands campaign, and author of The Official History of the Falklands Campaign, published in two volumes (London: Routledge, 2006).[10]\n\nFreedman's principal areas of interest include contemporary defence and foreign policy issues.[11] He has written extensively on nuclear strategy and the cold war, as well as commentating regularly on contemporary security issues, and provides book reviews for Foreign Affairs.[12] His recent books include an Adelphi Paper on The Revolution in Strategic Affairs, an edited book on Strategic Coercion, an illustrated book on the Cold War, a collection of essays on British defence policy, and Kennedy's Wars that covers the major crises of the early 1960s over Berlin, Cuba, and Vietnam. Kennedy's Wars was a Silver Medal Winner of the Arthur Ross Prize, awarded by the Council on Foreign Relations in New York City.[13] In addition, a book on deterrence was published in 2004.[14] A Choice of Enemies: America Confronts the Middle East (New York: PublicAffairs, 2008), won the 2009 Lionel Gelber Prize and the 2009 Duke of Westminster's Medal for Military Literature. Strategy: A History (New York: Oxford University Press, 2013) was named as one of the best books of 2013 by the Financial Times[15] and was awarded the W J McKenzie Book Prize by the Political Studies Association.[16]\n\nFreedman was elected a Fellow of the British Academy in 1995 and appointed Commander of the Most Excellent Order of the British Empire in 1996[17] and Knight Commander of the Most Distinguished Order of St Michael and St George in 2003.[18][19]\n\nIn January 2006, he was awarded the Chesney Gold Medal by the Royal United Services Institute (RUSI) to mark a lifelong distinguished contribution in the defence and international security fields. His citation read:\n\nUnder his supervision, generations of students, as well as officers in Her Majesty's Forces learnt about the changing nature of war, and Britain's military history.\n\nIn his early academic career, Professor Freedman concentrated on the Soviet strategic threat, Britain's nuclear deterrent and the evolution of the trans-Atlantic Alliance.\n\n\nAs the Cold War ended, Professor Freedman was one of the prime movers in the growing debate about European security arrangements, as well as the new and emerging threats of terrorism and failed states. In all his contributions, he has combined erudition with a sympathetic view of the challenges facing Britain's Armed Forces, thereby enlightening a generation and more, in Britain and abroad, about the challenges facing us, and the appropriate role which the military can play to overcome them[20]\nHis other awards include Distinguished Scholar Award from the International Security Studies Section of the US International Studies Association (2007)[21] and the first George G Bell Award for strategic studies leadership from the Canadian International Council (2008).[22]\n\nHe was made a member of the Privy Council of the United Kingdom when appointed to the Iraq Inquiry in 2009.[23]\n\nHis wife is Judith Freedman, Pinsent Masons Professor of Taxation Law and a Fellow of Worcester College, Oxford.[24] They have two children, Ruth and Sam. Sam is an education policy expert who was a Senior Policy Advisor to the then Secretary of State for Education Michael Gove from 2010 to 2013 and is a Senior Fellow at the Institute for Government.[25]\n",
  "concepts": [
    "Lawrence Freedman"
  ],
  "findings": [
    "Life",
    "Career",
    "Honours and awards",
    "Personal life",
    "Selected publications",
    "References",
    "Further reading",
    "External links"
  ],
  "timestamp": "2025-04-11T10:20:26.333954"
}