{
  "title": "Stephen Billett",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Stephen_Billett",
  "content": "\nStephen Richard Billett is an Australian educational researcher and Professor of Adult Vocational Education in the School of Education and Professional Studies at Griffith University. His research centres on vocational learning, workplace learning, and learning for vocational purposes.\n\nStephen Billett earned a Diploma of Teaching in technical and further education from the Brisbane College of Advanced Education (1984), a B.A. in humanities (1987) and a M.Ed. (1990) from the University of Queensland, and a Ph.D. in education (1995) from Griffith University. His thesis, titled Structuring Knowledge Through Authentic Activities, was presented in 1995. His primary doctoral supervisor was John Stevenson, along with Peter Freebody. During his Ph.D. studies, he took up a position as lecturer at Griffith University's School of Education and Professional Studies (1992–97), from which he was promoted to senior lecturer (1997-2000), associate professor (2001–07) and eventually to Professor of Adult and Vocational Education (in 2008).[1]\n\nHe has received funding from the Australian Research Council and sits on the editorial and advisory boards of several academic journals, including the Journal on Workplace Learning, Vocations and Learning, and Empirical Research in Vocational Education and Training.[2][3][4][5] Previously, Billett had a career in garment manufacturing. In 2013, he was awarded an Honorary Doctorate by the University of Jyväskylä.[6]\n\nStephen Billett's research centres on the topic of learning through and for work, pertaining to the fields of vocational learning,[7] workplace learning,[8][9] and of conceptual accounts of learning for vocational purposes.[10][11] Since the 1990s, Billett's research has consistently emphasized the potential of workplace learning, conceptualizing workplaces as learning environments where the use of knowledge, roles and processes are continuously negotiated, framing the learner's participation in situated work activities, and appreciating practical knowledge.[12][13][14][15] In particular, he envisions learning as the transformatory result of individuals' participation in goal-directed activities - situated learning -, with the social circumstances of the learning influencing the development of knowledge, which in turn has consequences in terms of cognitive changes.[16] In his research, he notably found that guided learning interactions in the workplace may improve the efficacy of workers in performing new tasks in ways that cannot be (readily) achieved through everyday work activities alone, even though the latter are most valued by workers.[17] Moreover, Billett repeatedly emphasizes that the types and quality of learning occurring in the workplace are determined by individuals' engagement in the workplace and workplaces' readiness to afford individuals with opportunities for engaging in work and to support them in doing so, with the latter increasing the former if individuals are interested in learning.[18] These two topics - individuals' co-participation in work practices within a certain social setting - and workplaces' readiness to offer learning opportunities - are also returning themes in his work on workplace pedagogies and curricula;[19] for instance, he makes the case for a participatory workplace pedagogy based on guidance and participatory practices in the workplace and individuals' engagement in those practices.[20][21]\n\nBillett has been critical of descriptions of workplace learning as inherently \"informal\", arguing that workplace learning may display many characteristics of formal learning, and that learning should rather be conceptualised in terms of participatory practices wrought between the personal and vocational goals of individuals and the needs of workplaces.[22] Together with Margaret Somerville, he has also highlighted how workplace practices shape individuals' identities and are, in turn, shaped by workers based on their subjective experiences, e.g. if they demand better occupational health and safety in order to improve the quality and perception of their occupation; however, the learning process underlying such actions is hardly taken into account by most lifelong learning policies.[23] This emphasis on individual agency is also present in his analysis of the interdependance between individual and social agencies and, more specifically, the role of individual agency (e.g. intentionality, subjectivity or identity), its shaping by society over time and effect on cognitive experience, and its role in the social construction of experiences.[24][25] Finally, more recently, Billett has pleaded for the inclusion and integration of practice-based experiences in higher education, which requires close relations between academic institutions and practice settings and their personnel, while recognizing that both learning environments may have different imperatives.[26]\n\nAs a Future Fellow of the Australian Research Council, Billett led a research project on the development of a curriculum, pedagogy and epistemology of practice aimed at enhancing and legitimating practice-based learning experiences from 2011 to 2015. Currently (2015-2018), he manages a research project on how to increase students' employability by improving post-practicum educational processes.\n\nSelected books by Stephen Billett include:\n",
  "concepts": [
    "Stephen Billett"
  ],
  "findings": [
    "Biography",
    "Research",
    "Bibliography",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:14:00.177667"
}