{
  "title": "Windsor knot",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Windsor_knot",
  "content": "The Windsor knot, sometimes referred to as a full Windsor (or misleadingly as a double Windsor) to distinguish it from the half-Windsor, is a knot used to tie a necktie. As with other common necktie knots, the Windsor knot is triangular, and the wide end of the tie drapes in front of the narrow end. The Windsor is a wider knot than most common knots, and while not truly symmetric is more balanced than the common four-in-hand knot. The Windsor's width makes it especially suited to be used with a spread or cutaway collar.\n\nThe knot is named after the Duke of Windsor. He is sometimes credited with its invention[1] alongside his London shirtmaker.[2] It is however the case that the Duke achieved the wide knot that was his signature by wearing ties of thicker cloth that produced a wider knot from the conventional four-in-hand, and hence the Windsor knot was likely invented to emulate the Duke's wide knots using ties of normal thickness.[citation needed][3]\n\nThe Windsor knot is the only tie knot that is to be used by all personnel in the Royal Air Force and the Royal Air Force Air Cadets (comprising the ATC and CCF(RAF)) in the UK when wearing their black tie while in uniform.[citation needed] It is also the only accepted knot for the SD tie of the RAAF and AAFC in Australia.[4] However, it is often frowned upon in other Armed Services or Regiments of the British Forces through its association with the Duke, who as King Edward VIII famously abdicated in order to marry American divorcee Wallis Simpson.[citation needed]\n\nThe Windsor and four-in-hand knots are authorized for use by all services of the Canadian Forces.[citation needed]\n\nIn the 1999 book The 85 Ways to Tie a Tie, by Thomas Fink and Yong Mao, the Windsor knot is knot 31 and described in that book's notation as:\n\nThis notation encodes the following series of steps:\n\nCommon variations on the Windsor include:\n\nIn Ian Fleming's novel From Russia, with Love, Chapter 25 is entitled \"A tie with a Windsor knot\". James Bond, traveling on the Orient Express, is met by a supposed fellow British agent, who wears \"the dark blue and red zigzagged tie of the Royal Artillery, tied with a Windsor knot.[...] Bond mistrusted anyone who tied his tie with a Windsor knot. It showed too much vanity. It was often the mark of a cad.\"\n",
  "concepts": [
    "Windsor knot",
    "knot",
    "windsor",
    "tie",
    "windsor knot",
    "needed",
    "knots",
    "duke",
    "common",
    "citation needed",
    "citation"
  ],
  "findings": [
    "History and adoption",
    "Specification",
    "In fiction",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:26:13.498914"
}