{
  "title": "Atlantic menhaden",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Atlantic_menhaden",
  "content": "The Atlantic menhaden (Brevoortia tyrannus) is a North American species of fish in the herring family, Alosidae.[3]\n\nAtlantic menhaden are found in North Atlantic coastal and estuarine waters from Nova Scotia south to northern Florida. They are commonly found in all salinities of the Chesapeake Bay and Mid-Atlantic water. They swim in large schools that stratify by size and age along the coast. Younger and smaller fish are found in the Chesapeake Bay and southern coastline while older, larger fish are found along the northern coastline.[4]\n\nAtlantic menhaden are silvery coloured fishes characterized by a moderately compressed body and a black spot on their shoulder behind their gill openings. They can reach a size of approximately 15 inches.[4]\n\nThe Atlantic menhaden is a filter feeder; it collects food by filtering water through modifications of the branchial apparatus (gill arches and gill rakers). Its diet depends on the size of their gill rakers, which change as menhaden age. When the rakers are smaller (typically less than 1 year old) Atlantic menhaden feed primarily on zooplankton. As they age and their gill rakers grow larger, menhaden shift their diet to primarily consume phytoplankton.[5]\n\nAtlantic menhaden can spawn year round in inshore waters off the Atlantic coast, with the highest spawning rates near North Carolina in the late fall. The eggs hatch in the open ocean and the larvae drift to sheltered estuaries via ocean currents. The young spend a year developing in these estuaries before returning to the open ocean. At this early stage, they are commonly known as \"peanut bunker\". Atlantic menhaden usually do not become sexually mature until the end of their second year, after which they reproduce until death. A young, sexually mature female can produce roughly 38,000 eggs, while a fully mature female can produce upwards of 362,000.[6]\n\nEggs are buoyant and hatch within 2 to 3 days depending on the temperature. The larvae will spend 1 to 3 months in waters over the continental shelf. The Chesapeake Bay is a popular nursery for juvenile menhaden. Larval fish will enter the Bay in late winter and early summer. The larval fish will move into lower salinity waters in estuarine tributaries while juvenile and immature fish remain in the Bay until the fall. Atlantic menhaden can live up to 10 to 12 years.[4]\n\nAtlantic menhaden are preyed upon by fish such as striped bass, weakfish and bluefish, and by birds such as ospreys and eagles.[7] Humpback whales off the coast of New Jersey feed on Atlantic menhaden.[8][9]  Other cetaceans, such as fin whales and dolphins also eat menhaden.[10][11][12][13][14]  Dolphins can eat up to 20 pounds of Atlantic menhaden a day.[15]\n\nMenhaden have historically been used as a fertilizer for crops. It is likely that menhaden is the fish that Squanto taught the Pilgrims to bury alongside freshly planted seeds as fertilizer. Other uses for menhaden include: feed for animals, bait for fish, oil for human consumption, oil for manufacturing purposes and oil as a fuel source.\n\nIn the early years of the United States, Atlantic menhaden were being harvested by thousands of fishing ships. The Atlantic coastline was lined with processing facilities to quickly transform the fish into a product of worth, typically oil but later fish meal became more popular. Tragedy of the commons set in and the menhaden population began to dwindle. Many of these small companies could not manage, which left only a handful of menhaden fishing companies to remain on the Atlantic coast.[16]\n\nWhile many sources today claim that the menhaden is inedible, the fish were once consumed as sardines might be, or fried. Maine fishermen, for example, would eat fried pogies for breakfast. The fish that were not sold for bait would be sold to the poorer classes for food.\n\nIn the Atlantic, menhaden are targeted by two types of fisheries, a reduction fishery and a bait fishery. They are also taken directly by recreational fishing for use as bait.[18]\n\nThe reduction fishery processes whole menhaden into fish meal, fish oil, and fish solubles while the bait fishery supplies fishermen with menhaden as bait for key commercial and recreational fisheries. Both menhaden fisheries use a process known as purse seine fishing, in which two fishing boats surround a single school of fish with a large net. Purse seining is one of the most efficient methods of fishing available, with one of the lowest levels of bycatch.[19] The UN Food and Agriculture Organization has cited the Atlantic and Gulf menhaden fisheries as having one of the lowest levels of bycatch in the world.[20] The reduction fishery is largely based in the Chesapeake Bay and nearby Atlantic waters, and its season runs annually starting in May through the fall.\n\nThe bait fishery operates throughout the Atlantic coastline, ranging from North Carolina to New England.[21] Cast nets are also used for bait catch in the recreational fishing sector.\n\nThe fishery's sustainability has also been certified by independent organizations. Friend of the Sea, an international seafood sustainability certification program, has recognized both the Atlantic menhaden and Gulf menhaden fisheries as sustainable.[22] This is both due to the healthy status of the stock as well as the fishery's low levels of bycatch, which it achieves with the use of purse seine nets.[23]\n\nAtlantic menhaden are managed by the Atlantic States Marine Fisheries Commission (ASMFC), an interstate compact formed under an agreement by the 15 Atlantic coast states. Like with other species, the ASMFC manages menhaden to prevent overfishing and to keep the stock from being overfished. There is a subtle but distinct difference between the two designations. Overfishing occurs when too many fish are being taken from the population of a fish stock. A stock is considered overfished when it is not able to produce enough new fish to maintain the population.\n\nThe ASMFC uses two biological measurements, or reference points, to measure the health of the menhaden stock. To determine if the stock is overfished, the ASMFC measures fecundity (FEC), the number of mature eggs in the menhaden population, which indicates the stock's reproductive capability. To measure overfishing, the ASMFC monitors fish mortality (F), the measure of the amount of fish removed from the water. In 2010, the ASMFC's stock assessment found that the stock's mortality levels were high enough that overfishing was occurring, but its fecundity level indicated that it was not overfished.[24]\n\nBecause the ASMFC's 2010 assessment concluded that Atlantic menhaden was experiencing overfishing, some conservation, fishing and other organizations began urging the commission to impose new harvest restrictions, and the ASMFC began the process of drafting new catch limits.[25] This culminated the development of Amendment 2 to the menhaden Fishery Management Plan that established a total allowable catch (TAC) of 170,800 metric tons (376,549,544 pounds), effectively reducing the coastwide harvest by 20 percent compared to average landings from 2009 to 2011.[26]\n\nThe cuts followed a sustained campaign by environmental groups like Chesapeake Bay Foundation, as well as authors like Paul Greenberg, who called for a ban on fishing menhaden in US federal waters and the Chesapeake Bay. The decision was opposed by many working in the menhaden fishery, who considered the cuts unnecessary and economically harmful.\n\nThe TAC created the first ever coastwide catch limit, though the ASMFC had earlier instituted a harvest cap on the number of menhaden that can be caught in the Chesapeake Bay to address concerns of localized depletion.[27] \nAccording to recent reports, the stocks are not overfished in the Chesapeake Bay.[28]\n\nCritics have since evaluated several claims made about the status of menhaden during the development of the 2012 management measures. For example, claims about historic overfishing of menhaden made by the Pew Charitable Trusts were rated \"mostly false\" by the Providence Journal's Politifact column, which took issue with Pew saying 90 percent decline in abundance had occurred in recent years, rather than citing the 88 percent decline from 1982 to 2008.[29]\n\nThe latest stock assessment, published in early 2015, indicates that the stock is not currently subject to overfishing and has not been at an overfished population level since the 1990s.[30] The ASMFC unanimously accepted the stock assessment to use for management in May 2015 and increased the TAC to 187,880 metric tons (414,204,498 pounds). They also voted to begin Amendment 3 to consider changes to the current state-by-state allocation scheme and establish ecological reference points to help them, as Menhaden Management Board Chair Robert Boyles stated in the ASFMC's May 6, 2015 press release, fully evaluat[e] the ecological role of Atlantic menhaden through the amendment process.”[31]\n\nWhile popularly cited as filter feeders that remove excess algae and nutrients from the water, evidence suggests that menhaden do not significantly impact water quality. Adult menhaden largely do not eat phytoplankton, whose excessive growth leads to dead zones, instead feeding mainly on zooplankton.[32] There is evidence that, because menhaden secrete nitrogen, that they may actually be a net contributor to phytoplankton growth.[33]\n\nSeparate, but related, to the issue of dead zones are fish kills, where large numbers of menhaden or other fish will turn up dead in a single area. According to the Virginia Institute of Marine Sciences, which investigates fish kills in the Chesapeake Bay, the causes of fish kills are varied, but often are related to environmental factors such as low amounts of oxygen in the water, algal blooms, and water temperatures that are either too hot or too cold. Other factors, such as the dumping hazardous materials or excess bycatch, can also contribute.[34]\n\nDue to the change in striped bass population many have begun to cite the commercial harvesting of menhaden as the reasoning behind the shift. Several claims state that menhaden are a key staple in the striped bass diet. However, other studies see the striped bass as an opportunistic feeder with a variety of aquatic creatures that it consumes and therefore does not completely rely on the menhaden. In fact, menhaden has been represented as low as 8% of the striped bass diet.[35]\n",
  "concepts": [
    "Atlantic menhaden"
  ],
  "findings": [
    "Characteristics",
    "Biology",
    "Diet",
    "Life cycle",
    "Predators",
    "Fisheries and management",
    "Historical uses",
    "Commercial fishery",
    "Management",
    "Environmental concerns in the Chesapeake Bay",
    "History of the names",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:16:04.621041"
}