{
  "title": "LGBTQ Mormon suicides",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/LGBTQ_Mormon_suicides",
  "content": "In society at large, LGBTQ individuals, especially youth, are at a higher risk of depression, anxiety, and suicide.[1][2][3] Though causes of mental health risk are complex, one often cited reason for these higher risks is minority stress stemming from societal anti-LGBT biases and stigma, rejection, and internalized homophobia.[4]\n\nA 2016 empirical study found a correlation between the percentage of members of Mormonism's largest denomination, the Church of Jesus Christ of Latter-day Saints (LDS Church), in a U.S. state and the suicide rates of that state, stating the reason was due to the church's stance on same-sex sexual relations.[5] The study could not examine what percentages of the deaths were LGBTQ persons or the percentage that were Latter-day Saints. A 2019 study found that gay and bisexual men raised in the LDS Church who remained affiliated had lower life satisfaction and higher risk of suicidality than LDS-raised gay and bisexual men who had disaffiliated. It also found for sexual minorities of all genders that discontinuing involvement with the LDS Church was correlated with better mental health and less internalized anti-gay biases.[6]: 8 [7]\n\nA 2002 research report found a negative correlation in suicide between general LDS Church youth members and nonmember youth in Utah, finding higher levels of religiosity appear to be inversely associated with suicide. The study did not take into account sexual orientation or gender identity and expression,[8] and a different study found that while higher religiosity was correlated with lower rates of suicide attempts for heterosexual youth, it had the opposite affect for youth reporting homosexual feelings and increased suicidality, and the same pattern held true for reported parental religiosity.[6]: 3 [9] In a 2015 survey of 92 LGBTQ BYU students done by USGA, over half had at some point considered self-harm.[10]\n\nOther studies have shown that LGBTQ Mormons and former Mormons experience higher rates of certain mental health disorders such as PTSD, major depressive disorder, and generalized anxiety disorder than the general population.[11][12][13] These are positively correlated with suicidality.[14][15][16] One snowball sampling study of 1,612 LGBTQ Mormon and former Mormon respondents in 2015 found that involvement with the LDS Church and being single and celibate or engaging in a mixed-orientation marriage are both associated with higher rates of depression and a lower quality of life for LGBTQ individuals.[11]\n\nMany have stated the belief that LDS teachings on homosexuality and gender, such as the belief gender and sexuality can be changed, have contributed to the suicides of LGBTQ members, and enabled harsh behavior by its members.[19] In January 2016 the LDS Church stated in regards to reported suicides of LGBTQ Mormons that leaders and members are taught to \"reach out in an active, caring way to all, especially to youth who feel estranged or isolated.\"[20] Affirmation, the largest and oldest continuously run LGBTQ Mormon organization, reported over 30 LGBTQ LDS deaths by suicide between 1971 and 2008[21][22] including five gay male Brigham Young University (BYU) students who died by suicide in 1965.[23][24]\n\nSuicidality among the general LGBTQ population in the United States (US) is an area of ongoing research. The US Department of Health and Human Services found in 1989 that nearly 1 of 3 adolescent suicides in the US were by lesbian and gay teens.[25] Another 2001 study found that homosexual teens were 2.5 times more likely to attempt suicide than their heterosexual peers with suggestions that higher rates of depression, victimization by bullies, and alcohol use to numb anxiety from hiding ones stigmatized sexual orientation may be causative factors.[25] Teen suicide rates in the US and Utah (a state with a large LDS population) have increased over the past decade.[26] Among Utah youth aged 10–17 who died by suicide during 2011–2015 with circumstances data, 45% (48 of 146) were LDS affiliated.[27]: 91  Of the 40 cases that included information on the decedent's sexual orientation, six (15.0%) were identified as sexual minorities.[27]: 38 \n\nVarious research surveys have found a range of correlations in the intersection of suicidality and involvement with the LDS Church. Studies have shown that LGBTQ Latter-day Saints and LGBTQ former Latter-day Saints experience higher rates of certain mental health disorders such as PTSD and major depressive disorder than the general population, and these are positively correlated with suicidality. One study of 1,612 LGBTQ Latter-day Saint and former Latter-day Saint respondents in 2015 found that involvement with the LDS Church and being single and celibate or engaging in a mixed-orientation marriage are both associated with higher rates of depression and a lower quality of life for LGBTQ individuals.[11] Depression has been shown to have a strong positive correlation with suicidal intent.[14] Clinically significant symptoms of complex post-traumatic stress disorder related to their experiences within Mormonism have also been observed at high rates among affiliated and disaffiliated LGBTQ Latter-day Saints,[12][13][28] and PTSD is associated with suicide attempts and ideation.[15][16]\n\nA large representative sample of Utah middle and high school students shows higher rates of suicide for LGBTQ youth, which was higher for non-LDS LGBTQ youth when compared to LDS LGBTQ youth.[29] An analysis by the church's largest university, Brigham Young University (BYU), of data from the 2019 Utah Department of Human Services survey of Utah students (6th to 12th grade) found that \"religious affiliation was unrelated to suicidality and depression for LGBQ youths once other factors (e.g., family, drug use) were taken into account.\"[30] For both non-LDS and LDS Utah youth, higher levels of family conflict and lower levels of parental closeness were related to increased reports of depression, substance use, self-harm, suicidal ideation and attempts.[29]\n\nA key factor in determining mental health wellbeing is family acceptance and support, and feelings of isolation and rejection are correlated with suicidality.[31] Studies show LDS transgender and other gender diverse (TGD) individuals tend to have much better outcomes when their family members are affirming.[31]\n\nA number of individuals[32][33] and organizations[34] have stated their belief that church teachings against homosexuality and the treatment of LGBT Mormons by other members and leaders has contributed to LGBTQ Mormon suicides.[35][10][36] For example, LDS historian Gregory Prince stated that by condemning homosexuality as \"evil, self-inflicted, and impossible in postmortal existence\" LDS church leaders have enabled harsh behavior by its members with the alarming number of LDS LGBTQ unhoused people and Utah's highest per capita teen suicide rate in the country manifesting the effects of this cruelty.[17]: 4  A prominent openly gay member Mitch Mayne wrote in 2012 that his LDS mother told him it would have been better for her if he had been born dead (i.e. stillborn) rather than live and grow up and be gay.[17]: 17 [18]\n\nIn the late 1990s psychiatrist Jeffery R. Jensen[37] directed his presentations' comments to church leaders and LDS Family Services stating that \"far too many of our lesbian and gay youths kill themselves because of what you say about them,\" and \"those who believe your false promises and remain celibate in the hopes of eventual 'cure' are consigned to a misery.\"[38][39] Soon after, the American Psychiatric Association disavowed therapy trying to change sexual orientation as ineffective and destructive, and current publications find that these efforts can be very harmful.[40][41]\n\nChurch leaders taught for decades that members could and should try to \"turn off\" gay attractions through means including personal righteousness.[42] There is no reliable evidence that such practices can alter sexual orientation or gender identity, and many medical institutions warn that sexual orientation change efforts are ineffective and potentially harmful. Church teachings were taken to heart by many adherents as a 2015 survey of 1,612 LGBTQ Mormons and former Mormons found that 73% of men and 43% of women had attempted sexual orientation change, usually through multiple methods across many years.[43]: 5 \n\nLGBTQ youth who have undergone sexual orientation or gender identity conversion efforts (SOGICE) are more than twice as likely to report having attempted suicide and more than 2.5 times as likely to report multiple suicide attempts in the past year according to a 2020 survey of over 30,000 teen and young adult LGBTQ individuals.[45] The study also found that greater levels of family religiosity are associated with increased attempts at SOGICE, and three-fourths of respondents who had undergone SOGICE reported parents using religion to say negative things about being LGBTQ.[44]: 1225  Another study of 245 LGBTQ young adults found those who reported both parent-initiated attempts to convince them to change, and formal efforts by others (e.g. church clergy) were 5 times more likely to report suicide attempts than those who reported no change attempts or conversion efforts.[44]: 1221–1222 \n\nApostle Todd Christofferson's gay brother Tom stated that he was \"quite surprised\" that he was still gay after serving his mission having believed church teachings that through righteous effort God would remove same-sex attractions.[17]: 26  Former bishop Robert Rees stated in 2016 that he counseled many gay members who followed church leader promises about changing their sexual orientation via missions, temple attendance, and scripture reading, and when change didn't came they often blamed themselves for not being righteous enough and this led to many attempted and successful suicides.[17]: 26–27  LDS author Carol Lynn Pearson whose husband came out as gay many years into their marriage stated that, \"to me it is clear that many suicides among young Mormon homosexuals, as well as gay people in other religions, can be traced directly to a hostile social and religious environment.\"[46] One of the Evergreen International's first board members, and a stake presidency member Russ Baker-Gorringe became severely depressed when his continued efforts to change his attractions failed, resulting in a 1999 suicide attempt only prevented by his daughter.[47][48]\n\nLDS church leaders explicitly promoted therapy attempts to change sexual orientation in the past, but have recently shifted away from those previous views.[49]: 17–20  A church leader did not take a position on conversion therapy when asked in 2006.[50][49]: 17–20  Church leaders began explicitly stating that same-sex physical attractions were not a choice in 2012[49]: 21  and stating that therapy focusing on a change in sexual orientation was unethical in 2016.[51] In 2019 The church's tacit endorsement of conversion therapy[52]: 195  was announced as overturned when a spokesperson for the church stated, \"We are opposed to conversion therapy and our therapists do not practice it.\"[53][54]: 4–5 [55]\n\nChurch teachings on suicide have changed through the years.[56] One of the earliest recorded explicit mentions by a top church leader was by George Q. Cannon in the First Presidency who stated in an 1893 editorial to LDS youth that \"Every member of the Church should be made to understand that it is a dreadful sin to take one's own life. It is self-murder ....\"[57] He echoed this stating, \"They who do so are guilty of murder, self-murder it is true ... no one can destroy so precious a gift as that of life without incurring a severe penalty.\"[58][59][56] Cannon recorded that the First Presidency decided those who died by suicide would not receive an honorable burial in their LDS temple robes as was customary for endowed members.[60]\n\nIn 1987 the apostle M. Russell Ballard also stated that those who die by suicide have \"committed a very serious sin, and some consequences of it may remain with them throughout eternity.\"[61] Church seventy Bruce R. McConkie wrote in his highly influential LDS bestseller[62][63][17]: 16  Mormon Doctrine that \"Suicide is murder, pure and simple, and murderers are damned.\"[64]: 12 [65][66] In the 2011 LDS Beliefs: A Doctrinal Reference published by the church, the section on suicide called it \"self-murder\" and stated that, \"modern prophets and apostles have likewise spoken clearly about the seriousness of murder, including self-murder and the severity of consequences associated therewith.\"[67]\n\nThe LDS Church released a statement through spokesman Dale Jones on 28 January 2016 mourning the reported suicides of 32 LGBTQ Mormons. The release stated that leaders and members are taught to \"reach out in an active, caring way to all, especially to youth who feel estranged or isolated.\"[20][10] On 9 February 2016 when apostle Dallin H. Oaks was asked about church leaders and members' responsibility for the treatment of LGBTQ individuals that may have precipitated in suicides he stated \"that's a question that will be answered on judgment day\" and that \"nobody is sadder about a case like that than I am.\"[68]\n\nIn June 2016 the church published its official Mental Health website[69] followed shortly in September 2016 by its official Preventing Suicide website.[70] In August 2017, the LDS Church supported the LoveLoud Festival, a concert event at Utah Valley University raising money for charities which support LGBTQ youth.[71] In April 2018, the LDS Church donated $150,000 to the state of Utah to aid in suicide prevention.[72] In July 2018, the LDS Church donated $25,000 to the LGBTQ advocacy group Affirmation: LGBTQ Mormons, Families & Friends to aid in worldwide suicide prevention training.[73]\n\nBelow are a few media-reported, completed suicides of LGBTQ individuals from Mormon backgrounds, with the year of death noted in parentheses.\n\nSuicide attempts and ideation have been experienced by many LGBT Latter-day Saints. In a 2015 survey of 92 LGBTQ BYU students done by USGA, 52% had at some point considered self-harm.[10] Below is a list of a at one time LDS-affiliated LGBTQ individuals who reported serious suicidal ideation or suicide attempts.\n",
  "concepts": [
    "LGBTQ Mormon suicides"
  ],
  "findings": [
    "Research",
    "Teachings on sexuality and gender identity origins and purported changeability",
    "Sexual orientation or gender identity conversion efforts",
    "Church leader teachings on suicide",
    "Church suicide prevention efforts",
    "Publicized instances of suicide",
    "Latter-day Saint LGBT suicide attempts and ideation",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:19:54.248925"
}