{
  "title": "Hyperaccumulator",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Hyperaccumulator",
  "content": "A hyperaccumulator is a plant capable of growing in soil or water with high concentrations of metals, absorbing these goodness through their roots, and concentrating extremely high levels of metals in their tissues.[1][2] The metals are concentrated at levels that are toxic to closely related species not adapted to growing on the metalliferous soils. Compared to non-hyperaccumulating species, hyperaccumulator roots extract the metal from the soil at a higher rate, transfer it more quickly to their shoots, and store large amounts in leaves and roots.[1][3] The ability to hyperaccumulate toxic metals compared to related species has been shown to be due to differential gene expression and regulation of the same genes in both plants.[1]\n\nHyperaccumulating plants are of interest for their ability to extract metals from the soils of contaminated sites (phytoremediation) to return the ecosystem to a less toxic state. The plants also hold potential to be used to mine metals from soils with very high concentrations (phytomining) by growing the plants, then harvesting them for the metals in their tissues.[1]\n\nThe genetic advantage of hyperaccumulation of metals may be that the toxic levels of heavy metals in leaves deter herbivores or increase the toxicity of other anti-herbivory metabolites.[1]\n\nMetals are predominantly accumulated in the roots causing an unbalanced shoot to root ratio of metal concentrations in most plants. However, in hyperaccumulators, the shoot to root ratio of metal concentrations are abnormally higher in the leaves and much lower in the roots.[4] As this process occurs, metals are efficiently shuttled from the root to the shoot as an enhanced ability in order to protect the roots from metal toxicity.[4]\n\nDelving into tolerance: Throughout the research of hyperaccumulation, there is a conundrum with tolerance. There are several different understandings of tolerance associated with accumulation; however, there are a few similarities. Evidence has conveyed that the traits of tolerance and accumulation are separate to each other and are moderated by genetic and physiological mechanisms.[5] Moreover, the physiological mechanisms, in relation to tolerance, are classified as exclusion: when the movement of metals at the interfaces of soil/root or root/shoot are blocked, or accumulation: when the uptake of metals that have been rendered as non-toxic are allowed into the aerial plant parts.[6]\n\nCharacteristics from certain physiological elements:\n\nThere are certain characteristics that are specific to certain species. For example, when presented with a low supply of zinc, Thlaspi caerulescens had higher zinc concentrations accumulated compared to other non-accumulator plant species.[7] Further evidence indicated that when T. caerulescens were grown on soil with an adequate amount of contamination, the species accumulated an amount of zinc that was 24-60 times more than Raphanus sativus (radish) had accumulated.[7] Additionally, the capacity to experimentally manipulate soil metal concentrations with soil amendments has allowed researchers to identify the maximum soil concentrations that hyperaccumulation species can tolerate and the minimum soil concentrations in order to reach hyperaccumulation.[4] Furthermore, with these findings, two distinct categories of hyperaccumulation arose, active and passive hyperaccumulation.[4] Active hyperaccumulation is attained by relatively low soil concentrations. Passive hyperaccumulation is induced by exceedingly high soil concentrations.[4]\n\nSeveral gene families are involved in the processes of hyperaccumulation including upregulation of absorption and sequestration of heavy-metal metals.[8] These hyperaccumulation genes (HA genes) are found in over 450 plant species, including the model organisms Arabidopsis and Brassicaceae. The expression of such genes is used to determine whether a species is capable of hyperaccumulation.  Expression of HA genes provides the plant with capacity to uptake and sequester metals such as As, Co, Fe, Cu, Cd, Pb, Hg, Se, Mn, Zn, Mo and Ni in 100–1000x the concentration found in sister species or populations.[9]\n\nThe ability to hyperaccumulate is determined by two major factors: environmental exposure and the expression of ZIP gene family.\nAlthough experiments have shown that the hyperaccumulation is partially dependent on environmental exposure (i.e. only plants exposed to metal are observed with high concentrations of that metal), hyperaccumulation is ultimately dependent on the presence and upregulation of genes involved with that process. It has been shown that hyperaccumulation capacities can be inherited in Thlaspi caerulescens (Brassicaceae) and others. As there is a wide variety among hyperaccumulating species that span across different plant families, it is likely that HA genes were eco-typically selected for. \nIn most hyperaccumulating plants, the main mechanism for metal transport are the proteins coded by genes in the ZIP family, however other families such as the HMA, MATE, YSL and MTP families have also been observed to be involved. The ZIP gene family is a novel, plant-specific gene family that encodes Cd, Mn, Fe and Zn transporters. The ZIP family plays a role in supplying Zn to metalloproteins.[10]\n\nIn one study on Arabidopsis, it was found that the metallophyte Arabidopsis halleri expressed a member of the ZIP family that was not expressed in a non-metallophyte sister species. This gene was an iron regulated transporter (IRT-protein) that encoded several primary transporters involved with cellular uptake of cations above the concentration gradient. When this gene was transformed into yeast, hyperaccumulation was observed.[11] This suggests that overexpression of ZIP family genes that encode cation transporters is a characteristic genetic feature of hyperaccumulation. \nAnother gene family that has been observed ubiquitously in hyperaccumulators are the ZTP and ZNT families. A study on T. caerulescens identified the ZTP family as a plant specific family with high sequence similarity to other zinc transporter4. Both the ZTP and ZNT families, like the ZIP family, are zinc transporters.[12] It has been observed in hyperaccumulating species, that these genes, specifically ZNT1 and ZNT2 alleles are chronically overexpressed.[13]\n\nWhile the precise mechanism by which these genes facilitate hyperaccumulation is unknown, expression patterns strongly correlate with individual hyperaccumulation capacity and metal exposure, implying that these gene families play a regulatory role. Because the presence and expression of zinc transporter gene families are highly prevalent in hyperaccumulators, the ability to accumulate a diverse range of heavy metals is most likely due to the zinc transporters' inability to discriminate against specific metal ions. The response of the plants to hyperaccumulation of any metal also supports this theory as it has been observed that AhHMHA3 is expressed in hyperaccumulating individuals. AhHMHA3 has been identified to be expressed in response to and aid of Zn detoxification.[9] In another study, using metallophytic and non-metallophytic Arabidopsis populations, back crosses indicated pleiotropy between Cd and Zn tolerances.[14]  This response suggests that plants are unable to detect specific metals, and that hyperaccumulation is likely a result of an overexpressed Zn transportation system.[15]\n\nThe overall effect of these expression patterns has been hypothesized to assist in plant defense systems. In one hypothesis, \"the elemental defense hypothesis\", provided by Poschenrieder, it is suggested that the expression of these genes assist in antiherbivory or pathogen defenses by making tissues toxic to organisms attempting to feed on that plant.[10] Another hypothesis, \"the joint hypothesis\", provided by Boyd, suggests that expression of these genes assists in systemic defense.[16]\n\nAn important trait of hyperaccumulating plant species is enhanced translocation of the absorbed metal to the shoot. Metal toxicity is tolerated by plant species that are native to metalliferous soils. Exclusion, in which plants resist undue metal uptake and transport, and absorption and sequestration, in which plants pick up vast quantities of metal and pass it to the shoot, where it is accumulated, are the two basic methods for metal tolerance.[17] Hyperaccumulators are plants that have both the second technique and the ability to absorb more than 100 times higher metal concentrations than typical organisms.[18]\n\nT. caerulescens is found mostly in Zn/Pb-rich soils, as well as serpentines and non-mineralized soils. It was discovered to be a Zn hyperaccumulator. Because of its ability to extract vast quantities of heavy metals from soils.[19] When grown on mildly polluted soils, a closely related species, Thlaspi ochroleucum, is a heavy metal-tolerant plant, but it accumulates much less Zn in the shoots than T. caerulescens. Thus, Thlaspi ochroleucum is a non-hyperaccumulator and of the same family T. caerulescens is a hyperaccumulator. The transfer of Zn from roots to shoots varied significantly between these two species. T. caerulescens had much higher shoot/root Zn concentration levels than T. ochroleucum, which always had higher Zn concentrations in the roots. When Zn was withheld, the amount of Zn previously accumulated in the roots in T. caerulescens decreased even more than in T. ochroleucum, with a concomitantly greater rise in the amount of Zn in the shoots. The decreases in Zn in roots may be mostly due to transport to shoots, since the volume of Zn in shoots increased during the same time span.[20]\n\nA heavy metal transporter, cDNA, mediates high-affinity Zn2+ uptake as well as low-affinity Cd2+ uptake. This transporter is expressed at very high levels in roots and shoots of the hyperaccumulator. According to (Pence et., al. 1999), an overexpression of a Zn transporter gene, ZNT1, in root and shoot tissue is an essential component of the Zn hyperaccumulation trait in T. caerulescens.[21] This increased gene expression has been shown to be the basis for increased Zn21 uptake from the soil in T. caerulescens roots, and it is possible that the same process underpins the enhanced Zn21 uptake into leaf cells.\n\n13. Souri Z, Karimi N, Luisa M. Sandalio. 2017. Arsenic Hyperaccumulation Strategies: An Overview. Frontiers in Cell and Developmental Biology. 5, 67. DOI: 10.3389/fcell.2017.00067.\n",
  "concepts": [
    "Hyperaccumulator"
  ],
  "findings": [
    "Physiological basis",
    "Genetic basis",
    "Metal transporters",
    "See also",
    "References"
  ],
  "timestamp": "2025-04-11T10:13:55.561346"
}