{
  "title": "2016 FC Dallas season",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/2016_FC_Dallas_season",
  "content": "The 2016 FC Dallas season was the club's 21st season in existence in Major League Soccer (MLS), the top tier of the United States soccer league system. The club played its home games at Toyota Stadium for the 12th straight year.\n\nThe 2016 season was FC Dallas' most successful season ever. They achieved the double by winning both the Supporters' Shield for posting the best regular season record and the U.S. Open Cup, the nation's domestic cup competition. It marked the first time since 2014 where a club earned the double, and Dallas became the last of either the original MLS teams in 1996 or the existing teams founded before 2005 to win any major trophies. The Hoops fell short of winning the treble by being eliminated in the conference semifinals of the 2016 MLS Cup Playoffs, losing 2–4 on aggregate to the Seattle Sounders FC. Individually, head coach Óscar Pareja was named MLS Coach of the Year,[1] Matt Hedges was named Defender of the Year,[2] and Mauro Díaz and Hedges were named to the MLS Best XI.[3]\n\nIn addition to winning the Shield, winning the Open Cup and participating in the MLS Cup Playoffs, Dallas also played in the group stages of the 2016–17 CONCACAF Champions League, where they managed to win their group. This allowed Dallas to qualify for the knockout rounds of a CONCACAF competition for the first time in their club history. The knockout rounds of the competition will be played during the 2017 FC Dallas season.\n\nThe first stage of the 2015 MLS Re-Entry Draft took place on December 11, 2015.\nThe second stage of the 2015 MLS Re-Entry Draft took place on December 17, 2015.\n\nRounds 1 and 2 of the draft were held on January 14, 2016. \nRounds 3 and 4 of the draft were held on January 19, 2016.\n\nAs of September 15, 2016.[35]\n\nNote: Flags indicate national team as defined under FIFA eligibility rules; some limited exceptions apply. Players may hold more than one non-FIFA nationality.\n\n  Win\n  Draw\n  Loss\n  Canceled\n\nWestern Conference\n\n\nLast updated: October 23, 2016.\nSource: Regular Season\n\nKickoff times are in CDT (UTC-05) unless shown otherwise\n\nSince FC Dallas were the 2015 MLS Western Conference regular season champions, the club qualified for a group stage spot in the CONCACAF Champions League.  It is the second time Dallas qualified for the competition after participating in the group stage of the 2011-12 Champions League where they did not advance out of the group stage. This time, however, they won their group to advance to the knockout stage.\n",
  "concepts": [
    "2016 FC Dallas season",
    "mls",
    "season",
    "dallas",
    "2016",
    "stage",
    "group",
    "league",
    "fc",
    "cup",
    "club"
  ],
  "findings": [
    "Background",
    "Transfers",
    "Loan in",
    "Loan out",
    "2015 MLS Re-Entry Draft picks",
    "2016 MLS SuperDraft picks",
    "Roster",
    "Competitions",
    "Match results",
    "Preseason",
    "Major League Soccer",
    "MLS Cup Playoffs",
    "CONCACAF Champions League",
    "U.S. Open Cup",
    "Statistics",
    "Appearances",
    "Goals and assists",
    "Disciplinary record",
    "Goalkeeper statistics",
    "Kits",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:40.154834"
}