{
  "title": "Evangelical Philosophical Society",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Evangelical_Philosophical_Society",
  "content": "The Evangelical Philosophical Society (EPS) is an organization devoted to the study of philosophy, philosophy of religion, philosophical theology, apologetics, and ethics from an evangelical perspective.[1] Membership is open to professional scholars, and associate membership is available to laypersons and students. The current president of the organization is Keith Hess.[2]\n\nPhilosophia Christi is a peer-reviewed academic journal published twice a year by the Evangelical Philosophical Society with the support of Biola University as a vehicle for the scholarly discussion of philosophy and philosophical issues as well as philosophy of religion, philosophical theology, and philosophical apologetics.[3] Its editor is Ross Inman.[3]\n\nThe Evangelical Philosophical Society (EPS) is considered a \"sister society\" to the Evangelical Theological Society (ETS). EPS was founded in 1974[4] at Dallas Theological Seminary when a group of scholars from ETS met at the ETS annual meeting in December 1974 to discuss concerns related to philosophy of religion.[5] At this meeting, a steering committee was established to explore the idea of forming a new society to focus on philosophy.[6] EPS was then officially organized at the ETS annual meeting in Philadelphia on December 28, 1976, with Norman Geisler serving as its first president.[1] There were twenty charter members of the EPS.[1] In 1978, EPS began publishing its own journal, the Bulletin of the Evangelical Philosophical Society, which was later renamed Philosophia Christi in 1994.[7]\n\nIn 1998, plans were made to restructure the Evangelical Philosophical Society in several ways. Among these was lengthening the term of officers from one to three years and relaunching the EPS journal, Philosophia Christi, starting with \"Series 2\" in 1999.\n\nThis article about a philosophy-related organization is a stub. You can help Wikipedia by expanding it.\nThis article about a Christian organization is a stub. You can help Wikipedia by expanding it.\nThis philosophy of religion-related article is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Evangelical Philosophical Society",
    "philosophical",
    "society",
    "philosophy",
    "evangelical",
    "eps",
    "philosophical society",
    "evangelical philosophical",
    "religion",
    "philosophy religion",
    "organization"
  ],
  "findings": [
    "Philosophia Christi",
    "History",
    "Presidents",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:40:06.828518"
}