{
  "title": "Mary Elizabeth Lease",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Mary_Elizabeth_Lease",
  "content": "Mary Elizabeth Lease (September 11, 1850[a] – October 29, 1933) was an American lecturer, writer, Georgist,[1] and political activist. She was an advocate of the suffrage movement as well as temperance,[2] but she was best known for her work with the People's Party (Populists).\n\nShe made her political debut in 1888 with the Union Labor Party or Socialist Labor Party and soon joined the Farmers' Alliance or Populist Party. She was referred to as the \"People's Joan of Arc\". In that party's 1890 campaign she made more than 160 speeches and claimed credit for the defeat of Kansas senator John Ingalls. (William A. Peffer was elected on the Populist ticket.)\n\nShe opposed big business and stated flatly that \"Wall Street owns the country.\"[3] She was called \"Our Queen Mary\" while campaigning with the Populists candidate James B. Weaver during his 1892 run for president,[4] and also \"Mother Lease\" by her supporters, as well as, \"Mary Yellin\" by some of her enemies. \n\nIn 1895, she wrote The Problem of Civilization Solved,in which she pushed for back-to-the-land government programs for willing workers, self-improvement, and no support for idlers.[5][6]\n\nLiterary scholar Brian Attebery claimed Mary Elizabeth Lease to have been the model for Dorothy in L. Frank Baum's The Wonderful Wizard of Oz.[7]\n\nLease was born to Irish immigrants Joseph P. and Mary Elizabeth Murray Clyens (an anglicization of the Gaelic name Mac Giolla Chaillín), in Ridgway, Pennsylvania. \n\nAt the age of 20, she moved to Kansas to teach school in Osage Mission (St. Paul, Kansas), and three years later, she married Charles L. Lease, a local pharmacist. They lost their Kingman County farm in the Panic of 1873 and moved to Denison, Texas, where she studied law.[8] The Leases and their four children later moved to Wichita, Kansas, where she took a leading role in civic and social activities. She was admitted to the Kansas bar in  1885.[9]\n\nIn 1885 Lease went on her first public speaking tour, raising money for the Irish National Land League. She also spoke at the Kansas state convention of the Union Labor Party.[10] By 1888, she was active within the party, stumping for the 1888 campaign and editing the party newspaper. \n\nHer work led her to the Farmer's Alliance and Knights of Labor, and in 1891, she was elected leader of a local Knights assembly.[10]\n\nShe was involved in African American suffrage. From there she became involved in the movement that would become the Populist Party. She believed that big business had made the people of America into \"wage slaves\", declaring, \"Wall Street owns the country. It is no longer a government of the people, by the people, and for the people, but a government of Wall Street, by Wall Street, and for Wall Street. The great common people of this country are slaves, and monopoly is the master.\"[11]\n\nShe was said to have exhorted Kansas farmers to \"raise less corn and more hell\", but she later said that the admonition had been invented by reporters. Lease decided to let the quote stand anyway because she thought \"it was a right good bit of advice\".[12][10]\n\nShe was recognized as being a powerful orator who was adept at expressing the discontent of the people. Emporia Gazette editor William Allen White, who did not share her political views, wrote on one occasion that \"she could recite the multiplication table and set a crowd hooting and hurrahing at her will\".[13] While many considered her speeches inspirational, the fervor of her words and the vehemence of her conviction, made others hesitant to support her cause. Farmers and labor unions loved her, while the press and the major party politicians criticized her mercilessly. \n\nMost went far beyond disagreeing with the content of Lease's arguments and resorted to ad hominem and misogynistic tactics, focusing their attacks on her looks, self-confidence, and her \"unwomanly\" argumentative behavior. One reporter described her as \"untrained, and while displaying plenty of a certain sort of power, is illogical, lacks sequence and scatters like a 10-gauge gun.\"[14] The Wellington Monitor called her “a miserable character of womanhood and hideously ugly of features and foul of tongue”.[15] A Republican editor similarly characterized her as \"...the petti-coated smut-mill. Her venomous tongue is the only thing marketable about the old harpy, and we suppose she is justified in selling it where it commends the highest price.\"[16]\n\nDespite the abuse, Lease persevered, continuing to deliver her message throughout America. In 1890 she made more than 160 speeches for the Populist cause, campaigning throughout Kansas, as well as the Far West and the South.\n\n This helped to elect William A. Peffer as Kansas senator.\n\nLease was a leader of the anti-fusion faction within the party who opposed merger with the Democratic Party. Lease began drifting away from the Populist Party after Populist Governor Lorenzo D. Lewelling was elected into office. By November 1893, she was reported to have openly criticized the Lewelling administration, only to deny it in an interview several days later.[17]\n\nIt would seem that the first interview reflected her true feelings. By December 1893, Lewelling attempted to have her removed from the board of charities, a position to which he originally had appointed her. Lease felt the attempt to have her removed stemmed from her determination to have women's suffrage and temperance as her main focus at the Populist Party's next state convention. Her public outrage at the attempt to remove her prompted other Populist parties to distance themselves from her.\n\nBy 1896, Lease had become alienated from the Populist Party, and historian Gene Clanton cites her split with the Populist Party as being a major contributor to the Populist party's defeat in 1894.[18]\n\nDespite her fallout with — and the eventual destruction of — the Populist Party, Lease felt that their work and efforts were ultimately rewarded with the election of Theodore Roosevelt and the national push for reforms that she had championed years earlier: \n\n\"In these later years I have seen, with gratification, that my work in the good old Populist days was not in vain. The Progressive party has adopted our platform, clause for clause, plank by plank. Note the list of reforms which we advocated which are coming into reality. Direct election of senators is assured. Public utilities are gradually being removed from the hands of the few and placed under the control of the people who use them. Women suffrage is now almost a national issue... \n\nThe seed we sowed out in Kansas did not fall on barren ground.\"[19]\n\nIn 1896, she moved to New York City where she wrote for the New York World.  In addition, she worked as an editor for the National Encyclopedia of American Biography. \n\n\nShe divorced her husband in 1902 and spent the rest of her life with one or another of her children in the East until her death.\n\nLease died in Callicoon, New York on October 29, 1933.[2]\n\nIn 1893 Lease predicted that by 1993 people would be eating synthetic food. She predicted that in one hundred years' time 'Agriculture will be developed by electricity, the motive power of the future. Science will take, in condensed form from the rich loam of earth, the life force or germs now found in the heart of the corn, in the kernel of the wheat, and in the luscious juices of the fruit. A small phial of this life from the fertile bosom of Mother Earth will furnish man with subsistence for days. And thus the problems of cooks and cooking will be solved'.[20] This theory, it is suggested, remained a 'private fantasy' until 1930 when it found its way into the early science-fiction musical film Just Imagine.[21]\n\n\"Wall Street owns the country. It is no longer a government of the people, by the people, and for the people, but a government of Wall Street, by Wall Street and for Wall Street... Our laws are the output of a system which clothes rascals in robes and honesty in rags...\"[22]\n",
  "concepts": [
    "Mary Elizabeth Lease",
    "party",
    "lease",
    "populist",
    "people",
    "kansas",
    "wall street",
    "wall",
    "street",
    "populist party",
    "mary"
  ],
  "findings": [
    "Early life",
    "Political career",
    "Split with Populists",
    "Later life",
    "Synthetic food",
    "Famous quotes",
    "Notes",
    "References",
    "Works cited",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:56.503071"
}