{
  "title": "George Métivier",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/George_Métivier",
  "content": "George Métivier (29 January 1790 – 23 March 1881) was a Guernsey poet dubbed the \"Guernsey Burns\", and sometimes considered the island's national poet. He wrote in Guernésiais, which is the indigenous language of the island. Among his poetical works are Rimes Guernesiaises published in 1831. Métivier blended together local place-names, bird and animal names, traditional sayings and orally transmitted fragments of medieval poetry to create themes.\n\nHe was born in Rue de la Fontaine, St Peter Port, Guernsey, in the night of 28–29 January 1790.[1] He used the pen-name Un Câtelain, as his grandfather, a Huguenot by origin, had settled in Castel. As a young man, Métivier had studied in England and Scotland for a career in medicine, but had abandoned the idea of becoming a doctor to devote himself to linguistics and literature. His poems were published in Guernsey newspapers from 1813 until his death and since.\n\nGeorge Métivier corresponded publicly in verse form with Robert Pipon Marett (\"Laelius\"), the Jèrriais poet. He translated the Gospel according to Matthew into Guernésiais for publication by Prince Louis-Lucien Bonaparte, who visited him in 1862.[2] Métivier's close friend and protégé was Denys Corbet 1826-1909, born in Vale, Guernsey.\n\nThe first to produce a dictionary of the Norman language in the Channel Islands, Métivier's Dictionnaire Franco-Normand (1870) established the first standard orthography of Guernésiais - later modified and modernised.\n\nAt the end of the 18th century and beginning of the 19th century, a new movement arose in the Channel Islands, led by writers such as Métivier and writers from Jersey. The independent governments, lack of censorship and diverse social and political milieu of the Islands enabled a growth in the publication of vernacular literature — often satirical and political.\n\nMost literature was published in the large number of competing newspapers, which also circulated in the neighbouring Cotentin peninsula, sparking a literary renaissance on the Norman mainland.\n",
  "concepts": [
    "George Métivier",
    "métivier",
    "guernsey",
    "published",
    "poet",
    "literature",
    "islands",
    "guernésiais",
    "writers",
    "publication",
    "political"
  ],
  "findings": [
    "Influence",
    "La Victime",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:30:28.043077"
}