{
  "title": "Glyn Johns",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Glyn_Johns",
  "content": "Glyn Thomas Johns (born 15 February 1942) is an English recording engineer and record producer.  He has worked with many of the most famous rock recording acts from both the UK and abroad, such as The Rolling Stones, The Beatles, The Who, Led Zeppelin, the Kinks, Eagles, Bob Dylan, The Band, Eric Clapton, The Clash, Steve Miller Band, Small Faces, The Ozark Mountain Daredevils and Joan Armatrading. Throughout his career, he has generally preferred a live, natural approach to recording in the studio, and developed a method of recording drums sometimes referred to as the \"Glyn Johns method\". \n\nThe years 1964–1984 marked Johns's peak era of activity in which he engineered or produced numerous hit records. In 1965 Johns became one of the first independent British recording engineers to operate freelance rather than under the hire of a particular record label or studio. He was involved in making some of the most influential albums of the rock era such as Beggars Banquet and Let It Bleed by the Rolling Stones, Who's Next by the Who, and Led Zeppelin's debut album.  Johns was the chief engineer during the Beatles' Get Back sessions for what became the Let It Be album, as documented in the films Let It Be (1970) and The Beatles: Get Back (2021). Since 1984 Johns has continued to be active in the industry.    \n\nJohns is the father of Ethan Johns, and the older brother of Andy Johns (1950–2013), all three of whom shared the same career.  In addition to his work as an engineer and producer, Johns has recorded as a solo musical artist. In 2012, Johns was inducted into the Rock and Roll Hall of Fame, receiving the Award for Musical Excellence.\n\nJohns was born in Epsom, Surrey, England, on 15 February 1942,[1] and is the older brother of Andy Johns.[2]  In his autobiography, Glyn Johns recounts that at the age of eight he joined a local church choir as a boy soprano.[3]  Felton Rapley, considered one of the leading pipe organists in the UK at the time, became the choirmaster, and as Johns progressed, Johns was given occasional solos and eventually rose to head chorister at the age of eleven.[4]  Johns attributes his experience in the choir, particularly hearing and watching Rapley play the organ, as having a profound impact on his musical direction.[5]  As he approached adolescence, Johns left the choir after his vocal cords began to change.[6]\n\nJohns recounts that his next-door neighbour lent him a Guild electric guitar, which sparked his interest playing guitar.  At this time Johns was attending the church's Wednesday night youth club, where for the first time he saw Jimmy Page play guitar.[7]  Johns became a fan of traditional jazz and joined a local ragtag jazz band on tea chest bass.[8]  He cites the record \"Little Rock Getaway\" by Les Paul and Mary Ford as an influence.[9]  Les Paul was one of the first musicians to experiment with tape multi-tracking and sound effects.[10] Lonnie Donegan's skiffle hit version of Lead Belly's \"Rock Island Line\" was also influential—according to Johns, \"I had heard nothing like it and rushed out to buy it the next day\".[9]  He soon bought his own guitar and was introduced to blues and folk recordings by a neighbour, who lent him records by artists such as Snooks Eaglin, Brownie McGhee, Sonny Terry, Woody Guthrie, and Burl Ives.[11]  Johns began to keep company with a group of friends interested in music, whose ranks included Ian Stewart (later in the Rolling Stones).[12]  In 1959 at the age of 17, Johns left school, and with Mayhew and Golding formed the band the Presidents.[13]\n\nOver a long career as an engineer and/or producer, Johns has worked with numerous successful musical acts in the industry.[1]  Johns has also recorded as a solo musical artist.[1]\n\nIn 1959, Johns began his career as an assistant recording engineer at IBC Studios on Portland Place in London.[14]  IBC was an independent recording studio and had no affiliation with a label.[15]  Johns recounts that his early duties included odd tasks and providing basic support for the experienced engineers.[16]  His first session as a recording engineer was for the popular skiffle singer Lonnie Donegan.[17]\n\nAt the time IBC had a busy schedule.  Coats and ties were required to be worn by recording engineers (and white lab coats for technical engineers).  Most recordings were done then in mono (except for  classical music).[18]  During Johns's first year at IBC, the popularity of rock and roll increased and demand for records that sounded more American.[19]  Engineers were confronted with the challenge of capturing louder music.[18]  Younger engineers were more apt to try new approaches, and Terry Johnson, another young engineer at IBC, convinced Johns to move in this direction.[19]  Johns recounts that Jack Good, one of the UK's early successful television rock and roll producers, made regular use of IBC Studios, and did many of his recordings with Johns and Johnson engineering sessions.[20]  They engineered pre-recorded tracks for the Oh Boy! television programme, which featured leading British rock and roll performers of the day, such as Joe Brown, Marty Wilde, Billy Fury, Wee Willie Harris, and others.[20]\n\nJohns recounts that in the early 1960s, he was signed to Decca Records as a solo musical performing artist at the urging of Jack Good.[21]  Johns's first single, \"Sioux Indian\", was produced by Jack Good[21] and the next two produced by Tony Meehan.[22]  Johns later went on to record for Pye Records[22] and Immediate Records,[23] but none of his solo records became hits.[1]\n\nDuring this time, Johns was playing in the Presidents,[24] who, according to Johns, began to put the phrase \"Featuring Decca Recording Star Glyn Johns\" on their posters.[25]  Johns realised that he could invite musicians to IBC on Sundays, when the studio was not booking sessions—letting musicians play in the sound room whilst he honed his engineering and producing skills at the console.[26]  The makeshift sessions attracted many of the best young musicians in London, such as Jimmy Page, Ian Stewart, Alexis Korner, Brian Jones, and Nicky Hopkins.[25]  Johns recounts that his first session as chief engineer was for a recording by Joe Brown, which was produced by Tony Hatch.[27][a]  In 1962, Johns entered into an arrangement with George Clouston, the manager at IBC studios, to let him produce records by certain artists.[28]\n\nJohns's friend, Ian Stewart was playing piano with the Rolling Stones.[29] The two lived for a while in a house nicknamed \"the Bungalow\" with one of Stewart's friends, Brian Wiles, who played in a group with Jeff Beck.[30]  It was through Stewart that Johns became involved in recording the Rolling Stones on their earliest recordings.[29]  Johns mentions that in March 1963, he brought them to IBC to record several tracks.[31]  After Andrew Loog Oldham became the Rolling Stones' manager, Stewart was asked to leave the group, and Oldham took over the role as producer of the group's recordings.[32]  Oldham moved the Rolling Stones' sessions to other studios, such as Regent Sound, using other engineers, and for more than a year Johns was not involved with the Rolling Stones recordings.[33]\n\nIn 1963, Johns made arrangements to produce and record a session with Georgie Fame,[33] but was paired, only as engineer, with producer Shel Talmy.[34]  Initially he was skeptical, but unexpectedly enjoyed working with Talmy, and the two formed a successful partnership on many recordings for the next couple of years, recording hit songs for acts such as the Kinks and the Who.[35]\n\nDuring the mid 1960s, Johns worked with several of the popular British beat groups of the era.  With producer Shel Talmy he engineered many of the early records by the Kinks and the Who,[34] such as \"You Really Got Me\" and \"All Day and All of the Night\" by the Kinks, and \"My Generation\" by the Who.[36]\n\nIn 1965, Johns left IBC studios to further pursue his solo career as a singer and performer and promote his latest record \"Mary Anne\", but the record failed to chart.[37]  At the urging of Talmy, Johns began working freelance as an independent producer and engineer—one of the first independent engineers in the UK.[34]  Subsequently, he did sessions at various studios such as Decca, Pye, Marble Arch, and Olympic.[34]\n\nIn 1971, Johns reunited with the Who for the first time since the mid-1960s, this time as a co-producer, to work on what became the album Who's Next.[13][b]  According to Pete Townshend in his autobiography:\n\nGlyn was my model of what a good producer should be—someone who guides the music and creates the right sound—and there was a great mutual respect and fondness between us. We were both perfectionists in the studio who worked quickly.  It was his work as an engineer on the early Who sessions ... that made them sound so great.[40]\nJohns continued to work with the Who throughout the 1970s as an engineer on parts of Quadrophenia in 1973.[13]  He produced and engineered The Who by Numbers[41] (1975) and produced early sessions for Who Are You (1978) with engineer John Astley, who later took over as producer.[42]  Johns returned to work with the group, producing and engineering 1982's It's Hard.[43]\n\nPete Townshend recruited Johns to engineer Eric Clapton's Rainbow Concert in 1973.[44]  Johns produced and engineered Eric Clapton's 1977 album, Slowhand,[45] which featured hits such as \"Lay Down Sally\", \"Wonderful Tonight\", and his version of J. J. Cale's \"Cocaine\",[46] and Clapton's next album, Backless in 1978, which contained another hit \"Promises\".[47]  In his autobiography Eric Clapton wrote about Johns:\n\nHe was a disciplinarian who did not like people mucking about or wasting time.  When we were in the studio we were expected to work and he'd get frustrated if there was any goofing off.  Even though we were all getting stoned or drunk we responded to that quite well.  He brought out the best in us, and as a result that album [Slowhand] has great playing and a great atmosphere.\"[48]\nThough Johns briefly ceased recording the Rolling Stones in late 1963 and 1964, in 1965 he returned to the role on their British sessions and assisted the group with much of their most famous material.[c]  With Johns that year they recorded \"(I Can't Get No) Satisfaction\"[51] and the albums December's Children (And Everybody's)[52] and Out of Our Heads.[53]  Johns worked regularly with the Rolling Stones as engineer for the remainder of the decade and into the mid-1970s—from December's Children (And Everybody's) (1965) through to Black and Blue (1975).[54][d]\n\nStarting with the sessions for Between the Buttons in late 1966, Johns and the Rolling Stones began to record extensively at Olympic Studios.[56]  Olympic Studios became Johns's preferred studio for many years,[57][e] and it became one of the most in-demand recording facilities in England.[60]\n\nIn 1968 the Rolling Stones expressed the desire to work with an American producer and Johns recommended Jimmy Miller, who he had seen working with Traffic.[61]  Johns stayed on as engineer, and with this team the group recorded Beggars Banquet (1968)[13] and Let It Bleed (1969).[13]  Glyn Johns engineered some of the tracks on Sticky Fingers (1971),[62] and Exile on Main St. (1972),[63] both produced by Jimmy Miller.  On these two albums his brother, Andy Johns, also worked as an engineer.[64][f]  His brother engineered Goat's Head Soup, the last Rolling Stones album produced by Jimmy Miller.[67]  Glyn Johns contributed to certain tracks on It's Only Rock 'n Roll,[68] and returned as chief recording engineer on the early sessions for Black and Blue.[69][g]\n\nIn the 1960s, Johns engineered many of the records made by the Small Faces,[71] such as \"Whatcha Gonna Do About It\"[71] \"Tin Soldier\",[72] their 1967 hit, \"Itchycoo Park\",[73] which featured the use of bizarre phasing effects[72] Johns learned from another Olympic engineer, George Chkiantz.[74][h]  Johns engineered the Small Faces' 1968 LP, Ogdens' Nut Gone Flake.[76]\n\nAfter the group's breakup, guitarist and lead vocalist Steve Marriot formed Humble Pie, whose membership included Peter Frampton—Johns produced engineered their third and fourth albums, Humble Pie[77] and Rock On.[78][i]  The other former Small Faces, Ronnie Lane, Ian McLagan, and Kenney Jones, joined with Rod Stewart and Ronnie Wood, both from Jeff Beck Group to form the Faces, and Johns engineered and co-produced (with the band) the albums A Nod Is as Good as a Wink... to a Blind Horse[80] and Ooh La La.[81]  During the 1970s, after leaving the Faces, Ronnie Lane worked on several projects including the Rough Mix album with Pete Townshend, which was produced by Glyn Johns.[82]  Lane began to experience health problems and was diagnosed with multiple sclerosis.[83]  In 1983, Eric Clapton and Johns helped organize the ARMS Charity Concerts to raise money for Lane's medical bills and research for the disease,[84] and assembled a cast of musicians for the show, which included Clapton, Jimmy Page, Bill Wyman, Charlie Watts, Steve Winwood and others.[85]\n\nJohns engineered Led Zeppelin's debut album recorded in October 1968. Though Jimmy Page was credited as producer, Johns was involved in the production during the making of the album.[86]  According to Johns, when working on the album, he developed his method of using three microphones to record drums for stereo mixes.[87]\n\nGlyn Johns worked as the chief recording engineer on the Beatles' \"Get Back\" sessions, which were both taped and filmed.[88]  The project resulted the Let It Be album[89] and Let it Be (1970)[90] and The Beatles: Get Back (2021)[91] documentary films.  In 1969, Paul McCartney called Johns and asked him to assist with sessions.[92]  George Martin, though officially listed as the producer, only made occasional appearances.[93]  During taping and shooting, John Lennon in jest referred to him as \"Glynis\" (referring to the apparently unrelated actress Glynis Johns).[94]\n\nAccording to Johns, he suggested the band play a concert on the rooftop of their Apple Studio facility, where much of the sessions were being recorded and filmed,[95] and rigged the recording wires onto the rooftop connected to control room for the performance.[13]  He also recommended that the album be structured as an \"audio documentary\" with talk and banter included between each track.[95]  Johns helped the band compile several versions of the album,[96] all of which got shelved[97] before the project was turned over to producer Phil Spector in 1970, who reworked it and released it as the album Let It Be.[98][j]\n\nJohns engineered early recorded parts of the song \"I Want You (She's So Heavy)\" at Trident Studios[100] on 23 February 1969, that in later finished form appeared on the Abbey Road album.[101]  For Abbey Road's remaining tracks, the group returned to EMI Studios and re-united with producer George Martin and a team of engineers including Geoff Emerick, Phil McDonald, and Alan Parsons.",
  "concepts": [
    "Glyn Johns",
    "johns",
    "album",
    "engineer",
    "recording",
    "producer",
    "engineered",
    "produced",
    "sessions",
    "worked",
    "glyn"
  ],
  "findings": [
    "Early life",
    "Career in music and recording",
    "Early years: 1959–1963",
    "Peak years: 1964–1984",
    "1985–present",
    "Approach to recording",
    "Family",
    "Legacy",
    "Discography",
    "Notes",
    "References",
    "Citations",
    "Bibliography",
    "Websites",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:26:36.537361"
}