{
  "title": "Finally // Beautiful Stranger",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Finally_//_Beautiful_Stranger",
  "content": "\"Finally // Beautiful Stranger\" (stylized in sentence case)[2][3][4] is a song by American singer Halsey. It was released on December 6, 2019 through Capitol Records as the second promotional single from her third studio album, Manic (2020). The song was released simultaneously with the album's third promotional single \"Suga's Interlude\".[5][6]\n\nOn January 25, 2020, Halsey performed \"Finally // Beautiful Stranger\" on Saturday Night Live.[7]\n\nThe song was announced on December 3, 2019 through social media.[8] In an Instagram livestream on December 3, 2019 Halsey announced that she was releasing two new songs and a music video on Friday December 6, 2019.[9] On December 5, 2019 she revealed that those two songs are \"Finally // Beautiful Stranger\" and \"Suga's Interlude\".[10] Halsey described both songs as \"very different [...] very dreamy stories.\"[10] She revealed in an interview with Zane Lowe for Beats 1 that she wrote it at home in her living room at \"two in the morning when I was dating Dom,\" thinking about the night that they met, written with just her voice and a guitar at first. She said that, after listening, her friends described it as \"the best song I'd ever written\".[11]\n\nKoltan Greenwood from Alternative Press described the song as a \"moving, emotional song that explores first love and the emotions it causes\".[12] Nina Corcoran of Consequence of Sound labeled the chorus the \"real highlight\", as Halsey \"belts the title with some heartbreaking voice cracks\".[13] Madeline Roth, writing for MTV News, described the track as a whole as a \"country-tinged, guitar-led love song\", noting that it sounded \"a bit like Lady Gaga's 'You and I'\".[5] In an article for E! News, Billy Nilles noted the track as a \"true standout\" and described the production as \"stripped-back\" with \"gentle guitar\" and as a \"country-kissed little number that lets her vulnerabilities take center stage as she sings about first love\".[14] Lexi Lane from Atwood Magazine praised the song and its lyrics, stating that the track puts \"Halsey's songwriting talents to the forefront and is arguably her strongest song lyrically\" and called the song as a whole \"well-crafted\".[15]\n\nA music video for the song was released on December 6, 2019.[16] The video was directed by Patrick Tracy and showcases Halsey performing the song on a guitar in two different bar settings.[17] As of June 2021, it has over 22 million views on YouTube.\n\n‡ Sales+streaming figures based on certification alone.\n",
  "concepts": [
    "Finally // Beautiful Stranger"
  ],
  "findings": [
    "Background",
    "Critical reception",
    "Music video",
    "Charts",
    "Certifications",
    "Release history",
    "References"
  ],
  "timestamp": "2025-04-11T10:48:19.660125"
}