{
  "title": "Ngā Manu Nature Reserve",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Ngā_Manu_Nature_Reserve",
  "content": "Ngā Manu Nature Reserve is a nature and wildlife reserve in Waikanae, New Zealand, on the Kāpiti Coast of the North Island. In addition to offering a sanctuary for native birds and other animals, the 14 hectares (35 acres) reserve preserves the largest remnant of coastal lowland swamp forest on the Kāpiti Coast.[1]\n\nNgā Manu contains aviaries housing native birds such as kākā, kākāriki, scaup, whio and kea, enclosures with tuatara, and a nocturnal house with kiwi[2] and morepork.[3]\n\nBird life in the reserve comprises up to 60 different bird species,[4] the most visible being common local birds such as kererū, tūī, black swan, paradise duck and pūkeko. The reserve is not surrounded by a pest-exclusion fence, and as a result the native bush area of the reserve does not host any critically endangered animals, however, Ngā Manu is regularly involved in wider conservation efforts and breeding programmes.[5][6][7]\n\nNgā Manu has been managed by the charitable Ngā Manu Trust since 1974 and opened to the public in 1981.[4]\n\nThe site was chosen as it had a large remnant of coastal lowland swamp forest and was purchased by founding trustees Peter McKenzie, Prof. John Salmon and David Mudge with part of an inheritance from the late Sir John McKenzie. The well-known geologist and naturalist Charles Fleming later joined the project and extensive planting and additional landscaping was completed in the late 1970s.[9]\n\nThe nature reserve had a tūī, named Keko, that could mimic human speech. Phrases included \"I'm Keko\", \"I'm hungry\", \"fe fi fo fum\", \"bloody kids\" and could also count. Keko died in 2020.[10]\n\nIn 2023, Ngā Manu received a Qualmark Silver Sustainable Tourism Business Award.[11]\n\nToday, Ngā Manu also serves as an important \"stepping stone\" for birds travelling between the native forests of Kapiti Island and the Tararua Range. Visitor numbers have been helped by easier access and signposting on the Kāpiti Expressway built in 2017.[12]\n\nCloser to the visitor centre, the reserve offers lawn areas and an arboretum of native trees. An education centre building was added in the 1990s, which is a popular destination for school trips and also available for hire as a venue.[9] The reserve also offers small tours and individual experiences.[13]\n\nA wheelchair-friendly loop track circles through the native bush home to some 700 native plant species, taking in some small lawn clearings and skirting the three small lakes and ponds in the reserve. The largest lake contains several small bush-covered islands connected with small wooden bridges, and there is a side track leading to a lookout tower overlooking the native bush.[14]\n\n40°51′40″S 175°03′38″E﻿ / ﻿40.861°S 175.0605°E﻿ / -40.861; 175.0605\n",
  "concepts": [
    "Ngā Manu Nature Reserve"
  ],
  "findings": [
    "History",
    "Visitor facilities",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T12:41:10.740946"
}