{
  "title": "Michael Valente Memorial Bridge",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Michael_Valente_Memorial_Bridge",
  "content": "\n40°35′44.71″N 73°39′24.02″W﻿ / ﻿40.5957528°N 73.6566722°W﻿ / 40.5957528; -73.6566722\n\nThe Michael Valente Memorial Bridge (formerly known as the Long Beach Bridge) is a twin-span bascule bridge crossing Reynolds Channel, between the City of Long Beach and the Village of Island Park, in Nassau County, New York, United States.\n\nThe bridge starts in Long Beach as Long Beach Boulevard. At Barnum Island, the main road continues northeast as Austin Boulevard, while Long Beach Road (the northern continuation of Long Beach Boulevard) branches to the north.[4] Each span carries traffic in one direction.[5]\n\nThe twin bridges were built in 1953 to replace an earlier bridge built in 1922.[5][6] The replacement spans were constructed after it was realized that the original, 1922 span was both functionally and structurally obsolete.[6]\n\nIn 2011, the Long Beach Bridge was renamed the Michael Valente Memorial Bridge, in honor of Michael Valente – a World War I veteran and longtime resident of Long Beach.[7][8][9] The name change was made official following a vote by the Nassau County Legislature, and the renaming ceremony – which took place at Long Beach City Hall – was attended by hundreds of people.[7][8][9]\n\nIn 2013, the bridge was used as a filming location by NBC, for scenes in \"The Blacklist\".[10][11] The scenes were used for the show's pilot episode and employed several special effects – including the use of fire & smoke, collisions, gunshots, and actors repelling themselves off the bridge. The City of Long Beach, the Village of Island Park, and the County of Nassau all consented to the filming.[11]\n\nThis article about a location in Nassau County, New York is a stub. You can help Wikipedia by expanding it.\nThis article about a bridge in New York is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Michael Valente Memorial Bridge",
    "long beach",
    "long",
    "bridge",
    "beach",
    "nassau",
    "county",
    "york",
    "valente",
    "span",
    "new york"
  ],
  "findings": [
    "Description",
    "History",
    "In popular culture",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:03.004309"
}