{
  "title": "Still (TVXQ song)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Still_(TVXQ_song)",
  "content": "\"Still\" (stylized as \"STILL\") is the 34th single by South Korean pop duo Tohoshinki. The song is a medium-tempo pop ballad, written and produced by Shinjiroh Inoue. The single was released on March 14, 2012 by Avex Trax as the second single from their sixth Japanese studio album, Time (2013). It was released in three editions – a CD+DVD version, a CD-only version, and a Bigeast Board edition. Its B-side track \"One More Thing\", also a pop ballad, was promoted as the theme song for the mobile television drama, Let M: Watashi ga Anata wo Aisuru Riyuu.[1]\n\n\"Still\" was Tohoshinki's tenth Japanese single to debut at number one on the Oricon Singles Chart, pushing Tohoshinki to be the first and currently the only foreign artists in Japan to do so. It sold nearly 139,000 copies on its first week of release,[2] stayed in the charts for eight weeks, and was certified gold by the Recording Industry Association of Japan (RIAJ) for shipments of over 100,000.[3] With over 160,000 copies sold, \"Still\" was Japan's forty-eighth best-selling single of 2012.[4]\n\nThe single was released on March 14, 2012 in through digital and physical platforms in Japan. The physical release was published in three editions – a CD+DVD version, a CD only version, and a CD version exclusive to the members of Bigeast, Tohoshinki's official Japanese fan club. The first press CD only version also included a 12-page photo book.\n\nProduced, written, and arranged by Shinjiroh Inoue, the A-side track \"Still\" was used as a commercial song for Glicos' Bokujou Shibori. The duo first performed the song at their Live Tour 2012: Tone. During the performance, the audience held white light-sticks instead of the usual red, which is Tohoshinki's official fanclub color.\n\nOn its first day of release, the physical single sold 84,029 copies, debuting at number one on the daily Oricon Singles Chart.[5] It debuted at number one on the weekly Oricon Singles Chart and the Billboard Japan Hot 100.[6] The single also created a new record for Tohoshinki, pushing them to be the first and only foreign artists in Japan to have ten number-one singles on the Oricon.[7]\n\n\"Still\" peaked at number 31 on the Billboard Japan Adult Contemporary Airplay and number 29 on the Billboard Japan Hot Top Airplay.\n\n^ Shipments figures based on certification alone.\n",
  "concepts": [
    "Still (TVXQ song)"
  ],
  "findings": [
    "Background and release",
    "Chart performance",
    "Formats and track listings",
    "Charts",
    "Sales",
    "Certifications",
    "Release history",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:07:11.396470"
}