{
  "title": "List of Lupin the Third: The Woman Called Fujiko Mine episodes",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/List_of_Lupin_the_Third:_The_Woman_Called_Fujiko_Mine_episodes",
  "content": "Lupin the Third: The Woman Called Fujiko Mine is a 2012 Japanese anime series based on Monkey Punch's Lupin III manga. Produced by TMS Entertainment and Po10tial, the series aired on NTV between April 4, 2012 and June 27, 2012.[1][2] It focuses on the franchise's heroine, Fujiko Mine, as she undergoes various missions and encounters the rest of the Lupin III cast for the first time. Unlike the franchise's previous three televised anime, The Woman Called Fujiko Mine is more sexually oriented in order to capture the \"sensuality\" present in the original manga as well as darker and more serious. It is also the first in which Lupin is not the protagonist.\n\nSayo Yamamoto is the director of the series, making it the first Lupin title to be directed by a woman, and Takeshi Koike was the character designer and animation director.[3] Mari Okada was the main writer of the series,[3] although Itsuko Miyoshi (ep 2), Dai Satō (ep 3, 7, 10), Shinsuke Ōnishi (ep 5) and Junji Nishimura (ep 8) served as episode writers. The opening theme is \"New Wuthering Heights\" (新・嵐が丘, Shin Arashi ga Oka) by Naruyoshi Kikuchi, who also wrote the in-show music,[3] and Pepe Tormento Azcarar feat. Ichiko Hashimoto, while the ending theme is \"Duty Friend\" by NIKIIE.\n\nVAP released the anime on home video in four-disc DVD and Blu-ray box sets on September 19, 2012.[4][5] Funimation simulcasted the series, with English subtitles, on their website and Nico Nico for North American audiences as it aired in Japan.[6] On July 28 at Otakon 2012, they announced that they also acquired the home video rights to the series.[7] They released The Woman Called Fujiko Mine in Blu-ray and Blu-ray/DVD sets on August 20, 2013, including an English-language dub.[8] Manga Entertainment released a similar set in the United Kingdom on September 16,[9][10] whereas Hanabee released it in Australasia in two parts, on October 16 and November 20.[11]\n\nOther Lupin III lists:\n",
  "concepts": [
    "List of Lupin the Third: The Woman Called Fujiko Mine episodes"
  ],
  "findings": [
    "Episode list",
    "See also",
    "Notes",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:08:17.669601"
}