{
  "title": "Jill Krementz",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jill_Krementz",
  "content": "Jill Krementz (born February 19, 1940) is an American photographer and author.[1] She has published 31 books, mostly of photography and children's books. She was married to Kurt Vonnegut for almost 30 years.[2][3]\n\nKrementz grew up in Morristown, New Jersey and moved to New York City in her late teens.[4] In 1961, she received a Nikon camera as a 21st birthday present, and continued to build a career as a photographer and photojournalist. In the 1960s, she worked as a photographer for the New York Herald-Tribune.[5] Her color photography of the 1967 March on the Pentagon was featured on the cover of The New York Times Magazine.[6] In 1965, she spent a year taking photographs in Vietnam during the Vietnam War. Her photojournalist works have appeared in The New York Observer.[7][8]\n\nKrementz later specialized in photographing writers. A major profile of her, written by Dorothy Gelatt, was published in the Spring 1975 issue of 35mm Photography (Ziff-Davis Publishing Company). According to the article, Krementz decided in 1970 to \"fill the author picture vacuum\". Working only with the aid of a secretary she built and ran a large library of photographs of authors. Most of her photographs at that time were in black and white. The article described her as working with a minimum of photographic equipment (two 35mm camera bodies and three lenses) and having her prints made by Erika Leone at the Meridian photographic laboratory. At the time the article was written, \"the Krementz stock list of authors totalled roughly 542\".[9] Four years later, her count was over 800.[10]\n\nIn 1970, Krementz met Kurt Vonnegut during the production of his play Happy Birthday, Wanda June in Greenwich Village. The two married in 1979 and in 1982, they adopted a daughter, Lily, when the baby was three days old.[11] They remained married until his death in 2007.\n\nKrementz's photographs were exhibited at Nikon House Gallery in New York the mid-1970s. In 1980, her book The Writer's Image (David R. Godine, Boston) was published, featuring black-and-white photographs, with a preface written by Kurt Vonnegut, and an introduction by Trudy Butner Krisher.[12] In 1984 Krementz was awarded the Washington Post/Children’s Book Guild Nonfiction Award for “creatively produced books, works that make a difference.”[13]\n\nIn 2004, a major exhibition of her work was held at the Mark Twain House and Museum in Hartford, Connecticut. Writers Unbound featured warm, intimate portraits of authors in their homes and at their desks.[14]\n",
  "concepts": [
    "Jill Krementz"
  ],
  "findings": [
    "Biography",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:10:29.807662"
}