{
  "title": "Dr. G.C. Stockman House",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Dr._G.C._Stockman_House",
  "content": "The Dr. G.C. Stockman House (also known as Mrs. Evangeline Skarlis House) was designed by Frank Lloyd Wright and built in 1908 for Dr. George C. and Eleanor Stockman in Mason City, Iowa. The home was originally located at 311 1st St. SE, but was moved to 530 1st St. (David Christiansen) NE to avoid demolition. It has been fully restored as a public museum and is listed on the National Register of Historic Places. It features numerous authentic period furnishings and reproduction pieces.\n\nIn 1907, Frank Lloyd Wright was commissioned to design a mixed-use building for Mason City attorneys, James E.E. Markley and James E. Blythe. Construction on what became known as the Park Inn Hotel and City National Bank Building did not begin until April 1909, but Wright made many visits to the site during the 1907–1908 design period. While on one of these visits in 1908, Wright was contracted by Markley's neighbor George Stockman and his artist wife Eleanor to design a house on a small lot within blocks of his hotel and bank project.[2]\n\nFor the design of the Stockman House, Wright adapted a plan he had published in the Ladies' Home Journal in 1907. Titled \"A Fireproof House for $5000,\" it re-envisioned Wright's Prairie Style in a smaller, more compact dwelling that was more affordable for a family of medium income.[3][4] The Stockman House was Wright's third constructed version of the \"Fireproof House\" after completing both Tan-Y-Deri (the Andrew T. Porter House) and the Stephen M. B. Hunt House I in 1907.[5]\n\nStockman owned the house until 1924, after which the house passed through at least six owners, including one who used it for a photography studio. Although the house became dilapidated, very few alterations were ever made.  Following the death of the final occupant in 1987, the house was put up at auction.  The only bidder was the neighboring First United Methodist Church, which desired the land for a parking lot.  The offer was below the minimum bid and hence rejected. Subsequently, a group of Mason City volunteers formed the River City Society for Historic Preservation in hopes of saving the house. Local inventor and entrepreneur, David Murphy (1918–1999), stepped in to satisfy both groups by donating an additional $20,000 to towards the Methodist Church's purchase under the agreement that the Stockman House would be donated to the city instead of being demolished.[6]\n\nOwnership was transferred to the River City Society, and two years later the house was moved roughly two blocks east and two blocks north to its present location at the end of 1st St. NE.  The restoration that followed included a new roof, repair of exterior stucco and interior plaster, new wiring and plumbing, and refurbishing of most other finishes inside and out.  Original materials and architectural integrity were maintained as much as possible, but in some cases the Society substituted less costly, modern products for missing or damaged material.  For instance, the roof was resurfaced in asphalt shingles instead of replicating the long-removed oak shingles.[6]\n\nThe Stockman house was opened to the public in 1992 upon the completion of most restoration work.[4]  It was added to the National Register of Historic Places in the same year.[1] After four years of design and fund raising, the River City Society for Historic Preservation broke ground in September 2009 for the Mason City Architectural Interpretive Center to replace a non-historical duplex apartment to the north of the house. The building, which contains an auditorium and gallery space, is loosely based on a design by Prairie School architect Walter Burley Griffin. This learning and research facility opened in May 2011.[7]\n\nLike the other known instances of the \"Fireproof House\" — including the Hunt House I (1907) and Zeigler House (1909) — the Stockman House was constructed with slight variations from the original design.  For instance, the entrance was enlarged, the specified entrance trellis was exchanged for a cantilevered roof, a covered veranda (now enclosed) was adjoined to the north side, and the flat roof was replaced by a shallow hip roof.\n\nWhile almost all original furnishings were lost as the house transferred owners, three built-in bookcases and a dining room sideboard remain.  The house is now furnished with period Arts and Crafts furniture — many designed by Gustav Stickley — oriental rugs, and a few Frank Lloyd Wright originals and reproductions.  Among the latter are gold and white china from the 1922 Imperial Hotel and a dresser which was crafted from Wright drawings.[8]\n",
  "concepts": [
    "Dr. G.C. Stockman House"
  ],
  "findings": [
    "History",
    "Architecture",
    "See also",
    "References",
    "Further reading",
    "External links"
  ],
  "timestamp": "2025-04-11T10:13:12.475053"
}