{
  "title": "Ognjen Kraus",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Ognjen_Kraus",
  "content": "Dr. Ognjen Kraus (born 4 October 1945) is a Croatian physician, president of the Jewish community Zagreb and the coordinator of the Jewish communities in Croatia.[1]\n\nOgnjen Kraus was born in Zagreb to Jewish parents, Ivo and Herma (née Delpin) Kraus. He has a twin sister Živa, who is a prominent painter.\n\nKraus family moved to Croatia from Moravia and Czech Republic during Austro-Hungarian Empire. His paternal grandfather parents, Ignacs and Berta (née Herrnheiser) Krausz lived in Daruvar where his grandfather Josip was born. Kraus grandmother Ruža was born in Bjelovar where she lived with her parents, Samuel and Nanete (née Löwy) Schwarz. His grandfather moved to Zagreb in 1906, where he was the secretary of the Croatian insurance company Merkur. Under his leadership community house Merkur was built in Zagreb. Kraus grandfather was among the initiators of the Merkur sanatorium building which was opened in 1928. In 1918 his grandmother established the Zagreb cinema theater Urania. His grandfather died in Zagreb in 1934. During World War II his father and grandmother escaped the Nazi and Ustaše persecutions through Rijeka from where they went to Italy. In Italy, his father ended up in the concentration camp and after the capitulation of Italy he moved to Switzerland.[2] Kraus grandmother died in Switzerland in 1943 just as she was given a visa for the free countries. After the war Kraus father returned to Zagreb and saved the few remains of the Zagreb Synagogue which was destroyed by the Ustaše in 1941. He dug through the remains of the destroyed synagogue and found the capital column from the synagogue lobby, which is now preserved and kept at the Jewish community of Zagreb.[3]\n\nKraus studied medicine at the School of Medicine of the University of Zagreb. After graduation, he went to London, Paris, Hradec Králové and Budapest to gain additional training. He eventually specialized in urology. When he returned to Zagreb, he got a job at the Sisters of Charity Hospital where he serves as the head of the urology department. He received the award from the city of Zagreb in 2001 as a physician and humanist for his scientific and professional work.[3] Kraus became the president of the Jewish community of Zagreb in 1993 after Nenad Porges withdrew from the position.[2]\n\nIn 1978, Kraus married Sanja (née Milković) Kraus. Kraus has a stepson Saša, and a son Jaša. Saša lived in Israel for seven years and has served in the Israel Defense Forces. He now lives in Canada with his family. Kraus's younger son Jaša is a lawyer. Kraus is a secular Jew.[2]\n",
  "concepts": [
    "Ognjen Kraus"
  ],
  "findings": [
    "Family and early life",
    "Education and career",
    "Personal life",
    "See also",
    "References"
  ],
  "timestamp": "2025-04-11T10:10:34.499403"
}