{
  "title": "Jackson School of Geosciences",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jackson_School_of_Geosciences",
  "content": "The Jackson School of Geosciences at The University of Texas at Austin unites the Department of Earth and Planetary Sciences with two research units, the Institute for Geophysics and the Bureau of Economic Geology.\n\nThe Jackson School is both old and new. It traces its origins to a Department of Geology founded in 1888 but became a separate unit at the level of a college only on September 1, 2005.[1] The school's formation resulted from gifts by John A. and Katherine G. Jackson initially valued at $272 million.[2]  The school's endowment as of December 31, 2015 is $442.3 million.[3]\n\nDr. Claudia Mora is the Dean of the Jackson School of Geosciences.[4]\n\nThe Department of Earth and Planetary Sciences offers the following undergraduate degree programs: Bachelor of Science in General Geology, Bachelor of Science in Climate System Science, Bachelor of Science in Environmental Science, Bachelor of Science in Geophysics, Bachelor of Science in Hydrology and Water Resources, Bachelor of Science in Teaching, Bachelor of Science in Geosystems Engineering and Bachelor of Arts in Geological Sciences. There is also an undergraduate Geological Sciences Honors Program. In the 2006-2007 academic year, the department awarded 49 undergraduate degrees.\n\nThe department offers the following graduate degree programs: Master of Science (with thesis), Master of Arts (with report), and Doctoral Degree. In the 2006-2007 academic year, the department awarded 52 graduate degrees.\n\nIn 2018, U.S. News & World Report ranked the Jackson School of Geosciences No. 7 among U.S. earth science graduate programs. In addition to the overall ranking, the Jackson School earned top 10 rankings in two of four earth science specialty areas, placing No. 1 in geology and No. 7 in geophysics and seismology.[10] Other areas in which the school is actively involved are paleontology, sedimentology, stratigraphy, hydrology, environmental geology, climate, petroleum exploration, petrology, geochemistry, structural geology and tectonics.\n\nStudents may also graduate with an interdisciplinary Master of Arts Degree through the Energy & Earth Resources (EER) Graduate Program. The EER Graduate Program provides the opportunity for students to prepare themselves in management, finance, economics, law and policy leading to analytical and leadership positions in resource–related fields. Private sector and government organizations face a growing need for professionals that can plan, evaluate, and manage complex resource projects, commonly international in scope, which often include partners with a variety of professional backgrounds. This program is well suited for those looking towards 21st century careers in energy, mineral, water, and environmental resources. Dual degrees in Energy & Earth Resources and Public Affairs are also available through the Jackson School and the Lyndon B. Johnson School of Public Affairs.\n\nThe Jackson School's faculty and research scientists pursue 200 active research projects a year with annual funding of over $25 million.[12] Research is often collaborative across the three scientific units and interdisciplinary with other departments at The University of Texas at Austin.\n\nThe Bureau of Economic Geology was established in 1909 as a successor to the Texas Geological Survey and the Texas Mineral Survey. Dr. William Battle Phillips was the Bureau's first director.[13][14] Before 1909 the Texas legislature established and funded three Texas Geological Surveys, which lasted from 1858 to 1867 (with a four-year suspension), 1873–1876, and 1888–1901 (with the last five years unfunded).[15] Today the Bureau functions as a research unit of The University of Texas at Austin, the State Geological Survey, and the Regional Lead Organization for the Petroleum Technology Transfer Council.\n\nCurrently under the leadership of Dr. Scott Tinker,[16] The Bureau conducts research in two broad areas: energy and environment.\n\nThe Bureau's energy research focuses largely on oil and natural gas. Major approaches include salt tectonics, carbonate and clastic reservoir characterization, fracture characterization and prediction, multicomponent seismic applications, and basin analysis. The Bureau works to bring insight and innovation from outcrop studies to the evolving science of reservoir characterization. With 70% of in-place reserves typically remaining in the ground at the time of oil field abandonment, this research has enduring economic and societal importance.\n\nThe Bureau's environmental research group conducts a wide range of basic and applied research in groundwater resources, vadose zone hydrology, coastal studies, near-surface geophysics, and geologic mapping. The group also has programs that relate energy and the environment, including a major initiative in geological sequestration of greenhouse gases. A variety of approaches are used to investigate characteristics and processes of shallow Earth systems and impacts of human activities on those systems. Remote sensing, including satellite (GRACE and MODIS) and airborne geophysics are used to quantify regional scale evapotranspiration, groundwater storage, and saline plume characterization. Subsurface geologic and hydrogeologic characterization provides critical information on sustainability of water resources and potential for carbon sequestration and desalination. Although many of the studies are focused in Texas, insights and process understanding are applied to other regions globally (such as China, India, Africa, and South America).\n\nThe Bureau provides wide-ranging advisory, technical, informational, and research-based services to industries, nonprofit organizations, and Federal, State, and local agencies. The Bureau also provides facilities and management to the office of Publication Sales, Core Research Laboratories, and the Geophysical Log Facility, all of which serve the public.\n\nFounded in 1972, the University of Texas Institute for Geophysics (UTIG) is an Organized Research Unit within The University of Texas at Austin, conducting academic research in geology and geophysics. UTIG works with the UT Department of Geological Sciences and Bureau of Economic Geology to provide basic and applied geophysical research opportunities for graduate students at the MA and PhD level through its worldwide programs in solid earth geophysics, marine geology/geophysics, and multi-channel reflection seismology. Some of its scientists also participate in the university's Environmental Science Institute.\nUTIG research activities are carried out all over the world and include large-scale, multi-investigator, multi-institutional field programs. The importance of geophysical measurements and their mathematical interpretation in the exploration for petroleum and economically useful minerals has also led to valuable partnerships between UTIG and industry. UTIG plays a role in K-12 education through formal teacher-training programs and informal outreach efforts.\n\nUTIG strives to conduct research that expands the frontiers of knowledge in earth science, has societal and economic relevance, and is of human interest. Dedicated to basic and applied research alike, the Institute aims to enhance humanity's fundamental understanding of the dynamic geophysical processes that have influenced and continue to influence Earth's structure and climate.\n\nGeographically, UTIG's scope includes the ocean basins, continental margins, Antarctica, and all sites of seismic activity. Chronologically, its scope is no less vast: from the development of tectonic evolution models that reconstruct continental arrangements as much as a billion years ago to predicting how future climatic scenarios would impact sea-level changes and thus the habitability of densely populated coastal regions. The Institute's research is highly relevant to natural resource exploration, the assessment of geologic hazards, and the mitigation of environmental damage. The development of new mathematical models, data processing and imaging techniques, and geophysical instrumentation is also an integral part of UTIG's ongoing research and future goals.\n\nFounded in 1888 as the Department of Geology, the Department of Earth and Planetary Sciences is the main academic unit of the Jackson School of Geosciences. However, scientists and students in the Department do conduct a wide range of research and collaborate with researchers at the Institute and Bureau, as well as with colleagues around the world.\n\nScientists in the Department conduct research and teach courses in 9 main areas: Atmospheric Sciences, Computational Geosciences, Geochemistry/Thermo- & Geo-chronology, Geophysics/Seismology, Hydrogeology/Glaciology, Paleontology/Geobiology, Petrology/Mineral Physics, Sedimentary Geology/Stratigraphy, Structural Geology/Lithospheric Geodynamics.[17]\n\nThe Department houses one of only a handful of non-medical CT scanners at an academic institution anywhere in the world. The High Resolution X-Ray CT (UTCT) Facility has been used to non-destructively scan precious, one-of-a-kind specimens such as Lucy (an ancient human ancestor and the world's most famous fossil),[18] Archaeopteryx (one of the oldest and most primitive birds known), one of the first books printed in the New World, and a meteorite thought by some to contain signs of life on Mars. The UTCT is an NSF-supported shared multi-user facility. Data and imagery from the research are freely available online for scientists,  students and the general public via the DigiMorph web site.[19][20]\n\nOther major lab facilities include: Aqueous Geochemistry, Electron Microbeam (EPMA, SEM, ESEM, and XRD), Fission Track Thermochronology, Geomicrobiology, Geophysics (Landmark and Geoquest software for seismic processing and  interpretation), ICP Mass Spectrometry, Isotope Hydrology, Mineral Physics, Paleomagnetics, Petrographic Imaging, Stable Isotope, Thermal Ionization Mass Spectrometry (TIMS), and U-PB Geochronology.[21]\n\nThe Department, in partnership with the Texas Natural Science Center, also maintains two major paleontology collections: the Vertebrate Paleontology Laboratory (focusing largely on the American Southwest and Texas) and the Non-vertebrate Paleontology Lab.\n\nKnown as the Department of Geological Sciences since its first name change in 1967, the department was renamed Department of Earth and Planetary Sciences in 2023 to reflect changes in the department's curriculum and scope of research.[22]\n",
  "concepts": [
    "Jackson School of Geosciences"
  ],
  "findings": [
    "Academics",
    "Research Units",
    "Bureau of Economic Geology",
    "Institute for Geophysics",
    "Department of Earth and Planetary Sciences",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:07:35.289579"
}