{
  "title": "2008 California Proposition 7",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/2008_California_Proposition_7",
  "content": "Mayoral elections:\n\nMayoral elections:\n\nMayoral elections:\n\nMayoral elections:\n\nMayoral elections:\n\nMayoral elections:\n\nCalifornia Proposition 7, would have required California utilities to procure half of their power from renewable resources by 2025. In order to make that goal, levels of production of solar, wind and other renewable energy resources would more than quadruple from their current[when?] output of 10.9%.[1] It would also require California utilities to increase their purchase of electricity generated from renewable resources by 2% annually to meet Renewable Portfolio Standard (RPS) requirements of 40% in 2020 and 50% in 2025.  Current law AB32 requires an RPS of 20% by 2010.\n\nThe 42 page measure, 7 pages of which is new law, is an initiated state statute that had qualified for the November 2008 ballot in California,[2] and was disapproved by voters on November 4 of that year.\n\nThe California Legislative Analyst's Office, the nonpartisan state agency charged with providing a neutral estimate about the fiscal impact on the state of ballot initiatives and state legislative bills, has arrived at the following summary of Prop. 7's estimated costs:\n\nThe official committee supporting Prop 7 is called Californians for Solar and Clean Energy.\n\nFor the full list of supporters, see: List of Proposition 7 supporters\n\nThe primary financial backer of the initiative is Peter Sperling.\n\nAs of September 18, two donors have contributed $5,000 or more to support Prop. 7.  They are:\n\nJim Gonzalez, founding partner of the political consulting firm Jim Gonzalez & Associates in Sacramento, is the initiative's chief spokesperson.[6]\n\nThe official committee opposing Prop. 7 is called Californians Against Another Costly Energy Scheme.\n\nSee also:  List of Proposition 7 opponents.\n\nAs of August 2, three donors are listed as having given $5,000 or more to defeat this initiative.[11]  They are:\n\nThe opposition coalition as of July 14, 2008 had paid about $175,000 to the campaign consulting firm of Townsend, Raimundo, Besler & Usher.[15]\n\nA poll released on July 22, 2008 by Field Poll showed Proposition 7 with 63% support and 24% opposition.  82% of those surveyed had no initial awareness of Proposition 7.[16]\n\nThe petition drive to qualify the measure for the ballot was conducted by Progressive Campaigns, Inc. at a cost of $1.367 million.[24]\n\nSupporters and opponents of Proposition 7 filed lawsuits in Sacramento Superior Court regarding the wording of ballot arguments that voters will see in the official voter's guide.[25]\n\nThe lawsuit filed by proponents of Proposition 7 claimed that the opposition’s ballot arguments contained false and misleading statements that should have been deleted.  Specifically, proponents sued over the opponents' claim that small renewable providers would be shut out of the market.  Noting that there is no language in the measure that states that, Sacramento County Superior Court Judge Michael Kenny refused to take sides on the issue.[26]\n\nThe lawsuit filed by opponents of Proposition 7 wanted the removal of three statements in the voter's guide:\n\nThe opponent's petition was denied in its entirety, with Judge Kenny stating that the opponents had not sufficiently established that those statements were misleading.\n",
  "concepts": [
    "2008 California Proposition 7"
  ],
  "findings": [
    "Provisions in the initiative",
    "Estimated fiscal impact",
    "Supporters",
    "Arguments made in favor of Prop. 7",
    "Donors who support Prop. 7",
    "Campaign consultants",
    "Opponents",
    "Arguments made against Prop. 7",
    "Donors who oppose Prop. 7",
    "Campaign consultants",
    "Polling information",
    "Newspapers Opposed to Proposition 7",
    "Path to the ballot",
    "Lawsuits over ballot language",
    "Results",
    "Basic information",
    "Supporters",
    "Opponents",
    "References",
    "Further reading"
  ],
  "timestamp": "2025-04-11T10:48:48.342053"
}