{
  "title": "Kiester, Minnesota",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Kiester,_Minnesota",
  "content": "Kiester (/ˈkiːstər/ KEE-stər)[4] is a city in Faribault County, Minnesota, United States. The population was 501 at the 2010 census.[5]\n\nA post office called Kiester has been in operation since 1882.[6] The city was named for county judge Jacob Armel Kiester.[7]\n\nA tornado reportedly touched down in the city of Kiester on June 17, 2010.[8] The tornado caused a large amount of destruction, and several homes were damaged.[9] The tornado was later rated EF2 on the Enhanced Fujita Scale after damage assessment was completed.[10]\n\nAccording to the United States Census Bureau, the city has a total area of 0.44 square miles (1.14 km2), all  land.[11]\n\nMinnesota State Highway 22 and County Highway 2 are two of the main routes in the community.\n\nAs of the census[13] of 2010, there were 501 people, 246 households, and 141 families residing in the city. The population density was 1,138.6 inhabitants per square mile (439.6/km2). There were 281 housing units at an average density of 638.6 per square mile (246.6/km2). The racial makeup of the city was 97.2% White, 0.4% Asian, 1.2% from other races, and 1.2% from two or more races. Hispanic or Latino of any race were 4.2% of the population.\n\nThere were 246 households, of which 20.3% had children under the age of 18 living with them, 42.3% were married couples living together, 9.3% had a female householder with no husband present, 5.7% had a male householder with no wife present, and 42.7% were non-families. 40.2% of all households were made up of individuals, and 20.7% had someone living alone who was 65 years of age or older. The average household size was 2.04 and the average family size was 2.67.\n\nThe median age in the city was 47.8 years. 17.2% of residents were under the age of 18; 8.6% were between the ages of 18 and 24; 18.8% were from 25 to 44; 29.4% were from 45 to 64; and 26.1% were 65 years of age or older. The gender makeup of the city was 51.5% male and 48.5% female.\n\nIn 2016, the small town of Kiester, Minnesota, gained national attention as the filming location for a Preparation H commercial. The advertisement humorously capitalized on the town's name, which phonetically resembles \"keister,\" a colloquial term for the buttocks. The commercial featured residents and local landmarks, creating a playful and memorable connection to the hemorrhoid treatment product.\n\nThe response from Kiester's community was notably positive. Residents embraced the attention and the humorous nature of the commercial, finding it an amusing and unique way to put their town on the map. The commercial not only provided a boost in local morale which had recently suffered from recent school and business closings, but also highlighted the town's ability to engage with humor and light-heartedness. This event marked a distinctive moment in Kiester's history, showcasing the town's charm and sense of community to a nationwide audience.\n[14][15][16]\n",
  "concepts": [
    "Kiester, Minnesota"
  ],
  "findings": [
    "History",
    "Tornado",
    "Geography",
    "Demographics",
    "2010 census",
    "In popular culture",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:12:22.549980"
}