{
  "title": "Jonathan Lipnicki",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jonathan_Lipnicki",
  "content": "Jonathan William Lipnicki (born October 22, 1990) is an American actor who is known for his roles as a child actor. He has appeared in films such as Jerry Maguire (1996), Stuart Little (1999) and Stuart Little 2 (2002), The Little Vampire (2000), and Like Mike (2002). He also starred in the television series Dawson's Creek on The WB and Meego on CBS.\n\nJonathan William Lipnicki was born on October 22, 1990, in Westlake Village, California,[1] to Joseph Lipnicki and Rhonda Rosen. He has an older sister, Alexis.[2] His father owns the mixed martial arts promotion firm Fight Sports Entertainment.[3] His family is Jewish[4] and he had a Bar Mitzvah.[5]\n\nHe was educated at Agoura High School, a public secondary school in the city of Agoura Hills in Los Angeles County, California.[6]\n\nLipnicki played the son of a single parent in his film debut Jerry Maguire. He subsequently appeared on The Single Guy, The Jeff Foxworthy Show as well as episodes of Dawson's Creek and the 1997 sitcom, Meego. He played George Little in Stuart Little and its sequel Stuart Little 2.\n\nHe also played the lead, Tony Thompson, in the 2000 film, The Little Vampire and co-starred with hip-hop rapper Bow Wow in the 2002 sports film, Like Mike, which was released two weeks before Stuart Little 2. The latter films did relatively well in theaters, and Lipnicki has become known among preteen audiences, although he has focused mostly on independent films.\n\nLipnicki has also appeared in the season preview of Jamie Kennedy's Blowin' Up and When Zachary Beaver Came to Town.\n\nHe appeared on the comedy Motherlover on the YOMYOMF Network. Lipnicki currently trains in mixed martial arts styles, but when asked whether he planned to ever fight professionally, he replied, \"I've been pretty busy filming and I would need to put off a certain amount of time to really train for a fight and be in amazing cardio shape and really work on my striking more. I'm not saying no and I'm not saying yes.\"[7]\n\nLipnicki completed lead roles in the horror-thriller motion picture Broil,[8] produced by the team behind It Follows, and the comedy-drama motion picture Pooling To Paradise opposite Taryn Manning and Jordan Carlos. He also guest-starred in Antoine Fuqua's and Philip Noyce's The Resident.\n\nIn 2022, it was announced to the public that Lipnicki will be starring in the horror film Camp Pleasant Lake as the character Jasper Meadows.[9]\n\nLipnicki has been a speaker for the Breast Cancer Research Foundation and is actively involved with the Juvenile Diabetes Research Foundation, the Starlight Children Foundation and the NBA's Read to Achieve program.[10][11][12] The Juvenile Diabetes Research Foundation named Lipnicki one of its \"Heroes of 2001\" at the age of ten, for his work with the organization.[10][12]\n\nAdditionally, Lipnicki has been an international spokesperson for Pediatric Chiropractic and Kids Day America/International and has worked with animal rights groups such as Pets and Their Stars and the Nutz for Mutts group.[10][11][12]\n\nLipnicki dated Becca Mason in 2018, after meeting on the reality show Celebs Go Dating. They later broke-up.\n\nLipnicki is a trained martial arts practitioner and holds a black belt in Brazilian jiu-jitsu[13] and still maintaining his fitness routine.[14] In 2021, following an uptick in antisemitic attacks, Lipnicki teamed up with security firm Magen Am to escort Jews to synagogues.[15]\n\nLipnicki currently resides in Oklahoma after becoming executive producer for Buffalo 8 Production.[16][17]\n",
  "concepts": [
    "Jonathan Lipnicki"
  ],
  "findings": [
    "Early life",
    "Career",
    "Philanthropy",
    "Personal life",
    "Filmography",
    "Awards and honors",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:08:33.277525"
}