{
  "title": "Metropolitan School District of Mt. Vernon",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Metropolitan_School_District_of_Mt._Vernon",
  "content": "The Metropolitan School District of Mt. Vernon, Indiana, also known as simply the MSD of Mt. Vernon or MSDMV, is the school corporation serving the City of Mt. Vernon and southern Posey County and is the larger of two school districts in the county.[when?][citation needed]\n\nThe townships covered by this district include Black, Lynn, Marrs, and Point.[1] The only incorporated community is Mount Vernon, by far the largest community in the county.\n\nThe school district comprises five schools, Marrs Elementary, Farmersville Elementary, West Elementary, Mt. Vernon Junior High, Mt. Vernon High school. The district is led by Dr. Matthew Thompson\n\nIn 1949 the Indiana Legislature passed a law that allowed school consolidation. By 1953 there had been proposals in Posey County to establish metropolitan school district systems. By 1953 the Rural School Improvement Council (RISC) was promoting such a consolidation for Black, Marrs, and Lynn townships, and a referendum on such was scheduled for May 4, 1954.[2]\n\nPreviously Posey County had a county school system, but it transitioned,[3] after a referendum on October 1, 1956 determined it would do so.[4] By December 1956, the consolidations of the school systems into Mt. Vernon schools had occurred.[3] The referendum was held because there were people opposed to the school district consolidations who submitted official documents opposing them.[5]\n\nPoint Township was not a part of the October 1956 vote. In November 1956, Point Township joined MSD of Mount Vernon,[6] because the board of the township asked to join.[4]\n\nThis Indiana school-related article is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Metropolitan School District of Mt. Vernon",
    "school",
    "vernon",
    "mt vernon",
    "mt",
    "district",
    "county",
    "school district",
    "1956",
    "township",
    "referendum"
  ],
  "findings": [
    "History",
    "Schools",
    "Other Facilities",
    "Nearby districts",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:13.156525"
}