{
  "title": "Jonas Lie (writer)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jonas_Lie_(writer)",
  "content": "Jonas Lauritz Idemil Lie (Norwegian: [liː]; 6 November 1833 – 5 July 1908) was a Norwegian novelist, poet, and playwright who, together with Henrik Ibsen, Bjørnstjerne Bjørnson and Alexander Kielland, is considered to have been one of the Four Greats of 19th century Norwegian literature.[1]\n\nJonas Lie was born at Hokksund in Øvre Eiker, in the county of  Buskerud,  Norway.  His parents were Pauline Christine Tiller (1799–1877) and Mons Lie (1803–81). Five years after Jonas's birth, his father was appointed sheriff of Tromsø, which lies within the Arctic Circle, and young Jonas Lie spent six of the most impressionable years of his life at that remote port.[2][3]\n\nHe was sent to the naval school at Fredriksværn; but his defective eyesight caused him to give up a life at sea. He transferred to the Bergen Cathedral School (Bergen katedralskole) in Bergen, and in 1851 entered the University of Christiania, where he made the acquaintance of Ibsen and Bjørnson. He graduated in law in 1857, and shortly afterwards began to practice at Kongsvinger, a town located between Lake Mjøsa and the border with Sweden.[4]\n\nClients were not numerous at Kongsvinger and Lie found time to write for the newspapers and became a frequent contributor to some of the Christiania journals. His first work was a volume of poems which appeared in 1866 and was not successful. During the four following years he devoted himself almost exclusively to journalism, working hard and without much reward, but acquiring the pen of a ready writer and obtaining command of a style which has proved serviceable in his subsequent career.[citation needed]\n\nBetween 1863 and 1864 Lie edited a magazine Illustreret Nyhedsblad.[5] In 1870 he published Den Fremsynte,[6] a powerful tale of the sea and superstitions centering on Northern Norway. In the following year he revisited Nordland and traveled into Finnmark.[7]\n\nStarting from 1874, the Norwegian Parliament had granted him an artist salary. Having obtained this small  pension from the Government, he sought the greatest contrast he could find in Europe to the scenes of his childhood and started for Rome. For a time he lived in North Germany, then he moved to Bavaria, spending his winters in Paris. In 1882 he visited Norway for a time, but returned to the continent of Europe. His voluntary exile from his native land ended in the spring of 1893, when he settled at Holskogen, near Kristiansand. His works were numerous after that.[8]\n\nIn his works, Jonas Lie often sought to reflect in his writings the nature, folk life, and social spirit of the nation of Norway. His writing often dealt with family life in diverse settings, including  portraying the social and intellectual restrictions on women of the educated classes. Lie was a versatile writer, liberal and modern, but also strongly tradition bound.[8]\n\nAmong Lie's finest works must be considered Familien paa Gilje[9] (1883) which was a striking document of the life of an officer's family, and the few options given to the daughters of such families.[10]\n\nHis two collections of short stories called Trold involve the superstitions of the fishermen and coast commoners of northern Norway. The much anthologized short story Elias and the Draugh was included in a collection originally published by Gyldendal Norsk Forlag, and was reprinted  by Roald Dahl in  Roald Dahl's Book of Ghost Stories (1983).[11]\n\nIn 1860, he married his cousin Thomasine Henriette Lie (1833–1907). The couple had five children. Two died young; the others were diplomat Michael Strøm Lie (1862–1934) and writers Mons Lie (1864–1931) and Erik Røring Møinichen Lie (1869–1943). Jonas Lie was the uncle of the author Bernt Lie (1868–1916). Henriette Thomasine Lie was the aunt of Jonas Lie, the Norwegian-born American painter.[8] His grandson, also named Jonas Lie, served as the Minister of Police under Norway's collaborationist Quisling government.\n\nJonas Lie died at Fleskum at Sandvika in 1908, less than a year after Thomasine's death.[12][13]\n\nIn 1904, the King of Norway awarded Lie the Grand Cross of the Order of St. Olav.\n",
  "concepts": [
    "Jonas Lie (writer)",
    "lie",
    "jonas",
    "norway",
    "jonas lie",
    "norwegian",
    "life",
    "years",
    "works",
    "time",
    "thomasine"
  ],
  "findings": [
    "Background",
    "Career",
    "Works",
    "Personal life",
    "Legacy",
    "Works in English translation",
    "References",
    "Further reading",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:53.317752"
}