{
  "title": "Donald and the Wheel",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Donald_and_the_Wheel",
  "content": "Donald and the Wheel is a 17-minute Donald Duck animated short directed by Hamilton Luske, produced by Walt Disney and released on June 21, 1961.[1] It is an educational-based film, and features a considerable amount of musical vocals. Disney described the cartoon as \"using the revolutionary Xerox and Sodium Screen Processes together for the first time, Disney and his director, Ham Luske, combine real people and objects in the same perspective as animated characters and objects.\"[2][3]\n\nTwo \"spirits of progress\" are observing the potential inventor of the wheel. These spirits are never seen aside from their auras. One of these spirits is an adult (voiced by Thurl Ravenscroft) and is accompanied by his beatnik-talking son (voiced by Max Smith). The elder is trying to explain the importance of the wheel to his son. They observe a caveman (portrayed by Donald Duck) trying to haul his supply sled up a hill and into a cave. Donald is then chased out of the cave by a Saber Tooth Tiger. He gets away, but the tiger tumbles down a hill wrapped around a rock. The spirits tell Donald that this should be the inspiration for his invention of the wheel.\n\nThe film then goes into the evolution and widespread uses for the wheel, including those used by the Ancient Egyptians, Ancient Greeks, and Ancient Romans. It introduces the horse-drawn vehicles of the Middle Ages as well as buggies and carriages of the 19th century, culminating with the invention of the steam locomotive and the Industrial Revolution.\n\nThe narrators also take time to explain various devices that use wheel-based parts, including gears like a music box, a gramophone and a jukebox. Inside the jukebox, a tiny lady dances on the records contemporary jazz, hoedown and classic ballet with Donald joining in with her. The last few segments enter the 20th century and the rise of factories and the automobile. They finally reach the present day, wrapping up with satellites. They also explain that the world itself is a wheel, and that the Sun, Moon, Earth and planetary orbits act as wheels.\n\nAfter seeing into the future, Donald appears overwhelmed and bewildered, and decides against inventing the wheel. He claims it is \"too much trouble\" and does not want to bear the enormous responsibility. The Spirits of Progress accept that Donald may not be the true inventor of the wheel, but that \"somebody did\".\n\nThe music was composed by Buddy Baker, who also composed Donald in Mathmagic Land and sung by The Mellomen.\n\nDonald and the Wheel was released in theaters with the film The Parent Trap.\n\nThe short was released on November 11, 2008, on Walt Disney Treasures: The Chronological Donald, Volume Four: 1951-1961.[4]\n",
  "concepts": [
    "Donald and the Wheel"
  ],
  "findings": [
    "Plot",
    "Voice cast",
    "Music",
    "Release",
    "Home media",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:11:51.713849"
}