{
  "title": "The Ranksters",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/The_Ranksters",
  "content": "The Ranksters (Korean: 뭐든지 프렌즈) was a South Korean variety show program on tvN. It was aired on tvN on Wednesdays at 23:00 (KST).[1][2]\n\nThis show features 2 segments, namely \"No Matter What Ranking Mart\" and \"Taste Detective Friends\".[3] The cast will be split into pairs, while the guests will form their own pair.\n\nIn the first segment, \"No Matter What Ranking Mart\", the pairs compete to answer different themes Top 5 (out of 30 items), based on actual surveys conducted in Korea, such as \"Top 5 items that you will be reluctant to buy using your own money but other people are thankful for when gifted to them as presents from you\". If a pair chose an item that is not under the Top 5, they will have to pay for the item with their own credit cards. The pair that guessed the most number of correct Top 5 items will have their spending deducted to zero. From episode 4, the pairs will have to answer just the top 3, out of 20 items.\n\nIn the second segment, \"Taste Detective Friends\", they will move to the Food Court. There will be a food theme for each episode, and there are a number of versions of the food out of the versions shown above that are actually being sold, while the rest of the versions are made by the production team. The pairs have to play games to get to choose first, as they each attempt to guess which are the real versions, while trying their own choices. If he/she guesses correctly he/she will not have to pay for these food products using their own credit cards.\n\nThe money spent by the cast will be used to purchase the items to be used for future episodes.\n\nNew segments are introduced, in addition to the current segments shown in the first 5 episodes. The main objective for each episode is to pick each episode's Employee of the Week, which is through the competition between the cast and the 2 guests each week.\n",
  "concepts": [
    "The Ranksters"
  ],
  "findings": [
    "Cast",
    "Ranking Market Employees",
    "Anything Friends",
    "Synopsis",
    "Episode 1-5",
    "Episode 6-8",
    "Episodes",
    "Ratings",
    "2019",
    "Notes",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:46:57.180985"
}