{
  "title": "HMCS Collingwood",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/HMCS_Collingwood",
  "content": "HMCS Collingwood was a Flower-class corvette that served with the Royal Canadian Navy during the Second World War. She served primarily in the Battle of the Atlantic though also saw service as a training vessel. She was named for Collingwood, Ontario.\n\nFlower-class corvettes like Collingwood serving with the Royal Canadian Navy during the Second World War were different from earlier and more traditional sail-driven corvettes.[3][4][5]  The \"corvette\" designation was created by the French as a class of small warships; the Royal Navy borrowed the term for a period but discontinued its use in 1877.[6] During the hurried preparations for war in the late 1930s, Winston Churchill reactivated the corvette class, needing a name for smaller ships used in an escort capacity, in this case based on a whaling ship design.[7] The generic name \"flower\" was used to designate the class of these ships, which – in the Royal Navy – were named after flowering plants.[8]\n\nCorvettes commissioned by the Royal Canadian Navy during the Second World War were named after communities for the most part, to better represent the people who took part in building them. This idea was put forth by Admiral Percy W. Nelles. Sponsors were commonly associated with the community for which the ship was named. Royal Navy corvettes were designed as open sea escorts, while Canadian corvettes were developed for coastal auxiliary roles which was exemplified by their minesweeping gear. Eventually the Canadian corvettes would be modified to allow them to perform better on the open seas.[9]\n\nCollingwood was ordered on 1 November 1940 as part of the 1939–1940 Flower-class building program. She was laid down on 2 March 1940 by Collingwood Shipbuilding at Collingwood, Ontario and launched 27 July later that year.[10] She was commissioned on 9 November 1940 at Collingwood, the first corvette to enter Canadian service.\n\nIn early December 1941 she went on a two-month refit at Halifax. Between 1942 and 1944 Collingwood had three minor refits. In October 1943, she was sent to New York for a major refit that lasted until December of that year, during which her fo'c'sle was extended.[11]\n\nAfter arriving at Halifax and completing her work up, Collingwood joined Halifax Force in January 1941. She worked with them until 23 May when she transferred to Newfoundland Escort Force (NEF). Beginning in June she spent the next six months escorting convoys from St. John's to Iceland.[11] The first NEF convoy to face battle, HX 113, had three corvettes as part of the escort. However, none of them had adequate communications equipment as they were only able to communicate through signals and not radio. This led to six losses and the escorts were only able to stop the attacks due to a reinforcement of Royal Navy escorts out of Iceland.[12]\n\nAfter completing her working up after her first refit, Collingwood was assigned to the \"Newfie\" – Derry run, which were the Atlantic convoys that no longer switched escort groups near Iceland, but went all the way to the United Kingdom. She spent 1942 through to 1944 escorting convoys on this run. From December 1942 onward, Collingwood was a member of escort group EG C-4. From April 1945 until June 1945, Collingwood served as a training ship at Digby, Nova Scotia.[11]\n\nCollingwood was paid off on 23 July 1945 at Sorel, Quebec. She was sold for scrapping in July 1950 and broken up at Hamilton.[11][13]\n",
  "concepts": [
    "HMCS Collingwood",
    "collingwood",
    "royal",
    "navy",
    "corvettes",
    "class",
    "canadian",
    "escort",
    "war",
    "royal navy",
    "named"
  ],
  "findings": [
    "Background",
    "Construction",
    "Service history",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T15:48:23.053008"
}