{
  "title": "Invisible (band)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Invisible_(band)",
  "content": "Invisible was an Argentine band formed by Luis Alberto Spinetta following the breakup of Pescado Rabioso in 1973 and the release of Artaud. The original lineup of the band was completed by Carlos \"Machi\" Rufino (bass, backing vocals) and Héctor \"Pomo\" Lorenzo (drums), both of whom conformed Pappo's Blues' rhythm section at the time. From 1976 until their breakup a year later, the band expanded into a quartet with the inclusion of guitarist Tomás Gubitsch. Spinetta had already played with Pomo on several occasions: in Tórax—the first band created by Spinetta after Almendra—, in Billy Bond y La Pesada del Rock and Roll, and on his first solo album, Spinettalandia y sus amigos.\n\nInvisible's first live performance took place at the Teatro Astral on 23 November 1973. The following year, they recorded their first single and their first album, self-titled Invisible. The group secluded more and more in their rehearsals and dropped live performances in small places; they only performed in big theaters or stadiums, but never in festivals.\n\nAfter a long hiatus, they changed recording company (from Talent - Microfón to multinational CBS) and announced their second LP, Durazno Sangrando in 1975. The premiere took place in the Teatro Coliseo on 21 and 22 November that year. A cover version of \"Amor de primavera,\"[1] a song originally composed and performed by Tanguito, was Invisible's only sign of activity until the release of their third and last LP, El jardín de los presentes, in which the band incorporated Tomás Gubitsch on lead guitar. The album obtained massive success almost immediately[citation needed] and contains \"El Anillo del Capitán Beto\", considered a classic of Argentine rock.[2] The album also featured a guest appearance by bandoneón virtuoso Rodolfo Mederos on \"Las Golondrinas de Plaza de Mayo\". The new material included in this LP would be first performed live on 6 August 1976 in the Estadio Luna Park. About \"El Anillo del Capitán Beto,\" Spinetta once said: \n\n\"I remember myself with Pomo and Machi, having a great time in the coffee shop that was next to Teatro Astral and thinking of possible names for that astronaut who has gone through the fight of ages (in Spanish: lucha de las eras)... Las eras... Las Heras y Bustamante (an intersection in Buenos Aires). I imagined that his spaceship was similar to the DeLorean of Back to the Future, or something like that, that took off due to a science that only Beto understands, and goes far away... Actually, Beto does not want to come back. He has conquered something impressive but, as any conqueror, he can't avoid comparison and distance to the world he left behind.\"\nInvisible had its last concert on 12 December 1976 in the Luna Park. In early 1977, the group disbanded due to the different opinions among its members on which musical style to follow.\n\nIn the Spinetta y las Bandas Eternas concert of 2009 - a retrospective of Spinetta's career in which he brought together the bands that accompanied him over 40 years-Invisible played 5 songs: \"Durazno sangrando\", \"Jugo de lúcuma\", \"Lo que nos ocupa es la conciencia, es la abuela que regula el mundo\", \"Niño condenado\" and \"Amor de primavera\".\n\n Media related to Invisible at Wikimedia Commons\n",
  "concepts": [
    "Invisible (band)",
    "invisible",
    "spinetta",
    "las",
    "band",
    "el",
    "beto",
    "album",
    "year",
    "took",
    "teatro"
  ],
  "findings": [
    "History",
    "Discography",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:28:30.304446"
}