{
  "title": "Ramón Vázquez García",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Ramón_Vázquez_García",
  "content": "Ramón Vázquez García (born 14 February 1964), commonly known as Ramón, is a former Spanish footballer who played as a forward.\n\nRamón began his career at Sevilla, initially playing for the club's B team, Sevilla Atlético. On 17 March 1983, Ramón scored 13 minutes into his debut, in a 3–2 away win against Salamanca. In 1985, after struggling for game time at Sevilla, Ramón was loaned to Recreativo for a season. Ramón played every league game for Recreativo in the 1985–86 Segunda División, scoring twelve times. Upon his return to Sevilla, Ramón became a regular, playing 40 games in the following season. Ramón remained with Sevilla until 1992, when he was released from the club after failing to agree a new contract. In 1992, Ramón signed for Deportivo La Coruña, however failed to make an appearance for the club due to injury problems. In 1993, Ramón signed for Albacete, making 17 appearances, all as a substitute. Ramón retired from football at the end of the 1992–93 season.[1][2]\n\nIn the early 1980s, Ramón represented Spain's under-18's in the Principato di Monaco and the Coppa Principe Alberto. After representing Spain at under-21's, Ramón represented the under-23 side during qualification for the 1988 Summer Olympics. On 21 January 1987, Ramón made his debut for Spain, in a 1–1 draw against the Netherlands.[3]\n\nRamón's son, Javi Vázquez, currently plays for Sevilla.[1]\n\nThis biographical article related to a Spanish association football forward is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Ramón Vázquez García",
    "ramón",
    "sevilla",
    "spain",
    "season",
    "club",
    "1992",
    "vázquez",
    "spanish",
    "signed",
    "sevilla ramón"
  ],
  "findings": [
    "Club career",
    "International career",
    "International goals",
    "Personal life",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:55:24.987985"
}