{
  "title": "Griffenfeldsgade",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Griffenfeldsgade",
  "content": "Griffenfeldsgade is a street in the Nørrebro district of Copenhagen, Denmark, running from Nørrebrogade in the northeast to Åboulevard on the border to Frederiksberg in the southwest from where it continues as H. C. Ørsteds Vej. The street has a multiethnic character and is home to a number of African specialty stores, coffee shops and restaurants.[1] Between Griffenfeldsgade and Stengade is a small green space, Folkets Park, which was refurbished between 2007 and 2009.[2]\n\nGriffenfeldsgade was until 1879 called Parcelvej (\"Lot Road). Griffenfeldsgade is named after the Holstein statesman Peter Schumacher Griffenfeld, who served as Danish Chancellor from 1673.  A bridge, Parcelbroen (\"Lot Bridge\"), was until 1892 located at the far end of the street, connecting it to Ladegårdsvej on the other side and from 1872 to H. C. Ørsteds Vej.\n\nAt the outbreak of World War II the Danish Communist Party had its office on the 3rd floor of Griffenfeldsgade 50, the party newspaper Arbejderbladet were housed in the ground and first floor.\n\nWhen the German Wehrmacht occupied Denmark on 9 April all the lists of party members, subscribers and magazine sellers were burned, but the Danish police had already secured the addresses.\n\nAfter Nazi Germany's attack on the Soviet Union in 1941, the Communist Party was banned in Denmark. Simultaneously, several members were arrested and the release of the Arbejderbladet was banned. The party then continued as an illegal organization from November 1941 and published the illegal opposition magazine Land og folk. A small printing house in Griffenfeldsgade, usually printing occasional songs and the like, now  printed illegal pamphlets and newspapers.\n\nDuring the occupation Griffenfeldsgade was scene of several firefights between the Danish resistance and representatives of the occupying power. Many apartments and shops were also exposed to either raids or sabotage. The Danish communist youth organization still resides in Griffenfeldsgade.[3]\n\nThe former St. Joseph's Hospital is from 1875. It was founded by St. Joseph Sisters in 1975. The building was designed by Christian Hansen in the Gothic Revival style. The hospital was later nursing home but closed in 2005.[4]\n\n55°41′14.96″N 12°33′14.18″E﻿ / ﻿55.6874889°N 12.5539389°E﻿ / 55.6874889; 12.5539389\n",
  "concepts": [
    "Griffenfeldsgade"
  ],
  "findings": [
    "History",
    "Griffenfeldsgade during the occupation",
    "Notable buildings",
    "References",
    "External links"
  ],
  "relationships": [
    {
      "subject": "Griffenfeldsgade",
      "relationship": "is a",
      "object": "street in the nørrebro district of copenhagen",
      "sentence": "Griffenfeldsgade is a street in the Nørrebro district of Copenhagen, Denmark, running from Nørrebrogade in the northeast to Åboulevard on the border to Frederiksberg in the southwest from where it continues as H. C. Ørsteds Vej."
    }
  ],
  "timestamp": "2025-04-11T13:23:18.413021"
}