{
  "title": "Evacuation of Ny Sjælland",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Evacuation_of_Ny_Sjælland",
  "content": "North Atlantic\n\nAfrica\n\nAsia\n\nCaribbean\n\nThe evacuation of Ny Sjælland (Danish: Rømningen af Ny Sjælland, lit. 'New Zealand') was a Danish evacuation of a newly established colony on Camorta, Nicobar Islands due to native threats and raids.\n\nDue to its ability to produce exotic crops and strategic placement, the Nicobar Islands were unsuccessfully colonized by the Danish Asiatic Company based in Tranquebar. The Danes first attempted to establish a colony on Great Nicobar Island, named Ny Danmark (New Denmark),[1] however due to illness the colony failed.[2][3]\n\nThe remnants of the colony were moved to Camorta Island, where the Danes established Ny Sjælland (New Zealand).[4][5] Despite being kindly received by the local Nicobarese people and their chief, Captain John, the situation soon deteriorated, with the first Dane dying of disease a short time after arriving.[6]\n\nSubsequently, there were several raids into the colony's warehouses,[6] and the Danish commander, Christian Frederik Lund, believed that the Nicobarese used the Danes' vulnerability to their advantage. In a report written several years later, Lund also placed the blame on the deceased commander, Jens Tved, saying he should not have indulged the Nicobarese with tobacco and cloth.[7] Soon the Nicobarese had enough of those items and demanded weapons and iron instead.[8]\n\nLund says that he complained about the thefts to Captain John, whom Lund himself had appointed as the colony's officer. Subsequently, a great number of spear-armed warriors showed up in the colony one morning. Lund asserts the size of the army to 300-400 warriors, while another witness claims 200-300.[7]\n\nThey demanded the Danes' weapons so they could hunt the thieves. Despite succeeding in sending them away, the Danes still perceived them as very threatening. After a few days,[8] Lund gave up the defense and on 28 August, decided to evacuate the colony on the vessel Ebenezer, and the next day set sail for Achin (present-day Aceh). Lund left most of the equipment and 6 Indian soldiers in the colony.[7]\n\nIt is unclear how the events unfolded. Lund recalls the warriors arriving on 27 August, and he recounts that the next day they could see them approaching the colony again to carry out a night attack. According to the captain of the Ebenezer, Matthias Rasmussen, the significant influx of warriors occurred on 25 August. In the days leading up to 28 August, the Danes kept watch at night, while they drew Ebenezer close to the colony's landing site. Captain John promised to protect the colony but also informed the Danes that there were a couple of hundred Nicobarese warriors ready in the jungle to attack the Danes.[7]\n\nIt is entirely possible that Lund exaggerated the conflict with the local population in order to have an excuse to evacuate the failing colony. The dramatic attack might not have happened and it is also possible that he exaggerated and blamed Jens Tved for problems not related to him.[8]\n\nThe Ebenezer, with Lund, gets back from Achin in January 1758 to retrieve the property in Ny Sjælland. However, Lund found it impossible to resume colonization as there were too few people left. The 6 Indians initially left in the colony were never mentioned again.[9] After the failure of Ny Danmark and Ny Sjælland, the Danish Asiatic Company no longer showed big interest for the Nicobar Islands.[3]\n",
  "concepts": [
    "Evacuation of Ny Sjælland"
  ],
  "findings": [
    "Background",
    "Evacuation",
    "Aftermath",
    "References",
    "Works cited"
  ],
  "timestamp": "2025-04-11T10:15:41.452633"
}