{
  "title": "South Semitic languages",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/South_Semitic_languages",
  "content": "South Semitic is a putative branch of the Semitic languages, which form a branch of the larger Afro-Asiatic language family, found in (North and East) Africa and Western Asia. The grouping is controversial and several alternate classifications supplanting South Semitic have been proposed in recent decades.[1]\n\nThe \"homeland\" of the South Semitic languages is still debated amongst researchers, with sources such as A. Murtonen (1967) and Lionel Bender (1997)[2] suggesting an origin in Ethiopia and others suggesting the southern portion of the Arabian Peninsula.[3]\n\nA 2009 study by Andrew Kitchen and Christopher Ehret amongst others, based on using a Bayesian model to estimate language change, concluded that the latter viewpoint is more probable, with origins in Southern Arabia, and subsequent migration into the Horn of Africa around 2800 years ago.[4] This statistical analysis could not estimate when or where the ancestor of all Semitic languages diverged from Afroasiatic, but it suggested that the divergence of the East, Central, and South Semitic branches occurred in the Levant around 5750 years ago.[5] German linguist Winfried Noth claimed that the ancestors of Ethiopians spoke a non-Semitic language (or languages, such as Cushitic languages) before adopting Semitic.[6] Evidence for movements across South Arabia are consistent with some recent genomic findings,[7] which find strong association with the movement and ancestry of human population groups speaking the Afro-Asiatic Semitic languages. The dates matched with the origin of the Semitic languages in the Levant, and a spread during the early Bronze Age (~5.7 KYA) into the rest of the Middle East and East Africa.[8]\n\nAccording to another hypothesis supported by many scholars, Semitic originated from an offshoot of a still earlier language in North Africa and desertification made some of its speakers migrate in the fourth millennium BCE into what is now Ethiopia, others northwest into West Asia.[9]\n\nSouth Semitic is divided into two branches:[10]\n\nThe Ethiopian Semitic languages collectively have by far the greatest numbers of modern native speakers of any Semitic language other than Arabic. Eritrea's main languages are mainly Tigrinya and Tigre, which are North Ethiopic languages, and Amharic (South Ethiopic) is the main language spoken in Ethiopia (along with Tigrinya in the northern province of Tigray). Geʽez continues to be used in Eritrea and Ethiopia as a liturgical language for the Orthodox Tewahedo churches.\n\nSouthern Arabian languages have been increasingly eclipsed by the more dominant Arabic (also a Semitic language) for more than a millennium. Ethnologue lists six modern members of the South Arabian branch and 15 members of the Ethiopian branch.[11]\n",
  "concepts": [
    "South Semitic languages",
    "semitic",
    "languages",
    "south",
    "language",
    "semitic languages",
    "south semitic",
    "ethiopia",
    "east",
    "branch",
    "africa"
  ],
  "findings": [
    "History",
    "Classification",
    "Demographics",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:31.731279"
}