{
  "title": "Ella Christie",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Ella_Christie",
  "content": "Isabella  \"Ella\"  Robertson Christie FRSGS FSA Scot FRGS (21 April 1861 - 29 January 1949) was a pioneering Scottish traveller and explorer, landowner, gardener and author.\n\nChristie was born on 21 April 1861 at Millbank in Cockpen, near Bonnyrigg, to Alison (née Philp, c.1817–1894) and John Christie (1824–1902), a Scottish industrialist and landowner. Christie had an elder brother, John Coldwells who died in childhood in his 12th year in 1872,[1] and a younger sister, Alice Margaret.[1]  In 1865 Christie's father purchased the Castleton estate in the Ochils, renaming it Cowden Castle, and the family moved there. Christie and her sister were educated at home by her parents and governesses. From an early age she made annual trips with her parents to Europe including Spain, Italy, Germany and the Low Countries. After her mother's death and her sister's marriage Christie continued to travel with her father and also alone or with a friend. She visited Egypt, Palestine and Syria and started to write about her trips.\n\nOn her father's death in 1902 it was found that he had disinherited both Christie and her sister, leaving the entirety of his estate to an orphanage that he had founded without their knowledge. They contested the will and in 1903 it was settled with the estate being divided between the two sisters and the orphanage. Christie lived on at Cowden Castle and managed the estate.[2][3][4]\n\nAfter her father's death Christie's travels became more ambitious and she began to travel more widely. From 1904 to 1905 she travelled with her maid, Humphries, initially to India and then on to Kashmir, Tibet, Ceylon, Malaya and Borneo. Being well connected and carrying letters of introduction she attended a banquet with the Maharaja of Kashmir and dined with Lord Kitchener. Her adventures saw her camping in the snow at Chorbat Pass, sailing in a cargo ship full of pigs, travelling by pack horse and cart in the Kashmir wilderness and trekking by foot for 60 miles (97 km) in the Desoi mountains.[2]\n\nIn 1907, she visited China, Korea and Japan. While in Japan Christie was fascinated by the Japanese formal style of gardening, an interest that would inspire her to create a Japanese garden at Cowden Castle.[2][3][4]\n\nIn 1910, she packed a camp bed, stove, lamp, oatmeal and biscuits and travelled to Russian Turkestan. Her journey took her to Constantinople across the Black Sea, through Georgia to the Caspian Sea and onward to Ashkabad and Merv. She travelled by train and boat along the Silk Road, visiting Bukhara, Samarkand, Kokand, and finally  Andhizan.[2]\n\nChristie undertook a further trip to the Russian Empire in 1912. Starting in Saint Petersburg she travelled by train, steamer and droshky to Tashkent, Samarkand and Khiva. She was the first British woman to visit Khiva.[2]\n\nIn 1914, she visited the United States and Cuba.[2] While she was in the United States, she visited her American cousin,  Miss Katherine M. Hill of Baton Rouge, Louisiana, who was also a maiden lady.\n\nChristie kept an account of her travels in her diaries and she was in regular correspondence with her sister. She later wrote about her trips to the Russian Empire in the book Through Khiva to golden Samarkand.[2][3][4]\n\nIn 1916, Christie travelled to France to become the manager of the L'Oeuvre de la Goutte de Café at Bar-sur-Aube. This network of cafés was established by the French and British Red Cross as places for tired soldiers to relax and rest.[5] The café that Christie managed was staffed by five Scottish women and served the soldiers fighting at the Battle of Verdun. From 1918 to 1919 Christie oversaw another 'LOuevre de la Goutte de Café at Mulhouse.[3]\n\nAfter her visit to Japan in 1907 Christie was inspired to create a 7 acres (2.8 ha) Japanese garden at her home at Cowden Castle. She employed Taki Handi, from the Royal School of Garden Design in Nagoya, to help plan and design the garden. The burn on the estate was dammed and a hollow made to create an artificial loch. A pond and island garden was developed along with a stroll garden and a tea-house garden. Plants, shrubs, trees and a traditional stone lantern were imported from Japan. The garden was named Shāh-raku-en meaning a place of pleasure or delight.[2][4][6][7]\n\nChristie was advised on the form, maintenance and development of the garden by Professor Jijo Soya Suzuki, Master of the Soami School of Imperial Design. Suzuki considered the garden to the best Japanese garden in the Western world. Shinzaburo Matsuo lived and worked at Cowden as gardener from 1925 until his death in 1937. Queen Mary visited the garden in the late 1930s.[8][9]\n\nAfter Christie's death in 1949 the garden was maintained by workers on the Cowden estate. In 1963 it was vandalised and the tea-houses and bridges were burned, and the lanterns and shrines knocked into the loch.[6]\n\nIn 2014 Christie's great great niece Sara Stewart started a fundraising campaign to raise £1,000,000 to restore the garden.[4][6][7] The garden opened in 2019.[10]\n\nChristie was a fellow Royal Geographical Society of Scotland, she was a Member of Council and in November 1934 she became a vice-president of the Society.[11][12] She was also a Fellow of the Society of Antiquaries of Scotland.[2]\n\nOn 15 January 1913 the Royal Geographical Society voted to allow women to be elected members of the Society. On 10 February 1913 Christie was in the first cohort of women to be elected Fellows.[13]\n\nChristie died of leukemia on the 29 January 1949 at Strathearn Road, Edinburgh.[2][6]\n\nShe is buried in the Christie family plot at Muckhart churchyard, east of Cowden. Her gardener Matsuo lies just to the south.[14]\n\nChristie authored and co-authored several books about her travels, two of which she wrote with her sister, Alice.[15]\n",
  "concepts": [
    "Ella Christie",
    "christie",
    "garden",
    "cowden",
    "sister",
    "estate",
    "visited",
    "travelled",
    "society",
    "death",
    "japanese"
  ],
  "findings": [
    "Early life",
    "Travels",
    "World War I",
    "Japanese garden at Cowden Castle",
    "Fellowships",
    "Death",
    "Books",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:59:09.298383"
}