{
  "title": "Isaac Hayes",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Isaac_Hayes",
  "content": "Isaac Lee Hayes Jr. (August 20, 1942 – August 10, 2008) was an American singer, songwriter, composer, and actor. He was one of the creative forces behind the Southern soul music label Stax Records in the 1960s,[4] serving as an in-house songwriter with his partner David Porter, \nas well as a session musician and record producer. Hayes and Porter were inducted into the Songwriters Hall of Fame in 2005 in recognition of writing scores of songs for themselves, the duo Sam & Dave, Carla Thomas, and others. In 2002, Hayes was inducted into the Rock and Roll Hall of Fame.[5]\n\n\"Soul Man,\" written by Hayes and Porter and first performed by Sam & Dave, was recognized as one of the most influential songs of the past 50 years by the Grammy Hall of Fame. It was also honored by the Rock and Roll Hall of Fame, Rolling Stone magazine, and the Recording Industry Association of America (RIAA) as one of the Songs of the Century. During the late 1960s, Hayes also began a career as a recording artist. He released several successful soul albums such as Hot Buttered Soul (1969) and Black Moses (1971). In addition to his work in popular music, Hayes worked as a film composer.\n\nHayes wrote the musical score for the film Shaft (1971). For the \"Theme from Shaft,\" he was awarded the Academy Award for Best Original Song in 1972, making him the third black person, after Hattie McDaniel and Sidney Poitier, to win an Academy Award in any competitive field covered by the Academy of Motion Picture Arts and Sciences. Hayes also won two Grammy Awards that same year. Later, he won his third Grammy for his album Black Moses.\n\nIn 1992, Hayes was crowned honorary king of the Ada region of Ghana in recognition of his humanitarian work there.[6] He acted in films and television, such as in the movies Truck Turner (1974), Escape from New York (1981) and I'm Gonna Git You Sucka (1988), and as Gandolf \"Gandy\" Fitch in the TV series The Rockford Files (1974–1980). Hayes also voiced the character Chef in the Comedy Central animated series South Park from its debut in 1997 until his controversial departure in 2006.\n\nOn August 5, 2003, Hayes was honored as a BMI Icon at the 2003 BMI Urban Awards for his enduring influence on generations of musicians.[7] Throughout his songwriting career, Hayes received five BMI R&B Awards, two BMI Pop Awards, two BMI Urban Awards and six Million-Air citations. As of 2008, his songs had generated more than 12 million performances.[8][clarification needed]\n\nIsaac Lee Hayes Jr. was born in Covington, Tennessee,[9] the second child of Eula (née Wade) and Isaac Hayes Sr.[10] After his mother died young and his father abandoned his family, Hayes was raised by his maternal grandparents,[11] Mr. and Mrs. Willie Wade Sr. The child of a sharecropper family, Hayes grew up working on farms in the Tennessee counties of Shelby and Tipton. At age five, Hayes began singing at his local church and he taught himself to play the piano, Hammond organ, flute, and saxophone.[citation needed]\n\nHayes dropped out of high school, but his former teachers at Manassas High School in Memphis encouraged him to complete his diploma, which he did at the age of 21. After graduating from high school, Hayes was offered several music scholarships from colleges and universities. He turned down all of them to provide for his immediate family, working at a meat-packing plant in Memphis by day and playing nightclubs and juke joints several evenings a week in Memphis and nearby northern Mississippi.[11] Hayes's first professional gigs, in the late 1950s, were as a singer at Curry's Club in North Memphis, backed by Ben Branch's houseband.[12]\n\nHayes began his recording career in the early 1960s, as a session musician for acts recorded by the Memphis-based Stax Records.[13] He later wrote a string of hit songs with songwriting partner David Porter, including \"You Don't Know Like I Know,\" \"Soul Man,\"[14] \"When Something Is Wrong with My Baby\" and \"Hold On, I'm Comin'\" for Sam & Dave. Hayes, Porter and Stax studio band Booker T. & the M.G.'s were also the producers for Sam & Dave, Carla Thomas and other Stax artists during the mid-1960s. One of the first Stax records Hayes played on was \"Winter Snow\" by Booker T. and The M.G.s (Stax 45–236), which indicates \"Introducing Isaac Hayes on piano\" on the label.\n\nHayes-Porter contributed to the Stax sound of this period, and Sam & Dave credited Hayes for helping develop both their sound and style. In 1968, Hayes released his debut album, Presenting Isaac Hayes, a jazzy, largely improvised effort that was commercially unsuccessful.[15]\n\nStax then went through a major upheaval, losing its biggest star when Otis Redding died in a plane crash in December 1967, and then losing its back catalog to Atlantic Records in May 1968. As a result, Stax executive vice president Al Bell called for 27 new albums to be completed in mid-1969; Hayes's second album, Hot Buttered Soul was the most successful of these releases.[15]\n\nOn Hot Buttered Soul, Hayes reinterpreted \"Walk On By\" (previously recorded by Dionne Warwick) into a 12-minute exploration. \"By the Time I Get to Phoenix\" starts with an eight-minute-long monologue[16] before breaking into song, and the lone original number, the funky \"Hyperbolicsyllabicsesquedalymistic\" runs nearly ten minutes, a significant break from the standard three-minute soul/pop songs. \"Walk On By\" would be the first of many times Hayes would take a Burt Bacharach standard, generally known as three-minute pop songs by Dionne Warwick or Dusty Springfield, and transform it into a soulful, lengthy and almost gospel number.[citation needed]\n\nIn 1970, Hayes released two albums, The Isaac Hayes Movement and ...To Be Continued. The former stuck to the four-song template of his previous album. Jerry Butler's \"I Stand Accused\" begins with a trademark spoken word monologue, and Bacharach's \"I Just Don't Know What to Do with Myself\" is re-worked.[citation needed] The latter album included \"The Look of Love,\" another Bacharach song transformed into an 11-minute epic of lush orchestral rhythm (mid-way it breaks into a rhythm guitar jam for a couple of minutes before suddenly resuming the slow love song). An edited three-minute version was issued as a single.[17] The album featured the instrumental \"Ike's Mood,\" which segues into a version of \"You've Lost That Loving Feeling.\" Hayes released a Christmas single, \"The Mistletoe and Me\" (with \"Winter Snow\" as a B-side).[citation needed]\n\nIn early 1971, Hayes composed music for the soundtrack of the blaxploitation film Shaft (he appeared in a cameo role as a bartender). The title theme, with its wah-wah guitar and multi-layered symphonic arrangement, would become a worldwide hit single, and spent two weeks at number one in the Billboard Hot 100 in November. The remainder of the album was mostly instrumentals covering big beat jazz, bluesy funk, and hard Stax-styled soul. The other two vocal songs, the social commentary \"Soulsville\" and the 19-minute jam \"Do Your Thing,\" would be edited down to hit singles.[17] He won an \"Academy Award for Best Original Song\" for the \"Theme from Shaft,\" and in addition was nominated for Best Original Dramatic Score. Later in the year, Hayes released a double album, Black Moses, that expanded on his earlier sounds and featured The Jackson 5's song \"Never Can Say Goodbye.\" Another single, \"I Can't Help It,\" was not featured on the album.[citation needed]\n\nIn 1972, Hayes would record the theme tune for the television series The Men and release a hit single (with \"Type Thang\" as a B-side).[17] He released a couple of other non-album singles during the year, such as \"If Loving You Is Wrong (I Don't Want to Be Right)\" and \"Rolling Down a Mountainside.\" Atlantic would re-release Hayes's debut album this year with the new title In The Beginning.[18]\n\nHayes was back in 1973 with an acclaimed live double album, Live at the Sahara Tahoe, and followed it up with the album Joy. He moved away from cover songs with this album. An edited version of the title track would be a hit single.[19]\n\nIn 1974, Hayes was featured in the blaxploitation films Three Tough Guys and Truck Turner, and he recorded soundtracks for both. Tough Guys was almost devoid of vocals and Truck Turner yielded a single with the title theme. The soundtrack score of Truck Turner was eventually used by filmmaker Quentin Tarantino in the Kill Bill film series, and has been used for over 30 years as the opening score of Brazilian radio show Jornal de Esportes on the Jovem Pan station.[citation needed]\n\nUnlike most African American musicians of the period, Hayes did not sport an Afro haircut; his bald head became one of his defining characteristics.[citation needed]\n\nBy 1974, Stax Records was having serious financial problems, stemming from problems with overextension and limited record sales and distribution.[citation needed] Hayes himself was deep in debt to Union Planters Bank, which administered loans for the Stax label and many of its other key employees. In September of that year, Hayes sued Stax for $5.3 million. As Stax was in deep debt and could not pay, the label made an arrangement with Hayes and Union Planters: Stax released Hayes from his recording and production contracts, and Union Planters would collect all of Hayes's income and apply it towards his debts.[citation needed]\n\nHayes formed his own label, Hot Buttered Soul, which released its product through ABC Records.[20] His new album, 1975's Chocolate Chip, saw Hayes embrace the disco sound with the title track and lead single. \"I Can't Turn Around\" would prove a popular song as time went on. This would be Hayes's last album to chart in the top 40 for many years. Later in the year, the all-instrumental Disco Connection album fully embraced disco.[citation needed]\n\nOn July 17, 1974, Hayes, along with Mike Storen, Avron Fogelman, and Kemmons Wilson, took over ownership of the American Basketball Association team the Memphis Tams.[21] The prior owner was Charles O. Finley, the owner of the Oakland A's baseball team. Hayes's group renamed the team the Memphis Sounds. Despite a 66% increase in home attendance, hiring well regarded coach Joe Mullaney and, unlike in the prior three seasons, making the 1975 ABA Playoffs (losing to the eventual champion Kentucky Colonels in the Eastern Division semi-finals), the team's financial problems continued. The group was given a deadline of June 1, 1975, to sell 4,000 season tickets, obtain new investors and arrange a more favorable lease for the team at the Mid-South Coliseum. However, the group did not come through and the ABA took over the team, selling it to a group in Maryland that renamed the team the Baltimore Hustlers and then the Baltimore Claws before the club finally folded during preseason play for the 1975–1976 season.[22]\n\nIn 1976, the album cover of Juicy Fruit featured Hayes in a pool with naked women, and spawned the title track single and the classic \"Storm Is Over.\" Later the same year the Groove-A-Thon album featured the singles \"Rock Me Easy Baby\" and the title track. However, while all these albums were regarded as solid efforts, Hayes was no longer selling large numbers. He and his wife were forced into bankruptcy in 1976, as they owed over $6 million. By the end of the bankruptcy proceedings in 1977, Hayes had lost his home, much of his personal property, and the rights to all future royalties earned from the music he had written, performed, and produced.[23]\n\nIn 1977, Hayes was back with a new deal with Polydor Records, a live album of duets with Dionne Warwick did moderately well, and his comeback studio album New Horizon sold better and enjoyed a hit single \"Out The Ghetto,\" and also featured the popular \"It's Heaven To Me.\" 1978's For the Sake of Love saw Hayes record a sequel to \"Theme from Shaft\" (\"Shaft II\"), but was best known for the single \"Zeke The Freak,\" a song that would have a shelf life of decades and be a major part of the House movement in the UK. The same year, Fantasy Records, which had bought out Stax Records, released an album of Hayes's non-album singles and archived recordings as a \"new\" album, Hotbed, in 1978. In 1979, Hayes returned to the Top 40 with Don't Let Go and its disco-styled title track that became a hit single (U.S. #18), and also featured the classic \"A Few More Kisses To Go.\" Later in the year he added vocals and worked on Millie Jackson's album Royal Rappin's, and a song he co-wrote, \"Deja Vu,\" became a hit for Dionne Warwick and won her a Grammy for best female R&B vocal. Neither 1980s And Once Again or 1981's Lifetime Thing produced notable songs or big sales, and Hayes chose to take a break from music to pursue acting.[citation needed]\n\nIn the 1970s, Hayes was featured in the films Shaft (1971) and Truck Turner (1974); he also had a recurring role in the TV series The Rockford Files as an old cellmate of Rockford's, Gandolph Fitch (who always referred to Rockford as \"Rockfish\" much to his annoyance), including one episode alongside duet-partner Dionne Warwick. In the 1980s and 1990s, he appeared in numerous films, notably Escape from New York (1981), I'm Gonna Git You Sucka (1988), Prime Target (1991), and Robin Hood: Men in Tights (1993), as well as in episodes of The A-Team and Miami Vice. He also attempted a musical comeback, embracing the style of drum machines and synth for 1986s U-Turn and 1988s Love Attack, though neither proved successful. In 1991, he was featured in a duet with fellow soul singer Barry White on White's ballad \"Dark and Lovely (You Over There).\"[citation needed]\n\nIn 1995, Hayes appeared as a Las Vegas minister impersonating himself in the comedy series The Fresh Prince of Bel-Air. He launched a comeback on the Virgin label in May 1995 with Branded, an album of new material that earned impressive sales figures as well as positive reviews from critics who proclaimed it a return to form.[24] A companion album released around the same time, Raw & Refined, featured a collection of previously unreleased instrumentals, both old and new. For the 1996 film Beavis and Butt-Head Do America, he wrote a version of the Beavis and Butt-Head theme in the style of the Shaft theme.[citation needed]\n\nHayes joined the founding cast of Comedy Central's animated TV series South Park. He provided the voice for the character of \"Chef\", the amorous elementary-school lunchroom cook, from the show's debut on August 13, 1997 (one week shy of his 55th birthday), through the end of its ninth season in 2006. The role of Chef combined his work both as an actor and as a singer, thanks to the character's penchant for making conversational points in the form of crudely suggestive soul songs. A song from the series performed by Chef, \"Chocolate Salty Balls (P.S. I Love You),\" received international radio airplay in 1999. It reached number one on the UK singles chart and also on the Irish singles chart. The track also appeared on the album Chef",
  "concepts": [
    "Isaac Hayes"
  ],
  "findings": [
    "Early life",
    "Career",
    "1963–1974: Stax Records and Shaft",
    "1974–1977: HBS, basketball team ownership, and bankruptcy",
    "1977–1995: Polydor, hiatus, and film work",
    "1995–2006: Return to prominence and South Park",
    "2006–2008: Final years",
    "Health problems and death",
    "Legacy",
    "Personal life",
    "Family",
    "Scientology",
    "Charitable work",
    "Discography",
    "Collaborations",
    "Filmography",
    "Awards and nominations",
    "References",
    "Bibliography",
    "External links"
  ],
  "timestamp": "2025-04-11T10:09:17.663925"
}