{
  "title": "Union of Communists",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Union_of_Communists",
  "content": "The All-Union Party «Union of Communists» (SK; Russian: Всесоюзная партия «Союз коммунистов»; СК; Vsesoyuznaya partiya «Soyuz kommunistov», SK) is a communist party created in 1991 in the USSR, operating in the territory of the countries of the former Soviet Union, the second communist party created after the dissolution of the Communist Party of the Soviet Union (CPSU).\n\nA distinctive feature of the SK was that its organizational work from the very beginning was focused not on the formation of its own structures, but on establishing contacts with supporters of the revival of the CPSU.\n\nAs an all-Russian organization, the party was registered by the Ministry of Justice of the Russian Federation on September 29, 1992.\n\nThe party declares the principle of democratic centralism, which provides for the mutual accountability of higher and lower levels, the subordination of the minority to the majority, while maintaining the minority's rights to defend their views and representation in elected bodies.\n\nPrimary organizations, created on the basis of territorial, functional, professional and other characteristics, are the main link of the SK party. Primary organizations are united in regional (district, city, regional, territorial, republican) party organizations in accordance with the administrative-territorial division.\n\nThe supreme body of the All-Union Party Union of Communists is the Congress, which is held at least once every 5 years. The congress is in charge of program and statutory issues, determines the strategy of the party, elects its governing bodies - the Central Committee (CC) and the Central Control Commission (CCC), responsible for carrying out the outlined course and ensuring the unity of the party ranks.\n\nSince 1994, the main press organ of the UK has been the Iskra newspaper.[1] Earlier, the main press organ of the Investigative Committee was the independent communist newspaper Golos Kommunista (Voice of Communist), which was restored in January 1993.[2] While the party was a member of the UCP-CPSU, materials on the activities of the Investigative Committee were periodically printed in the social and political weekly Glasnost.\n\nOn September 7–8, 1991, at a meeting of the Coordinating Council of the Marxist Platform (MP) in the CPSU, by a majority vote, it was decided to create a \"new communist party\" Union of Communists \"(working title)\", the successor to the CPSU, which \"will unite like-minded people on the ideological basis of the Marxist platform\".[3] The Organizing Committee of the \"Union of Communists\" was formed, which included A. Prigarin, V. Isaichikov, O. Melnikov, S. Terekhov, O. Khlobustov.\n\nThe party \"Union of Communists\" announced the need to recreate the CPSU at the founding conference (November 16–17, 1991). At the Plenum of the Central Committee of the CPSU on June 13, 1992, the organizing committee was elected to hold the XX Party Conference of the CPSU and the XXIX Congress of the CPSU\nIt also included two representatives of the party, A. A. Prigarin and S. N. Stepanov.\n\nSince the fall of 1992, work on the reconstruction of the Communist Party of the RSFSR and its organizational structures has been widely deployed both in the center and in the localities. By this time, there were several approaches to the restoration and further development of the Russian Communist Party, one of them in the form of the restoration of the Communist Party of the RSFSR as an integral (regional) part of the CPSU, regardless of the court decision, even if it is not registered, supported by the Bolshevik Platform, the Union of Communists, the recreated Central Committee Komsomol, Informburo MGK KPSU .\n\nIn October 1992, the XX Party Conference of the CPSU took place. It made a decision to prepare the XXIX Congress of the CPSU and re-register the Communists and was held as an event of the \"Union of Communists\".\n\nOn December 12, 1992, a joint plenum of the Central Committee and the Central Control Commission of the \"Union of Communists\" party was held, at which the issues of the current situation in the communist movement of the country, the organizational tasks of the Union of Communists, which considers the task of the Communists - members of the Union of Communists - to actively participate in the work to restore the CP RSFSR and the CPSU, including active work in Moscow in the organizing committees of the XXIX Congress of the CPSU and the II Congress of the Communist Party of the RSFSR.[17]\n\nThe result of the work of the Union of Communists party to rally the communist forces during that period was the holding of the XXIX Congress of the CPSU, which took place in March 1993. And the very first members of the UCP-CPSU were the Union of Communists party, the Union of Communists of Latvia and the Communist Party of South Ossetia. They, according to the Charter of the UCP-CPSU, signed a protocol on joining the UCP-CPSU in April 1993.[18]\n\nThe Union of Communists Party took an active part in defending the Constitutional system of the RSFSR and opposed the coup d'etat. In the events of September–October 1993, hundreds of members of the Union of Communists Party were received, dozens of members of the Union of Communists Party were awarded the Order of the Defender of the Soviets. Courage during these events was shown by the secretaries of the Central Committee of the Union of Communists party V. A. Ershov, V. S. Markov, E. A. Kafyrin, O. Menshikova, S. N. Stepanov, members of the Central Committee V. Bondarenko, M. Kukel, V. A. Shilkin and many other party members.\n\nSergei Stepanov[19] together with Sergei Chernyakhovsky[20] wrote at nine o'clock in the evening on September 21, 1993 at the House of Soviets, a statement on behalf of the Political Executive Committee of the SPK-CPSU regarding the coup d'état committed by Yeltsin. This statement was transmitted to Novaya Square, where the editorial office of the Glasnost newspaper was located.\n\nThe party Union of Communists organized the information center \"Ring of the Federation\", which provided truthful information about the events near the House of the Council in all subjects of the RSFSR. Much credit for this belongs to Elena and Georgy Afanasyev. The Union of Communists Party organized the delivery in September 1993 of food and medicine for the defenders of the House of Soviets. The party has issued and distributed tens of thousands of leaflets.\n\nIn 1996, the People's Patriotic Union of Russia (NPSR) appeared, it was established by the Agrarian Party of Russia, the Communist Party of the Russian Federation, and a number of other communist parties, and among them was the Union of Communists party, as well as a number of other organizations of various kinds, from the party they were members of the Coordination Council of the People's Patriotic Union of Russia Sergey Stepanov and Vladimir Markov.\n\nIn recent years, the party has focused on creating party organizations throughout the entire Soviet Union and providing practical assistance to ordinary citizens (for example, the case of V.D. Zazykina won in 2014). The Union of Communists party also considers the creation and registration in 2011 of the International the public association Union of Communists, which currently exists in Russia, Belarus, Ukraine and a number of CIS republics. There is also an agreement to establish a branch of the International Public Association \"Union of Communists\" in Bulgaria and a number of other countries of Eastern Europe.\n",
  "concepts": [
    "Union of Communists",
    "party",
    "union",
    "communists",
    "union communists",
    "cpsu",
    "communist",
    "committee",
    "communists party",
    "communist party",
    "central"
  ],
  "findings": [
    "Party structure",
    "Party history",
    "Party Congresses and Conferences",
    "Struggle to restore the CPSU",
    "Union of Communists and Black October 1993",
    "The Union of Communists is a participant in the creation of the People's Patriotic Union of Russia",
    "In the 21st century",
    "Prominent party members",
    "Books",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:11.480616"
}