{
  "title": "2021 Women's EuroHockey Championship",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/2021_Women's_EuroHockey_Championship",
  "content": "The 2021 Women's EuroHockey Championship was the 15th edition of the Women's EuroHockey Championship, the biennial international women's field hockey championship of Europe organised by the European Hockey Federation.\n\nThe tournament was held alongside the men's tournament at the Wagener Stadium in Amstelveen, Netherlands and was originally scheduled to take place from 20 to 29 August 2021.[1][2] However, following the postponement of the 2020 Summer Olympics to July and August 2021 because of the COVID-19 pandemic the tournament was rescheduled and takes place from 5 to 13 June 2021.[3]\n\nThe top three teams not already qualified qualified for the 2022 World Cup.[4] The hosts Netherlands won the tournament for the eleventh time, beating Germany 2–0 . Belgium won the bronze medal, defeating Spain with 3–1.[5]\n\nAlong with the hosts, the Netherlands, the top 5 teams at the 2019 EuroHockey Championship which was held in Antwerp from 16 to 25 August 2019 and the top 2 teams from the 2019 EuroHockey Championships II qualified.[1] The numbers in brackets are the pre-tournament world rankings of when the draw was made.[6]\n\nThe pools were announced on 11 May 2020.[3]\n\nAll times are local (UTC+2).[7]\n\nThe points obtained in the preliminary round against the other team will be carried over.\n\nThe following awards were given at the conclusion of the tournament.[5]\n\nThere were 80 goals scored in 20 matches, for an average of 4 goals per match.\n\n8 goals\n\n4 goals\n\n3 goals\n\n2 goals\n\n1 goal\n\nSource: FIH\n",
  "concepts": [
    "2021 Women's EuroHockey Championship"
  ],
  "findings": [
    "Qualification",
    "Squads",
    "Preliminary round",
    "Pool A",
    "Pool B",
    "Fifth to eighth place classification",
    "First to fourth place classification",
    "Semi-finals",
    "Third and fourth place",
    "Final",
    "Statistics",
    "Final standings",
    "Awards",
    "Goalscorers",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:15:57.845169"
}