{
  "title": "Survival (Bob Marley and the Wailers album)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Survival_(Bob_Marley_and_the_Wailers_album)",
  "content": "Survival is the eleventh studio album by Bob Marley and the Wailers, released in 1979.\n\nSurvival is an album with an outwardly militant theme. Some critics speculate that this was due in part to criticism Marley received for the laid-back atmosphere of his previous release, Kaya, which seemed to sidetrack the urgency of his message.[1] In the song \"Africa Unite\", Marley proclaims Pan-African solidarity. The song \"Zimbabwe\" is a hymn dedicated to then white-dominated Rhodesia. The song was performed at Zimbabwe's Independence Celebration in 1980, just after the official declaration of Zimbabwe's independence.\n\nSurvival was originally to be called Black Survival to underscore the urgency of African unity, but the name was shortened to prevent misinterpretations of the album's theme.[1] The album was partially censored in South Africa because of their apartheid regime.[2]\n\nAll tracks are written by Bob Marley, except where noted\nAll tracks are written by Bob Marley, except where noted\nAll tracks are written by Bob Marley, except where noted\nAll tracks are written by Bob Marley, except where noted. Issued by Island Records with a Tuff Gong disc label. Track list revised, all tracks on side A move to side B and vice versa\nAll tracks are written by Bob Marley, except where noted\nThe album's front cover depicts 48 African flags and one Oceanian flag. Zimbabwe (Zimbabwe Rhodesia at the time of the album's release) is represented by two political flags instead of a national flag.\n\n\nFour states already sovereign by the time of the album's release didn't have their flags featured in its cover art, though they were featured in a poster that came with the album:[6]\n\nTwo non-sovereign regions that didn't have their flags included in the cover art are also featured on the poster:\n\nTwo nations' flags are grayed-out and are represented by numbers rather than names on the poster.[7]\n\nThe album's title appears in white (City typeface) with the Brookes slave ship engraving in the background.\n\n* Sales figures based on certification alone.^ Shipments figures based on certification alone.\n",
  "concepts": [
    "Survival (Bob Marley and the Wailers album)",
    "album",
    "marley",
    "tracks",
    "bob marley",
    "bob",
    "zimbabwe",
    "written bob",
    "written",
    "tracks written",
    "noted"
  ],
  "findings": [
    "Track listing",
    "Original Tuff Gong LP",
    "Original Island Records LP",
    "Tuff Gong cassette",
    "Island Records LP re-issue",
    "The Definitive Remastered edition (2001)",
    "Front cover",
    "Personnel",
    "Musicians",
    "Production",
    "Charts",
    "Certifications",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:45.270192"
}