{
  "title": "Blood Street",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Blood_Street",
  "content": "Blood Street is a 1988 action film co-directed by Leo Fong. It stars Fong in a reprised role as private detective Joe Wong who has been hired to find a woman's husband who has gone missing. Richard Norton, Stan Wertlieb, Stack Pierce, Chuck Jeffreys and Kymberly Paige also appear in the film.\n\nJoe Wong was a character that previously appeared in a Leo Fong film, Low Blow. He was a California PI who ran his business out of his shabby unkempt office.[1] Wong returns in this film as one of the best in the business, operating from his base in San Francisco.[2][3][4]  One day a woman walks into Wong's office and asks for his help. She needs him to find her missing husband Aldo. This takes Wong on a journey though the criminal world. Along the way he encounters a father and son team of Solomon and Bones which is played by Stack Pierce and Chuck Jeffreys.[5] Wong ends up getting involved in a gang war between  Malcolm Boyd (played by Richard Norton) and Aldo (played by Stan Wertlieb), the man he was supposed to be looking for.[6]\n\nDue to the recurring character Joe Wong, the film is probably a sequel of sorts to Low Blow where in this film, Fong plays a Raymond Chandler type martial arts expert.[7][8][9] The alternative title Eyes of the Dragon 2 Bloodstreet, could give the impression that it is a possible sequel to another Fong Directed title Eyes of the Dragon, which also featured Richard Norton, Chuck Jeffreys.[10][11]\n\nIt was directed by both Leo Fong and George Chung, and the cinematographer was Frank Harris.[12][13]\n\nThe narration for the film was provided by Leo Fong.[14]\n\nStack Pierce who plays Solomon here,[15] acted in Low Blow and depending on which source, he played either Corky or Duke.[16][17]\n",
  "concepts": [
    "Blood Street"
  ],
  "findings": [
    "Story",
    "Background",
    "Roles and actor info",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:12:51.500050"
}