{
  "title": "Ste. Anne",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Ste._Anne",
  "content": "Ste. Anne, or Sainte-Anne-des-Chênes, is a town in Manitoba, Canada, located about 42 km southeast of Winnipeg. The population was 2,114 in 2016, 1,524 in 2011, and 1,513 in 2011. It is known for being located on the Seine River and at the heart of the Old Dawson Trail. The town is surrounded by the Rural Municipality of Ste. Anne.\n\nOriginally known as \"La Pointe-des-Chênes\", which roughly translates to \"The Point of the Oak Trees\", Ste. Anne was the first parish established in the area, dating back to 1856, when the territory was a part of Rupert's Land. The early settlers, French-speaking Habitants from Canada East, arrived looking for farmland. The first 198 families in the community busied themselves with their first major industry, supplying lumber for the construction of the St. Boniface Cathedral. The Hudson's Bay Company also had a strong presence in the community in the 1800s. Ste. Anne served as a stopover for weary travelers on their journey to Winnipeg, along the famed Dawson Trail.\n\nIn June 1959, Ste. Anne experienced the worst flood in its history. Water rose at a rate visible by eye, and the Ste. Anne Hospital was evacuated. In 1960, the Seine River diversion project was completed to prevent future floods.\n\nSte. Anne is situated just east of the longitudinal centre of Canada (near the geographical centre of North America), and approximately 80 kilometres (50 mi) north of the border with the United States. It is near the eastern edge of the Canadian Prairies. It is surrounded by rich agricultural land to the west, and the boreal forest to the east. The Seine River runs through the middle of town. The tree-lined river is very picturesque and gives the area a beautiful naturalist look. The closest urban area with over 500,000 people is Winnipeg, approximately 40 kilometres (25 mi) west of Ste. Anne.\n\nSte. Anne has an extreme continental climate (Köppen climate classification Dfb). Ste Anne is approximately 250 kilometres (160 mi) northwest of International Falls, Minnesota, which according to USA Today is the coldest place in the continental USA. Summers are short and warm, with only three months (June to August) when the average high temperature exceeds 25 °C (68 °F). Even during the summer months, evening and night temperatures are quite cool, for example the average low in July is 13 °C (55 °F). Spring and autumn are highly variable seasons, but generally very cool. On average there are only 110 frost-free days per year. Winters are best described as extremely long and bitterly cold, with snow cover generally from November to March. According to Environment Canada, the daily average high temperatures range from -13 °C (9 °F) to 26 °C (79 °F), and average low temperatures range from -23 °C (-9 °F) to 13 °C (55 °F). The weather is characterized by an abundance of sunshine throughout the year. July is the sunniest month, and November the least sunny.\n\nIn the 2021 Census of Population conducted by Statistics Canada, Ste. Anne had a population of 2,891 living in 1,151 of its 1,204 total private dwellings, a change of 36.8% from its 2016 population of 2,114. With a land area of 4.14 km2 (1.60 sq mi), it had a population density of 698.3/km2 (1,808.6/sq mi) in 2021.[2]\n\nSte. Anne is located 40 kilometres (25 mi) from Winnipeg. This distance is covered by a four-lane divided highway (Highway 12 and the Trans-Canada Highway). Highway 12 connects Ste. Anne with the United States border, as well as the Trans-Canada Highway.  Two secondary roads, Provincial Roads 207 and 210 pass through town as Avenue Centrale Avenue.  PR 207 is a part of the Old Dawson Trail, one of the earliest roads that linked Manitoba with Northwestern Ontario.\n\nWinnipeg's James Armstrong Richardson International Airport is 60 kilometres (37 mi), or less than a one-hour drive, from Ste. Anne.\n\nThe largest employers in Ste. Anne are in the health and education services sector. The town boasts a senior's care home that houses 150 residents. The Ste. Anne Hospital serves the town and the surrounding area, and provides emergency medical services 24-hours a day. A medical clinic in the town also has ten doctors on staff, and an onsite pharmacy. The Seine River School Division #14 has its administration building in Ste. Anne. Most other businesses in Ste. Anne provide retail goods and services to the town's residents and those in the surrounding community.\n\nSte. Anne has four schools: Ste. Anne Elementary (English, K to grade 8), Ste. Anne Immersion (French immersion, K to grade 8) opened in 1994, Ste. Anne Collegiate (English, Grade 9 to 12), and Ecole Pointe-des-Chênes (French, K to grade 12). French immersion students wishing to continue in French immersion usually attend Collège Lorette Collegiate, approximately 20 kilometres west of Ste. Anne.\n\nSte. Anne Hospital was opened in 1954. The hospital is currently a 21-bed, acute-care facility serving the residents of Ste. Anne and the region. Recent investments in Ste. Anne Hospital include a $1.5-million project for safety and security upgrades including the relocation of the nursing station and the creation of two new birthing rooms. In October 2007, the Health Minister of Manitoba announced that more than $6 million will be invested in renovations to the Ste. Anne Hospital to increase the number of surgical suites and establish a post-anesthetic care unit. Renovations are scheduled to be completed by 2010.\n\nFor senior citizens, Ste. Anne has the Villa Youville, which combines a personal care home with an 85-suite seniors housing complex. The francophone facility is located in a park-like setting on the banks of the Seine River.\n\nThe Centre Medicale Seine has a staff of doctors and a lab. A pharmacy is also located within the clinic. Seine River Dental Centre is located across the street from the medical centre.\n\nHomes in Ste. Anne range from mobile homes to houses. Ste. Anne also has apartment buildings, including a 28-unit apartment project for those with lower-incomes and those with mental health-care needs. The project, led by the Ste. Anne Knights of Columbus Council, was supported by funding from the Canada-Manitoba Affordable Housing Initiative, and by land donated by the town.\n\nSte. Anne has two churches. The Ste. Anne Catholic Church (opened in 1898) is a town landmark. Masses are held in French and English. The church interior was completely renovated in 2007. Ste. Anne also has the Dayspring Fellowship Church, with services in English.\n\nSte. Anne has a public library constructed from a donated residence, whose character is still evident in the architecture of the building (the children's section used to be a kitchen).\n\nThe town has a volunteer fire department that serves the surrounding municipality and the municipality of Taché. The municipality of Taché also helps out Ste. Anne when it needs aid.\n\nThe town has its own municipal police force, the Sainte-Anne Police Service.\n\nSte. Anne plays host to Dawson Trail Days held during the September long weekend. It is a celebration of the area's heritage and the history of the Dawson trail. Many activities are planned each year, and the event serves as a windup for local residents after an enjoyable summer.\n\nSte. Anne features a splash pad that opened in 2016 in the Parc des Redemptoristes, a skateboard park that opened in 2016 on Arena Road, and numerous soccer and baseball fields.\n\nThe Parc des Redemptoristes is situated beside the Seine River in the center of town.\n\nIce hockey and curling are the favourite sports in Ste. Anne. The town has an ice-skating arena and curling rink. The Ste. Anne Aces, an ice hockey team, play in the Carillon Senior Hockey League. Soccer and Baseball are also popular and growing sports in this town.\n\nIn March 2009, three natives of Ste. Anne competed in the NCAA Women's Frozen Four. Known colloquially as the Ste. Anne Three, Bailey Bram, representing the Mercyhurst Lakers women's ice hockey program, Jocelyne Larocque of the Minnesota Duluth Bulldogs women's ice hockey program, and Melanie Gagnon, senior captain of the Minnesota Golden Gophers women's ice hockey program, competed in the event.[3]\n\nThe Mayor of Ste. Anne is Yvan St. Vincent. Other members include Councillors Cornie Klassen, Jason Einarson, Jeremy Wiens, Lyle Davis and Chief Administrative Officer, Marc Darker.[4][5]\n",
  "concepts": [
    "Ste. Anne",
    "anne",
    "ste anne",
    "ste",
    "town",
    "seine",
    "river",
    "canada",
    "seine river",
    "mi",
    "located"
  ],
  "findings": [
    "History",
    "Geography and climate",
    "Demographics",
    "Infrastructure and public services",
    "Transportation",
    "Economic base",
    "Education",
    "Health care",
    "Housing",
    "Churches",
    "Services",
    "Attractions",
    "Festivals",
    "Outdoor activities",
    "Sports",
    "Town Council members",
    "Notable people",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:45.220453"
}