{
  "title": "John Calvin's view of Scripture",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/John_Calvin's_view_of_Scripture",
  "content": "John Calvin believed that Scripture is necessary for human understanding of God's revelation, that it is the equivalent of direct revelation, and that it is both \"majestic\" and \"simple.\" Calvin's general, explicit exposition of his view of Scripture is found mainly in his Institutes of the Christian Religion.[1]\n\nCalvin viewed Scripture as necessary in two ways. First, he held that general revelation cannot in itself give humanity a saving knowledge of God. Although he can be known in some ways through creation he has \"added the light of his Word in order that he might make himself known unto salvation.\"[2] Calvin compares Scripture to being like a pair of spectacles, that enable us to properly interpret what we see in creation:[3]\n\nFor as the aged, or those whose sight is defective, when any book, however fair, is set before them, though they perceive that there is something written, are scarcely able to make out two consecutive words, but, when aided by glasses, begin to read distinctly, so Scripture, gathering together the impressions of Deity, which, till then, lay confused in our minds, dissipates the darkness, and shows us the true God clearly.[2]\n\nSecond, Calvin held that inscripturation is necessary to avoid the errors inherent in oral transmission:[4]\n\nFor if we reflect how prone the human mind is to lapse into forgetfulness of God, how readily inclined to every kind of error, how bent every now and then on devising new and fictitious religions, it will be easy to understand how necessary it was to make such a depository of doctrine as would secure it from either perishing by the neglect, vanishing away amid the errors, or being corrupted by the presumptuous audacity of men.[5]\n\nCalvin viewed Scripture as being equivalent to an utterance of God given from heaven:[6]\n\nSince no daily responses are given from heaven, and the Scriptures are the only records in which God has been pleased to consign his truth to perpetual remembrance, the full authority which they ought to possess with the faithful is not recognised, unless they are believed to have come from heaven, as directly as if God had been heard giving utterance to them.[7]\n\nAccording to Calvin, Word and Spirit must always go together.[8] Scripture gives us a saving knowledge of God, but only when its certainty is \"founded on the inward persuasion of the Holy Spirit.\"[9] It is \"foolish to attempt to prove to infidels that the Scripture is the Word of God,\" since this can only be known by faith.[9] Nevertheless, he did see a place for evidences of Scripture's authority, as long it is recognised that they are secondary:\n\nThe human testimonies which go to confirm it will not be without effect, if they are used in subordination to that chief and highest proof, as secondary helps to our weakness.[9]\n\nThe \"chief and highest proof\" being, of course, the testimony of the Holy Spirit,[10] though Calvin does not say that the inward testimony of the Holy Spirit is the source of this authority. John Murray has suggested that the distinction between the authority intrinsic to Scripture, and our persuasion that it is authoritative is not \"as clearly formulated in Calvin as we might desire.\"[11]\n\nCalvin viewed Scripture as being both majestic[12] and simple.[13] According to Ford Lewis Battles, Calvin had discovered that \"sublimity of style and sublimity of thought were not coterminous.\"[14]\n\nCalvin believed that Scripture possesses \"a divine majesty which will subdue our presumptuous opposition, and force us to do it homage.\"[15] It speaks with a unified voice, and its parts make up a perfect harmony:\n\nHow admirably the system of divine wisdom contained in it is arranged—how perfectly free the doctrine is from every thing that savours of earth—how beautifully it harmonises in all its parts—and how rich it is in all the other qualities which give an air of majesty to composition.[16]\n\nScripture, according to Calvin, also has an \"unpolished simplicity\". It is not particularly eloquent, for that would detract from its message:\n\nThe sublime mysteries of the kingdom of heaven have for the greater part been delivered with a contemptible meanness of words. Had they been adorned with a more splendid eloquence, the wicked might have cavilled, and alleged that this constituted all their force. But now, when an unpolished simplicity, almost bordering on rudeness, makes a deeper impression than the loftiest flights of oratory, what does it indicate if not that the Holy Scriptures are too mighty in the power of truth to need the rhetorician’s art?[16]\n",
  "concepts": [
    "John Calvin's view of Scripture"
  ],
  "findings": [
    "Necessity",
    "Authority",
    "Character",
    "Majesty",
    "Simplicity",
    "See also",
    "References",
    "Citations",
    "Sources"
  ],
  "timestamp": "2025-04-11T10:12:36.746136"
}