{
  "title": "Thomas Bancroft (priest)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Thomas_Bancroft_(priest)",
  "content": "Thomas Bancroft (1756–1811), was a vicar of Bolton-le-Moors in Lancashire, England.\n\nBancroft was the son of Thomas Bancroft, a thread-maker, was born in Deansgate, Manchester. At the age of six he was admitted to the Manchester Grammar School, where, in course of time, he became a teacher. He held a school exhibition from 1778 to 1781, and graduated B.A. at Brasenose College, Oxford, 10 October 1781. In 1780 he obtained the Craven scholarship; in the same year he assisted in correcting the edition of Homer published by the Clarendon Press, and further helped Dr. Falconer in correcting an edition of Strabo.[1]\n\nUnable to win a fellowship at Oxford, Bancroft returned to Manchester grammar school as assistant master, and remained there until he was appointed head-master of King Henry VIII's school at Chester. 'Towards the end of last century,’ writes Dr. Ormerod, 'the school attained a considerable degree of classical celebrity under the direction of the late Rev. Thomas Bancroft, afterwards vicar of Bolton-le-Moors in Lancashire. Plays were occasionally performed by the boys, and a collection of Greek, Latin, and English exercises, partly written by the scholars and partly by Mr. Bancroft, was published at Chester (1788) under the title of \"Prolusiones Poeticæ\"’.[2][1]\n\nIn 1793 Bancroft was presented by William Cleaver to the living of Bolton-le-Moors, then worth about £250 a year. In 1798 Bancroft was made chaplain to the Bolton volunteers by royal warrant, and four years previously he had been appointed domestic chaplain to Viscount Castle-Stewart. He was made one of the four \"king's preachers\" allowed to the county of Lancaster by Henry Majendie, bishop of Chester, in 1807.[1]\n\nBancroft was a magistrate, and a loyalist vehemently opposed to political change whose views were apparent in his sermons.[3] He remained as vicar of Bolton until his death on 5 February 1811. There was a tablet to his memory in the parish church.[1]\n\nBancroft published sermons, the 'Prolusiones' already mentioned, and wrote three dissertations (Oxford, 1835). Two tracts, 'The Credibility of Christianity vindicated,’ Manchester, 1831, and 'The Englishman armed against the Infidel Spirit of the Times,’ Stockport, 1833, were privately printed for his son-in-law, J. Bradshaw Isherwood. There remain several of his manuscripts in possession of the family of Major Fell, of Bolton, who married one of Bancroft's granddaughters.[1]\n\nWhile at the King's School in Chester, Bancroft married Miss Bennett, of Willaston Hall, against the wishes of her father, a wine merchant in Chester. Her father prevented an attempted elopement by stabbing his sword into Bancroft's leg, and he had to pay Bancroft £1,000 compensation. The marriage took place in defiance of the father, who was never reconciled to his daughter. He bequeathed, however, £1,000 each to her two daughters.[1]\n",
  "concepts": [
    "Thomas Bancroft (priest)",
    "bancroft",
    "school",
    "bolton",
    "chester",
    "manchester",
    "vicar bolton",
    "vicar",
    "thomas bancroft",
    "thomas",
    "published"
  ],
  "findings": [
    "Life",
    "Works",
    "Family",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T17:32:49.576889"
}