{
  "title": "Sev (band)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Sev_(band)",
  "content": "Sev was a rock band from the Northern Virginia area who appeared in a national advertising campaign for Pepsi Blue. Sev also appeared on the website come-alive show Farmclub and performed at HFStival, the summer festival in the Washington D.C. area that typically sets off the summer concert season. In the two decades since then, the band has toured North America and shared the stage with dozens of other local bands and platinum–selling artists of the era, including Dr. Dre, Snoop Dogg, Ice Cube, 311, Red Hot Chili Peppers, Incubus, Kid Rock, Avril Lavigne, and Korn. They endured member changes, secured deals with two major record labels, and performed on national TV shows and television commercials. In 2006, the band parted ways and scattered across the country.\n\nThe D.C. area band SEV played their first show on October, 27th 1996. SEV's catalyst, guitarist Max Alley, wrote the music for the band's first album Sunflower with bassist Will Mazur and drummer Dennis Fay. The trio quickly identified vocalists Danny Schools and Phil Clayman from other local projects and were soon selling out shows at local venues. The combination of metal, rap, pop, and electronic music, mixed with their signature high-energy shows, made every performance a unique experience. SEV gained the attention of the Mid-Atlantic music scene by winning the “Big Break” contest hosted by at-the-time alternative rock radio station 99.1 WHFS. They opened the 1999 HFStival with a performance on the Street Stage.\n\nTheir rising success garnered the attention of several national record labels, and the band originally signed with the Interscope/Universal joint venture Farmclub in 2000 with record industry moguls Jimmy Iovine and Doug Morris. On the show, Sev performed the songs \"Stand Straight\" and \"Same Old Song\". \"Stand Straight\" became Sev's first national single on Farmclub compilations, but not as an official single from the band. Sev immediately went into the studio in 2000 to capitalize on their sudden success. However, the label closed its doors in 2001 and the band subsequently signed with Geffen and released their debut album, All These Dreams, in 2002. Geffen, not having an interest in the band, took two years to release All These Dreams. Once the album finally came out in 2002, Geffen announced it had no other plans for the band and stopped all communication. Despite that, the success of their first single, \"Same Old Song\", caught the attention of Pepsi and the band filmed a commercial for the launch of Pepsi Blue. \"Same Old Song\" would eventually chart, peaking at No. 25 on the Billboard Hot Singles Sales chart.[1] A few songs from All These Dreams appeared on the extreme stunt DVD series by Adrenaline Crew. \n\nSoon after, the band's original bassist was replaced in 2003 by Chris Mullen, and then Tim Pryor. Later, drummer Matt Hughes was brought in, having been in another band with Tim. Throughout all of the ups and downs, one thing has remained consistent: the band's intense drive to deliver high-energy shows to their fans.\n\nA follow-up album was in the works but never came to be. Some of the songs from this era can be downloaded for free at the band's website.[2] The band experienced several lineup changes and then eventually became inactive in 2006.[3]\n\nTheir former manager and event producer, Eddie Fam of IMPACT Collective, has brought together four of the five original band members for a reunion concert as a way to raise funds for at-risk youth in DC, Virginia, Haiti, and Africa. April 27th, 2019 will be the band's first show together in 12 years and this performance will help provide medical access, education, food provision, and music programs through Meant 2 Live Foundation.\n\nAll These Dreams CD / LP (Geffen, 2002)\n\nBack Rider CD / LP (1998)\n\nSunflower CD / LP (1996)\n",
  "concepts": [
    "Sev (band)",
    "band",
    "sev",
    "shows",
    "national",
    "music",
    "geffen",
    "dreams",
    "album",
    "success",
    "songs"
  ],
  "findings": [
    "Biography",
    "Early years",
    "Rise",
    "Final years",
    "Reunion",
    "Members",
    "Original members",
    "Later members",
    "Discography",
    "Albums",
    "Singles",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:42.193168"
}