{
  "title": "Gaius Lutatius Catulus (consul 242 BC)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Gaius_Lutatius_Catulus_(consul_242_BC)",
  "content": "Gaius Lutatius Catulus (fl. 242–241 BC) was a Roman statesman and naval commander in the First Punic War.[1] He was born a member of the plebeian gens Lutatius. His cognomen \"Catulus\" means \"puppy\". There are no historical records of his life prior to consulship, but his career probably followed the standard cursus honorum, beginning with service in the cavalry and continuing with the positions of military tribune and quaestor.\n\nHe was elected as a consul in 242 BC, a novus homo. His colleague as consul was Aulus Postumius Albinus. In addition to the consulship Postumius held the position of Flamen Martialis, and for this reason the pontifex maximus Lucius Caecilius Metellus forbade him from leaving the city. Lutatius was therefore the only candidate for commanding the war in Sicily. The senate appointed the praetor Quintus Valerius Falto as his second-in-command. This was somewhat of a novelty, since a second praetorship was created only a few years earlier, thereby allowing one of the praetors to leave Rome. Typically the two consuls shared the command of the army.\n\nUpon assuming command Lutatius and Valerius embarked for Sicily. Lutatius had the command of both legions and a new fleet. This fleet was funded by donations from wealthy citizens as the prolonged war had left the public treasury virtually empty. The degree to which Lutatius was involved with the construction of the fleet is unknown. No decisive action in the war was taken in 242 BC. His brother, Quintus Lutatius Cerco, was elected consul in the following year (and censor in 236 BC), but Lutatius and Valerius were granted proconsulship and propraetorship, respectively, allowing them to continue leading the military efforts against Carthage.\n\nIn 241 BC, Carthage sent a large fleet commanded by an admiral called Hanno to Sicily with dual purpose of regaining naval supremacy and resupplying Hamilcar and their besieged garrisons in Sicily. A wound prevented Lutatius from commanding the fleet in the ensuing Battle of the Aegates personally, and so the command passed to Valerius. The battle ended in decisive Roman victory. Carthage, unable to fund a replacement fleet, was forced to negotiate a peace treaty favorable to the Romans with Lutatius. Lutatius' original treaty was rejected by the Senate, a commission of 10 senators negotiated an even stricter treaty which still bore Lutatius' name.[2] Both Lutatius and Valerius were awarded a triumph by the senate. To celebrate his victory, Lutatius built a temple to Juturna in Campus Martius, in the area currently known as Largo di Torre Argentina. There is no historical record of his subsequent life or career.\n\nGaius Lutatius Catulus is also the main character of Finnish writer Jukka M. Heikkilä's book Merikonsuli (\"The Marine Consul\").\n",
  "concepts": [
    "Gaius Lutatius Catulus (consul 242 BC)",
    "lutatius",
    "fleet",
    "valerius",
    "command",
    "bc",
    "war",
    "sicily",
    "consul",
    "treaty",
    "senate"
  ],
  "findings": [
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:21.539203"
}