{
  "title": "Costa Victoria",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Costa_Victoria",
  "content": "Costa Victoria was a Victoria-class cruise ship launched in 1995 and operated by Costa Cruises, a subsidiary of Carnival Corporation & plc, from 1996 until 2020. Built at Bremen, Germany, she was designed to reflect the spirit of Italy, which was enhanced in a 2013 refit. During her service with Costa she operated in many areas, including Asia. In June 2020, in light of the economic impact caused by the COVID-19 pandemic, Costa Victoria was moved to the Port of Piombino, Italy and decommissioned. She was sold in December 2020 for possible conversion to worker's accommodation at a Genoa shipyard, but resold for demolition in Turkey, where she arrived on 28 January 2021.\n\nCosta Victoria was the first of two Victoria-class cruise ships ordered by Costa Cruises from the German shipyard Bremer Vulkan as their yard number 107[2] (the second was intended to become Costa Olympia, but was completed as Norwegian Cruise Line's Norwegian Sky).[a] Costa Victoria was launched on 2 September 1995 and delivered on 15 July 1996.[2] She was 252.9 m (829 ft 9 in) in length with a 36.1 m (118 ft 5 in) beam, had fourteen decks and was measured at 75,166 gross tonnage (GT). She had a diesel-electric power plant, which gave her an operating speed of up to 24 knots (44 km/h; 28 mph).[2]\n\nThe last new acquisition before Costa Cruises was taken over by Carnival Corporation and Airtours plc in 1997, Costa Victoria entered service in mid-1996 with a capacity for 2,394 passengers.[5] \nIn 2004, the ship underwent an extensive refit, which included balconies being added to 246 cabins. Costa Victoria underwent an additional refit in November 2013, in which public rooms were modernized and staterooms were remodeled to have a more \"Italian\" design.[6]\n\nCosta Victoria hosted athletes for Universiade event at Naples in July 2019 with over 1,900 athletes and 38 national delegations worldwide were accommodated to aboard the ship.[7]\n\nDuring the COVID-19 pandemic, after the ship left Dubai on 7 March 2020, a female Argentine national tested positive after she had disembarked in Crete. 726 passengers on the ship were quarantined.[8] The ship did not dock at Venice, her final destination, or nearby Trieste,[9] and passengers ultimately departed the ship after she docked in Civitavecchia on 25 March.[8][10] On 4 May 2020, a 69-year-old woman linked to the ship died from the coronavirus, while her husband was also infected.[11]\n\nIn April 2018, the ship sailed in Asia, including China, and in summer 2018, the Mediterranean.[12] In November 2019, the ship sailed cruises from Mumbai to the Maldives[13] and fortnightly cruises to Sri Lanka.[14] Costa Victoria was set to sail from Aqaba from October 2019 to 2020,[15] but due to the COVID-19 pandemic, Costa's operations were suspended and her planned sailings were cancelled prior to her ultimate departure from the fleet.[16]\n\nShe docked in Civitavecchia to disembark her final passengers on 25 March 2020. On 19 June, Costa sold Costa Victoria to Cantiere Navale San Giorgio del Porto SpA for possible conversion to an accommodation vessel for their shipyard workers in Genoa or, otherwise, for scrapping.[17][18] On 23 June she was transferred to subsidiary Genova Trasporti Marittimi and berthed in Piombino.[19][20]\n\nOn 13 January 2021, renamed St. Victoria, the ship left Piombino in towed of the tug VOS Chablis, to Aliağa, Turkey, for demolition and was beached on 28 January. Scrapping began in March.[21][22]\n",
  "concepts": [
    "Costa Victoria"
  ],
  "findings": [
    "Design and construction",
    "Costa Cruises service",
    "Deployments",
    "Sale and scrapping",
    "Notes",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:14:14.396151"
}