{
  "title": "1977–78 AHL season",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/1977–78_AHL_season",
  "content": "The 1977–78 AHL season was the 42nd season of the American Hockey League. The season was in jeopardy when the last of the original eight franchises of the \"International-American Hockey League\", the Rhode Island Reds (previously Providence Reds) folded in the offseason, and the AHL was left with five teams. The league increased its member teams by four, when the North American Hockey League and Southern Hockey Leagues both folded before the 1977–78 season. Two teams joined from the NAHL, and another from the SHL, along with one expansion team.\n\nNorth and south divisions were resumed. The F. G. \"Teddy\" Oke Trophy resumes as the regular season championship trophy for the north division, and the John D. Chick Trophy resumes as the regular season championship trophy for the south division. The Fred T. Hunt Memorial Award is first awarded to the player best exemplifying sportsmanship, determination and dedication to hockey.\n\nNine teams were scheduled to play 80 games each, however the Hampton Gulls folded on February 10, 1978, playing 46 games. The Maine Mariners finished first overall in the regular season, and won the Calder Cup championship as a first year expansion team.\n\nNote: GP = Games played; W = Wins; L = Losses; T = Ties; GF = Goals for; GA = Goals against; Pts = Points;\n\n†Suspended operations.\n\nNote: GP = Games played; G = Goals; A = Assists; Pts = Points; PIM = Penalty minutes\n",
  "concepts": [
    "1977–78 AHL season",
    "season",
    "hockey",
    "trophy",
    "teams",
    "league",
    "games",
    "regular season",
    "regular",
    "north",
    "hockey league"
  ],
  "findings": [
    "Team changes",
    "Final standings",
    "Scoring leaders",
    "Calder Cup playoffs",
    "Trophy and award winners",
    "See also",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:24.921458"
}