{
  "title": "Newmarket, Queensland",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Newmarket,_Queensland",
  "content": "Download coordinates as:\n\nNewmarket is a north-west suburb in the City of Brisbane, Queensland, Australia.[3] In the 2021 census, Newmarket had a population of 5,083 people.[1]\n\nNewmarket is located approximately 5.1 kilometres (3.2 mi) by road from the Brisbane CBD.[4]\n\nIt is an older, mostly residential suburb containing pre-war and post-war homes, including many fine examples of the Queenslander style of home.  Over the last few years, some medium-density townhouses and unit blocks have appeared as well.[citation needed]\n\nNewmarket was originally known as \"The Three Mile Scrub\" due to its distance from the city, and Ashgrove Avenue, which links Enoggera Road with Waterworks Road to the west, was known as Three Mile Scrub Road. As Brisbane continued to grow northward along Kelvin Grove Road, in about 1880 it was decided to relocated Brisbane's livestock saleyards from Normanby to an outer location, the area now bordered by Enoggera Road, Newmarket Road, Wilston Road and Alderson Street. This area became known as the \"new market\" given the suburb its name.[3] The new sale yards were serviced by Newmarket railway station after the rail line was extended from Mayne Junction in 1899.[citation needed]\n\nIn 1900, local residents were agitating to have the Kelvin Grove tramway extended along Enoggera Road to the Newmarket Hotel. However, a new bridge over Enoggera Creek would be required.[5] Also there were concerns that the close proximity of the proposed tramway would take revenue away from the railway line.[6] However these concerns were resolved and the tramway extension to the Newmarket Hotel was opened on Monday 27 July 1903.[7]\n\nOn 20 April 1901, Bishop William Webber laid the foundation stone of St James' Anglican Church. The church was designed by architects John H. Buckeridge and Hall & Dods and built by G. Marshall and could seat 120 people.[8] It was dedicated on Sunday 20 July 1901 by Bishop Webber.[9] It is located at 58 Enoggera Road (27°26′22″S 153°00′24″E﻿ / ﻿27.4395°S 153.0067°E﻿ / -27.4395; 153.0067﻿ (St James' Anglican Church)).[10]\n\nNewmarket State School opened on 4 July 1904.[11]\n\nThe Newmarket Brickworks were constructed in Mina Parade in 1912 with a chimney over 50 metres (160 ft) tall. The brickwords were demolished in 1987 but the Newmarket Brickworks chimney remains and is now heritage-listed. However, due to changes in the suburb boundaries, the chimney is now officially in the neighbouring suburb of Alderley.[12]\n\nThe Ruby Estate, Kelvin Grove (now known as Newmarket), being re-subdivision of subdivision 43 of suburban portion, 25 parish of Enoggera were auctioned on site by G.T Bell Auctioneer on 22 August 1914, at 3pm. The terms of the sale required a £2 deposit and £1 per month per lot with the interest rate at 5%. The 22 building sites situated between Foster street and Ruby street, Kelvin Grove (Newmarket) Brisbane, were advertised as consisting of 16 perches and two minutes from the Kelvin Grove tram terminus. The original advertisement showed that between blocks 2 and 3 held a house on site, for removal.[13][14] The following Monday 24 August 1914, it was published in The Telegraph newspaper, that 16 allotments of the Ruby Estate, Kelvin Grove (Newmarket) were sold during the auction.[15]\n\nIn about March 1918, a block of land was purchased for £100 to build a Baptist church in Newmarket/Grange.[16][17][18][19] The church opened on Saturday 21 June 1919.[20] The church was at 197 Wilston Road (corner of Carberry Street) in the suburb of Grange and is known as Grange Baptist Church.[21][22][23]\n\nThe sale of the McCook Estate, at the time part of the suburb Kelvin Grove, now Newmarket, by Auctioneers, Martin Snelling & Co, occurred on 3 March 1928 at 3 pm on the grounds. It was offered again for sale by auction on 14 April 1928.[24] The Estate comprised 19 splendid business and residential sites, located on the corner of Kelvin Grove Road and Parker street and backing onto Foster street. The advertisement stressed the convenience of location on the tram-line, within 15 minutes ride to the GPO and close to the shopping centre, picture theatre, churches and state schools.[25]\n\nAs urban development continued in Newmarket, the saleyards were moved to Cannon Hill in 1931.[26] Evidence of the saleyards can still be seen in a number of narrow laneways including one known as Saleyards Lane, most likely old cattle tracks between stockyards, that still exist in this neighbourhood.\n\nSt Ambrose's Catholic School opened in 1936.[27][28]\n\nNewmarket State High School opened on 29 January 1963 and closed on 13 December 1996.[11][29] it was located immediately west of Newmarket State School, extending from Brent Street south towards Banks Street (27°25′55″S 153°00′08″E﻿ / ﻿27.4319°S 153.0022°E﻿ / -27.4319; 153.0022﻿ (Newmarket State High School (former))). The school's site has been redeveloped for housing with the creation of Nelson Place, Laurence Street, and Daniel Place.[30][31]\n\nUntil December 1968 trams operated by the Brisbane City Council plied along Enoggera Road.  A former tramway electrical substation still stands on the corner of Kate Street and Enoggera Road and has been transformed into a contemporary dwelling.[citation needed]\n\nIn the 2011 census, the population of Newmarket was 4,444, 51.8% female and 48.2% male. The median age of the Newmarket population was 32 years of age, 5 years below the Australian median. 76% of people living in Newmarket were born in Australia, compared to the national average of 69.8%; the next most common countries of birth were England 3.4%, New Zealand 2.6%, India 1.9%, China 1.2%, Korea, Republic of 0.7%. 85.6% of people spoke only English at home; the next most common languages were 1.1% Mandarin, 1% Italian, 0.7% Cantonese, 0.7% Spanish, 0.6% Korean.[32]\n\nIn the 2016 census, Newmarket had a population of 4,979 people.[33]\n\nIn the 2021 census, Newmarket had a population of 5,083 people.[1]\n\nNewmarket has a number of heritage-listed sites, including:\n\nNewmarket State School is a government primary (Prep-6) school for boys and girls at 15 Banks Street (27°25′56″S 153°00′14″E﻿ / ﻿27.4322°S 153.0040°E﻿ / -27.4322; 153.0040﻿ (Newmarket State School)).[53][54] In 2017, the school had an enrolment of 263 students with 26 teachers (17 full-time equivalent) and 17 non-teaching staff (10 full-time equivalent).[55] In 2018, the school had an enrolment of 279 students with 26 teachers (18 full-time equivalent) and 17 non-teaching staff (10 full-time equivalent).[56]\n\nSt Ambrose's Primary School is a Catholic primary (Prep-6) school for boys and girls at 23 Davidson Street (27°26′26″S 153°00′21″E﻿ / ﻿27.4405°S 153.0059°E﻿ / -27.4405; 153.0059﻿ (St Ambrose's Primary School)).[53][57] In 2017, the school had an enrolment of 273 students with 20 teachers (16 full-time equivalent) and 13 non-teaching staff (7 full-time equivalent).[55] In 2018, the school had an enrolment of 254 students with 20 teachers (16 full-time equivalent) and 11 non-teaching staff (7 full-time equivalent).[56]\n\nBrisbane Urban Environmental Education Centre is an Outdoor and Environmental Education Centre at 15 Banks Street (27°25′54″S 153°00′17″E﻿ / ﻿27.4318°S 153.0048°E﻿ / -27.4318; 153.0048﻿ (Brisbane Urban Environmental Education Centre)).[53][58]\n\nThere are no secondary schools in Newmarket. The nearest government secondary school is Kelvin Grove State College in neighbouring Kelvin Grove to the south.[31]\n\nNewmarket offers a number of options to locals and nearby residents.  The Brisbane City Council operates a public swimming pool in Sedgeley Park, on Alderson Street. Enoggera Creek, which forms the southern boundary of Newmarket, contains a linear park and bikeway. The suburb has several sporting ovals, including Spencer Park, which is home to former NSL and current Brisbane Premier League team Brisbane City Football Club and Windsor Royals Baseball Club, and McCook Park, which is home to Newmarket SFC soccer club.[citation needed]\n\nThe first stage of the Newmarket Shopping Centre opened in 2005.  The shopping centre contains a Coles supermarket, post office, Commonwealth Bank of Australia branch, newsagent and several specialty stores.   The historic Newmarket Hotel, established 1897, has been completely renovated and is now a buzzing hive of activity most nights of the week.  Both the Newmarket Hotel and shopping centre are located on the corner of Newmarket Road and Enoggera Road, at Newmarket. Brisbane Mexican cuisine pioneers Pepe's Mexican Restaurant moved to Newmarket in 2006. In 2018, the southern end of the centre was refurbished in order to create space for the recently built Newmarket cinemas and nearby restaurants.[59]\n\nVia Train, Newmarket Railway Station provides access to regular Queensland Rail City network services on the Ferny Grove railway line arranging travel to the Brisbane CBD, Beenleigh and Ferny Grove.[citation needed]\n\nVia Bus, Newmarket is serviced by Transport for Brisbane buses to Chermside, Mitchelton and to The City.[citation needed]\n\nVia Road, Newmarket's main arterials are Enoggera Road which is the main corridor for motorists travelling to The City and Alderley, as well as Newmarket Road which is the main corridor for motorists travelling to Lutwyche.[citation needed]\n",
  "concepts": [
    "Newmarket, Queensland"
  ],
  "findings": [
    "Geography",
    "History",
    "Demographics",
    "Heritage listings",
    "Education",
    "Amenities",
    "Transport",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:09:28.172635"
}