{
  "title": "Satish Dharmaraj",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Satish_Dharmaraj",
  "content": "Satish Dharmaraj is an American entrepreneur, speaker, angel investor and venture capitalist,[1] who currently serves as a general partner with Redpoint Ventures.[2][3] Prior to Redpoint Ventures, Satish Dharmaraj founded Zimbra, which he then sold to Yahoo! for $350 million, in 2007.[4]\n\nSatish Dharmaraj has the Bachelor of Science and Master of Science degrees in Computer Science and \"an executive management degree from the Harvard Business School.\"[5] He also holds the Bachelor of Engineering degree in Electronics and Communication Engineering from Government College of Technology, Coimbatore. Dharmaraj \"managed the messaging business at Openwave Systems\" (in addition to holding positions at Sun Microsystems and OneBox) and consequently, in 2003,[6][7][8] became the founder and chief executive officer of Zimbra,[9] which he sold to Yahoo for US$350 million in 2007.[10] According to Dharmaraj, his success at Zimbra was due to pioneering a web browser that focused on email.[11] While at Yahoo, Dharmaraj \"helped Yahoo make its email system open to third party applications.\"[12] After stepping down from Yahoo in 2009,[13] Dharmaraj became a partner for Redpoint Ventures, where he currently serves.[10] Dharmaraj was Redpoint's first entrepreneur partner and PandoDaily reported that \"Redpoint’s experience with Dharmaraj went well, spurring the firm’s current addition of Ryan Sarver from Twitter.\"[14]\n\nSatish Dharmaraj led investments in Snowflake,[15] Infer,[16] Sonos,[17] Coin,[18] Gogobot,[19] Peel,[20] Pure Storage,[21] MapR,[22] and Big Switch.[23] In 2014, Acompli, which was funded by Dharmaraj's Redpoint Ventures, was acquired by Microsoft and this acquisition is worth over US$200 million.[24][25] Pulse, which Dharmaraj funded, was bought out by LinkedIn for approximately US$90 million.[26] Satish Dharmaraj was an angel investor for Posterous, which was sold to Twitter in 2012.[27][28] In the same year, StorSimple, a product of Dharmaraj, was acquired by Microsoft.[29] In 2011, Cloud.com, which was built up by Satish Dharmaraj, was acquired by Citrix Systems.[30] In 2017, Trip.com (formerly Gogobot) was acquired by CTrip.[31] In 2012, Dharmaraj's Redpoint Ventures helped raise US$60 million for Zendesk's initial public offering (IPO).[32]\n\nArticles written by Dharmaraj include:\n",
  "concepts": [
    "Satish Dharmaraj"
  ],
  "findings": [
    "Education and career",
    "Investments and acquisitions",
    "Works",
    "Articles",
    "Video interviews",
    "References"
  ],
  "timestamp": "2025-04-11T10:49:21.993840"
}