{
  "title": "Mark Simpson (basketball)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Mark_Simpson_(basketball)",
  "content": "Mark Allen Simpson (born February 4, 1961) is an American former professional basketball player. As a player, Simpson was known for being a great 3-point shooter.\n\nAt a height of 2.03 meters (6'8\") tall, Simpson, who was born in Fort Wayne, Indiana, USA, played at the power forward position. He attended Catawba College, where he played college basketball, from 1979 to 1984.\n\nSimpson was selected in the seventh round, with the 149th pick of the 1984 NBA draft, by the Denver Nuggets.[1] However, he did not play in the NBA. Instead, he made his career in Europe. His first season as a professional was in the Israeli Ligat HaAl, where he played with Beitar Tel Aviv.\n\nSimpson then played in the Greek A1 National Category with PAOK Thessaloniki, in the French Nationale 1 with Caen, and then once again in Israel with Beitar Tel Aviv. In the 1988–89 season, while playing with the Italian club Paini Napoli, he averaged 22.7 points and 7.3 rebounds per game.[2] His last four seasons as a professional were spent playing in Spain's ACB League.\n\nHe first played with Cajabilbao for two seasons, and then later played with Real Madrid for two seasons. With Real Madrid, he averaged 17.9 points and 4.8 rebounds per game, in the 1991–92 Spanish ACB League season.[3] When he was with Real Madrid, as one of the club's two foreigner players, along with American Rickey Brown, he won the championship of the FIBA European Cup's 1991–92 season, against his former team, PAOK.\n\nIn the following 1992–93 season, the Lithuanian player Arvydas Sabonis joined Real Madrid, as their third foreign player on the team, along with Simpson and Brown. Real won the Spanish Double that season, as they won both the 1993 Spanish ACB League championship and the 1993 Spanish King's Cup title. After that season's Spanish ACB League Finals, Simpson decided to retire from his active playing career, due to knee problems. However, prior to his retirement, he failed a drug test, by ingesting an American drug called Elixir DM, \"without the consent of the club's medical services\". Simpson was trying to treat a bad cold. If he had not retired, he would have been sanctioned with a two year long ban from playing.[4]\n",
  "concepts": [
    "Mark Simpson (basketball)",
    "simpson",
    "season",
    "played",
    "spanish",
    "real",
    "real madrid",
    "playing",
    "player",
    "madrid",
    "league"
  ],
  "findings": [
    "College career",
    "Professional career",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:01.548938"
}