{
  "title": "Graeme Clark (doctor)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Graeme_Clark_(doctor)",
  "content": "Graeme Milbourne Clark AC FRS  FAA FRACS (born 16 August 1935)[1] is an  Australian Professor of Otolaryngology at the University of Melbourne.[2]  He has worked in ENT surgery, electronics and speech science, and contributed towards the development of the multiple-channel cochlear implant.[3][4][5] His invention was later marketed by Cochlear Limited.[6]\n\nClark was born in Camden, New South Wales, to parents Colin and Dorothy Clark. He has one younger sister. Clark was educated at Carey Baptist Grammar School, where he was later honoured with the 'Carey Medal' in 1997.[7][8] Clark was educated at The Scots College and studied medicine at Sydney University.[9][10]\n\nHe specialized in ear, nose and throat surgery at the Royal National Throat, Nose and Ear Hospital and obtained a fellowship in 1964 from the Royal College of Surgeons, London. Clark returned to Australia where he became a Fellow of the Royal Australian College of Surgeons and in 1969 completed his PhD at the University of Sydney on \"Middle Ear & Neural Mechanisms in Hearing and in the Management of Deafness\".[11][12] At the same time, he completed a Master of Surgery thesis on \"The Principles of the Structural Support of the Nose and its Application to Nasal and Septal Surgery\".\n\nIn 1976, he returned to England to study at the University of Keele and learn more about speech science.[13]\n\nClark hypothesized that hearing, particularly for speech, might be reproduced in people with deafness if the damaged or underdeveloped ear were bypassed, and the auditory nerve electrically stimulated to reproduce the coding of sound. His initial doctoral research at the University of Sydney investigated the effect of the rate of electrical stimulation on single cells and groups of cells in the auditory brain-stem response, the centre where frequency discrimination is first decoded.[citation needed]\n\nClark's research demonstrated that an electrode bundle with 'graded stiffness' would pass without injury around the tightening spiral of the cochlea to the speech frequency region. Until this time he had difficulty identifying a way to place the electrode bundle in the cochlea without causing any damage. He achieved a breakthrough during a vacation at the beach; he conceptualized using a seashell to replicate the human cochlea, and grass blades (which were flexible at the tip and gradually increasing in stiffness) to represent the electrodes.[14]\n\nClark demonstrated[clarification needed] that the electrode bundle needed to be free-fitting, with wires terminated in circumferential bands to reduce friction against the cochlear wall, facilitating insertion. The bands had to be wide enough to minimize charge density for safety yet narrow enough for precise nerve fiber stimulation to enable frequency place coding.[vague] To address safety concerns, Clark conducted experiments showing a minimal risk of meningitis from middle ear infections if a fibrous tissue sheath formed around the electrode bundle. This sheath was derived from a connective tissue graft taken from the patient and placed at the cochlear entry point.[15][16]\n\nThe first cochlear implant was invented and developed by Dr. William F. House.[17] House's device was a single electrode configuration, compared to the multiple electrode device developed by Clark.\n\nClark's first multi-channel cochlear implant operation was done at the Royal Victorian Eye and Ear Hospital in 1978 by Clark and Dr. Brian Pyman.[18] The first person to receive the implant was Rod Saunders who had lost his hearing aged 46.[19] Less than one year later, a second patient was implanted.  George Watson, an Australian World War II veteran, had lost his hearing after a bomb blast thirteen years earlier. An audiologist working on Clark's team at the time described the team's first two patients as, \"guys who'd put up with anything and continue to keep coming in and support the work.\".[20]\n\nAfter successfully completing the surgery in 1978, with his post-doctoral colleague, Yit Chow Tong, Clark discovered how multi-channel electrical stimulation of the brain could reproduce frequency and intensity as pitch and loudness in severely-to-profoundly deaf adults who originally had hearing before going deaf.  Electrical stimulation at low rates (50 pulses/sec) was perceived as a pitch of the same frequency, but at rates above 200 pulses/sec, what was heard was poorly discriminated and a much higher pitch.[citation needed] This discovery established that the timing of electrical stimuli was important for low pitch when this had been difficult to determine with sound.[vague] But discrimination of pitch up to 4000 Hz is required for speech understanding, so Clark emphasized early in the development of his cochlear implant that \"place coding through multi-channel stimulation\" would have to be used for the important mid-to-high speech frequencies.[citation needed] Clark and Tong next discovered that place of stimulation was experienced as timbre, but without a strong pitch sensation. The patient could identify separate sensations according to the site of stimulation in the cochlea.[citation needed]\n\nAt the end of 1978, Clark and Tong made the discovery that the speech processing strategy coded the second formant[clarification needed] as place of stimulation along the cochlear array, the amplitude of the second formant as current level, and the voicing frequency as pulse rate across the formant channels.[citation needed]\n\nin December 1978, Clark arranged that his audiologist present open-set words to his first patient, who was able to identify several correctly.\n\nAs a result, Clark went on to operate on a second patient who had been deaf for 17 years. He was able to show that the speech coding strategy was not unique to one person's brain response patterns, and that the memory for speech sounds could persist for many years after the person became deaf.\n\nIn 1982, Clark supervised clinical studies required by the U.S. Food and Drug Administration (FDA). In 1985, following a global trial, the FDA approved his multi-channel cochlear implant for adults aged 18 and over who had hearing before becoming deaf. It became the first multi-channel cochlear system approved as safe and effective for speech understanding through both electrical stimulation and lip reading.[citation needed] In 1990, the FDA extended approval for a 22-channel cochlear implant for children aged 2 to 17.[21]\n\nFrom 1985 to 1990, Clark’s team at the Cochlear Implant Clinic in Melbourne, along with clinics worldwide, found that their speech coding strategies allowed up to 60% of children to understand words and sentences using electrical stimulation alone, without lip-reading.[citation needed] The addition of high-frequency bands led to further improvements in speech perception, production, and language scores.[citation needed]\n\nIn 1970, Clark was appointed Foundation Professor of Otolaryngology at the University of Melbourne and became one of the first Laureate Professors in 2000, recognizing his international scientific achievements.[citation needed] He held this position until his retirement in 2004, leading cochlear implant research as Head of the Department of Otolaryngology.[citation needed] His research was funded initially by an appeal through a Telethon, and then a Public Interest Grant from the Australian government. His ongoing research to understand the functioning and improve the cochlear implant was through his grants from the National Health and Medical Research Council of Australia, the Australian Research Council, The US National Institutes of Health, and The Cooperative Research Center program. [citation needed] In 1983 the Bionic Ear Institute was founded by Clark, as an independent, non-profit, medical research organization.[22] The goal of the Bionic Ear Institute was, \"to give deaf children and adults the opportunity to participate as fully as possible in the hearing world and to find new ways to restore brain function\". The Bionic Ear Institute renamed itself the Bionics Institute in 2011 due to an expansion of its aims to not just improve the bionic ear, but to develop a bionic eye and devices capable of deep brain stimulation.\n\nIn 2002 The Graeme Clark Cochlear Scholarship Foundation was established in honour of Graeme Clark for his lifelong commitment to finding a solution for people with hearing loss, and his pioneering work in the field of cochlear implant technology.[23] Awarded by Cochlear Limited, scholarships are presented to cochlear implant recipients around the world to help defray the costs of their higher education, consisting of financial assistance towards a college degree at an accredited university for up to four years.[citation needed]\n\nIn recognition of Clark's contributions to the welfare of deaf people, The Graeme Clark Charitable Foundation, a charitable foundation has been established to firstly enable individuals with deafness and other sensory disorders develop their potential through appropriate biomedical, technological and educational measures.[citation needed]\n\nClark has been painted by Peter Wegner, three of these works are in the National Portrait Gallery (Australia), as an etching,[29] profile,[30] and portrait.[31]\n",
  "concepts": [
    "Graeme Clark (doctor)"
  ],
  "findings": [
    "Early life and education",
    "Career",
    "Development of multi-channel cochlear implants",
    "The Bionic Ear Institute",
    "Charity foundations",
    "Selected honors",
    "Academic",
    "Personal named distinctions",
    "Academic leadership",
    "Portraiture",
    "Selected bibliography",
    "Books",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:49:31.500193"
}