{
  "title": "Jabal al-Lawz",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jabal_al-Lawz",
  "content": "Jabal al-Lawz (Arabic: جَبَل ٱللَّوْز) is a mountain located in northwest Saudi Arabia, near the Jordanian border, above the Gulf of Aqaba at 2,580 metres (8,460 feet) above sea level. The name means 'mountain of almonds'.[2] The peak of Jabal al-Lawz, consists of a light-colored, calc-alkaline granite that is intruded by rhyolite and andesite dikes which generally trend eastward.[3]\n\nBetween 1300 and 2200 meters elevation, Jabal al-Lawz has relict Mediterranean woodlands of Juniperus phoenicea, with an understory of Achillea santolinoides, Artemisia sieberi, and Astracantha echinus subsp. arabica.[4]\n\nIn discussions about the location of biblical Mount Sinai, Jabal Maqlā ('Burnt Mountain') is often believed to be Jabal al-Lawz by various authors such as Bob Cornuke, Ron Wyatt, and Lennart Möller as shown by local and regional maps[3] and noted by other investigators.[5] In contrast to the real Jabal al-Lawz, the summit of Jabal Maqlā consists mainly of dark-colored hornfels derived from metamorphosed volcanic rocks that originally were silicic and mafic lava flows, tuff breccias, and fragmental greenstones. The middle and lower slopes of Jabal Maqlā consist of light-colored granite, which has intruded into the overlying hornfels. This is the same granite that comprises Jabal al-Lawz.[3] Jabal Maqla is about 7 kilometers to the south, and a few hundred meters lower.\n\nClaims made by some writers, including Bob Cornuke, Ron Wyatt, and Lennart Möller, that Jabal Maqlā, possibly identified as Jabal al-Lawz, is the real biblical Mount Sinai have been rejected by such scholars as James Karl Hoffmeier (Professor of Old Testament and Ancient Near Eastern History and Archaeology), who details what he calls Cornuke's \"monumental blunders\".[2][6]\n\nRemains both of pillars and cairns at the site have been described as \"similar to rock cairns of uncertain use and often uncertain date found at other sites throughout northern and western Arabia.\"[7]\n\nOther notes:\n",
  "concepts": [
    "Jabal al-Lawz"
  ],
  "findings": [
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:14:22.009411"
}