{
  "title": "Charles Edward Underhill",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Charles_Edward_Underhill",
  "content": "Charles Edward Underhill\nPRCPE FRSE LLD (8 March 1845–24 April 1908) was a Scottish physician and sportsman, who served as President of the Royal College of Physicians of Edinburgh from 1906 to 1908.\n\nCharles Edward Underhill was born in Tipton in Staffordshire on 8 March 1845, the second of eight sons of Emily Margaretta Roe and her husband, Dr William Lees Underhill (1814-1894).\n\nHe was educated in Bromsgrove and Shrewsbury. In the 1860s his family were still living at Tipton Green.[1] He studied medicine at Caius College, Cambridge as a Tancred Student, graduating MB in 1870. He was on the University rowing team whilst at Cambridge. Following graduation he became a Demonstrator in Anatomy at the University of Edinburgh.[2]\n\nIn 1875 he became assistant to Dr James Matthews Duncan, later replacing him as Physician to the Royal Hospital for Sick Children, Edinburgh and rising to the position of Consultant Physician. Underhill was also Manager of Edinburgh's Royal Maternity Hospital and on the management board of Edinburgh Royal Infirmary.\n\nIn 1873 Underhill was elected a member of the Harveian Society of Edinburgh and served as president in 1905.[3] In 1877 he was elected a Fellow of the Royal Society of Edinburgh. His proposers were Peter Guthrie Tait, Alexander Crum Brown, Alexander Buchan and David Milne Hume.[4] In 1881 he was elected a member of the Aesculapian Club and served as Honorary Secretary from 1905 until his death.[5]\n\nIn 1906, he succeeded Dr John Playfair as President of the Royal College of Physicians of Edinburgh in 1906. Underfill died in office on 24 April 1908. John Playfair completed Underhill's term in office before being succeeded by William Allan Jamieson.\n\nHe lived at 8 Coates Crescent in Edinburgh's West End.[6] Four weeks before his death on 24 April 1908, of a progressive heart disease, he moved out to Baberton House in south-west Edinburgh, lent to him by his friend and colleague, Byrom Bramwell.[7]\n\nHe is buried in Dean Cemetery in western Edinburgh. The grave lies on the south side of the main east-west path pointing at the Dean Gallery entrance. A memorial stained glass window to Underhill was erected in St Johns Episcopal Church on Princes Street.\n\nIn 1872 Underhill married Anna Wilhelmina Lambe (1845-1938), daughter of A. I. Lambe of Bengal. Dr Thomas Edgar Underhill FRSE was his brother.[8]\n\nUnderhill was a member of the Royal Company of Archers, the king's official bodyguard in Scotland,[9] along with being a member of the Aesculapian Club and Round Table Club.\n",
  "concepts": [
    "Charles Edward Underhill"
  ],
  "findings": [
    "Life",
    "Family and interests",
    "Selected publications",
    "References"
  ],
  "timestamp": "2025-04-11T10:13:00.923339"
}