{
  "title": "Reuben Kiborek",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Reuben_Kiborek",
  "content": "Reuben Kiborek (born 1992) is the current Member of Parliament for Mogotio Constituency of Baringo County located in Rift Valley, Kenya.[1] He was elected to the seat the 2022 Kenyan general elections.[2] Kiborek had previously contested Mogotio in the 2017 elections. He is a member of the United Democratic Alliance party.[3] Prior to politics, he worked as a herdboy.[4]\n\nAs a teenager, he worked as a herdboy with his family who kept livestock. He would often help his family moving their livestock from Laikipia to Kericho.[3]\n\nFollowing his completion of high school, Kiborek wished to study politics in Nairobi, however his father wished for his son to study in Eldoret, as it was closer. Kiborek was inspired to get involved in politics after the MP for Eldoret North, William Ruto, visited he Laikipia County. Eventually, comedian Kazungu Matano convinced his father to allow Kiborek to go to Nairobi. In Nairobi, Kiborek lived in the Landi Mawe area and studied at the Catholic University of Eastern Africa. After this, he moved to Rongai.\n\nKiborek went on to compete for Mogotio Constituency in 2017.[3] On April 15, 2022, vote counting for the United Democratic Alliance's candidate for Mogotio Constituency was suspended.[5] During the counting of votes at the tallying center in Baringo County, supporters of Kiborek disrupted counting as they claimed incumbent MP Daniel Tuitoek had rigged the election into his favour.[6] Tuitoek later won the nomination.[5] However, on 16 April, he got the nomination as the United Democratic Alliance's candidate for Mogotio Constituency.[7]\n\nDuring the leadup to the 2022 Kenyan general election, he frequently associated himself with William Ruto.[citation needed]\n\nOn 6 March 2023, Kiborek joined six other MPs' call on a tribunal to be formed to investigate the Supreme Court's decision to allow the registration of LGBTQI lobby groups, saying that it threatens Kenyan society and the family unit.[8]\n\nIn 2018, Kiborek was arrested on suspicion that he raped the 16-year-old daughter of Simon Chelugui after luring her to the Sarova woodlands hotel in Nakuru on 23 December 2018.[citation needed] On December 27, he was charged with sexual assault against a minor. Kiborek has denied the claims and was released on a 300,000 Kenyan shillings bond after spending three days in custody.[9] However he failed to appear in court on 2 August 2022.[6]\n\nOn 10 August 2023, Kiborek was ejected from a parliamentary session of the National Assembly for wearing a Kaunda suit that had the neck too low. Following this, he respected the decision but accused the National Assembly of pioritising British colonial-era fashion over native Kenyan attire.[10]\n\nOn 28 July 2023, his brother-in-law, Nelson Mandela, died in a road accident on the Nairobi-Nakuru highway. Following this, Kiborek cancelled a women's empowerment Harambee scheduled to be held on 29 July in Mogotio Constituency.[11] He is a close friend of William Ruto's son, Nick Ruto.[7]\n",
  "concepts": [
    "Reuben Kiborek"
  ],
  "findings": [
    "Early life and education",
    "Political career",
    "Controversies",
    "Personal life",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:23:38.313907"
}