{
  "title": "Age Concern",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Age_Concern",
  "content": "Age Concern is the banner title used by several charitable organisations specifically concerned with the needs and interests of all older people (defined as those over the age of 50) based chiefly in the four countries of the United Kingdom.[1]\n\nIn addition to providing practical support to individuals, Age Concern campaigns on issues such as age discrimination and pensions, influence public opinion and government policy about older people.\n\nNumerous Age Concern organisations have been established throughout the UK, working at national and local levels. At the national level, four Age Concern organisations[2] covered England, Scotland, Wales, and Northern Ireland. Local Age Concerns vary from small village groups to countywide organisations. In England, over 370 of the individual charities were members of a national federation.[3] Although each was a separately registered charity working under the Age Concern banner, the federation allowed members to collaborate at local, regional, and national levels, to share resources, expertise, and influence.\n\nSimilar organisations also exist in New Zealand, Spain, Ukraine, and elsewhere under similar banners.\n\nThere was a merger of Age Concern England and Help the Aged, and somewhat later Age UK took over the mantle of the national face of concern for the aged in the UK, and several local organisations have also adopted the new name, but many local organisations continued to operate as local Age Concerns. One of these was Age Concern Manchester,[4][5] and other examples are Age Concern Luton[6] and Age Concern Central Lancashire.[7]\n\nAge Concern's origins are in the United Kingdom and can be traced back to a realisation in that country of the effects on aged people of the Second World War; the dislocation and breakdown of family life arising out of conscription led to a recognition that existing poor laws failed to provide effective support for old people separated from family support networks.\n\nIn 1940, the Old People's Welfare Committee (OPWC), chaired by Eleanor Rathbone, was formed as a forum for discussion between government and voluntary organisations. OPWC was a sub-committee of the Liverpool Personal Service Society (PSS). In 1944, the committee changed its name to the National Old People's Welfare Committee (NOPWC) and took on responsibility for coordinating the activities of numerous local OPWCs.\n\nFrom the 1950s onwards, NOPWC accessed government and local funds associated with the post-war development of the welfare state, to provide services to local committees, and training to wardens of old people's homes.\n\nIn 1968 it became clear to Denise Newman. the then chairman of the NOPW council, an organisation funded within the government and run by unaccountable grandees was not an effective voice for the needs of the elderly. At that time the funding allocated from the government through the Department of Social Services was £40,000 a year.\n\nOne problem was that the minister responsible (Dick Crossman) was not in a position politically to guarantee that should the group break with the government that the funds would naturally follow to the new entity. So it was the taking of this funding risk which initially marked out Age Concern as part of a new way of dealing with what could be seen as a government-supported charitable exercise. Secondly, having successfully established itself with its premises and retained its £40,000 grant, Newman then insisted that the newly appointed CEO be salaried, and therefore accountable. This was the first salaried appointment of the senior executive of any charity in the UK.\n\nIn 1971, under the new direction of David Hobman, the NOPWC changed its public name to Age Concern, and separated itself from the government and the National Council for Social Service, now NCVO. It did so while also launching a 'manifesto for old age' and establishing itself nationally as a lobbying body as well as an organisation that engaged in service provision and enhancement, training, and research.\n\nThe directors of Age Concern England have included David Hobman, Baroness Greengross, and Gordon Lishman – the current Director General.\n\nIn 1986 Age Concern established an Institute of Gerontology at King's College London into which it folded its own Age Concern Research Unit.\n\nOn 30 May 2006, Age Concern launched Heyday – marking the launch by carrying out the UK's biggest survey, asking 10 million people born in the 1940s and 1950s for views on issues such as ageism, pensions, and health.\n\nHeyday was launched as a not-for-profit membership organisation for people planning for or in retirement. Heyday offered members access to expert advice on finances, work, retirement, and health, as well as putting them in touch with one another, for a small annual subscription.\n\nWith ambitious membership targets, Heyday proved an expensive and controversial exercise within the Age Concern Federation. Due to lower-than-expected membership take-up, Age Concern restructured the Heyday scheme to meet the low level of activity.\n\nShortly after a Charity Commission report made several recommendations,[8] Heyday announced that the scheme would close on 31 March 2009, noting that Heyday would maintain a presence on the Age Concern website.[9]\n\nThe charity commissioned Sir Christopher Kelly to investigate the project. His 2009 report concluded that Age Concern had lost over £22 million on the venture.[10]\n\nIn May 2008, Age Concern England and Help the Aged announced plans for the two charities to merge.[11]\nFollowing consultation, this was confirmed in September, when Dianne Jeffrey was confirmed as the new chairman of trustees.[12]\n\nTom Wright CBE, currently chief executive of VisitBritain, and Trustee of the Imperial War Museum\nwas appointed Chief Executive of the new charity in November 2008.[13]\n\nThe merged charity, now known as Age UK was formed on 1 April 2009, and launched a major branding exercise in April 2010, featuring Brian Cox, Ian McKellen, and Eleanor Bron in the charity's first television campaign. [citation needed]\n\nMany of the individual Age Concern charities, however, found the terms of the merger unacceptable and remain independent and have no connection with Age UK. Examples include Age Concern Luton,[6] Age Concern Eastbourne[14] and Age Concern Central Lancashire.[7]\n\nHeyday:\n\nInternational Age Concern organisations:\n",
  "concepts": [
    "Age Concern",
    "age",
    "concern",
    "age concern",
    "people",
    "organisations",
    "local",
    "heyday",
    "government",
    "uk",
    "new"
  ],
  "findings": [
    "History",
    "Heyday",
    "Merger",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:27.333747"
}