{
  "title": "Levels (Avicii song)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Levels_(Avicii_song)",
  "content": "\"Levels\"[a] is a progressive house song by Swedish DJ Avicii that was released on 28 October 2011 through Universal Music Group on iTunes. \"Levels\" topped the Swedish Singles Chart. Outside Sweden, \"Levels\" topped the charts in Norway and peaked within the top ten of the charts in Austria, Belgium, Denmark, Netherlands, the Republic of Ireland, Switzerland and the United Kingdom and received a platinum certification eight times in Sweden, and three times in the United Kingdom and the United States.\n\nBefore the song's release, an early version known as \"Unnamed\" played during a radio program on BBC Radio 1 in the United Kingdom on 11 December 2010. The final version was not played until the Ultra Music Festival in March 2011, where it was referred to as \"ID\". Afterward, \"Levels\" played in many clubs and festivals around the world before its eventual release on iTunes. Avicii has stated that he made the song so that he could incorporate a vocal sample from the 1962 gospel-inspired song \"Something's Got a Hold on Me\" by Etta James.\n\nThe music video was directed by Petro Papahadjopoulos, who came up with the concept after a phone interview with Avicii about the supposed \"symbolism\" behind \"Levels\". The video is about a businessman who starts dancing in his office in front of his co-workers and boss before being stunned by an officer and sent to the hospital. All the hospital workers slowly start dancing against their own free will after two of them touch a flower sprouted out of the businessman's mouth.\n\nTim Bergling was a Swedish DJ and electronic producer. He started music production as a teenager; he posted demos on a message board operated by Dutch producer Laidback Luke for feedback on his production.[1][2] After Bergling won a 2008 BBC Radio One competition, the host, Pete Tong, issued the submitted track, \"ManMan\", as Avicii's first single.[3][4] A few weeks later, club promoter Arash Pournouri would offer to manage Bergling's career toward success.[5][6] Bergling adopted the stage name Avicii, named after a Buddhist term for a hell-like afterlife for sinners,[7] and would release additional singles, with \"Seek Bromance\", a vocal remix of Avicii's \"Bromance\", achieving mild crossover success.[3][1]\n\nOn the origins of \"Levels\", Bergling explained in an interview with Artist Direct that he wanted to use a vocal sample from Etta James's \"Something's Got a Hold on Me\" and was satisfied when combining it with the hook he would use for \"Levels\".[8] In an interview with WNYL, DJ Mike Posner claimed that he was sent \"Levels\" by Avicii while it was still in production to provide vocals to it. Posner produced six \"toplines\" but did not use them, saying that, \"they were good, but not ... the thing\".[9]\n\nAvicii first premiered \"Levels\" on 11 December 2010 as an untitled track for BBC Radio 1's Essential Mix,[10][11] hosted by Pete Tong.[12] Throughout 2011, Avicii regularly performed \"Levels\" live in festivals, concerts, and clubs, starting with the Ultra Music Festival.[13][14] Bergling and Pournouri drew upon these performances to promote the song on social media.[15] During this time, a bootleg leak of \"Levels\" was posted on YouTube and gained over 15 million views.[13][16] The success of \"Levels\" on social media allowed Pournouri to make a deal with Universal Music Group to release the song as a single in Nordic countries.[15] \"Levels\" was released via iTunes on 28 October 2011 in Australia,[17] Denmark,[18] Ireland,[19] Netherlands,[20] the United Kingdom,[21] and Sweden.[22] After another deal brokered by another manager, Troy Carter,[15] \"Levels\" was released in the United States on 31 October 2011.[23]\n\n\"Levels\" is a progressive house,[7] EDM, and electronica[25] song produced in a dance style. The song's main aspect is its simple synth hook that is divided into two phrases.[26][b] The synth hook, which is accompanied by a chord progression of C♯m–E–B–A,[26] is repeated throughout most of the song.[24][26]\n\nIn the middle of the song, the synth hooks drop and the drums are cut out, being replaced by an echoing sound that sounds like a chorus.[24] A sample of the intro to Etta James's \"Something's Got a Hold on Me\" is played.[24][7][27] After the interlude, the synth hooks, and the drumbeat start up again along with a synth line that rises fast before slowly dropping. It was referred to by Billboard as a \"briefly burbling whistle sound that augments the hook ...\"[24]\n\n\"Levels\" received critical acclaim.[28] Billboard declared \"Levels\" one of the greatest songs of all time, and \"quite possibly one of the biggest dance music songs ever recorded\".[29][24]\n\nAllMusic critic David Jefferies described \"Levels\" as a \"simple and effective EDM monster that launched Swedish producer Avicii to Swedish House Mafia, Afrojack, or Tiesto, erm, levels.\"[30] Anje Riberra, on the Spanish news site, El Correo, called the song a \"very danceable tune that makes you enjoy it continuously\".[31] Kat Bein from the Miami New Times called the song \"a worldwide anthem\" and said that Avicii is \"part of a whole new generation of young producers helping make EDM the biggest youth culture movement since boy bands\".[13]\n\nDJ producer, Joe Bermudez, when talking about \"Levels\" said that \"Avicii's uplifting chord progressions instantly transport club goers to euphoric state\".[32] Music artist Zedd said it is the one song he wished he had produced, saying \"... there is something about the genius simplicity of this song; the unbelievably anthemic and powerful emotion I feel when I hear it.\"[33] New York's subsidiary, Vulture, Emily Yoshida praised the song for its \"central hook, stabbing, skyscraper-tall synth line, shiny and sleek and feeling like it could touch God ...\"[34] Future Music called \"Levels\", interesting because of its composition and its example of how \"... a simple part can become complex.\"[35] One criticism of \"Levels\" came from Simon Darnell on MK News, where he praised \"Levels\" for the vocals appearing for brief moment, but otherwise criticized the song for being \"utterly predictable, right down to the end.\"[36]\n\n\"Levels\" was nominated for Best Electro/Dance and won Best Song at the 2012 Grammis Awards.[37] It was also nominated for Best Dance Recording at the 2013 Grammy Awards.[38] Pitchfork ranked \"Levels\" as the 200th best song of the 2010s.[39] Both Billboard and Hollywood Reporter ranked \"Levels\" the best Avicii song.[29][40]\n\n\"Levels\" found the most chart success in Avicii's native Sweden, peaking at number 1 on the Swedish charts the week of 11 November 2011. It maintained its peak position for seven weeks.[41] It was Avicii's fifth song to make it to Sverigetopplistan's weekly charts.[41] \"Levels\" was part of three consecutive year-end charts, reaching number 23 in 2011,[42] number 3 in 2012,[43] and number 43 in 2013.[44] After leaving the charts in 2013, it made a return in the week of 24 April 2018 as number 4 and was on charts for four months.[41] That same year, it was placed as number 54 on the year-end charts.[45] \"Levels\" was also on the charts on two non-consecutive weeks in 2019, the week of 4 January as number 94, and the week of 19 April as number 77.[41] It has received a platinum certification eight times from the Swedish Recording Industry Association, indicating that \"Levels\" has been shipped to Sweden 320,000 times.[46]\n\n\"Levels\" was also very successful in the United States, entering the weekly Hot 100 charts in the week of 11 December 2011 at number 66.[47] \"Levels\" was the first song Avicii released that entered Billboard's weekly Hot 100 charts. The song stayed on the Hot 100 for 20 weeks, reaching its peak as number 60 on the week of 17 February 2012.[48] On other charts, It stayed on the Mainstream Top 40 for 5 weeks, reaching its peak position of number 33 on 9 March 2012.[49] It reached a peak position of number two on Dance/Mix Show Airplay on 24 February 2012 and was on the chart for 29 weeks,[50] and it reached a peak position of number 1 on Dance Club Songs on 30 December 2011 and was on the chart for 20 weeks.[51] On the year-end charts, It reached number 32 on the year-end Dance Club Songs chart,[52] and number 11 on the year-end Dance/Mix Show Airplay chart.[53] It earned a platinum certification by the Recording Industry Association of America on 9 January 2013, indicating that it was shipped to the US over one million times.[54] It had previously been awarded the gold certification on 27 March 2012.\n\n\"Levels\" was also successful in the UK and Norway. In the UK, \"Levels\" entered the \"Official Singles Chart Top 100\" on the week of 27 November 2011 at its peak position of number four.[55] It stayed on the chart for 50 weeks and left the charts after its position of number 96 in the week of 16 September 2012.[56] On UK's \"Official Dance Singles Chart Top 40,\" it peaked as number one on the week of 25 December 2011.[57] In the year-end charts of UK, it was number 101 in 2011,[58] and number 59 in 2012.[59] In Norway, \"Levels\" entered the charts on the week of 7 November 2011 as number four. It peaked as number one on the week of 17 December 2011 and stayed number one for four weeks. It was on the Norwegian charts for around 30 weeks.[60] \"Levels\" was certified in both the United Kingdom and Norway. In Norway, the International Federation of the Phonographic Industry awarded \"Levels\" a platinum certification five times, indicating that 50,000 copies were sold in Norway.[61] In the United Kingdom, \"Levels\" earned a platinum certification thrice from the British Phonographic Industry, indicating that it was sold and streamed 1,800,000 times in the United Kingdom.[62] In other nations, it reached a peak position of number 5 in Switzerland, number 4 in Austria, Netherlands, and Belgium, and number 3 in Denmark and Ireland.[63] \"Levels\" has also received a platinum certification at least once from Australia,[64] Austria,[65] Belgium,[66] Denmark,[67] Germany,[68] Italy,[69] and Switzerland.[70]\n\nIn September 2024, the song passed 1 billion streams on Spotify.[71]\n\nIn May 2025, the song was chosen as the official anthem of the 2025 IIHF Ice Hockey World Championship, held in Sweden and Denmark, as a tribute to Avicii.[72]\n\nAccording to director Petro Papahadjopoulos, he was approached by Universal Music Group for the concept of a music video for Avicii that would make him famous. Papahadjopoulos contacted Avicii to understand the symbolism behind \"Levels\" and to create a concept that would match the song. Papahadjopoulos created a concept based on Office Space, that he described as \"about a man who wakes up to realize he is living in hell. Everyone around him just thinks he's crazy. But his craziness is infectious.\"[73] Avicii later received the concept of the music video from his production manager, Arash Pournouri, and showed support for it.[74] He posted the concept on his official website on 8 December 2011.[75][76] Papahadjopoulos collaborated with Richie Greenfield for direction and choreography of the music video.[77][78] It was ultimately released to YouTube on 29 November 2011.[79]\n\nAccording to a concept booklet, the plot of the music video represents the idea \"we are already in Avici,[c] and that maybe we at times are aware of this and the existence of other levels...We watch as the man's reality implodes, he's experiencing awareness of other levels and his entire reality all around him transforms to something new.\"[76] The music video depicts a weary businessman, who is played by Richie Greenfield,[81] working at an office. The businessman eventually starts dancing and writing \"Avicii\" on the tables and walls. A security guard walks into the office, brings out an electroshock weapon, and stuns the businessman unconscious. During the interlude with a sample from \"Something's Got a Hold on Me\", the man is dreaming of pushing a big boulder up a mountain, mirroring Sisyphus' fate. The music video then cuts to him being restrained to a table in the hospital. A flower blossoms from his mouth. Two hospital workers who were in the same room notices and walk towards the businessman. One of them picks up a piece of the flower, eats a part of it, and then touches it to the other hospital worker. As both of them are walking away, the businessman swallows the flower and he and the two hospital workers start dancing around the hospital. As the hospital workers dance in the hospital, everyone else in the hospital starts dancing against their will.[82][83]\n\n* Sales figures based on certification alone.^ Shipments figures based on certification alone.‡ Sales+streaming figures based on certification alone.† Streaming-only figures based on certification alone.\n",
  "concepts": [
    "Levels (Avicii song)"
  ],
  "findings": [
    "Background and release",
    "Composition",
    "Critical reception",
    "Accolades",
    "Commercial performance",
    "Music video",
    "Track listing",
    "Charts",
    "Weekly charts",
    "Year-end charts",
    "Certifications",
    "Release history",
    "See also",
    "Notes",
    "References",
    "Sources"
  ],
  "timestamp": "2025-04-11T10:08:35.941247"
}