{
  "title": "Indiana Hoosiers women's basketball statistical leaders",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Indiana_Hoosiers_women's_basketball_statistical_leaders",
  "content": "The Indiana Hoosiers women's basketball statistical leaders are individual statistical leaders of the Indiana Hoosiers women's basketball program in various categories, including points, rebounds, assists, steals, and blocks. Within those areas, the lists identify single-game, single-season, and career leaders. The Hoosiers represent Indiana University Bloomington in the NCAA Division I Big Ten Conference.[1]\n\nIndiana began competing at a varsity level in 1971, as an independent in the Association of Intercollegiate Athletics for Women (AIAW), which was serving as the governing body for women's college sports at the time. Indiana joined the Big Ten Conference beginning with the 1982-83 season. The same year the Big Ten Conference began sponsoring women's basketball, the second year of the NCAA governing women's sports, and the first as the sole governing body, as the AIAW folded after the 1981-82 season.\n\nThe NCAA has recorded individual scoring and rebounding totals since it began sponsoring women's sports championships. However, it did not officially record the other statistics included in this page until later. Assists were first officially recorded in women's basketball in the 1985–86 season. Blocks and steals were first officially recorded in 1987–88. Nonetheless, Indiana's record books include players in these stats going back to the 1975-76 season, except for steals which it began tracking the following season.[2] These lists are updated through the end of the 2023–24 season. Players active in the 2024–25 season are indicated in bold.\n",
  "concepts": [
    "Indiana Hoosiers women's basketball statistical leaders"
  ],
  "findings": [
    "Scoring",
    "Rebounds",
    "Assists",
    "Steals",
    "Blocks",
    "References"
  ],
  "timestamp": "2025-04-11T10:20:43.862103"
}