{
  "title": "Michael Barlow",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Michael_Barlow",
  "content": "Playing career\n\nMichael Barlow (born 18 December 1987) is a former professional Australian rules footballer who played for the Fremantle Football Club and Gold Coast Football Club in the Australian Football League (AFL).\n\nBarlow grew up in regional Victoria town of Shepparton. He was educated at Notre Dame College, Shepparton before finishing his schooling as a boarder at Assumption College, Kilmore.\n\nUnlike most players in the AFL, Barlow did not play in the TAC Cup as a junior,[1] but instead played for Shepparton United in the Goulburn Valley Football League, where he represented Victoria Country in 2007 as a 19-year-old. Barlow also won Shepparton United's best and fairest at age 19 before moving to the Victorian Football League (VFL) at the end of the 2007 season.[2] He moved to play for the Werribee Football Club in the VFL in 2008.  He had a very successful season in 2009, having moved from the forward line into the midfield,[3] winning Werribee's best player award, the Fothergill–Round Medal as the league's best young player,[4] came second in the 2009 J. J. Liston Trophy for the league's best and fairest player,[5] and was named in the VFL's Team of the Year in both 2008 and 2009.[6]\n\nAfter training with St Kilda during the 2009 pre-season and with Essendon after the 2009 season,[7] Barlow was drafted to Fremantle Football Club with their first selection in the 2010 Rookie Draft—the eighth overall. He was one of eight players from the VFL selected in the rookie draft. Alex Silvagni was also drafted to Fremantle from the Casey Scorpions.[8] He also continued the trend of Fothergill–Round medallists being rookie listed, with all bar one of the previous seven winners being selected in the rookie draft: Michael Firrito (2002), Aaron Davey (2003), Adam Fisher (won the medal in 2004, rookie listed in 2003),[9] Jason Davenport (2006), Shane Valenti (2007) and Robin Nahas (2008).[3]\n\nAfter performing well in Fremantle's three NAB Cup pre-season games,[10] Barlow was promoted to Fremantle's senior list as a nominated rookie, enabling him to play throughout the 2010 AFL season.[11]\n\nHe made a successful debut for Fremantle in the opening round of the 2010 AFL season, gaining 33 possessions and kicking two goals, and was named as one of the best players on the ground.[12]  It was the most possessions gained by a player on debut since the AFL's official data partner, Champion Data, began collecting statistics in 1992, beating Bradd Dalziell's 32 possessions in 2008.[13] In his first Derby (R6 2010), Barlow was awarded the Ross Glendinning Medal for being the best player on the ground. His game consisted of 10 kicks, 15 handballs, 4 marks, 8 tackles and a goal.[14]\n\nA broken leg ended Barlow's season in Round 14 against Port Adelaide: late in the final quarter of the game, an awkward collision with teammate Rhys Palmer saw Barlow cleanly break both the tibia and fibula in his left leg, a few inches below the knee.[15]\n\nHe was awarded the Best First Year Player Award at the 2010 AFL Players Association awards, despite missing 8 home and away games due to his broken leg.\n\nAfter missing the first 12 rounds of the 2011 home and away season recovering from his broken leg, Barlow made his comeback in the Dockers round 13 clash with Melbourne at the MCG, after playing 2 games of WAFL football over the previous 2 weeks. Barlow gathered 25 disposals to be one of the Dockers best in the huge 89-point loss to the Demons in what was deemed a successful return to AFL football. However, he missed the following two games against Brisbane and the Gold Coast with soreness in his leg. He returned as the substitute in the round 17 clash against Sydney at the SCG, collecting 11 disposals after being activated on to the ground at three-quarter time.\n\nBarlow finished off the season strongly from then on, playing every game onwards and averaging just over 24 disposals. Although his form wasn't quite as stellar as his debut season, it was an impressive return to football.\n\nLeading up to the 2012 season, Barlow again faced difficulties with his rebuilt leg, experiencing more soreness weeks before the season began. He missed the whole pre-season competition and returned as the substitute again in the opening two games against Geelong and Sydney. Since then his form improved, with his best performance occurring in the Round 14 clash with Collingwood, where he collected a career high 37 disposals.  He finished 9th in the club's best and fairest award, the Doig Medal.[16]\n\nHe continued to be a key part of Fremantle's midfield in the following years, finishing seventh[17] and sixth[18] in the Doig Medal in 2013 and 2014 respectively.\n\nAt the conclusion of the 2016 AFL season, Barlow was delisted by Fremantle.[19] He subsequently joined Gold Coast as a delisted free agent.[20]\n\nBarlow had played in every game for the Suns in 2017 until he again broke the fibula in his left leg whilst being tackled by Bryce Gibbs during a match against Carlton in round 13.[21]\n\nBarlow was delisted by the Suns at the end of the 2018 season.[22]\n\nIn October 2018, Barlow was announced as a playing assistant coach with original VFL club Werribee for 2019.[23]\n\nIn 2021, Barlow was appointed head coach of the Werribee Football Club in the Victorian Football League (VFL). Barlow's 2 year coaching journey in South Western Melbourne helped Werribee end their Grand Final drought and helped players such as Shaun Mannagh earn their spot on an AFL list.[24] At the end of the 2023 season, he left to join North Melbourne as a Development Manager.[25]\n\nBarlow joined the North Melbourne Football Club and replaced Gavin Brown as their new Head of Development ahead of the 2024 AFL season.[26]\n\nTeam\n\nIndividual\n",
  "concepts": [
    "Michael Barlow",
    "barlow",
    "season",
    "football",
    "best",
    "afl",
    "round",
    "fremantle",
    "club",
    "leg",
    "vfl"
  ],
  "findings": [
    "Early life",
    "Early career",
    "AFL career",
    "Coaching career",
    "Werribee senior coach (2021–2023)",
    "North Melbourne Head of Development (2023–present)",
    "Honours and achievements",
    "Statistics",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:34.421771"
}