{
  "title": "Kinnea",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Kinnea",
  "content": "Kinnea (Irish: Ceann Eich[1]) a townland in the Urris Valley, located in the North-West corner of the Inishowen Peninsula.\n\nIt is in the Electoral Division of Dunaff, in Civil Parish of Clonmany, in the Barony of Inishowen East, in County Donegal. It borders the following other townlands: Dunaff to the west; Letter to the south; Straid to the south and Tullagh to the east. It has four subtownlands; Rockstown (Irish: Baile na Creige), Altnacullentra, Kindrohid (Irish: Ceann Droichid)  and Crocknagee (Irish: Croc na gaoithe).\n\nKinnea has an area of 227.53 hectares (562.2 acres).[2]\n\nThe name Kinnea is an anglicization of Ceann Eich, meaning Horse's Head.[1] The area is commonly known as Rockstown. This name was introduced in the 17th century by English settlers, which supplanted the much older Gaelic name of Kinnea.[3]\n\nThe townland is not mentioned in the Civil Survey - a cadastral survey of landholdings in Ireland carried out in 1654–56, nor in the Down Survey of 1655.[1]  The townland is mapped in William Mc Crea's \"A Map of County Donegal\" published in 1801.[4] It is also referenced in the Griffiths Valuation of the 1850s. The townland is also mentioned in the Irish Census' of 1901 and 1911. In the 1860s, Rockstown is recorded as having a harbour.[5]\n\n\nKinnea is mentioned the 1814 Statistical Account (Parochial Survey of Ireland). The Survey described the land ownership:\n\"A part of the lands of this Parish (Clonmany) belongs to the Bishop of Derry, and the remainder was the fee-simple estate of the Marquis of Donegal until the year 1810, when the townlands of Tullagh, Kinnea, Letter, Dunaff, and Urrismana, Leenan...were sold...to Sir Robert Harvey.\"[6]\nThe Survey also indicated that Arthur Chichester, MP owned a small villa in Roxtown (Kinnea).\n\nDuring the 19th century, there was a coast-guard station in Kindrohid.[7] It is marked on the maps used in the Griffiths Valuation.\n\nThe Irish Famine, also known as the Great Famine or the Great Hunger, was a devastating period in Irish history that occurred between 1845 and 1852. The famine was primarily caused by the failure of the potato crop, which was a staple food for the majority of the Irish population, especially the impoverished rural communities.[8] There are no direct records of the death toll in Kinnea. A comparison of the 1841 and 1851 census indicates that the population fell from 241 to 205; a decline of 14.5 percent. While it is not possible to attribute that decline to famine-related deaths or to immigration, the number of inhabited houses remained constant during that period, suggesting that the primary cause of the population decline was immigration. Kinnea's proximity to the sea offered alternative food sources which helped limit the population's dependence on potatoes.\n\nA three masted ship ran around in Rockstown bay in October 1860. The crew abandoned the ship before it broke up.[9]\n\nLand ownership in Kinnea and the surrounding valley of Urris was highly contentious, with landlords often issuing eviction notices to tenant farmers. These evictions often led to violent confrontations between the bailiffs and local residents.\n\nEvictions of tenants in rent arrears was a relatively frequent occurrence, and efforts to remove people from their homes was met by protest. In January 1881, four local men, named Bernard Toland. Patrick McCanny, Owen Doherty, and Denis McCool, were charged with having engaged in a riot and unlawful assembly. They were also accused of assaulting Thomas Stuart, a Bailiff who had visited Kinnea to serve eviction notices. A crowd of 150 residents confronted Stuart and pelted him with snowballs and sods of turf. The police, who had accompanied Stuart, identified the four men from the assembled crowd. The magistrates took a lenient view of the incident and dismissed the case.[10]\n\nThe Urris Valley and Rockstown has a long association with of poitin. For generations, the area was renowned for the clandestine distillation and production and consumption the iconic Irish moonshine.[11]\n\nIn August 1924, at Carndonagh District Court, Anthony Doherty of Kinnea faced prosecution for harboring poitin, found in his son's room during a neighborhood raid led by Superintendent James O'Halligan. Notably, the superintendent refrained from pushing for severe penalties, considering Doherty's recent personal hardships, including the loss of his child and his own hospitalization due to enteric fever. Maintaining innocence, Doherty denied knowledge of the prohibited spirits. The judge, aware of the case's unique circumstances, mitigated the penalty to the minimum prescribed by law.[12]\n\n\nIn September 1931, a large whale was beached in Rockstown Bay. The whale was sighted for several days, vainly attempting to escape the shallows. Eventually it landed ashore and despite the efforts of local people, the whale died. The whale attracted large crowds from as far away as Derry.[13][14]\nIn October 1940, a crate containing a bomber plane came ashore in a crate in Rockstown Bay. Three local men, Philip Diver, from Letter, John Devlin from Rockstown and John O'Donnell, from Rockstown found the crate, dismantled parts of the plane and used the wood and other items for construction materials. They were later arrested and charged under the Merchant Shipping Act of 1894. They were subsequently found guilty and fined at Carndonagh Court.[15]\n\nOn Friday, 17 August 1962, three fishermen from Rockstown drowned when their lobster boat hit submerged rocks and sank in calm seas off Binion Head. The three men were Patrick Doherty (aged 40), John McGilloway (aged 50) and his son, also called John McGilloway (aged 24). Patrick Doherty left behind a wife and five children ranging in age from ten to four years.[16]  A fourth man, John Devlin, the brother-in-law of John McGilloway, normally joined the fishing crew, but chose to stay at home on the day of the disaster.\n\nThe men went off fishing as usual at 9 a.m. and were expected to be back by early evening. Their boat was observed passing Binion at about 11 am. When the men failed to arrive by late evening the alarm was raised. At around 8:30 pm, the local parish priest, Fr. James O'Conner organised a search party. He telephoned the Malin Head wireless station. A lifeboat from Portrush was called to assist and arrived in the area at 4 am the following morning.[17]  Later the shattered wreckage of part of the 25-foot boat washed ashore on Ballyliffin Strand, a few hundred yards from Binion Head. The search party also found three full tea flasks, indicating that tragedy struck before the men had their lunch. Over the next two days, wreckage from the boat washed ashore from Pollan beach to Binion, a distance of more than a mile.\n\nThrough Saturday and Sunday the search continued. Frogmen came to help from a Londonderry-based British naval unit. An RAF helicopter also joined the search effort. On Monday, frogmen from the \"Sea Eagle\" Royal Navy Unit found the bodies of John McGilloway Senior and his Son. The keel of the boat with timber from the bow was beside the bodies. A week later, the body of Patrick Doherty was recovered.\n\nThe following Tuesday Royal Navy frogmen conducted another search where the bodies of John McGilloway and his son were found. The divers located the boat's engine on the seabed off Rockstown Harbor. A rope was entangled in the propeller, which according to the coroner \"fouled the engine, causing the boat to drift and strike submerged rocks\". The frogmen suggested that the rope was attached to a buoy from missing lobster pots.[18]  However, pieces of the wreckage were blackened which gave rise to an alternative theory that the boat was destroyed by an explosion on board.[17] A relief fund was later established to support the families of the lost men.[19]\n\nThe sea currents around Rockstown Bay are extremely dangerous. In July 2013, a woman from Londonderry was found drowned on the bay. The search operation, lasting roughly four hours, involved four lifeboats, a helicopter, and shoreline search parties.[20]\n",
  "concepts": [
    "Kinnea"
  ],
  "findings": [
    "Etymology",
    "History",
    "Great Famine",
    "Shipwreck",
    "Rural unrest in the late 19th century",
    "Poitin production and possession",
    "Beached Whale",
    "Second World War",
    "Binion Head Fishing Disaster",
    "Rockstown Bay Currents",
    "Places of interest",
    "Gallery",
    "References"
  ],
  "timestamp": "2025-04-11T10:48:33.687709"
}