{
  "title": "The Daydreamer (film)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/The_Daydreamer_(film)",
  "content": "The Daydreamer is a 1966 stop motion animated–live action musical fantasy film produced by Videocraft International.[2] Directed by Jules Bass, it was written by Arthur Rankin, Jr. and Romeo Muller, based on the stories of Hans Christian Andersen. It features seven original songs by Jules Bass and Maury Laws. The film's opening features the cast in puppet and live form plus caricatures of the cast by Al Hirschfeld. Among the cast were the American actors Paul O'Keefe, Jack Gilford, Ray Bolger and Margaret Hamilton (both from Metro-Goldwyn-Mayer's 1939 classic film The Wizard of Oz), and the Australian actor Cyril Ritchard as the voice of the Sandman. Three of the voice actors: Burl Ives, and Canadian actors Billie Mae Richards and Larry D. Mann, were the voice suppliers for Videocraft's stop motion Christmas television special, Rudolph the Red-Nosed Reindeer (1964). Some of the character voices were recorded at RCA Studios in Toronto, Ontario, under Bernard Cowan's supervision. The \"Animagic\" puppet sequences were staged by Don Duga at Videocraft in New York, and supervised by Tadahito Mochinaga at MOM Production in Tokyo, Japan.\n\nThe film was Videocraft's first theatrical feature production to be distributed by Embassy Pictures, located in Los Angeles, California and headed by executive producer Joseph E. Levine. Embassy Pictures later theatrically releases the company's two other films in 1967, Mad Monster Party? and The Wacky World of Mother Goose. As an association with Rankin and Bass, Ritchard also made his voice appearance in three of their studio's other animated productions: The Enchanted World of Danny Kaye: The Emperor's New Clothes in 1972, The First Christmas: The Story of the First Christmas Snow in 1975, and The Hobbit in 1977 (his final film role shortly before his death).\n\nA teenaged Hans Christian Andersen, the son of a poor shoemaker, daydreams instead of studying for school. He runs away from home. Whenever he falls asleep, or goes into a daydreaming spell, he dreams that he is in strange adventures with two swindling tailors, a tiny girl no bigger than a thumb, a mermaid, a devil boy in Eden, and others. In reality, as well as in his dreams, Hans is searching for the Garden of Paradise, which he does not find. The dream sequences are puppet animation, complete with a puppet version of himself, as well as with the pie man. Hans gets falsely arrested for poaching by a game warden, and is sent to work chopping wood. His father, who is out looking for Hans, gets falsely arrested, too, by the same game warden, for fishing in protected waters, and is also forced to chop wood, too, where he reunites with his son. Only when the father gives up the ring that he wore on his finger, while he was married in the past, are the father and son released from their labors. These dreams become the basis for his fairy tale fictions, which he writes as an adult: \"The Little Mermaid\", \"Thumbelina\", \"The Ugly Duckling\", \"The Emperor's New Clothes\", \"Little Claus and Big Claus\", and \"The Garden of Paradise\".\n\nA soundtrack album was issued by Columbia Records[3] featuring all of the songs and the partial score from the film.  In 2006, the album was reissued on CD by Percepto Records in a limited edition release that included four bonus tracks.[4]\n\nThe Daydreamer has been released on DVD twice: on March 4, 2003, and May 13, 2008, by Anchor Bay, and by Lionsgate on March 10, 2012, via Amazon.com as a MOD (Manufacture On Demand) disc. Scorpion Releasing has also announced a Blu-Ray release for 2021.[5]\n",
  "concepts": [
    "The Daydreamer (film)"
  ],
  "findings": [
    "Plot",
    "Cast",
    "Additional voices",
    "Crew",
    "Soundtrack",
    "Musical numbers",
    "Tales referenced",
    "Home media",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:06:46.312655"
}