{
  "title": "Yohanna Kure",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Yohanna_Kure",
  "content": "Yohanna Yarima Kure (?? - November 2, 2023) was a Nigerian army officer. He was a member of the Armed Forces Ruling Council (1985-1987) at the onset of Ibrahim Babangida's administration and was member of the Supreme Military Council of Nigeria (1983–1985) in Buhari's military government.\n\nKure is a former General Officer Commanding (GOC) 82nd Division, Enugu and the 2nd Mechanized Division, Ibadan.[1]\n\nKure hails from Kurmin Musa in Kachia Local Government Area, southern, Kaduna State, Nigeria. He attended Provincial Secondary School (1957 - 1962) and finished studies with a West African School Certificate. In 1963, he joined Nigeria Military Training College and had further military training at Officer Cadet School, Portsea, Australia. In 1982, he attended a course at the National Institute of Policy and Strategic Studies where he wrote the paper, Logistics in Military Campaign: A case Study of the Nigerian Civil War.\n\nKure was appointed Lieutenant in 1966, Captain in 1969 and Major in 1970. He was promoted Lt. Col in 1975 and became a Colonel in 1980. In 1983, he was appointed to the rank of Brigadier.  Kure was a member of the Special Military Tribunal that adjudicated suspected participants of the Mamman Vatsa coup of 1986.[2] In 1990, he was head of the Second Tribunal that tried suspected members of the Gideon Orkar led coup in 1990.[3] Upon the appointment of Salihu Ibrahim as Chief of Army Staff, Kure and other Generals who were higher in rank to Ibrahim were retired. However, Babangida gave him a ministerial post after his retirement.[2] He was Minister of Culture and Social Welfare in 1990 and was redeployed to the Sports Ministry in 1992. He died 2 November 2023.\n",
  "concepts": [
    "Yohanna Kure",
    "military",
    "kure",
    "school",
    "officer",
    "nigeria",
    "member",
    "ibrahim",
    "1990",
    "tribunal",
    "training"
  ],
  "findings": [
    "Life",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:34.175798"
}