{
  "title": "George Sigerson",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/George_Sigerson",
  "content": "George Sigerson (11 January 1836 – 17 February 1925) was an Irish physician, scientist, writer, politician and poet. He was a leading light in the Irish Literary Revival of the late 19th century in Ireland.[1]\n\nSigerson was born at Holy Hill, near Strabane, County Tyrone, the son of William and Nancy (née Neilson) Sigerson. He had had three brothers and three sisters He attended Letterkenny Academy but was sent by his father, who developed the spade mill and who played an active role in the development of Artigarvan, to complete his education in France.[2]\n\nHe studied medicine at the Queen's College, Galway, and Queen's College, Cork, and took his degree in 1859. He then went to Paris where he spent some time studying under Jean-Martin Charcot and Guillaume Duchenne de Boulogne at the Pitié-Salpêtrière Hospital; a fellow-student was Sigmund Freud.[2] Sigerson published successful translations of Charcot's Clinical Lectures in 1877 and 1881.\n\nHe returned to Ireland and opened a practice in Dublin, specialising as a neurologist. He continued to visit France annually to study under Charcot. His patients included Maud Gonne, Austin Clarke and Nora Barnacle. He lectured on medicine at the Catholic University of Ireland. He was professor of zoology and later botany at the University College Dublin.[2]\n\nWhile a student he taught himself Irish and made the acquaintance of Charles Kickham and John O'Leary.[2]\n\nHis first book, The Poets and Poetry of Munster, appeared in 1860. He was actively involved in political journalism for many years, writing for The Nation. Sigerson and his wife Hester were by now among the dominant figures of the Gaelic Revival. They frequently held Sunday evening salons at their Dublin home, No. 3 Clare St, to which artists, intellectuals and rebels alike attended, including O'Leary, W. B. Yeats, Patrick Pearse, Roger Casement and 1916 signatory Thomas MacDonagh. Sigerson was a co-founder of the Feis Ceoil and President of the National Literary Society from 1893 until his death.[2] His daughter, Dora, was a poet.\n\nHe was nominated for a twelve-year term to the first Seanad Éireann of the Irish Free State,[3][4] Sigerson briefly served as the first chairman on 11–12 December 1922 before the election of Lord Glenavy.[5] On 18 February 1925, the day after his death, the Seanad paid tribute to him.[6]\n\nThe Sigerson Cup, the top division of third level Gaelic Football competition in Ireland is named in his honour. Sigerson donated the salary from his post at UCD so that a trophy could be purchased for the competition. In 2009, he was named in the Sunday Tribune's list of the \"125 Most Influential People In GAA History\". The cup was first presented in 1911, with the inaugural winners being UCD.[1]\n\nHe married Hester Varian at St. Mary's Pro-Cathedral in Dublin on 1 December 1861.[7] The couple had four children. The eldest William, died aged two; two others (George and Dora) would predecease their father. Only one of their children, Hester, also a writer, outlived them both.[2] George Sigerson died at his home in Clare Street, Dublin, on 17 February 1925, aged 89, after a short illness.[8]\n",
  "concepts": [
    "George Sigerson"
  ],
  "findings": [
    "Doctor and scientist",
    "Cultural nationalist",
    "GAA supporter",
    "Death",
    "Partial bibliography",
    "Further reading",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:13:45.639578"
}