{
  "title": "10,000 BC (TV series)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/10,000_BC_(TV_series)",
  "content": "10,000 BC is a British reality television series that debuted on Channel 5 and MTV on 2 February 2015. The show is a joint commission between the two channels.[2]\n\nThe social experiment series follows 20 British people from all walks of life as they go back to the conditions of the Stone Age and try to survive two months in the wilderness.[3]\n\nThe 10,000 BC candidates were prepared and monitored by Klint Janulis, an archaeologist and survival expert. Janulis had spent 14 years in the U.S. military, initially as a Marine and then in the Army Special Forces.[4]\n\nThe series was set and filmed in the Byalka Hunting Preserve, near Lovech in the foothills of the Balkan Mountains, Bulgaria. The contestants were filmed for two months from October 2014.[5]\n\nNine men and eleven women from all over the United Kingdom took part in this series, including groups from two families (the Hardings and the O'Rourkes) and one couple (Oliver Farr and Terri Perry). The other eleven contestants each entered on their own. The oldest tribe member was retired private school PA Caroline Mortimer, who was 65 years old upon entering. The youngest tribe member was the restaurant maître d' Alice Harding, 20.\n\nFive of the original twenty participants remained until the eighth week. Twelve chose to leave; three were removed. It was decided by the whole tribe on day one that Steve would be tribe leader.\n\nA full cast list was posted online one week prior to the series launch.[6]\n",
  "concepts": [
    "10,000 BC (TV series)",
    "series",
    "tribe",
    "years",
    "week",
    "tribe member",
    "months",
    "member",
    "janulis",
    "filmed",
    "contestants"
  ],
  "findings": [
    "Location",
    "Contestants",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:36:18.572378"
}