{
  "title": "Sally Ride EarthKAM",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Sally_Ride_EarthKAM",
  "content": "Sally Ride EarthKAM (Earth Knowledge Acquired by Middle school students) is a NASA educational outreach program started in 1996. The program was initiated by JoBea Way Holt, an Earth scientist from NASA's Jet Propulsion Laboratory, and was initially named KidSat. It allowed students to direct a digital camera aboard a series of space shuttle flights to take photographs of specific places on Earth. In 1998, KidSat was co-opted Dr. Sally Ride, the first American woman in space and renamed EarthKAM. Dr. Ride directed the installation of camera equipment on the International Space Station (ISS), where it became a permanent fixture independent of shuttle flights.[1]\n\nDuring KidSat and EarthKAM missions (periods during which the program camera is operational), middle school students around the world can submit requests to capture photographs of specific locations. There are typically four missions a year. Students’ requests are relayed to a camera on the ISS. The camera then images the designated locations, and the digitized images are transmitted from orbit through a TDRSS Ku band satellite link to Johnson Space Center Mission Control. The images ultimately are posted on the Sally Ride EarthKAM website, where students can view and study them.[1][2]\n\nThe project is run cooperatively by the University of Alabama in Huntsville; Teledyne Brown Engineering; Johnson Space Center; U.S. Space and Rocket Center; and the Jet Propulsion Laboratory (JPL).[3]\n\nSince the program’s creation, cameras aboard the space shuttle and later the ISS have taken thousands of photographs of Earth. The entire collection of Sally Ride EarthKAM images is available in a searchable Sally Ride EarthKAM image archive.[1]\n\nTo take part in the program, teachers sign up on the Sally Ride EarthKAM website and then receive code words that are used to track image requests.[1]\n\nJoBea Holt had the idea for KidSat and worked with Sally Ride, Elizabeth Stork from Johns Hopkins Center for Talented Youth and JPL engineers to implement it in 1995.[4] Holt directed the KidSat program during its first three shuttle flights (STS-76, STS-81, and STS-86) and established the process through which students and educators could request images. A Special Section of the IEEE Transactions on Geoscience and Remote Sensing (July 1999, volume 37, No. 4, p1751-1847) presents the KidSat missions along with the science, engineering and education that were integral to the program. The program allowed middle school students to capture images of Earth using a camera aboard the Space Shuttle.[5]\n\nKidSat was renamed EarthKAM (Earth Knowledge Acquired by Middle school students) in 1998 and flew as part of three additional shuttle flights (STS-89, STS-93, and STS-99). In 2001, the camera moved to the International Space Station, and the program was renamed ISS EarthKAM.[3]  After Ride's death in 2012, NASA renamed the program Sally Ride EarthKAM in her honor.[6]\n\nEarthKAM captured the first photo of Earth from the newly installed Window Observational Research Facility (WORF).[7]\n\nSally Ride EarthKAM received the Top Results Award at the Third Annual International Space Station Research and Development Conference, held June 17–19, 2014.[8]\n",
  "concepts": [
    "Sally Ride EarthKAM"
  ],
  "findings": [
    "History",
    "Past Shuttle and ISS missions",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:20:46.140295"
}