{
  "title": "Quantum tunnelling",
  "source": "Wikipedia",
  "source_url": "https://en.wikipedia.org/wiki/Quantum_tunnelling",
  "content": "\n\nIn physics, quantum tunnelling, barrier penetration, or simply tunnelling is a quantum mechanical phenomenon in which an object such as an electron or atom passes through a potential energy barrier that, according to classical mechanics, should not be passable due to the object not having sufficient energy to pass or surmount the barrier.\n\nTunneling is a consequence of the wave nature of matter, where the quantum wave function describes the state of a particle or other physical system, and wave equations such as the Schrödinger equation describe their behavior. The probability of transmission of a wave packet through a barrier decreases exponentially with the barrier height, the barrier width, and the tunneling particle's mass, so tunneling is seen most prominently in low-mass particles such as electrons or protons tunneling through microscopically narrow barriers. Tunneling is readily detectable with barriers of thickness about 1–3 nm or smaller for electrons, and about 0.1 nm or smaller for heavier particles such as protons or hydrogen atoms.[1] Some sources describe the mere penetration of a wave function into the barrier, without transmission on the other side, as a tunneling effect, such as in tunneling into the walls of a finite potential well.[2][3]\n\nTunneling plays an essential role in physical phenomena such as nuclear fusion[4] and alpha radioactive decay of atomic nuclei. Tunneling applications include the tunnel diode,[5] quantum computing, flash memory, and the scanning tunneling microscope. Tunneling limits the minimum size of devices used in microelectronics because electrons tunnel readily through insulating layers and transistors that are thinner than about 1 nm.[6]\n\nThe effect was predicted in the early 20th century. Its acceptance as a general physical phenomenon came mid-century.[7]\n\nQuantum tunnelling falls under the domain of quantum mechanics. To understand the phenomenon, particles attempting to travel across a potential barrier can be compared to a ball trying to roll over a hill. Quantum mechanics and classical mechanics differ in their treatment of this scenario.\n\nClassical mechanics predicts that particles that do not have enough energy to classically surmount a barrier cannot reach the other side. Thus, a ball without sufficient energy to surmount the hill would roll back down. In quantum mechanics, a particle can, with a small probability, tunnel to the other side, thus crossing the barrier. The reason for this difference comes from treating matter as having properties of waves and particles.\n\nThe wave function of a physical system of particles specifies everything that can be known about the system.[8] Therefore, problems in quantum mechanics analyze the system's wave function. Using mathematical formulations, such as the Schrödinger equation, the time evolution of a known wave function can be deduced. The square of the absolute value of this wave function is directly related to the probability distribution of the particle positions, which describes the probability that the particles would be measured at those positions.\n\nAs shown in the animation, a wave packet impinges on the barrier, most of it is reflected and some is transmitted through the barrier. The wave packet becomes more de-localized: it is now on both sides of the barrier and lower in maximum amplitude, but equal in integrated square-magnitude, meaning that the probability the particle is somewhere remains unity. The wider the barrier and the higher the barrier energy, the lower the probability of tunneling.\n\nSome models of a tunneling barrier, such as the rectangular barriers shown, can be analysed and solved algebraically.[9]: 96  Most problems do not have an algebraic solution, so numerical solutions are used. \"Semiclassical methods\" offer approximate solutions that are easier to compute, such as the WKB approximation.\n\nThe Schrödinger equation was published in 1926. The first person to apply the Schrödinger equation to a problem that involved tunneling between two classically allowed regions through a potential barrier was Friedrich Hund in a series of articles published in 1927. He studied the solutions of a double-well potential and discussed molecular spectra.[10] Leonid Mandelstam and Mikhail Leontovich discovered tunneling independently and published their results in 1928.[11]\n\nIn 1927, Lothar Nordheim, assisted by Ralph Fowler, published a paper that discussed thermionic emission and reflection of electrons from metals. He assumed a surface potential barrier that confines the electrons within the metal and showed that the electrons have a finite probability of tunneling through or reflecting from the surface barrier when their energies are close to the barrier energy. Classically, the electron would either transmit or reflect with 100% certainty, depending on its energy. In 1928 J. Robert Oppenheimer published two papers on field emission, i.e. the emission of electrons induced by strong electric fields. Nordheim and Fowler simplified Oppenheimer's derivation and found values for the emitted currents and work functions that agreed with experiments.[10]\n\nA great success of the tunnelling theory was the mathematical explanation for alpha decay, which was developed in 1928 by George Gamow and independently by Ronald Gurney and Edward Condon.[12][13][14][15] The latter researchers simultaneously solved the Schrödinger equation for a model nuclear potential and derived a relationship between the half-life of the particle and the energy of emission that depended directly on the mathematical probability of tunneling. All three researchers were familiar with the works on field emission,[10] and Gamow was aware of Mandelstam and Leontovich's findings.[16]\n\nIn the early days of quantum theory, the term tunnel effect was not used, and the effect was instead referred to as penetration of, or leaking through, a barrier. The German term wellenmechanische Tunneleffekt was used in 1931 by Walter Schottky.[10] The English term tunnel effect entered the language in 1932 when it was used by Yakov Frenkel in his textbook.[10]\n\nIn 1957 Leo Esaki demonstrated tunneling of electrons over a few nanometer wide barrier in a semiconductor structure and developed a diode based on tunnel effect.[17] In 1960, following Esaki's work, Ivar Giaever showed experimentally that tunnelling also took place in superconductors. The tunnelling spectrum gave direct evidence of the superconducting energy gap. In 1962, Brian Josephson predicted the tunneling of superconducting Cooper pairs. Esaki, Giaever and Josephson shared the 1973 Nobel Prize in Physics for their works on quantum tunneling in solids.[18][7]\n\nIn 1981, Gerd Binnig and Heinrich Rohrer developed a new type of microscope, called scanning tunneling microscope, which is based on tunnelling and is used for imaging surfaces at the atomic level. Binnig and Rohrer were awarded the Nobel Prize in Physics in 1986 for their discovery.[19]\n\nTunnelling is the cause of some important macroscopic physical phenomena.\n\nTunnelling is a source of current leakage in very-large-scale integration (VLSI) electronics and results in a substantial power drain and heating effects that plague such devices. It is considered the lower limit on how microelectronic device elements can be made.[20] Tunnelling is a fundamental technique used to program the floating gates of flash memory.\n\nCold emission of electrons is relevant to semiconductors and superconductor physics. It is similar to thermionic emission, where electrons randomly jump from the surface of a metal to follow a voltage bias because they statistically end up with more energy than the barrier, through random collisions with other particles. When the electric field is very large, the barrier becomes thin enough for electrons to tunnel out of the atomic state, leading to a current that varies approximately exponentially with the electric field.[21] These materials are important for flash memory, vacuum tubes, and some electron microscopes.\n\nA simple barrier can be created by separating two conductors with a very thin insulator. These are tunnel junctions, the study of which requires understanding quantum tunnelling.[22] Josephson junctions take advantage of quantum tunnelling and superconductivity to create the Josephson effect. This has applications in precision measurements of voltages and magnetic fields,[21] as well as the multijunction solar cell.\n\nDiodes are electrical semiconductor devices that allow electric current flow in one direction more than the other. The device depends on a depletion layer between N-type and P-type semiconductors to serve its purpose. When these are heavily doped the depletion layer can be thin enough for tunnelling. When a small forward bias is applied, the current due to tunnelling is significant. This has a maximum at the point where the voltage bias is such that the energy level of the p and n conduction bands are the same. As the voltage bias is increased, the two conduction bands no longer line up and the diode acts typically.[23]\n\nBecause the tunnelling current drops off rapidly, tunnel diodes can be created that have a range of voltages for which current decreases as voltage increases. This peculiar property is used in some applications, such as high speed devices where the characteristic tunnelling probability changes as rapidly as the bias voltage.[23]\n\nThe resonant tunnelling diode makes use of quantum tunnelling in a very different manner to achieve a similar result. This diode has a resonant voltage for which a current favors a particular voltage, achieved by placing two thin layers with a high energy conductance band near each other. This creates a quantum potential well that has a discrete lowest energy level. When this energy level is higher than that of the electrons, no tunnelling occurs and the diode is in reverse bias. Once the two voltage energies align, the electrons flow like an open wire. As the voltage further increases, tunnelling becomes improbable and the diode acts like a normal diode again before a second energy level becomes noticeable.[24]\n\nA European research project demonstrated field effect transistors in which the gate (channel) is controlled via quantum tunnelling rather than by thermal injection, reducing gate voltage from ≈1 volt to 0.2 volts and reducing power consumption by up to 100×. If these transistors can be scaled up into VLSI chips, they would improve the performance per power of integrated circuits.[25][26]\n\nWhile the Drude-Lorentz model of electrical conductivity makes excellent predictions about the nature of electrons conducting in metals, it can be furthered by using quantum tunnelling to explain the nature of the electron's collisions.[21] When a free electron wave packet encounters a long array of uniformly spaced barriers, the reflected part of the wave packet interferes uniformly with the transmitted one between all barriers so that 100% transmission becomes possible. The theory predicts that if positively charged nuclei form a perfectly rectangular array, electrons will tunnel through the metal as free electrons, leading to extremely high conductance, and that impurities in the metal will disrupt it.[21]\n\nThe scanning tunnelling microscope (STM), invented by Gerd Binnig and Heinrich Rohrer, may allow imaging of individual atoms on the surface of a material.[21] It operates by taking advantage of the relationship between quantum tunnelling with distance. When the tip of the STM's needle is brought close to a conduction surface that has a voltage bias, measuring the current of electrons that are tunnelling between the needle and the surface reveals the distance between the needle and the surface. By using piezoelectric rods that change in size when voltage is applied, the height of the tip can be adjusted to keep the tunnelling current constant. The time-varying voltages that are applied to these rods can be recorded and used to image the surface of the conductor.[21] STMs are accurate to 0.001 nm, or about 1% of atomic diameter.[24]\n\nQuantum tunnelling is an essential phenomenon for nuclear fusion. The temperature in stellar cores is generally insufficient to allow atomic nuclei to overcome the Coulomb barrier and achieve thermonuclear fusion. Quantum tunnelling increases the probability of penetrating this barrier. Though this probability is still low, the extremely large number of nuclei in the core of a star is sufficient to sustain a steady fusion reaction.[27]\n\nRadioactive decay is the process of emission of particles and energy from the unstable nucleus of an atom to form a stable product. This is done via the tunnelling of a particle out of the nucleus (an electron tunneling into the nucleus is electron capture). This was the first application of quantum tunnelling. Radioactive decay is a relevant issue for astrobiology as this consequence of quantum tunnelling creates a constant energy source over a large time interval for environments outside the circumstellar habitable zone where insolation would not be possible (subsurface oceans) or effective.[27]\n\nQuantum tunnelling may be one of the mechanisms of hypothetical proton decay.[28][29]\n\nChemical reactions in the interstellar medium occur at extremely low energies. Probably the most fundamental ion-molecule reaction involves hydrogen ions with hydrogen molecules.  \nThe quantum mechanical tunnelling rate for the same reaction using the hydrogen isotope deuterium, D− + H2 → H− + HD, has been measured experimentally in an ion trap.\nThe deuterium was placed in an ion trap and cooled. The trap was then filled with hydrogen. At the temperatures used in the experiment, the energy barrier for reaction would not allow the reaction to succeed with classical dynamics alone. Quantum tunneling allowed reactions to happen in rare collisions. It was calculated from the experimental data that collisions happened one in every hundred billion.[30]\n\nIn chemical kinetics, the substitution of a light isotope of an element with a heavier one typically results in a slower reaction rate. This is generally attributed to differences in the zero-point vibrational energies for chemical bonds containing the lighter and heavier isotopes and is generally modeled using transition state theory. However, in certain cases, large isotopic effects are observed that cannot be accounted for by a semi-classical treatment, and quantum tunnelling is required. R. P. Bell developed a modified treatment of Arrhenius kinetics that is commonly used to model this phenomenon.[31]\n\nBy including quantum tunnelling, the astrochemical syntheses of various molecules in interstellar clouds can be explained, such as the synthesis of molecular hydrogen, water (ice) and the prebiotic important formaldehyde.[27] Tunnelling of molecular hydrogen has been observed in the lab.[32]\n\nQuantum tunnelling is among the central non-trivial quantum effects in quantum biology.[33] Here it is important both as electron tunnelling and proton tunnelling. Electron tunnelling is a key factor in many biochemical redox reactions (photosynthesis, cellular respiration) as well as enzymatic catalysis. Proton tunnelling is a key factor in spontaneous DNA mutation.[27]\n\nSpontaneous mutation occurs when normal DNA replication takes place after a particularly significant proton has tunnelled.[34] A hydrogen bond joins DNA base pairs. A double well potential along a hydrogen bond separates a potential energy barrier. It is believed that the double well potential is asymmetric, with one well deeper than the other such that the proton normally rests in the deeper well. For a mutation to occur, the proton must have tunnelled into the shallower well. The proton's movement from its regular position is called a tautomeric transition. If DNA replication takes place in this state, the base pairing rule for DNA may be jeopardised, causing a mutation.[35] Per-Olov Lowdin was the first to develop this theory of spontaneous mutation within the double helix. Other instances of quantum tunnelling-induced mutations in biology are believed to be a cause of ageing and cancer.[36]\n\nThe time-independent Schrödinger equation for one particle in one dimension can be written as\n\n\n\n\n−\n\n\n\nℏ\n\n2\n\n\n\n2\nm\n\n\n\n\n\n\nd\n\n2\n\n\n\nd\n\nx\n\n2\n\n\n\n\n\nΨ\n(\nx\n)\n+\nV\n(\nx\n)\nΨ\n(\nx\n)\n=\nE\nΨ\n(\nx\n)\n\n\n{\\displaystyle -{\\frac {\\hbar ^{2}}{2m}}{\\frac {d^{2}}{dx^{2}}}\\Psi (x)+V(x)\\Psi (x)=E\\Psi (x)}\n\n\nor\n\n\n\n\n\n\n\nd\n\n2\n\n\n\nd\n\nx\n\n2\n\n\n\n\n\nΨ\n(\nx\n)\n=\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\n\n(\n\nV\n(\nx\n)\n−\nE\n\n)\n\nΨ\n(\nx\n)\n≡\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\nM\n(\nx\n)\nΨ\n(\nx\n)\n,\n\n\n{\\displaystyle {\\frac {d^{2}}{dx^{2}}}\\Psi (x)={\\frac {2m}{\\hbar ^{2}}}\\left(V(x)-E\\right)\\Psi (x)\\equiv {\\frac {2m}{\\hbar ^{2}}}M(x)\\Psi (x),}\n\n\nwhere\n\nThe solutions of the Schrödinger equation take different forms for different values of x, depending on whether M(x) is positive or negative. When M(x) is constant and negative, then the Schrödinger equation can be written in the form\n\n\n\n\n\n\n\nd\n\n2\n\n\n\nd\n\nx\n\n2\n\n\n\n\n\nΨ\n(\nx\n)\n=\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\nM\n(\nx\n)\nΨ\n(\nx\n)\n=\n−\n\nk\n\n2\n\n\nΨ\n(\nx\n)\n,\n\n\nwhere\n\n\n\nk\n\n2\n\n\n=\n−\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\nM\n.\n\n\n{\\displaystyle {\\frac {d^{2}}{dx^{2}}}\\Psi (x)={\\frac {2m}{\\hbar ^{2}}}M(x)\\Psi (x)=-k^{2}\\Psi (x),\\qquad {\\text{where}}\\quad k^{2}=-{\\frac {2m}{\\hbar ^{2}}}M.}\n\n\n\nThe solutions of this equation represent travelling waves, with phase-constant +k or −k. Alternatively, if M(x) is constant and positive, then the Schrödinger equation can be written in the form\n\n\n\n\n\n\n\nd\n\n2\n\n\n\nd\n\nx\n\n2\n\n\n\n\n\nΨ\n(\nx\n)\n=\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\nM\n(\nx\n)\nΨ\n(\nx\n)\n=\n\n\nκ\n\n\n2\n\n\nΨ\n(\nx\n)\n,\n\n\nwhere\n\n\n\n\nκ\n\n\n2\n\n\n=\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\nM\n.\n\n\n{\\displaystyle {\\frac {d^{2}}{dx^{2}}}\\Psi (x)={\\frac {2m}{\\hbar ^{2}}}M(x)\\Psi (x)={\\kappa }^{2}\\Psi (x),\\qquad {\\text{where}}\\quad {\\kappa }^{2}={\\frac {2m}{\\hbar ^{2}}}M.}\n\n\n\nThe solutions of this equation are rising and falling exponentials in the form of evanescent waves. When M(x) varies with position, the same difference in behaviour occurs, depending on whether M(x) is negative or positive. It follows that the sign of M(x) determines the nature of the medium, with negative M(x) corresponding to medium A and positive M(x) corresponding to medium B. It thus follows that evanescent wave coupling can occur if a region of positive M(x) is sandwiched between two regions of negative M(x), hence creating a potential barrier.\n\nThe mathematics of dealing with the situation where M(x) varies with x is difficult, except in special cases that usually do not correspond to physical reality. A full mathematical treatment appears in the 1965 monograph by Fröman and Fröman. Their ideas have not been incorporated into physics textbooks, but their corrections have little quantitative effect.\n\nThe wave function is expressed as the exponential of a function:\n\n\n\n\nΨ\n(\nx\n)\n=\n\ne\n\nΦ\n(\nx\n)\n\n\n,\n\n\n{\\displaystyle \\Psi (x)=e^{\\Phi (x)},}\n\n where \n\n\n\n\nΦ\n″\n\n(\nx\n)\n+\n\nΦ\n′\n\n(\nx\n\n)\n\n2\n\n\n=\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\n\n(\n\nV\n(\nx\n)\n−\nE\n\n)\n\n.\n\n\n{\\displaystyle \\Phi ''(x)+\\Phi '(x)^{2}={\\frac {2m}{\\hbar ^{2}}}\\left(V(x)-E\\right).}\n\n\n\n\n\n\n\nΦ\n′\n\n(\nx\n)\n\n\n{\\displaystyle \\Phi '(x)}\n\n is then separated into real and imaginary parts:\n\n\n\n\n\nΦ\n′\n\n(\nx\n)\n=\nA\n(\nx\n)\n+\ni\nB\n(\nx\n)\n,\n\n\n{\\displaystyle \\Phi '(x)=A(x)+iB(x),}\n\n where A(x) and B(x) are real-valued functions.\n\nSubstituting the second equation into the first and using the fact that the imaginary part needs to be 0 results in:\n\n\n\n\n\n\n\nA\n′\n\n(\nx\n)\n+\nA\n(\nx\n\n)\n\n2\n\n\n−\nB\n(\nx\n\n)\n\n2\n\n\n=\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\n\n(\n\nV\n(\nx\n)\n−\nE\n\n)\n\n.\n\n\n{\\displaystyle A'(x)+A(x)^{2}-B(x)^{2}={\\frac {2m}{\\hbar ^{2}}}\\left(V(x)-E\\right).}\n\n\nTo solve this equation using the semiclassical approximation, each function must be expanded as a power series in \n\n\n\nℏ\n\n\n{\\displaystyle \\hbar }\n\n. From the equations, the power series must start with at least an order of \n\n\n\n\nℏ\n\n−\n1\n\n\n\n\n{\\displaystyle \\hbar ^{-1}}\n\n to satisfy the real part of the equation; for a good classical limit starting with the highest power of the Planck constant possible is preferable, which leads to\n\n\n\n\nA\n(\nx\n)\n=\n\n\n1\nℏ\n\n\n\n∑\n\nk\n=\n0\n\n\n∞\n\n\n\nℏ\n\nk\n\n\n\nA\n\nk\n\n\n(\nx\n)\n\n\n{\\displaystyle A(x)={\\frac {1}{\\hbar }}\\sum _{k=0}^{\\infty }\\hbar ^{k}A_{k}(x)}\n\n\nand\n\n\n\n\nB\n(\nx\n)\n=\n\n\n1\nℏ\n\n\n\n∑\n\nk\n=\n0\n\n\n∞\n\n\n\nℏ\n\nk\n\n\n\nB\n\nk\n\n\n(\nx\n)\n,\n\n\n{\\displaystyle B(x)={\\frac {1}{\\hbar }}\\sum _{k=0}^{\\infty }\\hbar ^{k}B_{k}(x),}\n\n\nwith the following constraints on the lowest order terms,\n\n\n\n\n\nA\n\n0\n\n\n(\nx\n\n)\n\n2\n\n\n−\n\nB\n\n0\n\n\n(\nx\n\n)\n\n2\n\n\n=\n2\nm\n\n(\n\nV\n(\nx\n)\n−\nE\n\n)\n\n\n\n{\\displaystyle A_{0}(x)^{2}-B_{0}(x)^{2}=2m\\left(V(x)-E\\right)}\n\n\nand\n\n\n\n\n\nA\n\n0\n\n\n(\nx\n)\n\nB\n\n0\n\n\n(\nx\n)\n=\n0.\n\n\n{\\displaystyle A_{0}(x)B_{0}(x)=0.}\n\n\n\nAt this point two extreme cases can be considered.\n\nCase 1\n\nIf the amplitude varies slowly as compared to the phase \n\n\n\n\nA\n\n0\n\n\n(\nx\n)\n=\n0\n\n\n{\\displaystyle A_{0}(x)=0}\n\n and\n\n\n\n\n\nB\n\n0\n\n\n(\nx\n)\n=\n±\n\n\n2\nm\n\n(\n\nE\n−\nV\n(\nx\n)\n\n)\n\n\n\n\n\n{\\displaystyle B_{0}(x)=\\pm {\\sqrt {2m\\left(E-V(x)\\right)}}}\n\n\nwhich corresponds to classical motion. Resolving the next order of expansion yields\n\n\n\n\nΨ\n(\nx\n)\n≈\nC\n\n\n\ne\n\ni\n∫\nd\nx\n\n\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\n\n(\n\nE\n−\nV\n(\nx\n)\n\n)\n\n\n\n+\nθ\n\n\n\n\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\n\n(\n\nE\n−\nV\n(\nx\n)\n\n)\n\n\n\n4\n\n\n\n\n\n\n{\\displaystyle \\Psi (x)\\approx C{\\frac {e^{i\\int dx{\\sqrt {{\\frac {2m}{\\hbar ^{2}}}\\left(E-V(x)\\right)}}+\\theta }}{\\sqrt[{4}]{{\\frac {2m}{\\hbar ^{2}}}\\left(E-V(x)\\right)}}}}\n\n\n\nCase 2\n\nIf the phase varies slowly as compared to the amplitude, \n\n\n\n\nB\n\n0\n\n\n(\nx\n)\n=\n0\n\n\n{\\displaystyle B_{0}(x)=0}\n\n and\n\n\n\n\n\nA\n\n0\n\n\n(\nx\n)\n=\n±\n\n\n2\nm\n\n(\n\nV\n(\nx\n)\n−\nE\n\n)\n\n\n\n\n\n{\\displaystyle A_{0}(x)=\\pm {\\sqrt {2m\\left(V(x)-E\\right)}}}\n\n\nwhich corresponds to tunneling. Resolving the next order of the expansion yields\n\n\n\n\nΨ\n(\nx\n)\n≈\n\n\n\n\nC\n\n+\n\n\n\ne\n\n+\n∫\nd\nx\n\n\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\n\n(\n\nV\n(\nx\n)\n−\nE\n\n)\n\n\n\n\n\n+\n\nC\n\n−\n\n\n\ne\n\n−\n∫\nd\nx\n\n\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\n\n(\n\nV\n(\nx\n)\n−\nE\n\n)\n\n\n\n\n\n\n\n\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\n\n(\n\nV\n(\nx\n)\n−\nE\n\n)\n\n\n\n4\n\n\n\n\n\n\n{\\displaystyle \\Psi (x)\\approx {\\frac {C_{+}e^{+\\int dx{\\sqrt {{\\frac {2m}{\\hbar ^{2}}}\\left(V(x)-E\\right)}}}+C_{-}e^{-\\int dx{\\sqrt {{\\frac {2m}{\\hbar ^{2}}}\\left(V(x)-E\\right)}}}}{\\sqrt[{4}]{{\\frac {2m}{\\hbar ^{2}}}\\left(V(x)-E\\right)}}}}\n\n\n\nIn both cases it is apparent from the denominator that both these approximate solutions are bad near the classical turning points \n\n\n\nE\n=\nV\n(\nx\n)\n\n\n{\\displaystyle E=V(x)}\n\n. Away from the potential hill, the particle acts similar to a free and oscillating wave; beneath the potential hill, the particle undergoes exponential changes in amplitude. By considering the behaviour at these limits and classical turning points a global solution can be made.\n\nTo start, a classical turning point, \n\n\n\n\nx\n\n1\n\n\n\n\n{\\displaystyle x_{1}}\n\n is chosen and \n\n\n\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\n\n(\n\nV\n(\nx\n)\n−\nE\n\n)\n\n\n\n{\\displaystyle {\\frac {2m}{\\hbar ^{2}}}\\left(V(x)-E\\right)}\n\n is expanded in a power series about \n\n\n\n\nx\n\n1\n\n\n\n\n{\\displaystyle x_{1}}\n\n:\n\n\n\n\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\n\n(\n\nV\n(\nx\n)\n−\nE\n\n)\n\n=\n\nv\n\n1\n\n\n(\nx\n−\n\nx\n\n1\n\n\n)\n+\n\nv\n\n2\n\n\n(\nx\n−\n\nx\n\n1\n\n\n\n)\n\n2\n\n\n+\n⋯\n\n\n{\\displaystyle {\\frac {2m}{\\hbar ^{2}}}\\left(V(x)-E\\right)=v_{1}(x-x_{1})+v_{2}(x-x_{1})^{2}+\\cdots }\n\n\n\nKeeping only the first order term ensures linearity:\n\n\n\n\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\n\n(\n\nV\n(\nx\n)\n−\nE\n\n)\n\n=\n\nv\n\n1\n\n\n(\nx\n−\n\nx\n\n1\n\n\n)\n.\n\n\n{\\displaystyle {\\frac {2m}{\\hbar ^{2}}}\\left(V(x)-E\\right)=v_{1}(x-x_{1}).}\n\n\n\nUsing this approximation, the equation near \n\n\n\n\nx\n\n1\n\n\n\n\n{\\displaystyle x_{1}}\n\n becomes a differential equation:\n\n\n\n\n\n\n\nd\n\n2\n\n\n\nd\n\nx\n\n2\n\n\n\n\n\nΨ\n(\nx\n)\n=\n\nv\n\n1\n\n\n(\nx\n−\n\nx\n\n1\n\n\n)\nΨ\n(\nx\n)\n.\n\n\n{\\displaystyle {\\frac {d^{2}}{dx^{2}}}\\Psi (x)=v_{1}(x-x_{1})\\Psi (x).}\n\n\n\nThis can be solved using Airy functions as solutions.\n\n\n\n\nΨ\n(\nx\n)\n=\n\nC\n\nA\n\n\nA\ni\n\n(\n\n\n\n\nv\n\n1\n\n\n\n3\n\n\n\n(\nx\n−\n\nx\n\n1\n\n\n)\n\n)\n\n+\n\nC\n\nB\n\n\nB\ni\n\n(\n\n\n\n\nv\n\n1\n\n\n\n3\n\n\n\n(\nx\n−\n\nx\n\n1\n\n\n)\n\n)\n\n\n\n{\\displaystyle \\Psi (x)=C_{A}Ai\\left({\\sqrt[{3}]{v_{1}}}(x-x_{1})\\right)+C_{B}Bi\\left({\\sqrt[{3}]{v_{1}}}(x-x_{1})\\right)}\n\n\n\nTaking these solutions for all classical turning points, a global solution can be formed that links the limiting solutions. Given the two coefficients on one side of a classical turning point, the two coefficients on the other side of a classical turning point can be determined by using this local solution to connect them.\n\nHence, the Airy function solutions will asymptote into sine, cosine and exponential functions in the proper limits. The relationships between \n\n\n\nC\n,\nθ\n\n\n{\\displaystyle C,\\theta }\n\n and \n\n\n\n\nC\n\n+\n\n\n,\n\nC\n\n−\n\n\n\n\n{\\displaystyle C_{+},C_{-}}\n\n are\n\n\n\n\n\nC\n\n+\n\n\n=\n\n\n1\n2\n\n\nC\ncos\n⁡\n\n\n(\n\nθ\n−\n\n\nπ\n4\n\n\n\n)\n\n\n\n\n{\\displaystyle C_{+}={\\frac {1}{2}}C\\cos {\\left(\\theta -{\\frac {\\pi }{4}}\\right)}}\n\n\nand\n\nWith the coefficients found, the global solution can be found. Therefore, the transmission coefficient for a particle tunneling through a single potential barrier is\n\n\n\n\nT\n(\nE\n)\n=\n\ne\n\n−\n2\n\n∫\n\n\nx\n\n1\n\n\n\n\n\nx\n\n2\n\n\n\n\nd\nx\n\n\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\n\n[\n\nV\n(\nx\n)\n−\nE\n\n]\n\n\n\n\n\n,\n\n\n{\\displaystyle T(E)=e^{-2\\int _{x_{1}}^{x_{2}}dx{\\sqrt {{\\frac {2m}{\\hbar ^{2}}}\\left[V(x)-E\\right]}}},}\n\n\nwhere \n\n\n\n\nx\n\n1\n\n\n,\n\nx\n\n2\n\n\n\n\n{\\displaystyle x_{1},x_{2}}\n\n are the two classical turning points for the potential barrier.\n\nFor a rectangular barrier, this expression simplifies to:\n\n\n\n\nT\n(\nE\n)\n=\n\ne\n\n−\n2\n\n\n\n\n\n2\nm\n\n\nℏ\n\n2\n\n\n\n\n(\n\nV\n\n0\n\n\n−\nE\n)\n\n\n(\n\nx\n\n2\n\n\n−\n\nx\n\n1\n\n\n)\n\n\n.\n\n\n{\\displaystyle T(E)=e^{-2{\\sqrt {{\\frac {2m}{\\hbar ^{2}}}(V_{0}-E)}}(x_{2}-x_{1})}.}\n\n\n\nSome physicists have claimed that it is possible for spin-zero particles to travel faster than the speed of light when tunnelling.[7] This appears to violate the principle of causality, since a frame of reference then exists in which the particle arrives before it has left. In 1998, Francis E. Low reviewed briefly the phenomenon of zero-time tunnelling.[37] More recently, experimental tunnelling time data of phonons, photons, and electrons was published by Günter Nimtz.[38] Another experiment overseen by A. M. Steinberg, seems to indicate that particles could tunnel at apparent speeds faster than light.[39][40]\n\nOther physicists, such as Herbert Winful,[41] disputed these claims. Winful argued that the wave packet of a tunnelling particle propagates locally, so a particle can't tunnel through the barrier non-locally. Winful also argued that the experiments that are purported to show non-local propagation have been misinterpreted. In particular, the group velocity of a wave packet does not measure its speed, but is related to the amount of time the wave packet is stored in the barrier. Moreover, if quantum tunneling is modeled with the relativistic Dirac equation, well established mathematical theorems imply that the process is completely subluminal.[42][43]\n\nThe concept of quantum tunneling can be extended to situations where there exists a quantum transport between regions that are classically not connected even if there is no associated potential barrier. This phenomenon is known as dynamical tunnelling.[44][45]\n\nThe concept of dynamical tunnelling is particularly suited to address the problem of quantum tunnelling in high dimensions (d>1). In the case of an integrable system, where bounded classical trajectories are confined onto tori in phase space, tunnelling can be understood as the quantum transport between semi-classical states built on two distinct but symmetric tori.[46]\n\nIn real life, most systems are not integrable and display various degrees of chaos. Classical dynamics is then said to be mixed and the system phase space is typically composed of islands of regular orbits surrounded by a large sea of chaotic orbits. The existence of the chaotic sea, where transport is classically allowed, between the two symmetric tori then assists the quantum tunnelling between them. This phenomenon is referred as chaos-assisted tunnelling.[47] and is characterized by sharp resonances of the tunnelling rate when varying any system parameter.\n\nWhen \n\n\n\nℏ\n\n\n{\\displaystyle \\hbar }\n\n is small in front of the size of the regular islands, the fine structure of the classical phase space plays a key role in tunnelling. In particular the two symmetric tori are coupled \"via a succession of classically forbidden transitions across nonlinear resonances\" surrounding the two islands.[48]\n\nSeveral phenomena have the same behavior as quantum tunnelling. Two examples are evanescent wave coupling[49] (the application of Maxwell's wave-equation to light) and the application of the non-dispersive wave-equation from acoustics applied to \"waves on strings\".[citation needed]\n\nThese effects are modeled similarly to the rectangular potential barrier. In these cases, one transmission medium through which the wave propagates that is the same or nearly the same throughout, and a second medium through which the wave travels differently. This can be described as a thin region of medium B between two regions of medium A. The analysis of a rectangular barrier by means of the Schrödinger equation can be adapted to these other effects provided that the wave equation has travelling wave solutions in medium A but real exponential solutions in medium B.\n\nIn optics, medium A is a vacuum while medium B is glass. In acoustics, medium A may be a liquid or gas and medium B a solid. For both cases, medium A is a region of space where the particle's total energy is greater than its potential energy and medium B is the potential barrier. These have an incoming wave and resultant waves in both directions. There can be more mediums and barriers, and the barriers need not be discrete. Approximations are useful in this case.\n\nA classical wave-particle association was originally analyzed as analogous to quantum tunneling,[50] but subsequent analysis found a fluid dynamics cause related to the vertical momentum imparted to particles near the barrier.[51]\n",
  "concepts": [
    "Quantum tunnelling"
  ],
  "findings": [
    "Introduction to the concept",
    "Tunnelling problem",
    "History",
    "Applications",
    "Solid-state physics",
    "Nuclear physics",
    "Chemistry",
    "Mathematical discussion",
    "Schrödinger equation",
    "WKB approximation",
    "Faster than light",
    "Dynamical tunneling",
    "Tunnelling in phase space",
    "Chaos-assisted tunnelling",
    "Resonance-assisted tunnelling",
    "Related phenomena",
    "See also",
    "References",
    "Further reading",
    "External links"
  ],
  "timestamp": "2025-04-11T10:14:17.536849"
}