{
  "title": "Newcastle, Jamaica",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Newcastle,_Jamaica",
  "content": "Newcastle is a settlement in the Blue Mountains of Jamaica. Formerly a military hill station for the British Army it is now a training centre for the Jamaica Defence Force.\n\nThe Blue Mountain and John Crow Mountain National Park in which Newcastle is located was established in 1992.  Newcastle lies on the Kingston to Buff Bay road through the National Park.  The Blue Mountains are criss-crossed by trails connecting villages to farms and plantations and other villages and trails from Newcastle to Catherine's Peak and Mt. Horeb are among the attractions for hikers and other visitors to the Park.[1][2]\n\nNewcastle became a military centre in the 1840s when Major General Sir William Maynard Gomm, Lieutenant Governor of Jamaica (and Britain's longest serving soldier), observed that yellow fever, a major cause of death among the British troops stationed in Jamaica, was far less prevalent in the mountains.[3]\nAfter unsuccessful attempts to persuade the government to pay for the construction of a military barracks up in the hills, Gomm went ahead with construction of the barracks at the Newcastle coffee plantation on his own initiative.  Construction was subsequently authorised by the Board of Ordnance.  The death toll among the troops posted to the West Indies garrison, formerly regarded as virtually a death sentence, declined dramatically.[4]\n\nDuring the colonial period until 1959, Newcastle was used as a \"change-of-air camp\" by British regiments stationed in Jamaica.  In 1959 Newcastle became the Training Depot of the West Indies Federation's Federal Defence Force. When the Federation was dissolved and Jamaica achieved independence in 1962, Newcastle was part of a general transfer of all military lands in Jamaica to the Jamaican Government.  The Newcastle Barracks are still used by the Jamaica Defence Force as a training centre.[4]\n\n18°04′21″N 76°42′52″W﻿ / ﻿18.07257°N 76.71453°W﻿ / 18.07257; -76.71453\n\nThis Jamaican location article is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Newcastle, Jamaica"
  ],
  "findings": [
    "History",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:23:46.117703"
}