{
  "title": "William T. Sampson",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/William_T._Sampson",
  "content": "Spanish–American War\n\nWilliam Thomas Sampson (February 9, 1840 – May 6, 1902) was a United States Navy rear admiral known for his victory in the Battle of Santiago de Cuba during the Spanish–American War.\n\nHe was born in Palmyra, New York, and entered the United States Naval Academy on September 24, 1857. After graduating first in his class four years later, he served as an instructor at the academy, teaching physics.[1] In 1864, he became the executive officer of the monitor Patapsco of the South Atlantic Blockading Squadron and engaged in sweeping torpedoes off Charleston, South Carolina. He survived the loss of that ironclad on January 15, 1865, when she struck a torpedo, exploded, and sank with a loss of 75 lives.\n\nFollowing duty on the steam frigate Colorado with the European Squadron, another tour as instructor at the Naval Academy, and in the Bureau of Navigation of the Navy Department, he served in the screw sloop Congress. He then commanded the Alert, the training ship Mayflower, and the Swatara while on duty at the Naval Academy.\n\nDuring the next years, he was Assistant to the Superintendent of the United States Naval Observatory, then Officer-in-Charge of the Naval Torpedo Station at Newport, Rhode Island. On September 9, 1886, he became Superintendent of the Naval Academy. He was promoted to captain on April 9, 1889, reported to the Mare Island Navy Yard to fit out the protected cruiser San Francisco, and assumed command when she was commissioned on November 15, 1889. He was detached in June 1892 to serve as Inspector of Ordnance in the Washington Navy Yard and was appointed Chief of the Bureau of Ordnance on January 28, 1893. He assumed command of the battleship Iowa on June 15, 1897. On February 17, 1898, he was made President of the Board of Inquiry to investigate the destruction of the Maine. On March 26, 1898, he assumed command of the North Atlantic Squadron, with the temporary rank of rear admiral.\n\nThe United States declared war against Spain on April 25, 1898; and, eight days later, Admiral Pascual Cervera's fleet sailed from the Cape Verde Islands for an uncertain destination. Rear Admiral Sampson, in flagship New York, put to sea from Key West. Sampson's early involvement in the conflict included his supervision of the Cuban blockade, which lasted for the duration of the war, as well as the bombardment of the city of San Juan on May 12, 1898. After initially being sent to blockade Havana itself, Sampson was given orders to intercept Admiral Cervera's squadron, but with only a vague notion of Cervera's current location, he was unable to actively pursue. Awaiting further information on Cervera's whereabouts, Sampson sailed east to San Juan and carried out a bombardment on May 12 that lasted several hours, dealing minor infrastructural damage to the city. After this preliminary bombardment, Sampson helped lead a land-sea attack on San Juan Hill, along with General William Shafter, taking the city of Santiago de Cuba. On July 1, following the successful invasion, Sampson returned to Puerto Rico, reinforcing the blockade in San Juan.\n\nOn May 29, elements of Sampson's command spotted Admiral Cervera's squadron moving into Santiago harbor and the naval presence there was greatly increased to prevent Cervera's escape. On the morning of July 3, 1898, Cervera's fleet came out of the harbor. Sampson was ashore at a conference with General Shafter, making plans for a coordinated attack on Santiago.[1] Rear Admiral Winfield Scott Schley was in command of the Flying Squadron in Sampson's absence and met the Spanish fleet, completely destroying every Spanish vessel in a running sea battle lasting five hours. The next day, Rear Admiral Sampson sent his famous message: \"The Fleet under my command offers the nation as a Fourth of July present, the whole of Cervera's Fleet\".\n\nSampson's message omitted any mention of Schley's leadership in the battle, leading to a controversy as to who was responsible for the victory. While Sampson also arguably played a significant role in the victory, having laid down the strategic framework and determining the favorable positions of his own forces, it was of course Schley who had actually commanded the fleet during the battle.[1] Schley appealed for a court of inquiry, which he got in 1901. In the Navy, the quarrel was so divisive that the rank-and-file identified themselves as either a \"Schley man\" or a \"Sampson man.\" The court of inquiry heard testimony in support of Schley by his own men and, despite some criticism of Schley, exonerated the commander of the Flying Squadron.\n\nAfter the Battle of Santiago Bay, Sampson was appointed Cuban Commissioner on August 20, 1898, but resumed command of the North Atlantic Fleet in December. He became Commandant of the Boston Navy Yard in October 1899 and transferred to the Retired List on February 9, 1902.\n\nSampson was a companion of the Military Order of the Loyal Legion of the United States and the Military Order of Foreign Wars. He was awarded an honorary doctorate (LL.D.) by Yale University in October 1901, during celebrations for the bicentenary of the university.[2]\n\nIn 1863, Sampson married Margaret Sexton Aldrich (1842–1878). On January 16, 1878, Sampson's first wife Margaret died.\n[5][6]\n\nIn 1882, Sampson married Elizabeth Susan Burling.[5]\n\nIn 1916, Sampson's daughter Margaret Aldrich Smith became the First Lady of Guam until 1918.\n\nSampson's granddaughter Marjorie Sampson Smith became a sponsor of USS Sampson on March 4, 1916.[7]\n\nAdmiral Sampson died of a cerebral hemorrhage on May 6, 1902, in Washington, D.C.,  and is buried in Arlington National Cemetery.[8][9]\n",
  "concepts": [
    "William T. Sampson",
    "sampson",
    "admiral",
    "cervera",
    "squadron",
    "schley",
    "naval",
    "fleet",
    "command",
    "navy",
    "1898"
  ],
  "findings": [
    "Biography",
    "Spanish–American War",
    "Awards",
    "Dates of rank",
    "Namesakes",
    "Personal life",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:27.765052"
}