{
  "title": "Gerry Hitchens",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Gerry_Hitchens",
  "content": "Gerald Archibald Hitchens (8 October 1934 – 13 April 1983) was an English footballer who played as a centre forward.[1][2]\n\nHitchens was born in the village of Rawnsley, Staffordshire, near Cannock, and began his career as a coal miner. He played in Shropshire with Highley Youth Club and Highley Miners Welfare between 1952 and 1953. He appeared in a county cup final for the Miners at Aggborough, the home stadium of local club Kidderminster Harriers. His performance was being watched by the Harriers club secretary Ted Gamson, who went on to offer Hitchens a contract in September 1953. After several seasons in the reserves, Hitchens played fourteen games for the first team, scoring six goals.\n\nDespite interest from West Bromwich Albion and Aston Villa, Hitchens moved to Cardiff City in January 1955 for a fee of £1,500. Hitchens got off to a good start by scoring within three minutes of the kick-off when making his League debut against Wolverhampton Wanderers in April 1955. Hitchens was then playing inside-forward but he subsequently took over the centre-forward berth and was top scorer in the subsequent two seasons.[3]\n\nHitchens moved on to Aston Villa in 1957 for £22,500, where he spent four seasons, scoring 96 goals in 160 appearances.[4][5]\n\nHe made his debut for England in 1961, scoring after just 90 seconds in an 8–0 drubbing of Mexico, and two weeks later scored twice more in Rome as England beat Italy 3–2.\n\nThis brought him to the attention of Inter Milan, who signed him in the summer of 1961 for £85,000.\nHitchens was Internazionale's top scorer with 16 goals in his first season.[6]\n\nHe played for England in the 1962 World Cup in Chile, and won a total of seven caps, scoring five goals. When chosen to appear for England in the World Cup, Hitchens became the first Englishman to represent his country while on the books of a foreign club.[7] Inter won Serie A in 1963, making him the second Englishman to win the Italian title after Jimmy Greaves and the last until Ashley Young did so for the same club in 2021.[8]\n\nHowever, when Alf Ramsey took over as England manager, Hitchens' international spell came to a halt, Ramsey preferring to pick home-based players.[9][10]\n\nNevertheless, Hitchens stayed in Italy for nine years, also playing for Torino, Atalanta and Cagliari.\n\nAfter retiring from the professional game in 1971, he played for Worcester City and Merthyr Tydfil before moving to live in Wales, managing an ironworks in Pontypridd before moving north to Holywell, Flintshire, in 1977 to run his brother-in-law's timber supply firm near Prestatyn.\n\nHe died playing in 1983 during a charity football match for a Mold-based firm of solicitors at Castell Alun sports ground in Hope. Seconds after heading a cross over the bar, Hitchens collapsed and was taken to Wrexham General Hospital but pronounced dead on arrival. His ashes were interred in Holywell on 20 April 1983. He was 48.[11]\n\nCardiff City\n\nAston Villa\n\nInter Milan\n\nTorino\n",
  "concepts": [
    "Gerry Hitchens"
  ],
  "findings": [
    "Early career",
    "Professional career",
    "Career statistics",
    "Honours",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:12:53.907214"
}