{
  "title": "Glastonbury chair",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Glastonbury_chair",
  "content": "Glastonbury chair is a nineteenth-century term for an earlier wooden chair, usually of oak, possibly based on a chair made for Richard Whiting, the last Abbot of Glastonbury, England. The Glastonbury chair was known to exist since the Early Middle Ages, but seems to have disappeared from use in part of the Later Middle Ages; it re-emerged in use in Italy by the fifteenth century AD.\n\nIn England it was made originally from a description brought back from Rome in 1504 by Abbot Richard Beere to Glastonbury Abbey, and was produced for or by John Arthur Thorne, a monk who was the treasurer[1] at the abbey. Arthur perished on Glastonbury Tor in 1539, hanged, drawn and quartered alongside his master, Richard Whiting, the last Abbot of Glastonbury, during the dissolution of the monasteries. The Abbot sat on a Glastonbury chair during his trial at Bishop's Palace, Wells, where one of the two original surviving examples (illustrated) can still be seen, together with other chairs of this age and later reproductions.\n\nAnother chair of the same style, believed at the time to be of the same date, was owned by Horace Walpole and kept in his Gothic pile Strawberry Hill in Twickenham, Middlesex. When the contents were sold in 1842,[2]  the then vicar of Glastonbury, the Reverend Lionel Lewis, made an impassioned speech telling the bidders the chair belonged in Glastonbury. Nobody bidding against him, Lewis took the chair to St John's Church in Glastonbury where it remains.  However, this chair is now believed to be a later copy.[3][4]\n\nThe Glastonbury chair design has become popular with reenactors, owing to its simple construction, wide availability of plans (see External links),[5] and the opportunity for extensive decorative carving. As a result, there are likely more chairs of this pattern in existence now than there ever were in period.\n\nThe chair does not fold. Although it is frequently assumed to do so, especially when made with circular tenons, triangular frames remain rigid even if they are joined by bearings. If the tenons are tusked then the chair may be quickly dismantled for shipping. Chairs for re-enactment are usually made in this way, but there is no evidence in period that they were regarded as being especially portable. The peripatetic nature of upper-class life in the 15- and 16-hundreds meant most of its furniture was made to be transported.\n",
  "concepts": [
    "Glastonbury chair"
  ],
  "findings": [
    "See also",
    "References",
    "Further reading"
  ],
  "timestamp": "2025-04-11T10:19:58.801551"
}