{
  "title": "Mayoralty of Fiorello La Guardia",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Mayoralty_of_Fiorello_La_Guardia",
  "content": "Fiorello La Guardia served as the 99th Mayor of New York City from January 1, 1934, to January 1, 1946. His mayoralty presided over New York City during the Great Depression and World War II. He is considered the builder of modern New York City due to his numerous infrastructure projects.[3] He replaced John P. O'Brien and was succeeded by William O'Dwyer.\n\nBefore La Guardia's election as mayor in 1933, Tammany Hall had controlled the mayoralty for the past twelve years.[4] He would win reelection two times and became the first Mayor of New York City to serve three terms. During his three terms as mayor he oversaw government reforms, fought against Tammany Hall, increased the budget by over $200 million, oversaw the development and completion of multiple infrastructure projects, and collaborated with President Franklin D. Roosevelt on multiple New Deal policies.\n\nLa Guardia is regarded as the best mayor in New York City's history and one of the best mayors in American history, according to The New York Times.[5] The Guardian, in its obituary of La Guardia, stated that he was \"the most remarkable mayor of a great city in American history\".[6] Another Republican would not win election as Mayor of New York City until John Lindsay won in the 1965 election and a Republican would not serve more than one term as mayor until Rudy Giuliani.[7][8]\n\nFiorello La Guardia wrote legislation in 1934, which would have reformed New York City's government, but it failed as it lacked a two-thirds majority with 81 members of the New York State Assembly voting in favor and 61 voting against.[9] An almost identical version of the legislation was put up again, but failed with 93 members voting in favor and 50 members voting against.[10] Another version of the legislation, which was described by La Guardia as a \"puny, anaemic and undersized baby\", passed in the Assembly with 120 members voting in favor and 23 members voting against.[11] The legislation passed in the New York State Senate and was signed into law by Governor Herbert H. Lehman on April 10, 1934.[12]\n\nFred C. Lemmerman, a commissioner of the Triborough Bridge Authority and who had been appointed by the pro-Tammany Hall Mayor John P. O'Brien, was placed under investigation and accused of receiving $930 as a brokerage fee for consummating a lease for bridge authority offices. Lemmerman later resigned from his position and La Guardia appointed George Vincent McLaughlin to fill the vacancy.[13][14][15] La Guardia later fired Commissioner John Stratton O'Leary and replaced him with Robert Moses causing the Triborough Bridge Authority to only have one pro-Tammany Hall member, Nathan Burkan, on the board.[16][17] Burkan, who was an influential district leader in Tammany Hall, died on June 6, 1936.[18]\n\nLa Guardia instituted civil service reforms during his tenure. The number of civil servants with unclassified positions fell from 15,000 to 1,500 from 1933 to 1940, and civil service applications rose from 6,327 in 1933, to over 250,000 by 1939. Irish-Americans, who dominated civil service leadership and patronage under Tammany, fell from being heads of 25-40% of departments to 5% under La Guardia.[19]\n\nLa Guardia appointed William Bowne Parsons to succeed Raymond J. O'Sullivan, secretary of Tammany Hall, on the Board of Assessors.[20]\n\nLa Guardia served as president of the United States Conference of Mayors from 1935 to 1945.[21][22]\n\nLa Guardia appointed Eugene Faulkner as a New York City Marshal, in 1935, making him the second black person and first black Republican to hold that position.[23] He appointed Jane Bolin as a judge in 1939, making her the first black woman to serve as a judge in the United States.[24]\n\nLa Guardia's efforts to improve racial relations were awarded by the Schomburg Center for Research in Black Culture and the Association for the Study of Negro Life and History in 1940. However, he was criticized by Adam Clayton Powell Jr. who accused La Guardia of ignoring the concerns of black people as he no longer needed their votes and stated that La Guardia was \"one of the most pathetic figures on the current American scene\".[4]\n\nThe Quinn-Ives Act, which prohibited discrimination in hiring and established a committee to investigate complaints, was signed into law by Governor Thomas E. Dewey in March 1945, and La Guardia created the Mayor's Committee to Integrate Baseball with Branch Rickey serving on the committee.[25]\n\nLa Guardia appointed John F. O'Ryan[26] then Lewis Joseph Valentine to serve as New York City Police Commissioner.[27] O'Ryan resigned after disputes between him and La Guardia about the police response to union strikes and accused La Guardia of encouraging \"Communists and the vicious elements of the city\".[28] La Guardia appointed Austin MacCormick to serve as Commissioner of the New York City Department of Correction and during their tenure they oversaw the development and completion of Rikers Island Penitentiary to replace Welfare Island Penitentiary as New York City's jail.[29]\n\nLa Guardia fought against Frank Costello's gambling empire and ordered raids that confiscated hundreds of slot machines. Costello converted 15,000 of his slot machines into candy machines and gained a court injunction against further raids. La Guardia continued the confiscations and had Paul Windels appeal the injunction. Anna Jurovaty was arrested for having one of the machines on her property and La Guardia found her guilty using his powers as a magistrate. Costello and Phillip Kastel later moved their gambling activities to Louisiana.[30]\n\nFollowing the Harlem riot of 1935, which resulted in over $2 million worth of property damage, La Guardia created an interracial commission to study the conditions that led to the riot occurring. The commission, which included Oswald Garrison Villard, Countee Cullen, Hubert Thomas Delany, A. Philip Randolph, and E. Franklin Frazier, reported after an eight-month investigation that the lack of social services, employment discrimination, police brutality, and overcrowded schools led to the riot.[31] Following the Harlem riot of 1943, La Guardia instituted a curfew of 10:30 P.M., the last curfew instituted in New York City until the 2020 COVID-19 pandemic, and had it enforced by 6,000 police and 1,500 civilian volunteers.[32][33]\n\nLa Guardia stated in 1935, that New York City was no longer the crime capital of the United States and that Chicago now held the highest crime rate in the United States.[34] However, Wilbert Crowley, the First Assistant State's Attorney, criticized La Guardia's statement and said that \"we consider ourselves in a splendid position\" and asked for where La Guardia got his crime statistics from.[35]\n\nLa Guardia commissioned a report by the New York Academy of Medicine in 1938, to study the effects of marijuana. The report was released in 1944, and showed that marijuana was not physically addictive, not a gateway drug, and did not lead to crime.[36][37]\n\nLa Guardia appointed William Fellowes Morgan Jr. to serve as Commissioner of Public Markets to prevent racketeering in New York City's markets and Morgan appointed Michael Fiaschetti to clear racketeers out of the markets.[38]\n\nLa Guardia revealed a plan in 1934, to develop a $101 million municipal power plant in New York City starting on February 1, 1935.[39] However, the Consolidated Gas Company filed a lawsuit to prevent a proposed referendum on whether or not to build the municipal plant and the courts ruled in favor of the Consolidated Gas Company.[40]\n\nThe Independent Subway System (IND) was opened in 1932, but New York City did not assume control of the system until 1940, under La Guardia and would remain under political control until the system was given to the New York City Transit Authority in 1953.[41] He sought a $57,639,000 loan from the Public Works Administration to construct the Sixth Avenue Line in 1935, started construction on March 23, 1936, and the project was completed at a cost of $59,500,000 in 1940.[42][43][44]\n\nLa Guardia formed the New York City Department of Parks and Recreation in 1934, by consolidating the five boroughs' independent parks departments and placing it under the control of Moses as its commissioner. During his tenure 1,800 engineers and designers, along with 70,000 workers in 1934, were employed, using money from New Deal programs, to expand and modernize public spaces.[45]\n\nSixty playgrounds were constructed within La Guardia's first year as mayor and Moses completed Central Park Zoo in 1934.[46] He opened the High School of Music & Art in 1936.[47] The New York City Center was converted from a meeting place of the Shriners to a performing arts centers during La Guardia's tenure as mayor and he himself led the New York Philharmonic in The Star-Spangled Banner when the center was officially converted on December 11, 1943.[48]\n\nLa Guardia called for the creation of a municipal airport in 1935.[49] The New York City Board of Estimate voted twelve to one, with only George U. Harvey voting against, on November 2, 1939, to rename the Municipal Airport to La Guardia Field. Following the death of General Alexander E. Anderson the New York City Council voted to name an airport after him. La Guardia vetoed the legislation, but his veto was overridden by the council.[50]\n\nHistorian Henry Graff stated that La Guardia mastered \"the art of spending public money, before that skill became commonplace\".[51] La Guardia helped plan the Civil Works Administration and Travis Harvard Whitney was appointed by La Guardia's suggestion.[52][53] 20% of the jobs created by the CWA nationally, 200,000, were in New York City. The CWA, Works Progress Administration, and Public Works Administration spent more than $1.1 billion in New York City from 1934 to 1939.[3] Harry Hopkins gave New York City independent administrative control over WPA relief operations in 1936, and Hugh S. Johnson was appointed as its administrator at La Guardia's advice.[22]\n\nLa Guardia presented an outline for a $1 billion public works program to President Franklin D. Roosevelt which would be completed using part of the $4 billion in Roosevelt's national work relief plan.[54] The $1 billion proposal called for educational, sewage, highway, fire department, hospital, housing, and power plants funding. Included in the plan was allocations of $30 million towards the building of municipal power plants, $19 million for 500 steel subway cars, $57,639,000 for the Sixth Avenue subway line, $2,189,000 for the completion of the city subway system, $25,245,000 for sewage treatment works on Wards Island, $9 million for elevated highways, $12 million for the Queens Civic Centre in Jamaica, $18,500,000 for Central Criminal Courts, $9 million for Brooklyn College, $5 million for Brooklyn Public Library, $69 million for thirty-seven sewage treatment plants, $805,000 for nine new fire buildings, $82,241,000 for 142 elementary schools, and $38,508,000 for twenty-two high schools.[55]\n\nMoses' leadership of the Triborough Bridge Authority was opposed by Roosevelt as the two had been political enemies in state politics. He sought the removal of Moses or else federal funds would be withdrawn from the project.[56] Moses ran for governor of New York in 1934, which prevented the president from removing federal funding in order to avoid being see as politically motivated. After the election Harold L. Ickes issued PWA Administrative General Order No. 129 which was targeted at Moses. La Guardia initially promised to not reappoint Moses, but did not. The order threatened La Guardia's plans using $310 million in funding from the PWA and further plans using $100 million. Moses made the issue public, but Roosevelt and Ickes maintained their position despite media criticism. A compromise was reached in which the order would not apply retroactively. The announcement was focused around allowing Langdon Post, chair of the Municipal Housing Authority and Tenement House Commissioner of New York, to maintain his positions while only one sentence was dedicated to Moses. The Triborough Bridge Authority was later given $1.6 billion in federal funding.[57]\n\nHereafter no funds shall be advanced to any authority, board or commission constituting an independent corporation or entity created for a specific project wholly within the confines of a municipality, any of the members of the governing body of which authority, board or commission holds any public office under said municipality.[58]\nNew York City had a budget of $550,961,960.06 in 1935, a budget of $545,541,842 in 1936, a budget of $554,998,917.10 in 1937, a budget of $587,980,567 in 1938, a budget of $578,509,839 in 1939, a budget of $581,048,834.10 from 1940 to 1941, a budget of $573,740,594.13 from 1941 to 1942, a budget of $656,314,369 from 1942 to 1943, a budget of $753,071,123.40 from 1943 to 1944, a budget of $737,400,923 from 1944 to 1945, and a budget of $759,266,401.82 in 1945.[59][60][61][62][63][64][65][66][67]\n\nLa Guardia inherited a $31 million budget deficit from Mayor O'Brien upon taking office and he reduced the deficit by $19 million during 1934.[68] He reduced spending through budget cuts and eliminating over 1,000 positions.[69] A lawsuit was filed regarding the 1938 budget of $589,980,567, which La Guardia was against, and the court ruled five to one in favor of retaining the budget and invalidating the lower budget proposed by La Guardia.[70]\n\nLa Guardia vetoed legislation which would have created an eight hour workday for members of the New York City Fire Department.[71] He supported legislation which would have created an eight hour workday for nurses.[72]\n\nPrior to taking office La Guardia had participated in a rally to protest Nazi Germany's discrimination against Jews. While giving the keynote address at the American National Conference Against Racial Persecution in Germany he stated that Adolf Hitler was \"a perverted maniac\". After taking office as Mayor of New York City he supported a boycott of German products which was being organized by Jews in New York.[73]\n\nPaul Marchandeau, the Mayor of Reims, France, and the head of the Association of the Mayors of France, visited New York City in 1934, and was greeted by La Guardia.[74]\n\nJames Clement Dunn, chief of the Division of Western European affairs in the United States Department of State, delivered an apology to Hans Thomsen, counselor of the German embassy in the United States, on behalf of the Department of State in regards to a statement made by La Guardia about Adolf Hitler.[75]\n\nLa Guardia served as one of the vice presidents of the Non-Sectarian Anti-Nazi League to Champion Human Rights.[76] La Guardia and Allen Wardwell, the chairman of the Greater New York Campaign of Russian War Relief, announced Russian War Relief Week on June 20, 1942, in which they called for people to donate to buy medical supplies for the army of the Soviet Union fight the Nazis.[77]\n\nHe supported changing",
  "concepts": [
    "Mayoralty of Fiorello La Guardia",
    "la guardia",
    "la",
    "guardia",
    "new",
    "york",
    "new york",
    "city",
    "york city",
    "000",
    "mayor"
  ],
  "findings": [
    "Tenure",
    "City government",
    "Civil rights and race",
    "Crime",
    "Development policy",
    "Economic policy",
    "Foreign policy",
    "Housing policy",
    "Elections",
    "1933",
    "1937",
    "1941",
    "References",
    "Works cited"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:37.895974"
}