{
  "title": "Maserati Ghibli (M157)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Maserati_Ghibli_(M157)",
  "content": "The Maserati Ghibli (Tipo M157) is an executive car produced by Italian automobile manufacturer Maserati.[2] The car was unveiled to the public at the 2013 Shanghai Motor Show.[3] The Ghibli ended production at the end of 2023.[4]\n\nThe Ghibli marks Maserati's comeback in the mid-size luxury car segment after two decades of absence, since the last of the Biturbo family saloons went out of production in 1994; it served as a key model in Maserati's plan of expanding its lineup to cover all segments in the luxury car market.[5]\nAssembly of the Ghibli took place alongside that of the Quattroporte VI at the new Giovanni Agnelli Plant in Grugliasco near Turin, Italy. On September 24, 2019, the 100,000th Ghibli rolled off the production line as announced by Maserati.[6]\n\nThe Ghibli was introduced at the 2013 Shanghai Auto Show and marked Maserati's entry into the mid-size executive car market as being positioned below the Quattroporte. The Ghibli is the first car to be underpinned by the Maserati M156 platform and was the company's best seller until the Levante crossover SUV was launched. The company sold 6,000 units of the car in its first year into the market, which alone exceeded the best sales figures for Maserati for 2008, which was 9,000 cars sold in total consisting of different models. The number increased to 22,500 in 2013 and 36,448 in 2014. It continued to increase in 2015 due to the delay in the Levante's launch. The Ghibli also marks the return of the name in the US market as the Biturbo based Ghibli (AM336) was not available for sale there.\n\nThe Ghibli, which is based on a shorter wheelbase than the flagship Quattroporte, uses a steel monocoque chassis with additional subframes with the front subframe made of aluminium. Tested weight distribution for the diesel version stands at 51/49 front/rear.\n\nThe diesel engine in the Ghibli, developed under Ferrari engine specialist Paulo Martinelli, is based on the V6 diesel unit found in the Jeep Grand Cherokee. The engine is exclusive to the European market only. A ZF 8HP transmission powers the rear wheels as used by all the major competition except Mercedes-Benz.\n\nBoth the Ghibli and the Quattroporte share the same suspension although the Skyhook suspension is optional on the former. An optional Koni adaptive sport suspension is also available. From the 2018 model year, the Ghibli can be optioned with one of two new trims, namely GranSport and GranLusso, all of which relate to the interior of the car with the GranSport trim featuring an aggressive front bumper.\n\nThe Ghibli uses a customized version of the Uconnect infotainment system found in other FCA vehicles like the Dodge Charger. Buyers have different leather upholstery for the interior to choose from. An Alcantara headliner, a premium Harman Kardon or Bowers and Wilkins sound system, wood, carbon fiber and optional metal and weaved leather interior inserts and steering wheel are available as an option.[7]\n\nSafety features and amenities include adaptive cruise control, adaptive LED headlights supplied by Magnetti Marelli, lane keep assist, steering assist and brake force assist. The car received a five-star crash test rating from NCAP due to these features.[8][9][10]\n\nThe S is a high-performance variant of the Ghibli boasting power output and performance improvements. It was initially powered by a 410 PS (404 hp; 302 kW) version of the twin-turbocharged V6 engine used in the Ghibli but was uprated at 430 PS (424 hp; 316 kW) in 2017. Despite the similarities to the Alfa Romeo V6 engine, which is also manufactured by Ferrari, the engines are not related to each other since the Maserati engine is a 60-degree V6 (using a block cast by Chrysler) rather than Alfa Romeo's 90-degree unit. The same unit is also used by the high-performance version of the Levante SUV as well as the base trims of the Quattroporte.\n\nThe Ghibli S was initially equipped with a hydraulic power steering which was changed to an electric power steering when the Ghibli range was updated for the 2018 model year. It also benefits from the same safety features as the base Ghibli.[10]\n\nIn occasion of Maserati's centenary, the limited-edition Maserati 100th Anniversary Neiman Marcus Ghibli S Q4 was the luxury car included in the 2014 edition of the Neiman Marcus Christmas Book gift catalogue. It is distinguished by Grigio Maratea paint over a Cuoio tan leather interior, forged multi-spoke wheels and black grille surround. The allotment was limited to 100 units, each priced at US$95,000.[11]\n\nA facelifted Maserati Ghibli and new, hybrid version were unveiled online on 16 July 2020. In a world first, the hybrid version of the Ghibli features a 2.0L turbocharged four-cylinder petrol engine with a 48 volt \"e-Booster\" electric supercharger and supported by a battery.\n\nThe battery is mounted at the rear of the car, which Maserati claims benefits the weight distribution. The hybrid version weighs around 80 kg (176 lb) less than the Diesel version. The car has a maximum output of 330 PS (325 hp; 243 kW) and 450 N⋅m (332 lb⋅ft) of torque delivered from 1,500 rpm. The car has a top speed of 255 km/h (158.45 mph) and acceleration from 0 to 100 km/h (62.14 mph) in 5.7 seconds.[12]\n\nThe Ghibli Trofeo is a high-performance version of the Ghibli powered by a 3.8 L twin turbocharged F154 V8 producing 580 PS (572 hp; 427 kW) at 6,250 rpm and of 730 N⋅m (538 lbf⋅ft) of torque.\nThe engine is built at the Ferrari plant at Maranello to Maserati's specifications. Although new for the Ghibli, the V8 engine has already been used in the past on the Quattroporte GTS. The Trofeo can accelerate from 0-60 mph (97 km/h) in 4 seconds, with a top speed of 326 km/h (203 mph).[13]\n\nTo mark the end of production of the twin-turbo V8 engine, Maserati developed two special editions of the Ghibli and the Levante debuting at the 2023 Goodwood Festival of Speed: the Ghibli 334 Ultima and the Levante V8 Ultima. \"334\" denotes the car's top speed in kilometres per hour (208 mph) – which made it the fastest internal combustion-engined four-door sedan in the world at the time. The models were aimed to become collector's items as only 103 units were manufactured, a nod to the Maserati 5000 GT's internal model code, it having been Maserati's first V8-powered road car.[14]\n\nThe Maserati Ghibli shared the architecture of the sixth-generation of the Maserati Quattroporte, but sits on a 200 mm (7.9 in) shorter wheelbase for a 290 mm (11.4 in) shorter overall length. Suspension is a double wishbone unit at the front axle and 5-link multilink unit at the rear axle; Maserati's Skyhook adaptive damping system is optional. All Ghibli models employ a ZF 8-speed 8HP automatic transmission and a rear limited slip differential.[3] The braking system uses vented discs on all four corners, four-piston callipers at the front and floating callipers at the rear; the S models come with larger cross-drilled dual-cast rotors, six-piston callipers at the front and four-piston calipers at the rear.\n\nGhibli's original exterior design produced a drag coefficient of Cd=0.31, value later bested by the 2020 restyled model at Cd=0.29.[15]\n\nFrom launch, the Ghibli is available with a choice of two petrol and one diesel engines: a 3.0-litre 330 PS (243 kW; 325 hp) twin-turbocharged V6 in the base Ghibli models, a 410 PS (302 kW; 404 hp) twin-turbocharged V6 in the high performance Ghibli S or Ghibli S Q4 (all wheel drive version, which is only available with this engine), or a 275 PS (202 kW; 271 hp), 3.0-litre V6 turbo-diesel in the Ghibli Diesel.[3][16]\n\nThe petrol engine is a 2,979 cc (182 cu in) 60-degree V6. It utilizes a turbocharger per cylinder bank, twin intercoolers and direct injection. The engine is designed and assembled by Ferrari. In 2017 the Ghibli S and S Q4 were upgraded to 430 PS (316 kW; 424 hp) and 580 N⋅m (428 lb⋅ft) of torque.\n\nThe Ghibli is the first Maserati in history to be offered with a diesel engine. The unit is a 2,987 cc (182 cu in), common rail, single variable-geometry turbocharged A630 V6 designed and produced by Fiat Powertrain's subsidiary VM Motori. On the Italian market, only a slightly detuned diesel version is also available (at the same price) because of the higher taxation on cars with more than 250 PS (184 kW; 247 hp).\n\nIn early September 2023, Maserati announced that production of the V8-engined Ghibli models (as well as the Quattroporte) will conclude at the end of 2023. The Ferrari-built V6 may be replaced with Maserati's own Nettuno V6 engine.[17]\n\nThe high performance S version of the Ghibli is also available with all-wheel drive; this powertrain is the same as that in the Quattroporte VI (Q4).[18] Attached to the end of the 8-speed transmission is a transfer case, containing an electronically controlled multi-plate wet clutch, which sends power through a drive shaft to an open differential bolted to the oil pan. During normal operation the car is rear-wheel drive only; when needed the system can divert up of 50% of engine power to the front wheels.[3] The system adds 59 kg (130 lb) to the weight of the car, with no change in gas mileage or weight distribution. All-wheel-drive Maserati vehicles make up 70 percent of the company's sedan sales in the United States.[18]\n\nAt the 2014 Paris Motor Show Maserati unveiled the Ghibli Zegna Edition Concept, a concept car previewing the marque's second collaboration with Italian fashion house Ermenegildo Zegna after the Quattroporte Zegna limited edition. The cabin is upholstered in Poltrona Frau leather and anthracite Zegna silk fabric; the exterior features triple-layer \"Azzurro Astro\" paint and special \"Liquid Silver\" 20 inch wheels. The concept car is based on a Ghibli S Q4.[19]\n\nThe Maserati Ghibli passed the Euro NCAP car safety tests in 2013, receiving a five-star rating.\n\nIn 2013 the US-specification 2014 Maserati Ghibli was tested by the Insurance Institute for Highway Safety, receiving \"Good\" rating in all four tests (moderate overlap front impact, side impact, roof strength, head restraints and seats); it therefore qualified for the 2013 Top Safety Pick.[24]\n\nIn 2021, the Trofeo includes features such as: Full-speed adaptive cruise control, traffic-sign recognition, blind-spot monitoring, lane-keeping assist, automatic emergency braking.[25]\n\nIn the United States, the Ghibli was used in a commercial during Super Bowl XLVIII called \"Strike\", which aired on 2 February 2014.[26] This marked the first time that Maserati aired an ad in the United States, which is part of Fiat Chrysler's promotional push to expand its brands in North America, as it prepared to sell the Ghibli there in the first quarter of 2014.[27]\n\nThe Ghibli appears in the 2015 film Furious 7 and was driven by Deckard Shaw (Jason Statham).\n",
  "concepts": [
    "Maserati Ghibli (M157)"
  ],
  "findings": [
    "Overview",
    "Variants",
    "Ghibli",
    "Ghibli S",
    "Ghibli Neiman Marcus",
    "2020 Facelift",
    "Trofeo",
    "334 Ultima",
    "Specifications",
    "Engines",
    "Q4 all-wheel drive system",
    "Concept cars",
    "Ghibli Zegna Edition Concept",
    "Sales",
    "Safety",
    "Marketing",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:20:00.507462"
}