{
  "title": "List of assassinated people from Turkey",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/List_of_assassinated_people_from_Turkey",
  "content": "\nThe following is an incomplete, chronological list of people from Turkey murdered by assassins mainly on political and religious grounds. Many were critical public servants and intellectuals assassinated by far-right proponents of an army-controlled Turkish Republic.[1] Many of the victims have historically been intellectual proponents of laicism and the strict separation of religion and state in Turkey, as defined in the constitution, and diplomats who were victims of militant attacks outside of Turkey.[2]\n\nThe event is considered to be the first in a decade-long chain of organized attacks against Turkish diplomats by Armenian militant groups.[4]\n\n28 September 1979: prosecutor.\n\n12 October 1979: son of the Turkish ambassador to the Netherlands, Özdemir Benler, murderered by ASALA.[11]\n\nOn 5 September 2006 he was shot dead from behind while kneeling in prayer in the church. A witness heard the perpetrator shouting \"Allahu Akbar\". A 16-year-old high school student was arrested two days after the shooting carrying a 9mm pistol. An investigation by the Air Force Office of Special Investigations on stolen weaponry in Iraq revealed that the gun was of the same type used in the supposedly Islamist attack on the Turkish Council of State in 2006.\n\n19 December 2009: founder and editor of the daily Güney Marmara’da Yaşam, was shot in a street in Bandırma, Balıkesir Province and died later that day at a hospital in Bursa. He had reported on corruption charges involving the owners of İlkhaber, another daily in the town.[29][30]\n\n19 December 2016: Andrei Karlov, the Russian Ambassador to Turkey, was assassinated by Mevlüt Mert Altıntaş, an off-duty Turkish police officer, at an art exhibition in Ankara, Turkey[31][32][33]\n\nSinan Ateş\n",
  "concepts": [
    "List of assassinated people from Turkey"
  ],
  "findings": [
    "Mustafa Suphi",
    "Sabahattin Ali",
    "1970s",
    "Mehmet Baydar and Bahadır Demir",
    "Daniş Tunalıgil",
    "Ismail Erez",
    "Taha Carim",
    "Bedrettin Cömert (tr)",
    "Doğan Öz",
    "Bedri Karafakıoğlu",
    "Abdi İpekçi",
    "Metin Yüksel",
    "Cevat Yurdakul",
    "Ahmet Benler",
    "İlhan Egemen Darendelioğlu",
    "Cavit Orhan Tütengil",
    "1980s",
    "Ümit Kaftancıoğlu",
    "Gün Sazak",
    "Nihat Erim",
    "Kemal Türkler",
    "Şarık Arıyak",
    "Kemal Arıkan",
    "Atilla Altıkat",
    "Esat Oktay Yıldıran",
    "1990s",
    "Muammer Aksoy",
    "Çetin Emeç",
    "Turan Dursun",
    "Bahriye Üçok",
    "Hulusi Sayın",
    "Memduh Ünlütürk",
    "Kemal Kayacan",
    "Musa Anter",
    "Zübeyir Akkoç",
    "Uğur Mumcu",
    "Cem Ersever",
    "Onat Kutlar",
    "Metin Göktepe",
    "Özdemir Sabancı",
    "Ahmet Taner Kışlalı",
    "2000s",
    "Gaffar Okkan",
    "Üzeyir Garih",
    "Necip Hablemitoğlu",
    "Andrea Santoro",
    "Mustafa Yücel Özbilgin",
    "Hrant Dink",
    "Necati Aydın, Uğur Yüksel and Tilman Geske",
    "İhya Balak (tr)",
    "Ahmet Yıldız",
    "Cihan Hayırsevener",
    "Andrei Karlov",
    "See also",
    "References"
  ],
  "timestamp": "2025-04-11T10:08:57.527359"
}