{
  "title": "Francisco Camacho Sr.",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Francisco_Camacho_Sr.",
  "content": "Francisco Camacho Sr. (1924-1955) was a Philippine Army enlisted trooper and a recipient of the Philippines' highest military award for courage, the Medal of Valor.[3]\n\nIn 1955, Camacho and fellow Scout Ranger Weene Martillana were tasked by their commander, Ernesto S. Mata to neutralize Hukbalahap commander Eddie Villapando who was operating in Cavite, Laguna and Batangas. In the subsequent military operation, Camacho and Martillana succeeded in killing Villapando and his bodyguards; Camacho however died of wounds suffered during the firefight.\n\nThe intelligence operation, designated \"Operation Secret\", was deemed very risky. Camacho and Martillana posed as civilians and befriended Villapando and his bodyguards. On 20 December 1955, Camacho, Martillana, Villapando and two Hukbalahap bodyguards were aboard a jeep traveling the highway from San Pablo City and Calauan town in Laguna with Camacho at the wheel. \nHe pulled over in front of the gate of what is now the International Rice Research Institute in Barangay Maahas in Los Baños, Laguna at the pretense of checking on the engine.\n\nAs Camacho got off the vehicle, Martillana did the same. One asked the other, \"Malamig, ano?\" (\"It's cold, isn't it?\"). The response was, \"Oo nga.\" (\"Yes, it is.\"); this was their pre-arranged signal to begin the attack. They grabbed two submachine guns and opened fire, killing Villapando and one of his bodyguards. The other, though seriously wounded, managed to shoot Camacho before succumbing to his wounds. Camacho later died at a hospital.\n\nMaster Sergeant Camacho and Corporal Martillana were conferred the Medal of Valor by President Ramon Magsaysay, posthumously in Camacho's case.[4] At the time, the two Scout Rangers were the only enlisted personnel honored to receive the medal.\n\n\"By direction of the President, pursuant to paragraphs 2a, Section I, AFPR G 131-051, this Headquarters, dated 21 January 1954, the Medal for Valor is hereby posthumously awarded to:\n\nMaster Sergeant Francisco M Camacho 504735\nPhilippine Army\n\nFor distinguishing himself conspicuously by gallantry and intrepidity at the risk of his life above and beyond the call of duty. Master Sergeant Camacho together with Corporal Martillana, Members of 1st Scout Ranger Regiment, posed as civilians and befriended Eddie Villapando, notorious Huk Commander who terrorized Cavite and Batangas for many years. With Master Sergeant Camacho as leader, these enlisted men, after establishing contact with Villapando in September 1955, skillfully and at great risk to themselves, managed to win the confidence of Villapando and his bodyguards. On or about 2200hours, 20 December 1955, the opportunity to bring success to the project came when Villapando, Commander Gueverra, two huk bodyguards, Master Sergeant Camacho and Corporal Martillana were riding in a jeep. Master Sergeant Camacho, who was at the wheel, stopped at the vicinity of Barrio Tabon, Calauan, Laguna on the pretense that the jeep needed some oil. He got out of the vehicle to pour oil on the engine, while corporal Martillana followed presumably to help him. At a pre-arranged signal they immediately opened fire on the Huks and, with concentrated fire, they were able to kill Commander Villapando, Commander Gueverra and one Huk bodyguard. One of the Huks managed to shoot back, hitting Master Sergeant Camacho, who died soon afterwards. The extraordinary heroism and indomitable courage displayed by Master Sergeant Camacho will inevitably form a part of the glorious traditions of our Armed Forces.\"[2]\n\nCamacho was born on 7 October 1924 to Pio Camacho and Aurelia Molina in Virac, Catanduanes. He was married to Expectacion Vargas Sacris; they had three sons; Francisco Jr., Frederico and Fernando.[1] Francisco Camacho Jr. attended the Philippine Military Academy but he quit the PMA in his plebe year. He later enlisted in the Philippine Air Force and fought in battles in Jolo, Sulu against Muslim rebels in 1974.[4]\n\nA marker was constructed to commemorate Camacho on the spot where he fell, however the marker was destroyed when a supermarket was constructed on the site and it was never restored. Camp Francisco Camacho, a Philippine National Police camp in Virac, Catanduanes, is named in his honor. A concrete bust of Camacho was installed at the camp in August 2015.[4]\n",
  "concepts": [
    "Francisco Camacho Sr.",
    "camacho",
    "villapando",
    "martillana",
    "sergeant",
    "master sergeant",
    "master",
    "sergeant camacho",
    "commander",
    "bodyguards",
    "philippine"
  ],
  "findings": [
    "Operation Secret",
    "Medal of Valor citation",
    "Personal life",
    "Commemoration",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:30:32.917178"
}