{
  "title": "Judy Finnigan",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Judy_Finnigan",
  "content": "Judith Adele Finnigan (born 16 May 1948) is an English television presenter and writer. She co-presented ITV's This Morning (1988–2001, 2019–2020) and the Channel 4 chat show, Richard & Judy (2001–2008) alongside her husband Richard Madeley. Her debut novel Eloise, published in 2012, was a Sunday Times bestseller. Her second novel, I Do Not Sleep, was published in 2015.\n\nFinnigan was born in Newton Heath, Manchester, on 16 May 1948. The second of three children, she has two brothers: Callum, who is older and Roger, who is younger. Finnigan attended the local Briscoe Lane Primary School. Finnigan then went on to attend Manchester High School for Girls, an independent school in the city, and later studied English and Drama at the University of Bristol.[1]\n\nIn 1971, Finnigan joined Granada Television as a researcher and in 1974, she moved to Anglia Television in Norwich to become the first female reporter on the About Anglia news team. In 1980, Finnigan returned to Granada in Manchester, working on a range of programmes including Flying Start (with Anthony Wilson), Granada Reports and Scramble.\n\nThe couple's best known programme was This Morning, which they hosted from 1988 to 2001. The series, a mix of celebrity interviews, household tips, cookery and phone-ins lasted approximately two hours each weekday morning on ITV. It first aired in October 1988 and was broadcast from the Albert Dock in Liverpool, although production moved to London in 1996. Madeley and Finnigan were so closely associated with the show, that many people referred to the show as This Morning with Richard and Judy or simply Richard and Judy. In December 2000, at the 6th National Television Awards, This Morning won the Daytime Programme category. Both Richard and Judy accepted the award, in which Finnigan suffered a wardrobe malfunction which exposed her bra to the audience at the Royal Albert Hall and television viewers. Once Madeley had noticed the malfunction, he said: \"If you vote for us next year she'll show you both of them!\"[2]\n\nThe couple have returned to the show as guests since leaving. In October 2013, they were guests for the show's 25th birthday show live from the Albert Dock in Liverpool – the original home of This Morning.[3]\n\nIn 2001, the couple left This Morning, having been approached by Channel 4[4] to host a similar show, simply called Richard & Judy, shown for an hour in the early evenings. The show was produced by Cactus TV, run by Jonathan Ross' brother, Simon Ross and his wife Amanda.\n\nIn February 2007, the couple publicly apologised live on air due to the discovery of a TV quiz phone scam regarding the daily phone in You Say We Pay. On the same show, Madeley and Finnigan made the decision to suspend the daily quiz until further notice. Later that week, the media confirmed that police investigations would be pursued, meaning the couple could be subject to a police interview. Channel 4 have admitted the scam may have been in force for two series of the show. While Madeley and Finnigan urged callers to continue entering, it was confirmed that winners were picked in the first ten minutes of the show. The couple both deny being involved in the scam[5] that was revealed by The Mail on Sunday newspaper after it was sold the story through media publicist Jonathan Hartley.\n\nThe television show also launched two very successful \"clubs\", the Richard & Judy Book Club and the Richard & Judy Wine Club, both of which are similar in style to those made popular by US TV presenter Oprah Winfrey. The book club featured literature by new and unknown writers. One book was reviewed each week and the winner, named \"Read of the Year,\" was announced at an awards ceremony.\n\nIn July 2008, Finnigan finally underwent a long-awaited knee operation and took a short leave of absence from the show to recuperate fully from the surgery. During this time, Madeley was joined by guest presenters Emma Bunton and Myleene Klass and on 23 July, he presented the episode by himself. On 22 August 2008, the couple's Channel 4 series aired its final episode.\n\nAfter seven years at Channel 4, Finnigan and Madeley began hosting a topical prime-time chat show on UKTV's new digital channel, Watch. From 7 October 2008, Richard and Judy's New Position aired on weeknights from 8pm. The programme still contained popular features such as the \"Book Club\" and \"Summer Read\". The show attracted very low viewing figures, with only 200,000 people for the first episode, and 53,000 for the second. Viewing figures since had consistently fallen, reaching new lows of just 11,000 viewers; their Channel 4 programme would see figures as high as 2,500,000.[6] Consequently, on 8 May 2009, it was announced that the show would end in July, claiming in a statement that viewers \"simply couldn't find us\".[7]\n\nOn 13 October 2014, it was announced that Finnigan had joined ITV chat show Loose Women as a regular panellist.[8][9]\n\nOn her first day, 13 October 2014, Finnigan was criticised when the panel discussed footballer Ched Evans, who was convicted of rape in 2012 before being acquitted in 2016 after two witnesses, who were offered a £50,000 reward for testimony leading to an acquittal, testified to having consensual sex with Evans' alleged victim around the time of the alleged rape.[10][11] Finnigan stated that Evans should be able to return to his club as the victim was drunk and the alleged rape was \"unpleasant\" but \"not violent\".[12]\n\nFinnigan stated later in the day: \"I apologise unreservedly for any offence that I may have caused as a result of the wording I used.\"[13] She continued to make intermittent appearances on the programme,[14] her final appearance on the series being in 2015.[15] Evans was acquitted of any wrongdoing in October 2016.[10]\n\nFinnigan presented a series of video-only specials, looking at a particular character of Coronation Street and were released in 1995 to mark the soap's 35th anniversary.\n\nFinnigan, and her husband, Richard Madeley, were the subjects of This Is Your Life in 1997 when they were surprised by Michael Aspel live on air while broadcasting This Morning.[16]\n\nIn 1998, Finnigan presented the ITV Watchdog style show We Can Work It Out in its first series before Caron Keating took over.\n\nMadeley and Finnigan co-wrote their autobiography, Richard and Judy: The Autobiography, published in 2002 by Hodder & Stoughton. In 2012, her novel, Eloise, was published and became a Sunday Times best seller. A second novel, I Do Not Sleep, followed in 2015 and a further novel, Roseland, in 2023.\n\nFinnigan met Madeley in 1982 when they worked on separate programmes for Granada TV. At this time, each was in their first marriage. The couple married in 1986 in Manchester and have two children together, both born in Manchester: Jack Christopher (born 1986) and Chloe Susannah (born 1987). Finnigan has twin sons – Dan and Tom (born 1977) – from her first marriage with journalist David Henshaw.[17]\n",
  "concepts": [
    "Judy Finnigan",
    "finnigan",
    "richard",
    "madeley",
    "richard judy",
    "judy",
    "morning",
    "couple",
    "channel",
    "television",
    "series"
  ],
  "findings": [
    "Early life",
    "Career",
    "This Morning",
    "Richard & Judy",
    "Loose Women",
    "Other work",
    "Personal life",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T17:04:22.523819"
}