{
  "title": "Shon Faye",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Shon_Faye",
  "content": "Shon Faye (born 27 March 1988) is an English writer, editor, journalist, and presenter, known for her commentary on LGBTQ+, women's, and mental health issues. She hosts the podcast Call Me Mother and is the author of the 2021 book The Transgender Issue: An Argument for Justice. She was an editor-at-large at Dazed and has contributed features and comment journalism to The Guardian, The Independent, VICE, n+1, Attitude, Vogue, Verso and others.\n\nFaye was born in Bristol.[1] She studied English Literature at the University of Oxford, followed by a Graduate Diploma in Law.[2] Faye moved to London in her early twenties, where she worked as a lawyer.[3] In Faye's own words, she later \"had a complete implosion, quit my job, moved back to Bristol and came out as a trans woman\".[3] She is now based in London.[1]\n\nFaye began her writing career in 2014.[4] The focus of Faye's editing and writing has been sexuality, feminism and mental health.[5][3][6][7] She has written and appeared in two short films[8] and her debut, Catechism,[9] was exhibited at the Tate Britain 'Queer British Art' exhibition in 2017.[10][11] She presented an online video series called Shon This Way[12] for Novara Media in 2017, which dealt with queer politics and history.\n\nIn a 2017 historical review for The Guardian, political columnist Owen Jones cited Faye, along with Paris Lees and Munroe Bergdorf, as emerging \"brilliant trans voices\".[13] Her art has been exhibited in the show Am I Making Sense at the Hoxton Arches.[14] In 2017, Faye used her column in The Guardian to call attention to the need for trans women to have access to support services in response to rape and domestic violence.[15]  In 2018, she presented at Amnesty International's Women Making History event, where she gave a speech calling for the public to \"re-centre\" underprivileged trans women.[16][17]\n\nShe hosts Call Me Mother,[18][19] a podcast that \"rails against the patronising image that reaching your 60s and 70s involves sitting under a blanket and knitting, by talking to older LGBTQ trailblazers,\" according to The Guardian.[20] A review of the podcast in GQ includes, \"This isn’t just a podcast for queer people, anybody can listen and enjoy the stories being shared and learn something about queer life.\"[21] Erin Patterson wrote for British Vogue that the podcast \"highlights to me that I have a history as a queer person, I have ancestry.\"[22]\n\nIn 2021, Faye published The Transgender Issue: An Argument for Justice, described in a review by Fiona Sturges of The Guardian as \"sobering reading\". Sturges writes, \"I had anticipated raw fury, but while the author talks about the ways trans people are publicly monstered, hers is a cool dismantling of the myths and falsehoods that continue to blight their lives.\"[23] Felix Moore writes in a review for The Guardian that \"many cisgender people live in blissful ignorance of the acute crises that face trans people in this country every day\" and \"It is those people who really need to read this book.\"[24] In a review for the Evening Standard, Stella O'Malley described the book as \"a welcome contribution to the trans debate\".[25] In a review for The Times Literary Supplement, Christine Burns writes, \"This will be a challenging book for those lulled by the nonsense that sometimes passes for journalism about trans lives.\"[26]\n\nIn March 2022 it was announced that Faye would release a second non-fiction book Love in Exile, due out in 2025, again on Allen Lane. Love in Exile is a literary memoir which explores the concepts of love and fulfillment in a lonely age.[27][28]\n\nFaye is a supporter of the boycott of Israeli cultural institutions, including publishers and literary festivals, and was an original signatory of the manifesto \"Refusing Complicity in Israel's Literary Institutions\".[29]\n",
  "concepts": [
    "Shon Faye"
  ],
  "findings": [
    "Early life and education",
    "Career",
    "Works",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:15:29.635893"
}