{
  "title": "AMOS-1 (satellite)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/AMOS-1_(satellite)",
  "content": "AMOS-1, then Intelsat 24, was a commercial communications satellite which was operated by Spacecom as AMOS-1, for Affordable Modular Optimized Satellite and formed part of the AMOS series of satellites. It was the first Israeli civilian communications satellite, and was initially positioned at 4° West longitude in geostationary orbit.[1] Then in September 2011, it was moved to 31° East.[2]\n\nIts development was based on experience from Ofeq reconnaissance satellites in association with DASA and Alcatel Espace. It was used for home television services (DTH/DBS by \"Yes\" company in Israel and by HBO and others in Europe). Spacecom succeeded quickly to fill all transmission abilities of AMOS-1 and accumulated additional requests. Therefore, Spacecom decided to build AMOS-2, which replaced AMOS-1 on orbit at 4° West. AMOS-1 carries nine Ku-band transponders.[3]\n\nWeighing 970 kg at launch, AMOS-1 incorporated a 400 newtons liquid apogee motor and fourteen reaction control thrusters, each delivering ten newtons of thrust for raising the satellite's orbit from geostationary transfer orbit (GTO) to its final geostationary orbit as well as for its attitude control. It carried 450 kg of propellant (Monomethylhydrazine and MON-3). AMOS-1 measures 10.55 m in length in its final in-orbit configuration. It is 3-axis body stabilised using Sun and Earth sensors, momentum and reaction wheels. Its solar array generates 1380 watts power, backed up by 24 A·h nickel–cadmium batteries. Cost: US$250 million. The Israeli government supports the program since 1991 with US$15 million per year.[2]\n\nIt was launched on 16 May 1996 from Centre Spatial Guyanais, Kourou in French Guiana, aboard an Ariane 4 launch vehicle flying in the 44L configuration, which launched together with Indonesian Palapa-C2 satellite using Ariane 4's SPELDA system that can launch two satellites stacked on top of another. After its launch, it was raised to its final geostationary orbit by firing the apogee boost motor in phases. After it reached the geostationary orbit, its antennae and solar panels were deployed and the satellite was placed in its allocated slot at 4° West longitude. AMOS-1 and AMOS-2 were placed near each other to enable satellite users to aim once and reach either satellite from the same antenna.[4] Launch was insured for over US$145 million. The satellite AMOS-1 was operational on 1 July 1996.[2]\n\nIn 2009, AMOS-1 was sold to Intelsat, and became Intelsat 24 (IS-24).[5] Intelsat moved it over the Middle East, put it into an inclined orbit to conserve fuel, and rented its capacity to Tachyon Networks for U.S. military communications.[1]\n",
  "concepts": [
    "AMOS-1 (satellite)",
    "amos",
    "satellite",
    "orbit",
    "launch",
    "geostationary",
    "intelsat",
    "geostationary orbit",
    "24",
    "west",
    "spacecom"
  ],
  "findings": [
    "Satellite description",
    "Launch",
    "Intelsat 24",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:04.175508"
}