{
  "title": "Juan Carlos Girauta",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Juan_Carlos_Girauta",
  "content": "Juan Carlos Girauta (Spanish pronunciation: [xwaŋˈkaɾlos xiˈɾawta]; born 12 March 1961) is a Spanish politician who served as Member of the Congress of Deputies in the 2016–2019 legislature.[1] Previously, he has served as Member of the European Parliament from 2014 to 2016, representing Spain for the Citizens political party.[2]\n\nGirauta was born in Barcelona on March 12, 1961, the son of Andalusian lawyer Víctor Girauta Armada (who was linked to the LaRouche movement[3]) and a Catalan language teacher[4] and studied in a Jesuit school.[5] He graduated in Law by the University of Barcelona and obtained an MBA from ESADE. He also started, but did not complete, a PhD in Philosophy.\n\nA former PSC member, Girauta later joined the PP[6] and became a prolific contributor to conservative journalism from his Libertad Digital column,[7] before becoming a Citizens member and candidate in the 2014 European election.[8] For years he lent support to the conspiracy theory about the authorship of the 11-M Madrid train bombings in 2004.[9]\n\nDuring his long tenure as Libertad Digital columnist and COPE debater, Girauta expressed strong sympathies for right-wing Zionism (to the point of calling then-president Zapatero an anti-Semite[10]) and lent credibility [11][12] to the now discredited book by Victor Farías [13] dismissing Socialist politician Salvador Allende as a racist and a Social Darwinist, without clarifying that the quotations about genetic determinism in Allende's doctoral dissertation were themselves quotations from other authors (mostly Cesare Lombroso) or the fact that Allende was highly critical of these conclusions in his thesis, which was later published [14] as a rebuttal to Farías' position. Farías was later sued for this[15] but Girauta never retracted his statements.\n\nHe ran as candidate to lead the list of the party in Toledo the April 2019 general election; more than half of the Talavera de la Reina's Cs branch resigned en masse from party membership, lamenting (among other reasons) such a move.[16][17] He won the party primary nonetheless and he subsequently renewed his seat at the Lower House at the election. He stood again as candidate for Toledo at the November 2019 general election. This time he failed to earn a seat.\n\nOn 5 May 2020 Girauta announced his resignation from Ciudadanos, in disagreement with the party stance to vote in favour of the extension of the State of Alarm during the COVID-19 pandemic.[18] Soon after, in June 2020, he declared his former colleagues remaining in Cs to be \"traitors\" and threatened they \"were going to suck his dick by taking turns\".[19]\n\nGirauta appeared as an independent in the 3rd position of the list presented by far-right Vox to the 2024 elections to the European Parliament.[20]\n",
  "concepts": [
    "Juan Carlos Girauta",
    "girauta",
    "party",
    "member",
    "election",
    "later",
    "farías",
    "european",
    "candidate",
    "allende",
    "2019"
  ],
  "findings": [
    "Early life",
    "Political and journalistic career",
    "Parliamentary service",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T15:18:49.337196"
}