{
  "title": "Dorsey, County Armagh",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Dorsey,_County_Armagh",
  "content": "54°08′49″N 6°31′12″W﻿ / ﻿54.147°N 6.520°W﻿ / 54.147; -6.520\nDorsey or Dorsy (from Irish Na Doirse, meaning 'the gateways')[1] is a small village and townland between Belleeks and Cullyhanna in County Armagh, Northern Ireland. It has an estimated population of 130 to 160 people.[citation needed]\n\nNa Doirse, the gateways, is an extensive earthwork which runs through the South Armagh area. The Dorsey Ramparts, or 'The Walls' as they are known locally, are said to have been a fortified frontier post to the kingdom whose capital was Emain Macha (Navan Fort), blocking an important historic route into South Armagh. It was built at a time when the power of the Ulster kingdom may have been at its strongest, around 100 BCE. Some time later Ulster was threatened from the south and it is speculated that Dorsey may have been incorporated into a more extensive defensive system known in Monaghan and further west as the Black Pig's Dyke.[citation needed]\n\nDorsey is one of the few monuments in the north of Ireland which have been confirmed as Iron Age in date.[2] It is a group of linear earthworks with a perimeter of 4 km, enclosing an area of 300 acres (1.2 km2).[citation needed]. The elongated enclosure measures 1,600 X 330m with an axis  alignment of East/West.[3] There have been a number of archaeological investigations of the Dorsey. There were a number of surveys and descriptions carried out from the 17th to 19th centuries. Much of this work was synthesised by Tempest (Tempest, 1930). Excavations at the South Gate, close to the current excavation, were carried out by Oliver Davies in 1938 (Davies, 1938). Davies also excavated at the north break in the Dorsey, and to the west of the ramparts around the watching stone in 1939 (Dorsey, 1940a). Excavations carried out by Chris Lynn in the 1977 provided dating evidence for the Dorsey. Felling dates of timbers from the southern part of the monument were dated by dendrochronology to 89±9 to 96±9 BC. (Lynn, 1992). Timbers from the northern section were dated by dendrochronology to felling dates of 135 ±9 to 150 ±9 BC (Baillie and Brown, 1989). It has been suggested that the Dorsey may not therefore be an enclosure but two lines of defence, the northern earlier and the southern one later (Lynn, 1989). (Above exert taken from Hurl et al, 2002, 1). \n\nDorsey has been believed to have rituals took en place in (most likely religious). There are several possible reasons why control over space would be exercised at this site, and the presence of the road is central to each interpretation.\n\nThe road was obviously intended for the progression of some form of traffic along its route, though the nature of the traffic may have varied. The division of zones of control at the western side of the road may have been intended to separate different types of traffic; it is also possible that the road may have been reserved, at certain times at least, for ritual or ceremonial functions. If so, the palisades may have been intended to separate participants from spectators.\n\nThe nature of the control of space around the road at this point, however, may have been of a different nature entirely. It may have been intended to exclude persons or animals from the vicinity of the road. The possibility of a pre-existing fortification at the gap in the south ramparts at the Dorsey has been mentioned by Lynn (1989, 8), and Palisades I and II could have formed part of such a fortification.\n\nDorsey has a community centre, a Gaelic football pitch (Rory McGee Park) and a chapel. The chapel in Dorsey was built, in the 1950s, by local people.[4] The site on which the chapel was built was donated by a local, Felix Mackin. Dorsey is part of the parish of Lower Creggan which incorporates Dorsey, Newtownhamilton and Cullyhanna.\n\nDorsey Emmet's GFC is a Gaelic Athletic Association club based in Dorsey and fielding football teams at Under-8, U10, U14, U16 and senior level.\n\nDorsey does not have its own schools. Some local children attend primary school in Carrickrovaddy or Belleeks, County Armagh. Older children attend secondary school in Crossmaglen or in Bessbrook.[citation needed]\n",
  "concepts": [
    "Dorsey, County Armagh",
    "dorsey",
    "road",
    "south",
    "needed",
    "lynn",
    "intended",
    "citation needed",
    "citation",
    "armagh",
    "west"
  ],
  "findings": [
    "'Dorsey ramparts'",
    "Facilities",
    "Sport",
    "Education",
    "References",
    "Notes",
    "4. Dorsey exacvations Centre for Archaeological Fieldwork. 2002."
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:26:21.398355"
}