{
  "title": "747 (performance art)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/747_(performance_art)",
  "content": "747 is a 1973 performance art piece by American artist Chris Burden. The piece is one of a number of photographs of Burden's work that is in the collection of the Metropolitan Museum of Art in New York City.[1]\n\nIn 747, Burden was photographed firing shots with a pistol at a Boeing 747 passenger airplane[which?] while it took off from Los Angeles International Airport at about 8 am on January 5, 1973.[2] It had a single witness, photographer Terry McDonnell, who filmed the act.[citation needed] Burden was later interviewed by the Federal Bureau of Investigation after a photograph of the piece was published in a magazine; a calling card was left by the FBI at his studio. A meeting subsequently took place at his lawyer's house, where he explained the nature of Burden's work in performance art to a FBI agent who conclusively agreed to call off any further investigation.[3]\n\nBurden said of the piece that \"the plane wasn't in any danger. I went down to the beach and fired a few shots at a plane flying over head. I wasn't trying to shoot the plane down, it was more a gestural thing, trying to get it photographed — to make an image\". Burden said in a 1980 interview with David Robbins that he additionally explained to the FBI that the piece was \"about the goodness of man — the idea that you can't regulate everybody. At the airport everybody's being searched for guns, and here I am on the beach and it looks like I'm plucking planes out of the sky. You can't regulate the world\".[3]\n\n747 was analyzed by Daniel Cottom in his 2002 essay \"To Love to Hate\". Cottom identifies the piece as belonging to the Western European artistic tradition of \"misanthropy\", feeling that Burden \"committed an artwork of terrific suggestiveness\" when he fired the gun at the airplane.[4][5]\n\nEnglish critic Dominic Johnson wrote of the piece, in his 2018 book Unlimited Action: The Performance of Extremity in the 1970s, that the \"threat of criminal damage, mass death and personal ignominy ground the formal challenge that confirms the action as a performance [...] Uncertainty, notoriety and doubt form part of a work's existential charm\".[6]\n",
  "concepts": [
    "747 (performance art)"
  ],
  "findings": [
    "Background",
    "Analysis",
    "References"
  ],
  "timestamp": "2025-04-11T10:14:37.953773"
}