{
  "title": "Project Orion (nuclear propulsion)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Project_Orion_(nuclear_propulsion)",
  "content": "Project Orion was a study conducted in the 1950s and 1960s by the United States Air Force, DARPA,[1] and NASA into the viability of a nuclear pulse spaceship that would be directly propelled by a series of atomic explosions behind the craft.[2][3] Following preliminary ideas in the 1940s,[4] and a classified paper co-authored by physicist Stanisław Ulam in 1955,[5] DARPA agreed to sponsor and fund the program in July 1958.[6][7]\n\nEarly versions of the vehicle were designed for ground launch, but later versions were intended for use only in space. The design effort took place at General Atomics in San Diego,[5] and supporters included Wernher von Braun,[8] who issued a white paper advocating the idea.[2][9] NASA also created a Mars mission profile based on the design, proposing a 125 day round trip carrying eight astronauts with a predicted development cost of $1.5 billion.[8] Non-nuclear tests were conducted with models, with the most successful test occurring in late 1959,[7] but the project was ultimately abandoned for reasons including the 1963 Partial Test Ban Treaty,[10] which prohibited nuclear explosions in space amid concerns over radioactive fallout.[2]\n\nPhysicists Ted Taylor and Freeman Dyson led the project, and Taylor has been described as the \"driving force behind Orion.\"[6] In 1979, General Dynamics donated a 26 inch (56 cm) tall wooden model of the craft to the Smithsonian, which displays it at the Steven F. Udvar-Hazy Center in Fairfax County, Virginia.[10]\n\nPhysicist Stanislaw Ulam proposed the general idea of nuclear pulse propulsion in 1946,[4] and preliminary calculations were made by Frederick Reines and Ulam in a Los Alamos memorandum dated 1947.[4][3][11] In August 1955, Ulam co-authored a classified paper proposing the use of nuclear fission bombs, \"ejected and detonated at a considerable distance\", for propelling a vehicle in outer space.[5][4] The project was led by Ted Taylor at General Atomics and physicist Freeman Dyson who, at Taylor's request, took a year away from the Institute for Advanced Study in Princeton to work on the project.[6]\n\nIn July 1958, DARPA agreed to sponsor Orion at an initial level of $1 million per year, at which point the project received its name and formally began.[6][7] The agency granted a study of the concept to the General Dynamics Corporation,[10] but decided to withdraw support in late 1959.[6] The U.S. Air Force agreed to support Orion if a military use was found for the project, and the NASA Office of Manned Spaceflight also contributed funding.[5] The concept investigated by the government used a blast shield and shock absorber to protect the crew and convert the detonations into a continuous propulsion force.[12][13] The most successful model test, in November 1959, reached roughly 100 meters in altitude with six sequenced chemical explosions.[7] NASA also produced a Mars mission profile for a 125 day round trip with eight astronauts, at a predicted development cost of $1.5 billion.[8] Orion was canceled in 1964, after the United States signed the Partial Test Ban Treaty the prior year; the treaty greatly reduced political support for the project.[10][8] NASA had also decided, in 1959, that the civilian space program would be non-nuclear in the near-term.[6]\n\nThe Orion concept offered both high thrust and high specific impulse, or propellant efficiency: 2,000 pulse units (Isp) under the original design and an Isp of perhaps 4,000 to 6,000 seconds according to the Air Force plan, with a later 1968 fusion bomb proposal by Dyson potentially increasing this to more than 75,000 Isp, enabling velocities of 10,000 km/sec.[8] A moderate-sized nuclear device was estimated, at the time, to produce about 5 or 10 billion horsepower.[6][14]\n\nThe extreme power of the nuclear explosions, relative to the vehicle's mass, would be managed by using external detonations, although an earlier version of the pulse concept did propose containing the blasts in an internal pressure structure, with one such design prepared by The Martin Company.[8][6] As a qualitative power comparison, traditional chemical rockets, such as the Saturn V that took the Apollo program to the Moon, produce high thrust with low specific impulse, whereas electric ion engines produce a small amount of thrust very efficiently. Orion, by contrast, would have offered performance greater than the most advanced conventional or nuclear rocket engines then under consideration. Supporters of Project Orion felt that it had potential for cheap interplanetary travel.[15]\n\nFrom Project Longshot to Project Daedalus, Mini-Mag Orion, and other proposals which analyze thermal power dissipation, the principle of external nuclear pulse propulsion to maximize survivable power has remained common among serious concepts for interstellar flight without external power beaming and for very high-performance interplanetary flight.[8] Such later proposals have tended to modify the basic principle by envisioning equipment driving detonation of much smaller fission or fusion pellets, in contrast to Project Orion's larger nuclear pulse units (full nuclear bombs).\n\nThe Orion nuclear pulse drive combines a very high exhaust velocity, from 19 to 31 km/s (12 to 19 mi/s) in typical interplanetary designs, with meganewtons of thrust.[17] Many spacecraft propulsion drives can achieve one of these or the other, but nuclear pulse rockets are the only proposed technology that could potentially meet the extreme power requirements to deliver both at once (see spacecraft propulsion for more speculative systems).\n\nSpecific impulse (Isp) measures how much thrust can be derived from a given mass of fuel, and is a standard figure of merit for rocketry.  For any rocket propulsion, since the kinetic energy of exhaust goes up with velocity squared (kinetic energy = ⁠1/2⁠mv2), whereas the momentum and thrust go up with velocity linearly (momentum = mv), obtaining a particular level of thrust (as in a number of g acceleration) requires far more power each time that exhaust velocity and Isp are much increased in a design goal. (For instance, the most fundamental reason that electric propulsion systems of high Isp tend to be low thrust is due to their limits on available power. Their thrust is actually inversely proportional to Isp if power going into exhaust is constant or at its limit from heat dissipation needs or other engineering constraints.)[18] The Orion concept detonates nuclear explosions externally at a rate of power release which is beyond what nuclear reactors could survive internally with known materials and design.\n\nSince weight is no limitation, an Orion craft can be extremely robust. An uncrewed craft could tolerate very large accelerations, perhaps 100 g. A human-crewed Orion, however, must use some sort of damping system behind the pusher plate to smooth the near instantaneous acceleration to a level that humans can comfortably withstand – typically about 2 to 4 g.\n\nThe high performance depends on the high exhaust velocity, in order to maximize the rocket's force for a given mass of propellant. The velocity of the plasma debris is proportional to the square root of the change in the temperature (Tc) of the nuclear fireball. Since such fireballs typically achieve ten million degrees Celsius or more in less than a millisecond, they create very high velocities. However, a practical design must also limit the destructive radius of the fireball. The diameter of the nuclear fireball is proportional to the square root of the bomb's explosive yield.\n\nThe shape of the bomb's reaction mass is critical to efficiency. The original project designed bombs with a reaction mass made of tungsten. The bomb's geometry and materials focused the X-rays and plasma from the core of nuclear explosive to hit the reaction mass. In effect each bomb would be a nuclear shaped charge.\n\nA bomb with a cylinder of reaction mass expands into a flat, disk-shaped wave of plasma when it explodes. A bomb with a disk-shaped reaction mass expands into a far more efficient cigar-shaped wave of plasma debris. The cigar shape focuses much of the plasma to impinge onto the pusher-plate.[19] For greatest mission efficiency the rocket equation demands that the greatest fraction of the bomb's explosive force be directed at the spacecraft, rather than being spent isotropically.\n\nThe maximum effective specific impulse, Isp, of an Orion nuclear pulse drive generally is equal to:\n\nwhere C0 is the collimation factor (what fraction of the explosion plasma debris will actually hit the impulse absorber plate when a pulse unit explodes), Ve is the nuclear pulse unit plasma debris velocity, and gn is the standard acceleration of gravity (9.81 m/s2; this factor is not necessary if Isp is measured in N·s/kg or m/s). A collimation factor of nearly 0.5 can be achieved by matching the diameter of the pusher plate to the diameter of the nuclear fireball created by the explosion of a nuclear pulse unit.\n\nThe smaller the bomb, the smaller each impulse will be, so the higher the rate of impulses and more than will be needed to achieve orbit. Smaller impulses also mean less g shock on the pusher plate and less need for damping to smooth out the acceleration.\n\nThe optimal Orion drive bomblet yield (for the human crewed 4,000 ton reference design) was calculated to be in the region of 0.15 kt, with approx 800 bombs needed to orbit and a bomb rate of approx 1 per second.[20]\n\nThe following can be found in George Dyson's book.[19] The figures for the comparison with Saturn V are taken from this section and converted from metric (kg) to US short tons (abbreviated \"t\" here).\n\nIn late 1958 to early 1959, it was realized that the smallest practical vehicle would be determined by the smallest achievable bomb yield. The use of 0.03 kt (sea-level yield) bombs would give vehicle mass of 880 tons. However, this was regarded as too small for anything other than an orbital test vehicle and the team soon focused on a 4,000 ton \"base design\".\n\nAt that time, the details of small bomb designs were shrouded in secrecy. Many Orion design reports had all details of bombs removed before release. Contrast the above details with the 1959 report by General Atomics,[24] which explored the parameters of three different sizes of hypothetical Orion spacecraft:\n\nThe biggest design above is the \"super\" Orion design; at 8 million tons, it could easily be a city.[25] In interviews, the designers contemplated the large ship as a possible interstellar ark. This extreme design could be built with materials and techniques that could be obtained in 1958 or were anticipated to be available shortly after.\n\nMost of the three thousand tons of each of the \"super\" Orion's propulsion units would be inert material such as polyethylene, or boron salts, used to transmit the force of the propulsion units detonation to the Orion's pusher plate, and absorb neutrons to minimize fallout. One design proposed by Freeman Dyson for the \"Super Orion\" called for the pusher plate to be composed primarily of uranium or a transuranic element so that upon reaching a nearby star system the plate could be converted to nuclear fuel.\n\nThe Orion nuclear pulse rocket design has extremely high performance. Orion nuclear pulse rockets using nuclear fission type pulse units were originally intended for use on interplanetary space flights.\n\nMissions that were designed for an Orion vehicle in the original project included single stage (i.e., directly from Earth's surface) to Mars and back, and a trip to one of the moons of Saturn.[25]\n\nFreeman Dyson performed the first analysis of what kinds of Orion missions were possible to reach Alpha Centauri, the nearest star system to the Sun.[26] His 1968 paper \"Interstellar Transport\" (Physics Today)[27] retained the concept of large nuclear explosions but Dyson moved away from the use of fission bombs and considered the use of one megaton deuterium fusion explosions instead. His conclusions were simple: the debris velocity of fusion explosions was probably in the 3000–30,000 km/s range and the reflecting geometry of Orion's hemispherical pusher plate would reduce that range to 750–15,000 km/s.[28]\n\nTo estimate the upper and lower limits of what could be done using 1968 technology, Dyson considered two starship designs. The more conservative energy limited pusher plate design simply had to absorb all the thermal energy of each impinging explosion (4×1015 joules, half of which would be absorbed by the pusher plate) without melting. Dyson estimated that if the exposed surface consisted of copper with a thickness of 1 mm, then the diameter and mass of the hemispherical pusher plate would have to be 20 kilometers and 5 million tonnes, respectively. 100 seconds would be required to allow the copper to radiatively cool before the next explosion. It would then take on the order of 1000 years for the energy-limited heat sink Orion design to reach Alpha Centauri.\n\nIn order to improve on this performance while reducing size and cost, Dyson considered an alternative momentum limited pusher plate design where an ablation coating of the exposed surface is substituted to get rid of the excess heat. The limitation is then set by the capacity of shock absorbers to transfer momentum from the impulsively accelerated pusher plate to the smoothly accelerated vehicle. Dyson calculated that the properties of available materials limited the velocity transferred by each explosion to ~30 meters per second independent of the size and nature of the explosion. If the vehicle is to be accelerated at 1 Earth gravity (9.81 m/s2) with this velocity transfer, then the pulse rate is one explosion every three seconds.[29] The dimensions and performance of Dyson's vehicles are given as:\n\nLater studies indicate that the top cruise velocity that can theoretically be achieved are a few percent of the speed of light (0.08–0.1c).[30][verification needed] An atomic (fission) Orion can achieve perhaps 9–11% of the speed of light. A nuclear pulse drive starship powered by fusion-antimatter catalyzed nuclear pulse propulsion units would be similarly in the 10% range and pure Matter-antimatter annihilation rockets would be theoretically capable of obtaining a velocity between 50% and 80% of the speed of light. In each case saving fuel for slowing down halves the maximum speed. The concept of using a magnetic sail to decelerate the spacecraft as it approaches its destination has been discussed as an alternative to using propellant; this would allow the ship to travel near the maximum theoretical velocity.[31]\n\nAt 0.1c, Orion thermonuclear starships would require a flight time of at least 44 years to reach Alpha Centauri, not counting time needed to reach that speed (about 36 days at constant acceleration of 1g or 9.8 m/s2). At 0.1c, an Orion starship would require 100 years to travel 10 light years. The astronomer Carl Sagan suggested that this would be an excellent use for sto",
  "concepts": [
    "Project Orion (nuclear propulsion)"
  ],
  "findings": [
    "Background and planning",
    "Basic principles",
    "Sizes of vehicles",
    "Theoretical applications",
    "Later developments",
    "Costs",
    "Vehicle architecture",
    "Potential problems",
    "Notable personnel",
    "Operation Plumbbob",
    "Notable appearances in fiction",
    "See also",
    "References",
    "Further reading",
    "External links"
  ],
  "timestamp": "2025-04-11T10:15:36.091320"
}