{
  "title": "Moore v. United States (2024)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Moore_v._United_States_(2024)",
  "content": "Moore v. United States, 602 U.S. 572 (2024), was a United States Supreme Court case related to the ability of the federal government to tax unrealized gains as income. The Supreme Court upheld the Mandatory Repatriation Tax (MRT).\n\nCharles and Kathleen Moore invested $40,000 in an Indian business named KisanKraft in 2005, in exchange for 13% of the company's equity. KisanKraft is a controlled foreign corporation. The company has made a profit every year of its existence, and rather than distributing its earnings to shareholders, it has reinvested profits in the business. Prior to the passage of the Tax Cuts and Jobs Act in 2017, income tax on such earnings generally did not have to be paid until they were distributed to shareholders. The 2017 law changed the corporate and Subpart F tax regime to focus on domestic profits, and imposed a one-time mandatory repatriation tax on profits held overseas. The Moores paid the $14,729 in tax owed and challenged the law in the United States District Court for the Western District of Washington as violating the Sixteenth Amendment's requirement that income be realized before it can be taxed, as set forth in Eisner v. Macomber (1920). \n\nWhile the plaintiffs claimed to be uninvolved with the company and only small investors, Charles Moore actually served as a director for five years and they made additional investments totaling $150,000.[1][2]\n\nThe district court ruled for the government, and the United States Court of Appeals for the Ninth Circuit affirmed. An appeal to rehear the case en banc was denied.\n\nThe Moores appealed the Ninth Circuit decision to the Supreme Court on February 21, 2023. The Supreme Court granted certiorari on June 26, 2023.[3]\n\nIn the summer of 2023, Justice Samuel Alito was interviewed for The Wall Street Journal by David B. Rivkin, an attorney in this case.[4] After publication, Senator Dick Durbin wrote to Chief Justice John Roberts, expressing his opinion that the court should \"take appropriate steps\" to ensure Alito's recusal from this case.[5] In an order list released on September 8, 2023,[6] Alito rejected Durbin's accusation that his verdict would be swayed by his contact with Rivkin, and he refused to recuse himself.[7]\n\nOral argument before the Supreme Court took place on December 5, 2023. The ruling was handed down on June 20, 2024.\n\nJustice Kavanaugh, writing for the majority, ruled that the tax fell within the authority of Congress under the Constitution. Kavanaugh was joined by Chief Justice Roberts and Justices Kagan, Sotomayor, and Jackson.  Justice Barrett wrote a concurring opinion, joined by Justice Alito.[8] In a dissenting opinion joined by Justice Gorsuch, Justice Thomas wrote that the Mandatory Repatriation Tax should have been struck down as unconstitutional because it taxes unrealized capital gains, which is not permitted by the 16th Amendment.[9]\n\nThe Supreme Court could have used the case to rule on the wider question whether a wealth tax is constitutional. However, the majority opinion sidestepped that question by explicitly adding a footnote stating that the opinion \"does not address … taxes on holdings, wealth, or net worth\". However, journalist Ian Millhiser disagreed, stating that \"the opinion includes a bonanza of loaded language that any competent tax lawyer can seize upon to protect their richest clients from wealth taxes.\"[10]\n",
  "concepts": [
    "Moore v. United States (2024)"
  ],
  "findings": [
    "Background",
    "Supreme Court",
    "Ruling",
    "Wealth tax",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:12:27.467150"
}