{
  "title": "Lady (EXID song)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Lady_(EXID_song)",
  "content": "\"Lady\" (Korean: 내일해; RR: naeilhae; lit. do it tomorrow) is a song recorded by South Korean girl group EXID. It was released as a single on April 2, 2018, by Banana Culture and distributed by Sony Music. A music video for the song was also released on April 2. This is the second single released by the group as a 4-member group, with the absence of member Solji for health reasons.\n\nThe song was released as a digital single on April 2, 2018, through several music portals, including MelOn in South Korea, and iTunes for the global market.[1][2] A CD single was released a day later in South Korea. It contains a photobook, a random photo card, post card, name sticker, film photo and a poster.[3]\n\nThe song is written by V!VE, Shinsadong Tiger and LE, and produced by the latter two.[4] Billboard's Tamar Herman described the song as funky while \"recalling the '90s\" era. New Jack Swing brassy beat is also noted, describing LE rap as \"sassy\", Hyelin and Jeonghwa verses as the dominants of the songs and Hani as the singsong chant in the chorus.[5] Paper's Bradley Stern cited Aaliyah, Bobby Brown, Janet Jackson, TLC and Toni Braxton as inspirations for the song.[6]\n\n\"Lady\" debuted and peaked at number 32 on the Gaon Digital Chart and at number 4 on the Gaon Album Chart, in the week ending April 7, 2018.[7][8] It also entered and peaked at number 37 on the Billboard KPop Hot 100, on the issue dated April 15, 2018.[9]\n\nThe physical copy of the single placed at number 22 for the month of April 2018 on the Gaon Album Chart, selling 14,633 copies.[10]\n",
  "concepts": [
    "Lady (EXID song)",
    "song",
    "april",
    "single",
    "released",
    "2018",
    "number",
    "april 2018",
    "south",
    "music",
    "group"
  ],
  "findings": [
    "Release",
    "Composition",
    "Commercial performance",
    "Track listing",
    "Charts",
    "Awards",
    "Music programs",
    "Release history",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T15:50:23.359931"
}