{
  "title": "Southwest Passage",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Southwest_Passage",
  "content": "Southwest Passage is a 1954 American Pathécolor Western film directed by Ray Nazarro and starring Joanne Dru, Rod Cameron and John Ireland, who are determined to make a unique trek across the west, using camels as his beasts of burden. The picture was originally released in 3-D.\n\nWith $20,000 in stolen gold, Clint McDonald, his girl Lilly and wounded brother Jeb head for the hills, just ahead of a posse. Lilly goes to town to find a doctor for Jeb, then returns with the best she can find, Dr. Stanton, a drunken veterinarian.\n\nClint becomes aware of a camel-led caravan being led by Edward Fitzpatrick Beale and decides to join it, taking Dr. Stanton's medical kit and pretending to be him. Lilly rides up later, claiming to be separated from a wagon train, but Jeb dies from his injuries.\n\nMule skinner Matt Caroll is at odds with Clint from the beginning, becoming attracted to Lilly and suspicious of Clint's skill as a doctor. After scout Tall Tale is bitten by a gila monster and needs a limb amputated, Clint's true identity is revealed and Beale makes him leave. Carroll follows, after the gold, but Clint kills him. Clint repents to Beale by leading the caravan to water and helping fend off attacking Apache braves. He reunites with Lilly and vows to return the gold.\n\nParts of the film were shot in Johnson Canyon and Coral Pink Sand Dunes in Utah.[1]\n\nThis 1950s Western film–related article is a stub. You can help Wikipedia by expanding it.\nThis article related to an American film of the 1950s is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Southwest Passage",
    "clint",
    "lilly",
    "film",
    "jeb",
    "gold",
    "beale",
    "wikipedia expanding",
    "wikipedia",
    "western film",
    "western"
  ],
  "findings": [
    "Plot summary",
    "Cast",
    "Production",
    "Notes",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [
    {
      "subject": "Southwest Passage",
      "relationship": "is a",
      "object": "1954 american pathécolor western film directed by ray nazarro and starring joanne dru",
      "sentence": "Southwest Passage is a 1954 American Pathécolor Western film directed by Ray Nazarro and starring Joanne Dru, Rod Cameron and John Ireland, who are determined to make a unique trek across the west, using camels as his beasts of burden."
    }
  ],
  "timestamp": "2025-04-11T17:06:18.520376"
}