{
  "title": "The Darker Face of the Earth",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/The_Darker_Face_of_the_Earth",
  "content": "The Darker Face of the Earth is a verse play written by Rita Dove. Her first full-length play, originally conceived in 1979, it was published in 1994,[1] while Dove was serving as United States Poet Laureate.  It was substantially revised in 1996 in preparation for its first production.[2]\n\nThe play is set on a slave plantation in antebellum South Carolina, and is based on the Greek legend of Oedipus, and on Sophocles' play Oedipus Rex in particular.[3][4]\n\nThe play premiered at the Oregon Shakespeare Festival in Ashland, Oregon in 1996.[5] It was thereafter performed at the Crossroads Theatre in New Brunswick, New Jersey[6] and at the Kennedy Center in Washington, D.C.[7] In 1999 it had its London premiere at the Royal National Theatre.[8][9]\n\nAmalia Jennings LaFarge: A white plantation owner/mistress who gives birth to Augustus, the son of Hector. Later on she and Augustus become lovers.\n\nAugustus Newcastle [Mulatto]: The son of Amalia and Hector, sold into slavery.\n\nLouis LaFarge: Amalia's violent and impulsive white husband who has seduced many slave women.\n\nPhebe: A slave that has romantic feelings for Augustus.\n\nScylla: A slave, prophet, and voodoo practitioner.\n\nHector: The slave Amalia seduced, resulting in the birth of Augustus.\n\nOther Slaves on the Jennings plantation /Chorus: Diana, Ticey, Scipio, Psyche and Alexander.\n\nDoctor: The person present at Augustus's birth who suggested selling him rather than killing him.\n\nJones [overseer]: A white man who watches over the slaves by the order of the Jennings family.\n\nLeader, Benjamin Skenne, and Henry Blake: Two slaves and one free man recruiting comrades to start a slave revolt in the area.\n\nThe play opens on the Jennings plantation, where several slaves wait below the bedroom window of their mistress Amalia, who is giving birth. Upstairs, the child is born – he is black and clearly not the son of Amalia's white husband Louis. The doctor convinces Amalia and Louis to send the child away to a life as another man's slave, telling their own slaves that he died during the birthing process. The baby is spirited away in Amalia's knitting basket, into which Louis has placed a pair of spurs in hopes of killing the child.\n\nTwenty years later, as several slaves (Scipio, Phebe) discuss their mistress’ increased cruelty since losing her child, another slave named Scylla falls into a trance. She relates a prophecy that will purportedly affect four people: black woman, black man, white woman, white man. She points to Hector – a slave who went mad and now lives in the swamp – as a black man possibly affected by the curse.\n\nAmalia has purchased a new slave named Augustus Newcastle, notorious for being educated and escaping many times. Upon arrival, he is introduced to and speaks with several slaves. When the conversation turns to his travels Scylla accuses him of stirring up trouble. In the ensuing argument Scylla foreshadows the Oedipal curse that hangs over his head.\n\nIn the swamp near the plantation, a group of conspirators enlist Augustus to assist them in whose stated goal is to kill their oppressors: slave masters and those who support the institution of slavery. Soon after, in the cotton fields, Augustus tells his fellow slave of the Haitian Revolution – a successful slave revolt heralded by its motto: Liberté, Égalité, Fraternité. Their mistress Amalia overhears and orders Augustus to the big house at sunset. Once there, Amalia and Augustus engage in a conversation that challenges and attracts them to one another, ending in a kiss.\n\nAs Amalia daydreams about her new lover, the slave girl Phebe and Augustus discuss the plans for revolution while the other slaves ponder exactly what their mistress and Augustus do together. Scylla then talks to Phebe about Augustus’ imminent end. At the swamp, Hector listens in on Augustus’ meeting with the conspirators. When confronted, Augustus chokes Hector to death. At Hector's funeral, Phebe and Augustus steal away to speak of the revolution.\n\nThat evening, Augustus confronts Louis in his study with a knife drawn. Louis pulls out a gun and begins to speak of the basket with red rosettes that Augustus was secreted away in. Augustus mistakenly thinks that Louis is his father and rips open his shirt to reveal the damage done by the spurs left in the basket. Outside, the revolt has begun and Augustus stabs Louis.\n\nAugustus hurries to Amalia's room to confront her, thinking it was she that left the spurs in the basket. Phebe bursts in as Amalia reveals that Hector was Augustus’ father, and she herself is his mother. As Augustus comes to realize the circumstances of his birth, Amalia stabs herself.  The slaves burst in, lifting him onto their shoulders, oblivious to his anguish. As they carry him out to chants of “Freedom,” Scylla sets fire to the curtains.\n\nTheodora Carlisle's article concerns itself with the act of reading: how it's a central thematic element and how it responds to Sophocles’ original. She posits that in Dove's adaptation, reading is equated with power as a way to resist the notion of slaves being intellectually inferior to their white masters. For instance, Amalia questions Augustus’ ability by thrusting a book of Greek plays at Augustus for him to read, incorrectly assuming he would not know it or that it would be too difficult. He refutes this, going so far as to lament the predictability of the Greek masters. This is a way for Augustus to meet her on equal ground, at least intellectually. Carlisle acknowledges that Darker Face of the Earth is an artistic rendering of Sophocles’ original, but maintains that it can stand on its own due to the undercurrents of difference within the play that speak to the black experience. She cites the character of Scylla as a prime example of Dove's ability to take the broad details of the original play and reinterpret them to suit her own thematic concerns.\n[10]\n\nIn an interview playwright Rita Dove discussed her decision to rewrite the Oedipus story on a southern plantation, saying she had a wonderful epiphany. She saw slavery as a great base to intertwine with the powerful Greek Oedipus tragedy. Augustus’ fate was naturally not in his control both as a slave and as a human being, just as Oedipus' fate was not in his hands. Dove says, “I want the audience to actually root for Amalia, Augustus’ mother and lover-to see her, and the others, as human beings trying to be individuals in a system that won't let them. I want there to be no chance for escape, to show a system that seems sturdily in place, as irrevocable and inevitable, as the Greek Gods seemed to the Greeks.”[11] She didn't want for there to be any room for Augustus' and Amalia's relationship to grow.\n\nMalin Pereira argues that Rita Dove's inclusion of miscegenation in Darker Face of the Earth produces the “mulatto” which Pereira identifies as Augustus Newcastle, the child of slave master Amelia Jennings and her slave Hector. The mulatto offspring of the White slave master and the Black slave is also the product of two cultural identities mixing during the Antebellum South.[12] Pereira also explores the motive of miscegenation between the characters in Darker Face of the Earth by distinguishing the reason for each characters participation that ranges from a simple love to a more complex attraction.\n\nMalin Pereira's article [13] \"When the Pear Blossoms/ Cast Their Pale Faces on/ the Darker Face of the Earth” discusses the various themes that appear in Rita Dove's Darker Face of the Earth such as miscegenation and incest. With the theme of slavery in the play, this article states that Augustus because of his upbringing by a white captain, he feels more familiar with white people rather than blacks on the plantation. This is pointed out as Augustus doesn't pursue a relationship with Phebe because he's involved with Amalia. Augustus also doesn't believe in Scylla's prophecies and doesn't complete the mission given to him by the conspirators to kill Amalia because of his relationship with her.\n\nDanny Sexton talks about the changes due to Rita's revision of her first publication. She gives the characters of Amalia, Hector and Augustus's parents more importance compared to the first publication. Rita looks into W.E.B DuBois' idea of double consciousness and adapts it into her second revision to expand on the characters of Amalia and Augustus that possesses “two souls, two thoughts, two reconciled; [and] two warring ideals inside one dark body.” According to DuBois double  consciousness is seeing yourself based on the perception of different people and a person's own opinion of themselves. Her creation of Amalia goes against DuBois' idea on double consciousness “Amalia belongs to that group of women who dominate so much of Western literature, women who are at once strong and fiercely independent yet at the same time enslaved by the rules of their society which has forced a feminine script upon them.” [14]\n\nTheodora Carlisle approaches the “Africanist Vision” with the themes of prophecy and knowledge, which are two of the major themes in the play. Carlisle suggests that Scylla is the character that personalizes the themes of prophecy and knowledge: “In a like manner, Scylla is aligned with feminine forces. Augustus’s birth has brought a curse “over the land.” Scylla, able to feel the living baby's kick in her womb, is one of those stricken directly.” Carlisle also explores the African customs of the slave community by highlighting the context of the African words being used in the play.[15]\n",
  "concepts": [
    "The Darker Face of the Earth"
  ],
  "findings": [
    "Characters",
    "Plot",
    "Prologue",
    "Act 1",
    "Act 2",
    "Themes and analysis",
    "Reading",
    "Fate",
    "Miscegenation",
    "Slavery",
    "Gender",
    "Prophecy and Knowledge",
    "References"
  ],
  "timestamp": "2025-04-11T10:20:36.608596"
}