{
  "title": "HMS Wigtown Bay (K616)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/HMS_Wigtown_Bay_(K616)",
  "content": "HMS Wigtown Bay was a Bay-class anti-aircraft frigate of the British Royal Navy. She was named for Wigtown Bay in Galloway.\n\nOrdered on 6 March 1943 from the Harland and Wolff yard in Belfast as a Loch-class anti-submarine frigate, and assigned the name Loch Garasdale, the ship was laid down on 24 October 1944 (yard number 1260). However, during construction the need for anti-aircraft escorts for service in the Far East, meant that the contract was revised, and she was completed as a Bay-class frigate. The ship was named Wigtown Bay when launched on 26 April 1945 with the pennant number K616.[1]\n\nCommissioned in November 1945 under the command of Lt-Cdr. D. Carson, Wigtown Bay completed her fitting-out and sea trials on 19 January 1946.[1]\n\nIn February she sailed to Malta, joining the 5th Escort Flotilla, and was deployed for patrol duty in the Mediterranean Sea. In May 1946 the flotilla patrolled the eastern Mediterranean to intercept ships carrying illegal immigrants to Palestine.[1]\n\nIn April 1947 Wigtown Bay returned to HMNB Devonport, and was decommissioned in May. Laid-up in reserve she was used as an accommodation ship for Reserve Fleet personnel, but was refitted in 1948 and 1951 to ensure that her operational availability was maintained.[1]\n\nIn April 1957 the ship was offered for sale to Ceylon, but negotiations failed. Put on the Disposal List in 1958, the ship was sold for scrapping in October 1958, arriving under tow at the breaker's yard at Faslane on 10 April 1959.[1]\n\nThis article about a specific frigate of the United Kingdom is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "HMS Wigtown Bay (K616)",
    "bay",
    "wigtown bay",
    "wigtown",
    "ship",
    "frigate",
    "april",
    "yard",
    "class",
    "anti",
    "sea"
  ],
  "findings": [
    "Service history",
    "1945–1947",
    "1947–1958",
    "References",
    "Publications",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:30:55.242167"
}