{
  "title": "Ji Yue 01",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Ji_Yue_01",
  "content": "The Ji Yue 01 (or JIDU 01[1]) is a high performance mid-size electric crossover SUV produced by Jidu Auto under the Ji Yue brand.\n\nIn September 2021, the newly established joint-venture company Jidu Auto, established on the initiative of Geely and Baidu, presented the first photo of deeply camouflaged prototypes heralding the production model of the Chinese company.[2] The debut of the finished car was preceded by the presentation of the Robo-01 Concept prototype in June 2022, announcing the key features of the vehicle's appearance[3] and the company's plans for the coming years as part of the \"Roboday\" event.[4] Ultimately, the debut of the model originally called Jidu Robo-01 took place at the end of October 2022.[5] Less than a year later, in August 2023, the car was officially renamed Ji Yue 01.[6]\n\nVisually, the 01 extensively reproduced the features of the prototype that preceded its debut.[7] Both the front fascia and the rear part of the body are decorated with full-width light strips made in Full LED technology, while a slender roofline gently sloping towards the rear, and the number of concavities and recesses is kept to a minimum in favor of flat surfaces. The manufacturer has abandoned traditional door handles in favor of motion sensors, and the doors open unconventionally: the front ones swing up and the rear ones open \"against the wind\".[8] The futuristic and minimalist passenger cabin was distinguished by the lack of a traditional steering wheel in favor of a steering wheel, while the dashboard, devoid of switches and traditional instrument layout, was created by a large, 35-inch display running across the entire width of the cockpit and displaying images in 3D technology.[9]\n\nThe 01 is a technically advanced car that is equipped with the fourth level of semi-autonomous driving and extensive driver support systems while driving. The car is equipped with 8,295 smart chips from Qualcomm, the Orin X chip from Nvidia, 31 external sensors, 12 HD cameras, two LiDAR environmental monitoring radars and an artificial intelligence system.[10]\n\nBased on the Sustainable Experience Architecture platform, the 01 is a fully electric vehicle powered by a set of two engines with a total power of 536 hp (543 PS; 400 kW). This allowed the vehicle to sprint from 0 to 100 km/h (0 to 62 mph) in 3.9 seconds, while the 100 kWh battery pack supplied by the Chinese company CATL, according to the manufacturer's data, allows the vehicle to travel up to 600 kilometres (370 mi) on a single charge.[11] Qualcomm Snapdragon 8295, 35.6-inch 6K UHD screen for driver.[12]\n",
  "concepts": [
    "Ji Yue 01",
    "01",
    "vehicle",
    "jidu",
    "company",
    "car",
    "yue",
    "traditional",
    "rear",
    "ji yue",
    "ji"
  ],
  "findings": [
    "History",
    "Specifications",
    "Safety",
    "Sales",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:53.204483"
}