{
  "title": "Chicago May",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Chicago_May",
  "content": "Chicago May (1871–1929) was the nickname of Mary Anne Duignan, an Irish-born criminal who became notorious in the U.S., United Kingdom and France. She referred to herself as the \"queen of crooks\" and sometimes used the name May Churchill.[1][2][3]\n\nShe was born in Edenmore, Ballinamuck, County Longford, Ireland. In 1890, at the age of 19, she stole the proceeds earned by her parents from a recent cattle fair and ran away to Liverpool, England where she bought new clothes and booked a ticket to America.[4] Upon arrival in New York she supported herself by prostitution and picking pockets.\n\nShe moved to Chicago to take advantage of the large influx of visitors at the 1893 World's Columbian Exposition. She teamed up with another prostitute. One robbed customers while the other was having sex with them. She returned to New York City, where she worked as a dancer, but was soon arrested for stealing a wallet, earning her first jail sentence. She briefly married friend Jim Sharpe but the couple soon separated. After this, she called herself May Churchill Sharpe. She soon established herself with the local criminal underworld, becoming involved in various crimes, mostly of a petty nature, including fraud, assault, brawling, drunk and disorderly behaviour, beggary and pickpocketing.\n\nShe had various criminal lovers, but she graduated from petty criminality to major crime when she met Eddie Guerin, who organised a robbery of the American Express office in Paris. May was imprisoned for her role in the crime. She operated her schemes on four continents and in nine countries. She reached the height of her career in England when she was taken up by aristocrat Sir Sidney Hamilton Gore, who is said to have proposed marriage to her - shortly before he shot himself.[5]\n\nAfter Guerin escaped from a French prison island, he made his way to London where he met May again, but the relationship turned sour. She took up with a burglar named Charley Smith. In 1907, during an altercation with Guerin, Smith shot him, wounding him in the foot. Smith and May were both accused of attempted murder. May was convicted and sentenced to 15 years. She was released in 1917, and returned to the U.S.[citation needed]\n\nBy the 1920s, she was living in Detroit and had become destitute. No longer young, she was reduced to propositioning men on the streets and was repeatedly arrested for soliciting and common prostitution. She hoped to make money from her former notoriety by writing magazine articles and an autobiography with the help of a journalist, which was published in 1928 as Chicago May, Her Story, by the Queen of Crooks. Her former lover Guerin published his own life story at the same time, under the title I Was a Bandit. She died on 30 May 1929, at the age of 58.[6]\n",
  "concepts": [
    "Chicago May",
    "guerin",
    "soon",
    "smith",
    "new",
    "criminal",
    "chicago",
    "york",
    "various",
    "story",
    "shot"
  ],
  "findings": [
    "Early life",
    "Criminal heyday",
    "Later years",
    "References",
    "Further reading",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:26:18.302224"
}