{
  "title": "2024–25 La Liga",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/2024–25_La_Liga",
  "content": "The 2024–25 La Liga, also known as La Liga EA Sports[1][2] due to sponsorship reasons, is the 94th season of La Liga, Spain's premier football competition. It commenced on 15 August 2024 and is scheduled to conclude on 25 May 2025. Real Madrid are the defending champions, having won their 36th title the previous season. The fixture schedule was announced on 18 June 2024.[3]\n\nA total of twenty teams contest the league, including seventeen sides from the 2023–24 season and three promoted from the 2023–24 Segunda División. This includes the two top teams from the Segunda División, and the winners of the promotion play-offs.\n\nThe first team to be relegated from La Liga were Almería, after a 1–3 loss to Getafe on 27 April 2024, ending their two-year stay in top tier. The second team to be relegated was Granada, following Mallorca’s 1–0 win against Las Palmas, suffering immediate relegation. The third and final team relegated to Segunda was Cádiz, after a 0–0 draw against Las Palmas on 19 May 2024, ending their four-year stay in the top tier.\n\nOn 26 May 2024, Valladolid became the first side to mathematically be automatically promoted, assured of a return to the top flight following a 3–2 win against Villarreal B, thus returning after a single season absence.[4] The second and final team to earn automatic promotion was Leganés, following a 2–0 win against Elche on 2 June 2024, thus returning after a four-season absence and also being promoted to the top flight for the second time in their history.[5] The third and final team to be promoted was Espanyol, following their win against Oviedo in the promotion play-off final, returning to the top flight after only a single season.[6][7]\n\nThe Zamora Trophy is awarded by newspaper Marca to the goalkeeper with the lowest goals-to-games ratio. A goalkeeper has to play at least 28 matches of 60 or more minutes to be eligible for the trophy.\n",
  "concepts": [
    "2024–25 La Liga",
    "2024",
    "season",
    "team",
    "win",
    "promoted",
    "liga",
    "la liga",
    "la",
    "following",
    "final"
  ],
  "findings": [
    "Teams",
    "Promotion and relegation (pre-season)",
    "Stadiums and locations",
    "Personnel and kits",
    "Managerial changes",
    "League table",
    "Results",
    "Season statistics",
    "Scoring",
    "Top goalscorers",
    "Zamora Trophy",
    "Discipline",
    "Awards",
    "Monthly awards",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T15:22:50.987144"
}