{
  "title": "Badru Kiggundu",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Badru_Kiggundu",
  "content": "Badru Malimbo Kiggundu is a Ugandan civil engineer, academic and consultant, who serves as the chairman of the presidential select committee responsible for the supervision of the successful completion of both Isimba Hydroelectric Power Station and Karuma Hydroelectric Power Station. He was appointed to that position by Yoweri Museveni, the president of Uganda in August 2016.[1] He concurrently serves as the Chairman of the board of directors of National Water and Sewerage Corporation. He was appointed to that position on 20 July 2020, replacing Christopher Ebal, whose contract expired.[2]\n\nIn the past, from 2002 until 2016, he served as the chairman of the Electoral Commission of Uganda, for 14 consecutive years.[1][3]\n\nHe was born in 1945 to the late Hajji Yonus Luswa, (d. 1997) and the late Hajati Kabugo Namatovu (d. 2006). Kiggundu is one of the 23 children fathered by Hajji Luswa.[3][4]\n\nHe attended Kabasanda Primary School for his elementary schooling. He then transferred to Kibuli Secondary School for his O-Level studies. In late 1964, he won a full scholarship from the government of Buganda, to pursue his A-Level studies at Nabumali High School in Mbale District, graduating from there in 1965.[3][4]\n\nAnother scholarship saw him enroll in the University of New Mexico, graduating with a Bachelor of Science degree in Civil Engineering. He continued his studies at Carnegie Mellon University, graduating from there in 1971, with a Master of Science in civil engineering. Later, in 1981, he obtained a Doctor of Philosophy from the University of New Mexico.[3][4]\n\nFor a period of six years, from 1971 until 1977, Badru Kiggundu served as an engineer and executive with the National Housing and Construction Company, a government parastatal company, where he was responsible for road construction.[3][4]\n\nAfter completing his doctoral studies in 1981, he was hired by the University of New Mexico as a research scientist, working in that capacity for six years. In 1987, Auburn University in Alabama, hired him as a research program manager and Assistant Professor in civil engineering. He worked in that capacity until 1988, when he returned to Uganda.[4]\n\nKiggundu worked in the private construction industry for two and one half years, after his return to Uganda in 1988. In 1991, Makerere University, hired him as a member of the academic staff in the department of civil engineering. In 1993, he rose to the rank of head of department. From 1999 until 2002, he served as the Dean of the Faculty of Technology. He left Makerere in 2002 at the rank of Associate Professor.[3][4]\n\nDuring the fourteen years that Kiggundu spent at the helm of Uganda Electoral Commission, the commission oversaw three general elections, in 2006, 2011 and 2016. In 2006 and 2016, the presidential election results were challenged in Uganda's Supreme Court, but in both cases, the Court ruled in favor of the incumbent president, Yoweri Museveni.[5]\n\nIn August 2016, Engineer Kiggundu was appointed by the president of Uganda to chair a seven-person committee to oversee the completion of two hydroelectric power projects, that were under construction then; the 600 megawatts Karuma Hydroelectric Power Station and the 183 megawatts Isimba Hydroelectric Power Station. Other members of the committee are as illustrated in the table below.[1]\n\nHe is married and is the father of eleven children, with three consorts.[3][4]\n",
  "concepts": [
    "Badru Kiggundu"
  ],
  "findings": [
    "Background and education",
    "Career in the United States",
    "Career in Academa",
    "Career at the Electoral Commission",
    "Career as chairman of committee on dams",
    "Family",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:15:14.019203"
}