{
  "title": "Es brent",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Es_brent",
  "content": "Es brent (עס ברענט \"It's burning\", also known as אונדזער שטעטל ברענט undzer shtetl brent \"our town is burning\", in Hebrew translation העיירה בוערת) is a Yiddish poem–song written in 1936 by Mordechai Gebirtig. Es Brent is generally said to have been written in response to the Przytyk Pogrom of 1936. After the Holocaust, the song was also often used in Holocaust commemoration or in programmes of World War II Ghetto music, both in the original Yiddish and in Hebrew translation.[1][2] Although Gebirtig wrote prolifically, Es Brent became his best-known composition.[3]\n\nMost accounts agree that Gebirtig wrote the song in 1937 as a response to the pogroms in Przytyk (1936) and Brest (1937) and that he began to perform it, with some variations in the text, in coffee houses and other places in the late 1930s.[3] This is attested in a number of memoirs written after the war.[4] However, others who were alive at the time dispute a specific link to those pogroms and considered it a general protest against rising antisemitism in Poland.[3] One aspect observed in a number of recollections is that the opening melody of the song sounded exactly like the fire engine sirens in Krakow at the time.[3]\n\nBy 1939, with the changing political situation in Europe, he had changed the final line of the poem from \"if the town is dear to you\" to \"if life is dear to you.\"[4] Rising antisemitic censorship in Poland also made it so that Gebirtig was occasionally forbidden to perform the song in public.[3]\n\nDuring the war, the song was adopted by Jewish Partisans against the Nazi regime, particularly in Kraków. According to some recollections, whistling its melody was used as a code by imprisoned resistance fighters in the Montelupich Prison.[5]\n\nAfter the Second World War, attempts were made to publish Gebirtig's songs, including efforts to document and transcribe versions that had not been written down but only performed. Some such publications include the Jewish Historical Committee in Kraków with their 1946 anthology, and the one put out by the Workman's Circle in 1948.[5] The song was also incorporated into the material of a Zionist youth choir in Bucharest; its leader Itzchak Artzi had learned it from concentration camp survivors from Poland.[3]\n\nMany performances and adaptations of this song have been done in Yiddish, Hebrew, English, and other languages.\n\nThe Yiddish version has been recorded by dozens of artists, including Sidor Belarsky,[6] Sarah Gorby,[7] The Workman's Circle Chorus,[8] Louis Danto,[9] and Bente Kahan.[10]\n\nIn Hebrew translation, it has been recorded by Israeli singer Dorit Reuveni and performed in a Metal music adaptation by Salem.[11] The poem was also thematically incorporated into a Hebrew-language book by Shalom Hulewsky which was named after its Hebrew translations (Hayara Boeret).[3]\n\nIn 2020 Mark Rubin released his own English translation and adaptation with a new melody.[12]\nSeveral versions of the poem have been recorded. and British band Oi Va Voi recorded a version with modified Yiddish lyrics for their album Travelling the Face of the Globe.\n",
  "concepts": [
    "Es brent"
  ],
  "findings": [
    "History",
    "Performances and adaptations",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:24:35.439559"
}