{
  "title": "Beni (music)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Beni_(music)",
  "content": "Beni, also spelled Mbeni,[1] is an indigenized East African form of brass band music.[2] The word beni derives from the English word \"band.\"[3] Beni appropriated symbols of colonial authority as the military drill, uniform, and elaborate hierarchies.[4]\n\nThe beni ngoma is a competitive dance genre based on a military drill performed to brass-band music. The corresponding Beni dance was developed during the colonial era, and mimicked military and colonial traditions with Africanized music and movement of the dancers.[5][6] Beni has been considered an evolution of taarab, a traditional form of Swahili music.[7]\n\nThis kind of dance to brass music also included Swahili songs.[4][8] It is a popular form of wedding entertainment with a strong focus on rhythm and dance, and audience participation.\n\nBeni has its origins in urban Swahili communities on the Kenyan coast in the 1890s,[9] where it came to be part of the culture of competitive associations.[10] Brass band music was performed for British audiences in East Africa. Brass band music was used by missionaries to introduce European culture to young people in Zanzibar.^ [4] At the same time, in the late colonial period, beni was a way for young people to express their independence.[9][4]\n\nAround 1914, the style spread to Tanga and Dar es Salaam. The first accounts of beni in Nyasaland were around 1918. During the First World War, beni was danced by askari soldiers.[11] Prisoners of war danced it in the detention camp at Zomba in Malawi, and by detachments of the 2nd KAR when they returned to Nairobi.[9] Beni dancers were also instrumental in structured communication during the 1935 Copperbelt strike in Northern Rhodesia.[5][6]\n\nWhen Beni was indigenized, western instruments were sometimes exchanged with local instruments, and march time was replaced by African cross beats and polyrhythm.[12] In Kenya, for example, wooden trumpets were substituted for traditional brass versions of the western instrument.[13]\n\nIn Zanzibar, Beni has been performed both as a street parade and stationary as a wedding dance.[14]\n",
  "concepts": [
    "Beni (music)",
    "beni",
    "music",
    "brass",
    "dance",
    "band",
    "colonial",
    "brass band",
    "band music",
    "swahili",
    "performed"
  ],
  "findings": [
    "History",
    "See also",
    "References",
    "Literature"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:37.424084"
}