{
  "title": "Boys of Steel",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Boys_of_Steel",
  "content": "Boys of Steel: The Creators of Superman is a picture book written by Marc Tyler Nobleman and illustrated by Ross MacDonald. It is the first picture book biography of Superman creators Jerry Siegel and Joe Shuster, and is the first ever stand-alone biography of the pair.\n\nJerome Siegel and Joseph Shuster are meek, bespectacled teens in Depression-era Cleveland who seek escape in the worlds of science fiction and pulp magazine adventure tales.[1]\n\n\"In a crowded high school hallway, Jerry wishes he could be with his 'friends,' and a turn of the page reveals Tarzan, Flash Gordon and Buck Rogers. Joe, 'lousy at sports and mousy around girls,' draws sci-fi heroes with a passion. In 1934, when both are 20, Jerry dreams up the Superman concept and Joe draws prototypes labeled 'S' for 'super.' And for 'Siegel' and 'Shuster.'\" [2]\n\nIt is four more years before they convince a publisher to take a chance on their character in the new comic book format.[1]\n\n\"In June 1938, their creation launches in Action Comics. Nobleman details this achievement with a zest amplified by MacDonald's punchy illustrations, done in a classic litho palette of brassy gold, antique blue and fireplug red. MacDonald's Depression-era vignettes picture Siegel pondering his superhero's powers and the friends casting a single, caped shadow. A cautionary afterword chronicles their protracted financial struggles with DC Comics—when Siegel and Shuster sold their first Superman story, they also sold all rights to the character, for $130.\"[2]\n\nNobleman revealed to Newsarama's Zack Smith that he first heard the origin story in high school, around 1988, but it wasn't until college graduation that he decided to write it up as a screenplay. However, warnings that the reclusive Siegel was unlikely to talk about Superman's beginnings discouraged Nobleman enough to give up the idea. He got into children's publishing, and a few years later decided to tell the story as a picture book.[3]\n\nHe set a timeframe of about ten years, closing his tale before the bitter legal battles that ultimately separated the idealistic young creators from their creation. The writer wanted Boys of Steel to end on a high note, emphasizing the friendship and initial triumph of two Depression-era underdogs who wouldn't stop believing in Superman.[3]\n\nWhile conducting his research, the writer was not able to contact the Siegel or Shuster families. Between published interviews with the creators (from which he cribbed his dialogue) and archival information gathered in Cleveland, Nobleman easily was able to build the framework for his version of the story.[3]\n\nThe search for an illustrator didn't commence for at least six months after Nobleman sold Boys of Steel to Random House in March '05. The publisher pitched MacDonald (Another Perfect Day), whose Art Deco style already was familiar to Nobleman.[3]\n\n\"[T]his robust treatment does [Shuster and Siegel’s] story justice.\" — Booklist, June 1, 2008[1]\n\n\"I never say the word 'Superman,'\" Nobleman pointed out. \"I say the word 'Super,' but never 'Superman' in the story proper. It's a fun little trick about the power of observation and the power of picture books. I had an illustrator to show it, so I never had to say 'Superman' even once.\"[3]\n",
  "concepts": [
    "Boys of Steel"
  ],
  "findings": [
    "Synopsis",
    "Background",
    "Praise",
    "Trivia",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:09:46.750722"
}