{
  "title": "Janet Kennedy",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Janet_Kennedy",
  "content": "\nJanet Kennedy (c. 1480 – c. 1545), was a Scottish noble and the mistress of King James IV of Scotland.\n\nShe was the eldest daughter of John Kennedy, 2nd Lord Kennedy and Lady Elizabeth Gordon. Through her father, she was a great-great-granddaughter of King Robert III wheres her mother was the daughter of Alexander Gordon, 1st Earl of Huntly.\n\nShe is believed to have first been married to Alexander Gordon of Lochinvar around 1493. They may have had a daughter.\n\nBy 1497, Janet was the mistress of Archibald Douglas, 5th Earl of Angus (\"Bell the Cat\"), with whom she had a daughter, Mary. They also may have been married, though she was never described as his Countess.\n\nShe attracted the attention of King James IV around 1497. She had three children with the king. They included James Stewart, 1st Earl of Moray, Margaret and Jane Stewart. They lived for a time at Stirling Castle and the household was the responsibility of Andrew Aytoun.[1]\n\nThe King had a number of mistresses, but this appears to have been his longest relationship, which continued even after his marriage to Margaret Tudor. After James IV's marriage by proxy, he met Janet at Bothwell Castle in April 1503, then she was sent to Darnaway Castle in August just before Margaret arrived.[2]\n\nJames IV gave her the lordship of Bothwell Castle in September 1498, transferred from the Earl of Angus.[3] In March 1500 the king gave her, in consideration of the \"hartlie luve and invict favoris he has and beris to her\", extensive lands in Menteith and the keeping of Doune Castle.[4] It is not clear whether she is the same as the \"Janet bair ars\" who received gifts from the king in 1505–12.[5]\n\nHer daughter Lady Margaret Stewart came to court from Darnaway in April 1513, her household being accommodated at Edinburgh Castle.[6][7]\n\nJanet Kennedy also had relationships with two other men, one of whom was John Ramsay, 1st Lord Bothwell whom she married in 1505.  Two of her partners died at the Battle of Flodden.\n\nBarnes, Ishbel Janet Kennedy Royal Mistress (John Donald: Edinburgh, 2007)\nMacDougall, Norman James IV of Scotland\n\nThis biography of a Scottish peer or noble is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Janet Kennedy"
  ],
  "findings": [
    "Life",
    "External links",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:23:33.147911"
}