{
  "title": "Shelford Girls' Grammar",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Shelford_Girls'_Grammar",
  "content": "Shelford Girls' Grammar (previously known as Shelford Girls' School, Shelford Church of England Girls' Grammar School, and sometimes SCEGGS) was an independent Anglican day school for girls. It was located in Caulfield, a suburb of Melbourne, Victoria, Australia.\n\nThe school was established in 1898, and was a member of Girls Sport Victoria (GSV),[1][2] the Junior School Heads Association of Australia (JSHAA) and the Alliance of Girls' Schools Australasia.[3] It was a non-selective entry school, with more than 600 students.[4]\n\nShelford had a coeducational Early Learning Centre, which educated toddlers 18 months old, as well as providing groups for 3 and 4-year-olds.[5]\n\nShelford offered students the Victorian Certificate of Education (VCE) program, and the Vocational Education and Training (VET) course.[citation needed]\n\nShelford used a house system through which students participated in inter-house competitions, with 4 school houses.[citation needed]\n\nThe school was established in 1898 on Glen Eira Road by Emily Dixon.[6][7]\n\nThe school was relocated to 77 Allison Road, Elsternwick,[8] by Dora Mary Petrie Blundell,[9][10][11] who served as the school's second principal from 1904 to 1921.[12] Dora was supported by her sisters, Lucy Annie Blundell,[13] Fanny Blundell,[14] and Margaret Helen Petrie Blundell.[15]\n\nAs the vicar of St Mary's Anglican Church in Caulfield, Henry Langley had been giving the pupils of Shelford Girls' School weekly lessons in religious instruction for many years.[16] In 1922, the Blundell sisters wished to give the school to the church. They approached Archdeacon Langley, who was responsible for its temporary move from 77 Allison Road, Elsternwick, to St Mary's Jubilee School Hall. The Argus reported on the re-opening and Archdeacon Langley's appointment of Ada Mary Thomas as the school's head mistress:\n\nThe following year, Archdeacon Langley moved the school to \"Helenslea\" in Hood Crescent, Caulfield North.[18] The school was officially opened at its new location by Archbishop Lees on 22 February 1923[19] adjacent to St Mary's Church as the Shelford Girls' Grammar School.\n\nAda Mary Thomas served as Shelford's headmistress from 1922 to 1945.[20][21][22]\n\nThe school will merge with Caulfield Grammar School with a formal transition of Shelford students into CGS beginning in 2025.[23]\n",
  "concepts": [
    "Shelford Girls' Grammar"
  ],
  "findings": [
    "History",
    "Notable alumnae",
    "See also",
    "References",
    "Bibliography",
    "External links"
  ],
  "timestamp": "2025-04-11T10:13:48.837024"
}