{
  "title": "O. Milton Gossett",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/O._Milton_Gossett",
  "content": "\nOscar Milton Gossett (1925–2006) was an advertising executive with Compton Advertising and Saatchi & Saatchi.  He married Anna C. Scheid in 1949 and had five children: Susanne, Michael, Thomas, Lorraine, and James.\n\nBefore joining Compton Advertising as a copywriter in 1949, Gossett served in the United States Naval Reserve from 1943 to 1946, received a degree in mechanical engineering at Stevens Institute of Technology in 1944, and attended the Northwestern University Midshipman School from 1947 to 1948.  In 1961, Gossett was appointed vice president and associate creative director of Compton.  He became president of the company in 1968 and chief executive officer in 1975. \n\nOver the span of his career at Compton, Gossett worked on advertising campaigns for such clients as Black & White, Chase & Sanborn Coffee, El Producto, Ivory, Kelly Tires, Knickerbocker Beer, Procter & Gamble, Socony Mobil Oil Company, and Tender Leaf Tea.  \n\nIn 1982, Gossett helped to engineer the merger of Compton Advertising and Saatchi & Saatchi Advertising, then a subsidiary of Compton Communications USA. The merger produced Saatchi & Saatchi Compton Worldwide (later shortened to Saatchi & Saatchi) and Gossett was appointed chairman and chief executive officer of the company.\n\nHe was also a member of the National Advertising Review Board and conducted career workshops for college students in conjunction with the American Advertising Federation. He was inducted into the AAF Hall of Fame in 1998. In 2001, he received the DeWitt Carter Reddick Award at the University of Texas at Austin.  \n\nHe died on March 1, 2006, in Mount Kisco, New York.\n",
  "concepts": [
    "O. Milton Gossett",
    "saatchi",
    "advertising",
    "compton",
    "gossett",
    "saatchi saatchi",
    "executive",
    "compton advertising",
    "company",
    "university",
    "received"
  ],
  "findings": [
    "Biography",
    "Sources",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:55.094510"
}