{
  "title": "Somerset, Manitoba",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Somerset,_Manitoba",
  "content": "The Village of Somerset is located approximately 130 kilometres south west of Winnipeg, in the center of the Rural Municipality of Lorne at the junction of Provincial Hwy. 23 and PTH 242. Somerset lies on the edge of the picturesque Pembina Hills. Its landscape consists of a multitude of grain fields broken by occasional wood lots and pothole marshes.\n\nThe first council meeting for the RM of Lorne was held on July 8, 1880.   During the next few years people homesteaded in Ward IV.  Homesteads of 160 acres could be purchased for $10.  On May 1, 1889 an agreement was made between Mr. Chas. Clark and Mr. Fortunat Lachance, two homesteaders and the Northern Pacific and Manitoba Railway Co.  This agreement stated that for the price of $1, forty acres from each of these quarters were to be set aside to provide for the site of Somerset when needed.  The agreement also read, “The Railway at its own expense shall locate and lay out a town site on these lands and within three months shall place the lots on the market for sale.  Additional lands shall be donated to the Railway for a right of way.”  This agreement was carried out and on September 30, 1889, the rails of the Northern Pacific were laid in Somerset.  This lead to the influx of houses and businesses in the area.\n\nIn 1922, the village of Somerset became an unincorporated village.  With a levy from the municipality, village councillors managed the affairs of the village.\n\nIn January, 1962 the village was incorporated.  After the incorporation the village was no longer under the jurisdiction of the Lorne Municipality.\n\nSomerset has a variety of facilities for residents and visitors including a large Community Hall, and a smaller senior’s centre, the Somerset Rendez-vous.\n\nIn the 2021 Census of Population conducted by Statistics Canada, Somerset had a population of 420 living in 195 of its 210 total private dwellings, a change of -3.9% from its 2016 population of 437. With a land area of 2.32 km2 (0.90 sq mi), it had a population density of 181.0/km2 (468.9/sq mi) in 2021.[2]\n",
  "concepts": [
    "Somerset, Manitoba"
  ],
  "findings": [
    "Demographics",
    "Climate",
    "References"
  ],
  "timestamp": "2025-04-11T10:11:48.455982"
}