{
  "title": "Eiliv Skard",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Eiliv_Skard",
  "content": "Eiliv Skard (19 October 1898 – 30 September 1978) was a Norwegian classical philologist.\n\nHe was born in Levanger as a son of educators Matias Skard (1846–1927) and Gyda Christensen (1868–1916). The family moved to Kristiansand in 1901. He was a nephew of Johannes Skar and Christopher Bruun, a brother of Bjarne and Sigmund Skard and a half-brother of Olav and Torfinn Skard. When Sigmund Skard married Åse Gruda Skard, Åsa became Eiliv's sister-in-law.[1]\n\nIn 1940 he married teacher Sigrid Nordang (1903–1988). They had met in Gudbrandsdalen in the same year.[1]\n\nHe finished his secondary education at Kristiansand Cathedral School in 1916, and graduated from the Royal Frederick University in 1922. He worked at the secondary schools in Hornnes Municipality from 1922 to 1924 and Orkdal Municipality from 1925 to 1929. He was a Latin teacher at the university from 1929, having specialized in classical philology during studies in Germany, Italy and Greece. He took the dr.philos. degree in 1931 on the thesis Zwei religiös-politische Begriffe. Euergetes. Concordia. When writing in Norwegian, he used the Nynorsk form. In 1934 he was promoted to professor of classical philology at the Royal Frederick University (from 1939: the University of Oslo).[1]\n\nIn the interwar period Skard marked himself as an opponent of Fascism, first and foremost as a follower of the Oxford Group. When  Germany invaded Norway in 1940, Skard participated in the fighting in Gudbrandsdalen.[1] Germany won, but one of the many civil protests ensued when the Nazi authorities were about to change the rules for admission to the university in autumn 1943. In retaliation, the authorities arrested 11 staff, 60 male students and 10 female students.[2] The staff Johannes Andenæs, Bjørn Føyn, Johan Christian Schreiner, Harald Krabbe Schjelderup, Anatol Heintz, Odd Hassel, Ragnar Frisch, Carl Jacob Arnholm, Endre Berner and Eiliv Skard were sent to Grini concentration camp. Skard was first incarcerated at Bredtveit from 15 October to 22 November, then at Berg until 8 December, then at Grini until 5 May 1945.[3] An exception came in the last winter, when Skard spent a month at Victoria Terrasse.[1]\n\nAfter the war Skard returned as professor, and was dean of the Faculty of Humanities from 1947 to 1952. On 1 February 1948 he became professor of the history of ideas with an emphasis on the Antiquity. He edited the journal Symbolae Osloenses, and his most notable books were Filosofien i oldtiden (1951) and the three-volume anthology Vestens tenkere (1962) which he edited together with Andreas Hofgaard Winsnes. He died in September 1978 in Oslo.[1]\n",
  "concepts": [
    "Eiliv Skard",
    "skard",
    "university",
    "professor",
    "germany",
    "eiliv",
    "classical",
    "teacher",
    "students",
    "staff",
    "sigmund skard"
  ],
  "findings": [
    "Personal life",
    "Career",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:09:29.310575"
}