{
  "title": "Luke Steckel",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Luke_Steckel",
  "content": "Luke E. Steckel (born April 28, 1985) is an American football coach and former player who is the tight ends coach for the Las Vegas Raiders of the National Football League (NFL).\n\nSteckel played college football at Princeton and got his first coaching job with the Cleveland Browns in 2009 and previously served as an assistant for the Chicago Bears and Tennessee Titans.\n\nSteckel was born on April 28, 1985, in Boston, Massachusetts.[1] Steckel's family moved multiple times while he grew up, as his father Les, was a coach in the National Football League (NFL).[1] He attended high school at Brentwood in Tennessee. He played linebacker and was named team captain as a senior. In his final game, the state championship, Steckel intercepted a pass at the end of the game to seal a 10–7 win.[2] He was offered multiple scholarships following high school, including from Penn and Yale. He accepted an offer from Princeton on February 3, 2003.[3] In 2005, he made six tackles as a member of special teams. He became co-captain on defense in his senior season, 2006.[4]\n\nHe moved to Los Angeles, California after college and worked as a production assistant in the films All About Steve and Fast & Furious.\n\nOn January 26, 2009, Steckel was hired by the Cleveland Browns as an assistant to the head coach.[5] He spent four seasons with the Browns from 2009 to 2012.\n\nIn 2013, Steckel was hired by the Tennessee Titans.[6] He served as an offensive assistant with them from 2013 to 2016, he also was a special assistant to the head coach in 2013.[6] He was promoted to assistant wide receivers coach for the 2017 season.[7] Steckel was reverted to offensive assistant the following year and held the position until 2021, when he was promoted to tight ends coach.[8][6]\n\nIn 2023, Steckel was hired by the Chicago Bears as their assistant offensive line coach under head coach Matt Eberflus.[9]\n\nOn February 23, 2024, Steckel was hired by the Las Vegas Raiders as their tight ends coach under head coach Antonio Pierce.[10]\n\nLuke married Lindsay Spieler in June 2018. Luke has two siblings, Lesley, a graduate of Baylor University and Christian, also a Baylor graduate, who is lead sports anchor for WAPT-TV, the ABC affiliate in Jackson, Mississippi, and works college basketball games for ESPNU. Luke's uncle, Dave Steckel just like his father is a football coach and is the former head coach of the Missouri State Bears football team and previously served under Gary Pinkel at Missouri.\n",
  "concepts": [
    "Luke Steckel",
    "coach",
    "steckel",
    "assistant",
    "football",
    "head coach",
    "head",
    "steckel hired",
    "luke",
    "hired",
    "tight ends"
  ],
  "findings": [
    "Early life and education",
    "Coaching career",
    "Cleveland Browns",
    "Tennessee Titans",
    "Chicago Bears",
    "Las Vegas Raiders",
    "Personal life",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:02.881390"
}