{
  "title": "Paul Hiebert (missiologist)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Paul_Hiebert_(missiologist)",
  "content": "Paul Gordon Hiebert (13 November 1932 – 11 March 2007) was an American missiologist. He was \"arguably the world's leading missiological anthropologist.\"[1]\n\nHiebert was born in India to missionary parents, and studied at Tabor College, Mennonite Brethren Biblical Seminary, and the University of Minnesota.[1]\n\nSubsequently, Hiebert went as a missionary to India and was Principal of the Mennonite Brethren Centenary Bible College, Shamshabad.  After a period of missionary service, he proceeded to Pasadena, California where he taught at Fuller Theological Seminary before becoming Distinguished Professor of Mission and Anthropology at Trinity Evangelical Divinity School.[2] Paul became the Chair of the Department of Missions and Evangelism at Trinity in addition to maintaining his Professor duties.[3] From 1974 to 1975, Hiebert lectured at Osmania University, Hyderabad, India on a Fulbright Scholarship.[4]\n\nA Festschrift in his honor, Globalizing Theology: Belief and Practice in an Era of World Christianity was published in 2006.[5]\n\nHiebert died of cancer in 2007.[6]\n\nHiebert developed several theories that widely influenced the study and practice of Christian missions. His model of \"critical contextualization\"[7] describes a process of understanding and evaluating cultural practices in light of biblical teaching. It is one of the most widely cited models in evangelical doctoral dissertations dealing with contextualization.[8]\n\nThe concept of the \"excluded middle\" argued that most Westerners see the universe as consisting of two tiers - the invisible things of the other world, and the visible things of this world. In this way, they exclude the part in between - namely, the invisible things of this world, and in particular the unseen personal beings, such as angels and demons. Hiebert suggested that non-Westerners are much more likely to accept this \"excluded middle\".[9][10][11]\n\nHiebert, who studied mathematics as an undergraduate, employed the idea of set theory to describe bounded sets versus centered or fuzzy sets as different ways of conceiving Christian community and theology.[12]\n",
  "concepts": [
    "Paul Hiebert (missiologist)"
  ],
  "findings": [
    "Biography",
    "Missiology",
    "Selected bibliography",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:12:53.799213"
}