{
  "title": "Crenellated guardhouse, 1846 model",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Crenellated_guardhouse,_1846_model",
  "content": "\nThe crenellated guardhouses of the 1846 model (corps de garde crénelés modèle 1846) were gun-batteries built along the coast of France as the result of a standardisation of coastal-defence redoubts during the reign of Louis Philippe I.  This standardisation came as an attempt to complete the defensive chain begun by Napoleon in 1811 with his model towers, left incomplete on his abdication in 1814.  A mixed coastal armament commission set up in 1841 defined 3 types of work, known as crenellated guardhouses, crenellated towers and model-redoubt with defensive barracks.[1] Along with the construction of the battleship La Gloire, they represent part of a 20-year trend of French naval and coastal re-armament, to which the United Kingdom eventually responded by building its own steam battleship (Warrior) and its own coastal defence chain (the Palmerston Forts) during the 1860s.\n\nAround 150 crenellated guardhouses were built.[2]\n\nThis sub-type accommodated 60 men and 12 cannons.\n\nThis sub-type could house 40 men and 8 cannons.\n\nThis sub-type could house 20 men and 4 cannons.\n\nSquare in plan, buildings of this size were slightly pyramidical in shape.\n\nThis sub-type housed 20 men and had two murder holes sticking out from either side.  This sub-type's particular feature was its 4 levels (underground level, two levels of barracks, and a terrace on top).\n\nThe model-redoubt is a fort built over a defensive barracks.  The barracks is vaulted and thus bomb-proof.  Sub-type 1 housed 300 men, and sub-type 2 housed 200 men.\n\nAll in French unless otherwise noted.\n",
  "concepts": [
    "Crenellated guardhouse, 1846 model"
  ],
  "findings": [
    "Crenellated guardhouses",
    "Crenellated towers",
    "Model redoubts with defensive barracks",
    "References"
  ],
  "timestamp": "2025-04-11T10:10:12.803262"
}