{
  "title": "Tiger Inn",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Tiger_Inn",
  "content": "Tiger Inn (or \"T.I.\" as it is colloquially known) is one of the eleven active eating clubs at Princeton University in Princeton, New Jersey.[2]  Tiger Inn [3] was founded in 1890 and is one of the \"Big Four\" eating clubs at Princeton (the others are The Ivy Club, University Cottage Club, and Cap and Gown Club), the four oldest and most prestigious on campus.[4] Tiger Inn is the third oldest Princeton Eating Club.[5] Its historic clubhouse is located at 48 Prospect Avenue, Princeton, New Jersey, near the Princeton University campus. \nMembers of \"T.I.\" also frequently refer to the club as \"The Glorious Tiger Inn.\"\n\nThe Tiger Inn clubhouse is the oldest of the Princeton Eating Club houses. It is both architecturally distinct, built in the Tudor style, and historically notable. \"The Clubhouse is designed in the timbered style of the 15th century and modeled especially after an old inn in Chelsea.\".[6]  The clubhouse was built in 1895 for an original club membership of 30 undergraduates. The clubhouse has been in continuous use since the facility first opened. The architect for the clubhouse's original plan was G Howard Chamberlain. According to The Tiger Inn's official history, \"Princeton myth [also] credits [the original plans for the clubhouse] to Howard Crosby Butler, Class of 1892 (a [Charter] member of Tiger Inn and Princeton's first Professor of architectural history).\"[7] The clubhouse's central hall was filled with massive antique furniture presented to the club by Mrs. Thomas Harrison Garrett (the former Alice Dickerson Whitridge (1851–1920), \"the widow[8] of a Princeton trustee and mother of three of Princeton's most prominent graduates of the 1890s\" Robert Garrett, John W. Garrett, and ???[9]); these furnishings remain in use to this day. The funding for the original clubhouse, the land, and the club's other furnishings were provided by the club's membership, although all at the time recognized the extraordinary support and contributions of the Garrett family.\n\nRenovations to the clubhouse have continued since it was built in 1895. During 1922–1923 a room was added to the left of the front door and the second floor was remodeled; the second floor alterations were never used for their intended purpose as members quickly converted the new portion of the second floor space to a card room. In the fall of 1926 the clubhouse was substantially improved; during the six weeks of these alterations club members were required to take their meals at the surrounding clubs. By 1928 the kitchen had been moved to the south of the building. The changes to the clubhouse from 1926 to 1928 were well timed as this coincided with an expansion of the membership. The financing of the renovations placed Tiger Inn on the firm financial footing it would need to survive the Great Depression.\n\nThe distinctive clubhouse has recently undergone renovations, improvements and enlargements as part of its “21st Century Expansion and Renovation Project,”   for which the commissioned architect was Connolly Architecture, Inc.[10] The project was completed with the formal dedication of the new club facilities on the weekend of 11-11-11. Funded entirely by the club's alumni, the expanded facilities include a new dining hall and improvements to the spaces normally reserved for social events. The new facilities provide a more suitable building to serve the club's Active Membership, now up from 26 to over 150 in any given year, and club alumni exceeding 2000 in 2012.[11] Fundraising for the completed project continues.[12]\n\nTiger Inn is a selective club, meaning membership is awarded after successful completion of a process called bicker. During bicker, prospective members interact with current members who then convene to vote on whether the prospective members should \"receive a bid,\" or be invited to join the club.[13]\n\nThe club has designated its 26 original founding members as \"Charter Members:\"  at the time of the club's founding, these members were known within the Princeton University community as \"The Sour Balls.\" The Active Membership is that portion of membership that uses the clubhouse on a daily basis and is composed principally of Princeton undergraduates, although graduate students have also been active members from time to time. Alumni Members frequently return to the Tiger Inn. The club also has two honorific categories of membership to recognize and honor those who have had a positive and notable association with the club, whether as members of the Princeton University community or as individuals whose principal affiliation with the Princeton community is their association with the Tiger Inn.\n\nTiger Inn's membership was once described by F. Scott Fitzgerald in This Side of Paradise (1920) as \"broad-shouldered and athletic, vitalized by an honest elaboration of prep-school standards.\"  In a 1927 essay on Princeton for the magazine College Humor, Fitzgerald elaborated: \"Tiger Inn cultivates a bluff simplicity. Its membership is largely athletic and while it pretends to disdain social qualifications it has a sharp exclusiveness of its own.\"[14]\n\nFitzgerald's comments were written during his time at Princeton University, when the membership of each of the Eating Clubs was male only. Women were not accepted as undergraduates at Princeton until 1969. Debate over co-ed Eating Club membership abounded from 1969 until 1991. In 1979, undergraduate Sally Frank filed suit against then all-male clubs Ivy Club, Cottage Club, and Tiger Inn for gender discrimination. While Cottage chose to coeducate during the intervening years, Ivy Club and Tiger Inn were forced to become co-ed organizations in 1991, after their appeal to the U.S. Supreme Court regarding Frank's lawsuit was denied.[15][16] The New Jersey Supreme Court had ruled in Frank v. Ivy Club that the failure to open membership to women violated the state's anti-discrimination statute.[17][18][19][20][21]\n\nIn modern times, the membership of The Tiger Inn is distinctly coed, and the club's membership and leadership, including members of both its Graduate Council and the undergraduate officers have included many notable Princeton alumnae and female students, respectively. In 2015 Grace Larsen was elected as the club's first female president.[22] That same year Maria Yu was elected as treasurer, and Victoria Hammarskjold was elected as communication chair, thus making it the first time the club's undergraduate officers were gender-balanced, with three women and three men.[22]\n\nThe full membership of the club, including all living alumni, have met four times to commemorate anniversaries of Tiger Inn. The highlight of the club's fiftieth anniversary celebration was the publication of the club's first official history, written by Charlie Mulduar and released in March 1940, just before America's involvement in World War II. The club's seventy-fifth anniversary was held on December 9, 1965, at the Hotel Roosevelt in New York.  The celebrations for the 100th anniversary of the club began in 1988 with a small informal meeting of 40 alumni at the Princeton Club of New York who began to plan the centennial celebrations. The centennial celebrations peaked with the club's Hundredth Anniversary Dinner held on October 20, 1990, at the Hyatt in Princeton, following which many of the alumni insisted on continuing celebrations at the clubhouse. The centennial celebrations were concluded by the subsequent publication of the second club history entitled The Tiger Inn of Princeton, New Jersey, 1890–1997. In February, 2016 The Tiger Inn marked its 125th anniversary with a dinner held at the Westin in Princeton, followed by continued celebrations at the clubhouse.\n\nTiger Inn members acted to form the first American Olympics team for the first modern Olympic games in Athens in 1896. Most of the first American Olympic team came from Princeton, Harvard University and the Boston Athletic Association. Four Princetonians, including three Tiger Inn members, participated in those games. The TI members earned six medals in total: two gold, three silver medals, and one bronze; the four Princetonians earned 7 medals in total. The three TI members were Robert Garrett, Herb Jamison and Frank Lane; they were joined by Princetonian Al Tyler, who also medalled. These four Princeton athletes' 7 medals helped the 1896 American Olympic team earn 20 medals in total. Team Member Garrett delivered the most unexpected upset of the 1896 Games when he won Gold in the Discus, outperforming his Greek rival to win the most symbolic sport carried over from the ancient Olympics to the modern Olympic games.\n\nTI members continued to participate in the Olympics after the 1896 Athens games.  Garrett returned to the Olympics for the 1900 Paris games where he won two bronze medals. He was joined in the Paris games by John Cregan who won a silver medal in the 800 meters. John DeWitt competed in the 1904 St. Louis games; he was joined there by A. M. Woods, who earned a silver medal.[23]\nPete Raymond rowed in both the 1968 Mexico City and 1972 Munich games; he earned a silver medal in Munich.\n\nMost recently, in 2024, current TI member Maia Mei Weintraub competed in the Women's Team Foil Fencing event for Team USA, where she carried her team to Olympic Gold. The victory marked the first time that the United States has taken gold in a team fencing event.\n\nTiger Inn members have earned more than 12 Olympic medals. Garrett's lifetime record of 6 Olympic medals among Princeton athletes continues to stand.\n\nTiger Inn members have been both Princeton football players,[24] and professional football players. The College Football Hall of Fame lists many TI members in its ranks.\n\nTiger Inn alumni have returned to Princeton to serve as Head Coaches of Princeton's football program.  As college football head coaches, Tiger Inn alumni through the class of 1900 compiled composite career coaching records of 175-31-5. They coached Princeton to at least one national championship. TI members who served as Princeton Football Head Coach include Garrett Cochran, Arthur Hillebrand and Robert Casciola. TI Members have also served as Head Coaches of Football at Annapolis, Berkeley, Bowdoin,  Georgetown,  and the University of Nebraska-Lincoln, among other colleges.\n\nCharlie Gogolak and Cosmo Iacavazzi are two prominent TI members who became professional football players.\n\nThrough the club's history Tiger Inn members have also featured prominently in other collegiate sports in which Princeton competes.\n\nIn 2012 the Princeton men's squash team won the National Collegiate Championship powered by the performances of three Tiger Inn members.\n\nTiger Inn's sole winner of a Nobel Prize,[25] thus far, is economist Michael Spence, the winner of the 2001 Nobel Prize in Economics together with George Akerlof and Joseph Stiglitz. During his illustrious career Spence has served as dean of the Stanford Graduate School of Business[26] and is presently chairman of the Commission for Growth and Development.[27]\n\nPrinceton University's School of Architecture was founded in 1919 through the efforts of Tiger Inn Charter Member Howard Clark Butler and his fellow faculty members.[28] He became the School of Architecture's director in 1920. Professor Butler was only the second Princeton Professor to offer a course related to architecture, following the precedent set by Princeton Professor Marquand.\n\nIn addition to Spence, Tiger Inn has produced well over 100 members of Phi Beta Kappa. Its members have earned at least three Rhodes, and two Marshall, Scholarships.  TI members serve as research scientists at the Bell Labs and NASA and in the research or \"Think Tank\" roles of such commercial organizations as international financial institutions and the BIG 4 accounting firms, among other organizations.\n\nTiger Inn alumni have served many universities, including Princeton, as faculty members and as non-faculty instructors and administrators. Spence has served Harvard University, New York University and Stanford University. Butler served Princeton as did noted philologist W K. Prentice. Chauncey Loomis was a Dartmouth professor, and from there, led 5 Arctic expeditions.  James Harland was a professor of classics at University of North Carolina, Chapel Hill. John Fine joined the Princeton faculty in 1940 from Yale as a professor of Classics  and retired in 1972. Richard H Williams is a professor of history at Southern Methodist University. Samuel Armistead is a professor of Spanish language and literature at UC Davis.\n\nSean Smith is a professor of computer science at Dartmouth.[29] Joseph Haid is a professor at Wisconsin Polytechnique Institute.[30]\n\nWill Garwood continues to serve Princeton as vice chairman of advisory board to the James Madison Program [31] On June 12, 2012, Robert J Hugin was elected a Charter Trustee of Princeton University [32]\n\nTiger Inn's members have been active in literature and the arts. Jesse Williams won the first Pulitzer Prize in Drama. Frank Taplin was president of the Metropolitan Opera in New York, the Cleveland Orchestra, and the Cleveland Institute of Music. Thomas Hoving was the director of New York's Metropolitan Museum of Art. And Barry S Friedberg is the chairman emeritus of the New York City Ballet.\n\nJesse Williams, the author of Why Marry?, has been joined by several other Tiger Inn members as accomplished authors. William Edwards' book Football Days remains the definitive account of American Football in the 19th century. Classics Professor John Fine wrote several books, including The Ancient Greeks: A Critical History. Samuel Armistead wrote Spanish Tradition in Louisiana, which remains the definitive study on the use of the Spanish language in that state.[33] H K Twichell wrote Regeneration in the Ruhr: The Unknown Story of a Decisive Answer to Communism in Postwar Europe.[34]  Henry Owsley is co-author of the leading book in his field, Distressed Investment Banking: To the Abyss and Back.[35]\n\nChauncey Loomis remains Tiger Inn's only Arctic explorer.\n\nSeveral members of the Tiger Inn have served the United States as uniformed officers of its Armed Forces. TI was founded just over 20 years after the end of the Civil War. TI members have served in the Spanish–American War, World War I, World War II, the Korean war, the Vietnam war, Desert Storm and the more recent wars in Iraq and Afghanistan, among other armed conflicts.\n\nTI Members who served in World War I include Brigadier General Coulter, Medal of Honor recipient Gordon Johnston, and decorated World War I Flying Ace, \"Ace\" Vaughn.\n\nTiger Inn lists well over 30 members who gave their lives in the service of their country. The memory of many of these TI alums are honored through their portraits kept at the clubhouse, mainly in the upstairs Library.\n\nTI members have also served their communities through various positions at the Federal, State and local levels. Tiger Inn members have served as United States Senator a",
  "concepts": [
    "Tiger Inn",
    "club",
    "princeton",
    "members",
    "inn",
    "tiger inn",
    "tiger",
    "new",
    "membership",
    "clubhouse",
    "ti"
  ],
  "findings": [
    "The Tiger Inn clubhouse",
    "Membership",
    "Notable contributions to sport",
    "Notable community contributions",
    "Controversies",
    "Notable members",
    "References",
    "External links"
  ],
  "relationships": [
    {
      "subject": "Tiger Inn",
      "relationship": "is a",
      "object": "selective club",
      "sentence": "[12]\n\nTiger Inn is a selective club, meaning membership is awarded after successful completion of a process called bicker."
    }
  ],
  "timestamp": "2025-04-11T13:26:08.850396"
}