{
  "title": "Springfield–Branson National Airport",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Springfield–Branson_National_Airport",
  "content": "Springfield–Branson National Airport (IATA: SGF, ICAO: KSGF, FAA LID: SGF) (formerly Springfield–Greene County Airport, Springfield Municipal Airport, and Springfield–Branson Regional Airport) is five miles (8.0 km) northwest of Springfield, in Greene County, Missouri, United States. The airport hosts non-stop flights to 13 cities in the U.S., 1 of which is seasonal.[3]\n\nIn 1925, McCluer Flying Field (now Downtown Airport) was opened as a private airport on East Division Street. It was purchased by the city in 1928 and renamed to Springfield Park and Airport. The following year, commercial air service from American Airlines, Transcontinental and Western, and other carriers began to be offered at the airport.[4]\n\nOver the next two decades, as planes continued to increase in size, the short and unpaved runways of the Springfield Airport made it difficult for commercial air service to expand. Furthermore, the Great Depression left little funding for improvement, and commercial air service eventually disappeared.\n\nDuring World War II, wounded returning soldiers were being flown in large numbers to Springfield on their way to the O'Reilly General Hospital, and it became evident that the airport was ill-equipped for air traffic and  was in dire need of an upgrade.\n\nIn October 1942, municipal voters approved a $350,000 bond issue to build a new airport, for which work began in 1944. Further bonds in the amount of $150,000 to complete the project were approved in 1945, and on July 2 of that year the new Airport opened for business. While originally known as the Springfield-Greene County Airport, disagreements between the city and county governments about finances caused the City of Springfield to assume full control, renaming it the Springfield Municipal Airport. Soon after, in early 1946, American Airlines again began commercial service to SGF.\n\nIn 1960, Springfield voters approved a $600,000 bond issue to build a new terminal, which opened in October 1964. This terminal was expanded multiple times in the following decades as passenger numbers grew at an accelerating rate.\n\nThe airport was eventually renamed the Springfield-Branson National Airport. It is likely that this was in order to capitalise on the tourist industry of the nearby city of Branson, Missouri. Despite this, the city of Branson is not involved in any way with the operation or funding of the airport.\n\nIn 2005, the airport saw a year-over-year passenger increase of 23 percent, its largest in history. Due to this, ground was broken for yet another new terminal in May 2006. The new Midfield Terminal was opened in May 2009. In the same month, the airport celebrated its first scheduled service to the west coast, an Allegiant Air service to Los Angeles. The new terminal was eventually renamed the Roy Blunt Terminal in honor of Missouri Senator Roy Blunt.\n\nThe airport served 1 million passengers for the first time in 2018.\n\nThe airport covers 2,750 acres (1,110 ha) and has two runways: 14/32, asphalt/concrete, 8,000 ft × 150 ft (2,438 m × 46 m); and 2/20, concrete, 7,003 ft × 150 ft (2,135 m × 46 m).[1][5]\n\nIn the year ending December 31, 2021 the airport had 47,565 aircraft operations, average 130 per day: 44% general aviation, 27% air taxi, 6% military and 22% airline. 142 aircraft at that time were based at this airport: 87 single-engine, 10 multi-engine, 33 jet, 2 helicopters, and 10 military.[1]\n\nAn Army National Guard unit is based at Springfield–Branson, the 35th combat aviation brigade, detachment 3 company 1 of the 185th aviation regiment. \"The 35th Combat Aviation Brigade deploys to an area of responsibility to provide command, control, staff planning and supervision of combat aviation brigade operations. The brigade's units fly a combination of AH-64A Apache attack helicopters, OH-58 Kiowa observation helicopters and UH-60 Blackhawk utility helicopters. It also has a detachment of two C-23 Sherpa cargo airplanes and a C-12 transport airplane.\"[6]\n\nThe strongest area of income for SGF is from non-aeronautical revenue activities including parking and rental cars. This is followed by fuel sales, terminal fees and landing fees. Parking income has been the strongest for the past year[when?] and has followed enplanement trends with a drop in revenues in FY 2008, and increasing again in FY 2010, with the highest level to date at more than $2.5 million.[7]\n\nPersonnel is the largest expenditure for the airport: this major operating expense is increasing per year and remains the highest by a very large margin. Additionally, an expense that sticks out is a sharp increase in contractual series between FY 2011 and FY 2012.\n\nSource:[8]\n",
  "concepts": [
    "Springfield–Branson National Airport",
    "airport",
    "springfield",
    "year",
    "terminal",
    "service",
    "new",
    "branson",
    "air",
    "city",
    "aviation"
  ],
  "findings": [
    "History",
    "Accidents and incidents",
    "Facilities",
    "Financial data",
    "Airlines and destinations",
    "Passenger",
    "Cargo",
    "Statistics",
    "Top destinations",
    "Annual traffic",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:39.894896"
}