{
  "title": "2017 Bonavista—Burin—Trinity federal by-election",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/2017_Bonavista—Burin—Trinity_federal_by-election",
  "content": "Judy Foote\nLiberal\n\nChurence Rogers\nLiberal\n\nA by-election was held in the federal riding of Bonavista—Burin—Trinity in Newfoundland and Labrador on December 11, 2017 following the resignation of Liberal MP Judy Foote. The seat was held for the Liberals by Churence Rogers.[1]\n\nThe by election was held on the same day as 3 others across Canada; Battlefords—Lloydminster in Alberta,  Scarborough—Agincourt in Ontario and South Surrey—White Rock in British Columbia.\n\nBonavista—Burin—Trinity is a rural constituency on Newfoundland Island. The riding contains the Bonavista Bay area, the Burin Peninsula and the Trinity Bay area of Newfoundland.\n\nThe riding is considered a safe seat for the Liberal Party of Canada. The seat was vacated effective September 30, 2017, following the resignation of Judy Foote, Minister of Public Services and Procurement, from cabinet on August 24, 2017, and her resignation from parliament due to an illness in her family on September 30.[2]\n\nCentreville-Wareham-Trinity Mayor and former president of the Federation of Municipalities in Newfoundland and Labrador Churence Rogers[3] defeated[4] comedian Pete Soucy,[5][6] provincial and federal Liberal party organizer Larry Guinchard,[7] RCMP officer Dale Foote,[8] and North Harbour farmer, former search and rescue coordinator, and 2008 Conservative Party candidate in St. John's South—Mount Pearl Merv Wiseman[9][10] for the Liberal nomination.\n\nTeacher and guidance counsellor Mike Windsor was named the Conservative candidate.[11] Windsor previously ran for the party in 2015 in the riding.\n\nTyler James Downey was named the NDP candidate.[12]\n\nRumoured candidates for the Liberal nomination who ultimately did not run included former Progressive Conservative MHA Darin King[13] and current Liberal MHAs Steve Crocker,[14] Carol Anne Haley, and Dale Kirby.[13] On September 22, 2017, MHA Mark Browne announced he would not be seeking the nomination.[14] Lawyer Stacy MacDonald initially sought the Liberal nomination[15] but withdrew on September 28.[16]\n\nIn the 2015 federal election, Foote won the newly created riding with 81% of the vote, the highest percentage of vote taken by a candidate nationally in that election.[17]\n\nThe Speaker's warrant regarding the vacancy was received on October 3, 2017; under the Parliament of Canada Act the writ for a by-election had to be dropped no later than April 1, 2018, 180 days after the Chief Electoral Officer was officially notified of the vacancy via a warrant issued by the Speaker.[18]\n",
  "concepts": [
    "2017 Bonavista—Burin—Trinity federal by-election"
  ],
  "findings": [
    "Background",
    "Constituency",
    "Representation",
    "Campaign",
    "Results",
    "2015 result",
    "References"
  ],
  "timestamp": "2025-04-11T10:12:39.348160"
}