{
  "title": "Freedom Summer (film)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Freedom_Summer_(film)",
  "content": "Freedom Summer is a 2014 American documentary film, written, produced and directed by Stanley Nelson Jr.[1][2] The film had its world premiere at 2014 Sundance Film Festival on January 17, 2014.[3]\n\nIt won the Best Documentary award at 2014 Pan African Film Festival.[4] The film had its U.S. television premiere at PBS on June 24, 2014.[5][6]\n\nThe film narrates the events of the 1964 Mississippi Freedom Summer, when more than 700 student activists took segregated Mississippi by storm to resist the systematic exclusion of African Americans from the political process. Bob Moses of the Student Nonviolent Coordinating Committee developed a campaign to bring a thousand volunteers to canvassed for voter registration, creating freedom schools and establishing the Mississippi Freedom Democratic Party.\n\nFreedom Summer received positive reviews from critics. Rob Nelson of Variety, said in his review that \"A well-shaped and powerful reminder of a time in recent American history when white supremacy was decisively and courageously undercut.\"[7] Duane Byrge in his review for The Hollywood Reporter praised the film by saying that \"veteran filmmaker Stanley Nelson has crafted a searing portrait of those violent, racist times. Intelligently composed and powerfully driven, Freedom Summer is a stirring historical document. It would seem an essential addition for any university library.\"[8] Dawn Baumgartner Vaughan of Herald Sun, about the film said that \"\"Freedom Summer,\" for those who were born after 1964, brings home a time when wanting to vote meant threats of death on one extreme end, and losing your job on the other. It's a reminder why any new restrictions on voting, in particular those that impact African-American voters, are worth close scrutiny.\"[9]\n",
  "concepts": [
    "Freedom Summer (film)"
  ],
  "findings": [
    "Synopsis",
    "Reception",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:14:19.688694"
}