{
  "title": "Perfect World (video game)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Perfect_World_(video_game)",
  "content": "Perfect World (Chinese: 完美世界, commonly abbreviated as PW and W2), is a 3D adventure and fantasy MMORPG with traditional Chinese settings. Players can take on various roles depending on choice of race and choice of class within that race.\n\nPerfect World International (or PWI) is its more recent rebrand.\n\nCharacters develop skills over time with experience and level up via questing rewards and can use and upgrade physical and magical weapons, and team up with other players to fight against monsters in instances, bosses on the open world as well as other players. Very often, people will sell their accounts which saves buying the items from the in game cash shop, farming experience and gaining the skills needed. However, it is prohibited by the game rules, so the account has risks to be blocked.[1]\n\nEach player can join a guild (if accepted) and thereby be part of a 200 maximum player base with common goals to achieve. The PW map is broken into a large number of territories which gives guilds an option to conquer and govern such territories via Territory War for reward of ownership usually in the form of coins which are used back to benefit the guild and its players.\n\nTerritory War is 80 players VS 80 players, strategic battle which has a 3-hour maximum time cap with each class belonging to a race having unique roles to perform and teamwork and strategy is key to sustain victory. On the US version of PW, Territory War time cap was reduced to 1 hour 40 minutes due to the low player base numbers and low number of players attending. Currently, there is no real emphasis from the player base towards participating in Territory War due to useless rewards. Certain factions still choose to attend however, but most of the fights are completed in 15/20 mins due to other factions not being interested. Twilight Temple and Dawnglory servers currently have the most competitive Territory War seasons followed by Tideswell and then Etherblade server, which the latter has only had 1 faction intent on winning Territory Wars over the past few seasons.\n\nPerfect World is heavily based on Chinese mythology and is set in the mythical world of Pangu. It was launched in January 2006.[2]\n\nFollowing its acquisition in April 2022, the North American branch of Perfect World Entertainment was rebranded as Gearbox Publishing San Francisco, with the naming to be applied retroactively to past games published under Perfect World.[3]\n\nPWI has several expansions:\n\nWhile Perfect World states it is free-to-play, substantial amounts of money are needed to get a leg-up on competition and compete. The game relies on items sold in an in-game cash shop to make profit. Use of the cash shop is optional, but most items purchased there are required to improve a player's gameplay, while few items have purely cosmetic functions.\n\nCurrency used in the cash shop can be bought from the respective websites of each company running a version of the game. Alternatively, cash shop currency can be bought in the auction house from other players in exchange for in-game currency.\n\nPerfect World International offers pre-charged cards that can be bought from 7-Eleven, Target, and GameStop locations.[4] The Malaysian version allows a player to \"Top Up\" via CubiCards. Players may also use other payment forms such as Ultimate Game Cards to purchase cash shop currency by using the PayByCash option.[5]\n\nAs a prevention system against account hackers, Perfect World has a Phone Lock feature[6] for those who wish to use it. The Phone Lock, when activated, will freeze an account until the player of that account dials in using the registered phone number. Once the number is recognized, the account is temporarily activated for login. The player must login within 10 minutes of activation before the account login is frozen again. The player may continue to play despite the freeze. If the player logs out after the 10 minutes are up, that player must once again dial in to temporarily deactivate the Phone Lock. The phone lock feature is exclusive to the Chinese Malaysian version of the game.[citation needed]\n",
  "concepts": [
    "Perfect World (video game)",
    "player",
    "world",
    "players",
    "perfect world",
    "perfect",
    "game",
    "territory",
    "shop",
    "cash shop",
    "cash"
  ],
  "findings": [
    "Expansions",
    "Boutique",
    "Phone Lock System",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:17.340855"
}