{
  "title": "Osseointegration",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Osseointegration",
  "content": "Osseointegration (from Latin osseus \"bony\" and integrare \"to make whole\") is the direct structural and functional connection between living bone and the surface of a load-bearing artificial implant (\"load-bearing\" as defined by Albrektsson et al. in 1981). A more recent definition (by Schroeder et al.) defines osseointegration as \"functional ankylosis (bone adherence)\", where new bone is laid down directly on the implant surface and the implant exhibits mechanical stability (i.e., resistance to destabilization by mechanical agitation or shear forces). Osseointegration has enhanced the science of medical bone and joint replacement techniques as well as dental implants and improving prosthetics for amputees.[citation needed]\n\nOsseointegration is also defined as: \"the formation of a direct interface between an implant and bone, without intervening soft tissue\".[1]\n\nAn osseointegrated implant is a type of implant defined as \"an endosteal implant containing pores into which osteoblasts and supporting connective tissue can migrate\".[2] Applied to oral implantology, this refers to bone grown right up to the implant surface without interposed soft tissue layer. No scar tissue, cartilage or ligament fibers are present between the bone and implant surface. The direct contact of bone and implant surface can be verified microscopically.[citation needed]\n\nOsseointegration may also be defined as:[citation needed]\n\nOsseointegration was first observed—albeit not explicitly stated—by Bothe, Beaton, and Davenport in 1940.[3][4] Bothe et al. were the first researchers to implant titanium in an animal and remarked how it tended to fuse with bone.[3][4]  Bothe et al. reported that due to the elemental nature of the titanium, its strength, and its hardness, it had great potential to be used as future prosthesis material.[3][4] Gottlieb Leventhal later described osseointegration in 1951.[3][5] Leventhal placed titanium screws in rat femurs and said, \"At the end of 6 weeks, the screws were slightly tighter than when originally put in; at 12 weeks, the screws were more difficult to remove; and at the end of 16 weeks, the screws were so tight that in one specimen the femur was fractured when an attempt was made to remove the screw. Microscopic examinations of the bone structure revealed no reaction to the implants, the trabeculation appeared to be perfectly normal.\"[3][5] The reactions described by Leventhal and Bothe et al. would later be coined into the term \"osseointegration\" by Per-Ingvar Brånemark of Sweden. In 1952, Brånemark did an experiment where he used a titanium implant chamber to study blood flow in rabbit bone. At the end of the experiment, when it became time to remove the titanium chambers from the bone, he discovered that the bone had integrated so completely with the implant that the chamber could not be removed. Brånemark called this \"osseointegration\", and, like Bothe et al. and Leventhal before him, saw the possibilities for human use.[3][4][5]\n\nIn dentistry the implementation of osseointegration started in the mid-1960s as a result of Brånemark's work.[6][7][8][9]  In 1965 Brånemark, who was at the time Professor of Anatomy at University of Gothenburg, placed dental implants into the first human patient—Gösta Larsson. This patient had a cleft palate defect and needed implants to support a palatal obturator. Gösta Larsson died in 2005, with the original implants still in place after 40 years of function.[10]\n\nIn the mid-1970s Brånemark entered into a commercial partnership with the Swedish defense company Bofors to manufacture dental implants and the instrumentation required for their placement. Eventually an offshoot of Bofors, Nobel Pharma, was created to concentrate on this product line.  Nobel Pharma subsequently became Nobel Biocare.[10]\n\nBrånemark spent almost 30 years fighting the scientific community for acceptance of osseointegration as a viable treatment. In Sweden he was often openly ridiculed at science conferences. His university stopped funding for his research, forcing him to open a private clinic to continue treating patients. Eventually an emerging breed of young academics started to notice the work being done in Sweden. Toronto's George Zarb, a Maltese-born Canadian prosthodontist, was instrumental in bringing the concept of osseointegration to the wider world. The 1983 Toronto Conference is generally considered to be the turning point, when finally the worldwide scientific community accepted Brånemark's work. Osseointegration is now a highly predictable and common treatment modality.[10]\n\nSince 2010, Professor Munjed Al Muderis in Sydney, Australia, used a high tensile strength titanium implant with plasma sprayed surface as an intramedullary prosthesis that is inserted into the bone residuum of amputees and then connect through an opening in the skin to a robotic limb prosthesis. This lets amputees mobilize with more comfort and less energy consumption. Al Muderis also published the first series of combining osseointegration prosthesis with Joint replacement enabling below knee amputees with knee arthritis or short residual bone to walk without needing a socket prosthesis.[11]\n\nOn December 7, 2015, Bryant Jacobs and Ed Salau, two military veterans who fought in Operation Iraqi Freedom/Operation Enduring Freedom, became the first persons in the USA to get a percutaneous osseointegrated prosthesis.[12] In the first stage, doctors at Salt Lake Veterans Affairs Hospital embedded a titanium stud in the femur of each patient. About six weeks later, they went back and attached the docking mechanism for the prosthesis.[citation needed]\n\nOsseointegration is a dynamic process in which characteristics of the implant (i.e., macrogeometry, surface properties, etc.) play a role in modulating molecular and cellular behavior.[13] While osseointegration has been observed using different materials, it is most often used to describe the reaction of bone tissues to titanium, or titanium coated with calcium phosphate derivatives.[14] It was previously thought that titanium implants were retained in bone through the action of mechanical stabilization or interfacial bonding. Alternatively, calcium phosphate coated implants were thought to be stabilized via chemical bonding.  It is now known that both calcium phosphate coated implants and titanium implants are stabilized chemically with bone, either through direct contact between calcium and titanium atoms, or by the bonding to a cement line-like layer at the implant/bone interface.[15][16] While there are some differences (e.g., like the lack of chondrogenic progenitors), osseointegration occurs through the same mechanisms as bone fracture healing.[17][18]\n\nFor osseointegrated dental implants, metallic, ceramic, and polymeric materials have been used,[2] in particular titanium.[19] To be termed osseointegration the connection between the bone and the implant need not be 100%, and the essence of osseointegration derives more from the stability of the fixation than the degree of contact in histologic terms. In short it is a process where clinically asymptomatic rigid fixation of alloplastic materials is achieved, and maintained, in bone during functional loading.[20] Implant healing time and initial stability are a function of implant characteristics. For example, implants using a screw-root form design achieve high initial mechanical stability through the action of their screws against bone. Following placement of the implant, healing typically takes several weeks or months before the implant is fully integrated into the bone.[21][22][23] First evidence of integration occurs after a few weeks, while more robust connection is progressively effected over the next months or years.[24]  Implants that have a screw-root form design result in bone resorption followed by interfacial bone remodeling and growth around the implant.[25]\n\nImplants using a plateau-root form design (or screw-root form implants with a wide enough gap between the pitch of the screws) undergo a different mode of peri-implant ossification. Unlike the aforementioned screw-root form implants, plateau-root form implants exhibit de novo bone formation on the implant surface.[26] The type of bone healing exhibited by plateau-root form implants is known as intramembranous-like healing.[25]\n\nThough the osseointegrated interface becomes resistant to external shocks over time, it may be damaged by prolonged adverse stimuli and overload, which may cause implant failure.[27][28]  In studies done using \"Mini dental implants,\" it was noted that the absence of micromotion at the bone-implant interface was needed to enable proper osseointegration.[29] It was also noted that there is a critical threshold of micromotion above which a fibrous encapsulation process occurs, rather than osseointegration.[30]\n\nOther complications may arise even in the absence of external impact. One issue is growth of cement.[31] In normal cases, absence of cementum on the implant surface prevents attachment of collagen fibers. This is normally the case due to the absence of cementum progenitor cells in the area receiving the implant. However, when such cells are present, cement may form on or around the implant surface, and a functional collagen attachment may attach to it.[32]\n\nSince 2005, a number of orthopedic device makers have introduced products with porous metal construction.[33][34][35] Clinical studies on mammals have shown that porous metals, such as titanium foam, may allow formation of vascular systems within the porous area.[36] For orthopedic uses, metals such as tantalum or titanium are often used, as these metals have high tensile strength and corrosion resistance with excellent biocompatibility.[citation needed]\n\nThe process of osseointegration in metal foams is similar to that in bone grafts.  The porous bone-like properties of the metal foam contribute to extensive bone infiltration, allowing osteoblast activity to take place.  In addition, the porous structure allows for soft tissue adherence and vascularization within the implant.  These materials are currently deployed in hip replacement, knee replacement and dental implant surgeries.[citation needed]\n\nThere are a number of methods used to gauge the level of osseointegration and the subsequent stability of an implant. One widely used diagnostic procedure is percussion analysis, where a dental instrument is tapped against the implant carrier.[37] The nature of the ringing that results is used as a qualitative measure of the implant's stability. An integrated implant will elicit a higher pitched \"crystal\" sound, whereas a non-integrated implant will elicit a dull, low-pitched sound.[38]\n\nAnother method is a reverse torque test, in which the implant carrier is unscrewed. If it fails to unscrew under the reverse torque pressure, the implant is stable. If the implant rotates under the pressure it is deemed a failure and removed.[39] This method comes at the risk of fracturing bone that is mid-way in the process of osseointegration.[37] It is also unreliable in determining the osseointegration potential of a bone region, as tests have yielded that a rotating implant can go on to be successfully integrated.[40]\n\nA non-invasive and increasingly implemented diagnostic method is resonance frequency analysis (RFA).[37] A resonance frequency analyzer device prompts vibrations in a small metal rod temporarily attached to the implant. As the rod vibrates, the probe reads its resonance frequency and translates it into an implant stability quotient (ISQ), which ranges from 1–100, with 100 indicating the highest stability state. Values ranging between 57 and 82 are generally considered stable, though each case must be considered independently.[37]\n\nOne of the peculiarities of osseointegrated prostheses is that mechanical events at the prosthesis (e.g., touch) are transferred as vibrations through the bone.[41]\nThis \"osseoperception\" means that the prosthesis user regains a more accurate sense of how the prosthesis is interacting with the world. Users of bone-anchored lower limb prostheses report, for example, that they can tell which type of soil they are walking on due to osseoperception.[42]\n\nRecent research on users of bone-anchored upper and lower limb prostheses showed that this osseoperception is not only mediated by mechanoreceptors but also by auditory receptors.[43][44] This means that, rather than just feeling mechanical influences on the device, users also hear the movements of their prosthesis. This joint mechanical and auditory sensory perception is likely responsible for the improved environment perception of users of osseointegrated prostheses compared to traditional socket suspended devices. It is not clear, however, to what extent this implicit sensory feedback actually influences prosthesis users in everyday life.[45]\n",
  "concepts": [
    "Osseointegration"
  ],
  "findings": [
    "Definitions",
    "History",
    "Mechanism",
    "Technique",
    "Advances in materials engineering: metal foams",
    "Testing procedures",
    "Osseoperception",
    "Applications",
    "See also",
    "References",
    "Further reading",
    "External links"
  ],
  "timestamp": "2025-04-11T10:14:02.432690"
}