{
  "title": "Chief Judicial Commissioner for the Western Pacific",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Chief_Judicial_Commissioner_for_the_Western_Pacific",
  "content": "\nThe Chief Justice of the High Commissioner's Court,  more commonly known as the Chief Judicial Commissioner for the Western Pacific, was the chief judicial officer throughout the British Western Pacific Territories from 1877 through 1976. This was a supra-colonial entity established by the Western Pacific Orders-in-Council 1877 (amended in 1879 and 1880), and by the Pacific Order-in-Council 1893.[note 1] Headed by a High Commissioner for the Western Pacific, who was also ex officio the Governor of Fiji, until the end of 1952, it included numerous islands, mostly small, throughout Oceania. Composition varied over time, but Fiji (1877–1952) and the Solomon Islands (1893–1976) were its most durable members.\n\nFrom 1877 through 1961, the Chief Justice of Fiji was ex officio Chief Judicial Commissioner, apart from a three-year suspension of the High Commission from 1942 through 1945 during the War in the Pacific, when many of Britain's colonies in Oceania were under either military administration or Japanese occupation. Appeals lay to the Judicial Committee of the Privy Council in London.\n\nFrom the beginning of 1953, Fiji and Tonga were separated from the High Commission as a prelude to full independence, and the High Commission offices were transferred to Honiara on Guadalcanal in the Solomon Islands, with the Governor of the Solomon Islands now being the High Commissioner ex officio. The High Commissioner's Court, however, continued to meet in Suva, with the Chief Justice of Fiji continuing as Chief Judicial Commissioner for another decade, until 1962, when the two offices were separated. Under the Western Pacific (Courts) Order in Council, gazetted on 15 August 1961 and effective from 9 April 1962, the High Commissioner's Court was renamed the High Court of the Western Pacific and relocated to the Solomon Islands.[1] The court consisted of a Chief Justice (as the office of Chief Judicial Commissioner was renamed – no longer the Chief Justice of Fiji) and two puisne judges, one based in Port Vila, New Hebrides (now Vanuatu), and the other in Tarawa, Gilbert and Ellice Islands (now Kiribati and Tuvalu).[2]\n\nMost of the island groups had gained either independence or internal self-government by 1971. On 2 January 1976 after nearly all had been given separate statehood, the office of High Commissioner and the entity of the Pacific Territories were abolished. The High Commission of the Western Pacific was abolished, the last archives being finally packed up in Honiara in August 1978.[3] A remnant of the High Commission was the right of appeal from the courts of many island nations to the Court of Appeal of Fiji, then a right of appeal to the Judicial Committee of the Privy Council, which persisted into the late 1970s.[2]\n\nActing for Major\n\nNotes\n\nCitations\n\nSources\n",
  "concepts": [
    "Chief Judicial Commissioner for the Western Pacific"
  ],
  "findings": [
    "List of Chief Judicial Commissioners",
    "References",
    "Further reading"
  ],
  "timestamp": "2025-04-11T10:49:07.616210"
}