{
  "title": "Emotional Technology",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Emotional_Technology",
  "content": "Emotional Technology is the fourth studio album by electronica artist BT. Transitioning towards a more pop music oriented sound, the album features some of BT's more commercially successful releases, including \"Somnambulist (Simply Being Loved)\", \"The Force of Gravity\" and \"Superfabulous\". \"Somnambulist (Simply Being Loved)\" holds the Guinness World Record for most vocal edits in a single track, with 6,178 in the album version.[1] The album features vocal performances by JC Chasez, Rose McGowan, and BT himself, among others.\n\nThe album's intro consists of a backwards sample of \"Satellite\", the closing track of Movement, followed by reversed samples of \"Somnambulist\" and \"Dark Heart Dawning\" from Emotional Technology. Shortly after \"Somnambulist\", the album moves from its pop-oriented sound into a more experimental direction, containing introspective lyrics and song structures and samples not normally found in trance music at the time (the extended breakdown section of \"P A R I S\" features a galloping horse and a choir, while \"Communicate\"'s chorus drops the beat entirely). Emotional Technology also found Transeau writing several epic rock songs in the vein of \"Satellite\". Several of these songs would later be replaced on the Special Collector's Edition release.[citation needed]\n\nEmotional Technology received mixed reviews from critics. At Metacritic, the album received an average score of 61 out of 100, based on 7 reviews. The album charted at 138 on the Billboard 200, making it BT's highest charting album to date.\n\nPrior to the album's release, BT and BPM Magazine held a remix contest for the album. Inside an issue of BPM Magazine would be an EP containing the individual parts for \"Somnambulist\", \"Communicate\", \"The Great Escape\" and \"Superfabulous\", as well as a new, unreleased track titled \"Kimosabe\" (which would become part of the soundtrack for Electronic Arts' racing video game Need for Speed: Underground) and also featured in a Harmonix Music Rhythm game Amplitude.[citation needed] The four winners were announced in early 2004 and they won signed copies of Emotional Technology among other prizes. Two notable winners were Toksin (for his remix of \"Communicate\") and Burufunk (for their remix of \"The Great Escape\"). Burufunk had previously remixed \"Somnambulist\" for when the song was released as a single in May 2003. They later worked with BT on his remix of The Doors' classic, \"Break on Through (To the Other Side)\". Toksin has since released remixes of \"Superfabulous\" and \"The Great Escape\" on his website. He has also remixed \"Shame\" in his live shows.[citation needed]. The song \"Tao of the Machine\" was used in the 2005 video game Need for Speed: Most Wanted.\n\nThe album had only one official single, which was \"Somnambulist (Simply Being Loved)\". However, the Technology EP serves as a non-formal single release for \"Superfabulous\", \"The Force of Gravity\" and \"The Great Escape\".[citation needed]\n\nAll songs were written by BT, unless noted.\n",
  "concepts": [
    "Emotional Technology"
  ],
  "findings": [
    "Background",
    "Reception",
    "Remix contest",
    "Singles",
    "Track listing",
    "Vinyl",
    "Special Collector's Edition",
    "Personnel",
    "Charts",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:12:05.923347"
}