{
  "title": "Jochy Hernández",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jochy_Hernández",
  "content": "Carlos José \"Jochy\" Hernández Diaz (September 12, 1963 in San Cristobal Province, Dominican Republic-April 30, 1994 in Santo Domingo, Dominican Republic) was a Dominican Merengue singer who obtained success during the 1980s, becoming well known in Latin America.[1]\n\nHernández was the son of Bartolo Hernández.[2]\n\nHernández lost his father at the age of 11 when, on October 5, 1974, Bartolo was shot on his chest and murdered.[3] His father's murder was never solved.[4]\n\nAs a teenager, Hernández launched his singing career, becoming a Merengue singer with a few bands, before landing a spot on a popular Merengue orchestra that was led by Alex Bueno and by Anibal Bravo, two well-known Dominican musicians of the era.[5]\n\nIn 1985, Hernández became a solo singer, signed by Discos CBS, the musical subsidiary of American broadcasting company CBS. His first release was named \"Ahora Yo\" (\"Now Its My Turn\").[6]\n\nOn August 16 of 1987, Hernández and his orchestra had played a concert at Cibao when a mini-bus carrying part of the group collided with a truck after the concert had finished. Hernández and his brother Ruddy were in another vehicle; they got off and found three dead musicians; another one, singer Delvi, survived the crash but was hit by an on-coming vehicle and died later. The tragedy took place at a city named Bonao.[7]\n\nIn 1988, Hernández released the album that would give him his nickname, \"El Amiguito\" (\"The Little Friend\"). The album included a song named \"Hermanos Mios\" (\"My Brothers\"), which was dedicated to the musicians who died during the 1987 vehicular tragedy. Ever since, he was known as \"El Amiguito del Merengue\" (\"Merengue's Little Friend\").[8]\n\nIn 1989, Hernández started suffering headaches. Tests revealed he had a terminal brain tumor. He was initially given only two months to live, but he persevered, surviving five extra years.[9]\n\nAccording to his brother, San Cristobal senator Tito Hernández, Tito Hernández made Dominican President Joaquin Balaguer aware of his brother's condition. Balaguer wanted to assist and recommended doctor Ney Arias Lora. Hernández was then sent to a hospital in Boston, Massachusetts by Dr. Arias Lora, and he had surgery there.\n\nThe cancer, however, returned.[3]\n\nHernández married television news reporter and actress María del Carmen Hernández; the couple had three children.[9] One of his children, José Carlos, a rock musician,[3] was murdered in Santo Domingo during 2012. He also has a daughter, Cindy Marie Hernández.[10]\n",
  "concepts": [
    "Jochy Hernández",
    "hernández",
    "merengue",
    "dominican",
    "singer",
    "named",
    "musicians",
    "known",
    "brother",
    "vehicle",
    "tragedy"
  ],
  "findings": [
    "Early life",
    "Career",
    "Vehicular accident",
    "Health problems and death",
    "Personal life",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T17:29:37.942861"
}