{
  "title": "Tripunithura Krishnadas",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Tripunithura_Krishnadas",
  "content": "M A Krishnadas, also known as Tripunithura Krishnadas is an Indian musician. He is a well-known edaykkya (or Idakka) and chenda artist from Kerala. He is the best edaykkya player of modern Kerala.\n\nKrishnadas inherited the taste for music and talas from his illustrious family – Mundempilly Marath at Tripunithura. Born in 1955 as the son of Cherukkaraparambu Madathil Ananthan Embranthiri and Mundempilly Marath Karthyayani marasyar.\nKrishnadas was inducted into this field since the age of five under the tutorship of Late Ramamangalam Rama Marar. Since then he has been in this field of art and music. Krishnadas had his first stage performance at Tripunithura Sree Poornathrayesa Temple in the age of eight. He has been accompanying world-renowned singers and dancers since then.\n\nM A Krishnadas was the first person to make edaykkya this simple to public and the first to introduce the instrument in the western field of music at a time when it was considered a taboo. He can play the instrument in any genres of music including classical, jazz, pop, western, etc. He is associated with the western troupes like Atma, Kochi and \"The Banned\", Chennai and has performed in their albums and various stage shows, apart from the humongous number of other classical and non-classical troupes or bands.\n\n\"It might not be off-beamed if I say Tripunithura Krishnadas is the single most Edaykkya player who plays the instrument in the most melodious and heart touching manner of all the players in this world\", are the words of Padma Bhushan Dr. K. J. Yesudas who in the early 80s discovered the talent in this gifted artist and mentored him all along. It might not come as a surprise that if the singer is Dr. Yesudas, then the sound of edaykkya will be from Krishnadas.\n\nKrishnadas is the recipient of Kerala Sangeetha Nataka Academy award in the year of 1992 for the best edaykkya artist in the state. He is also recipient of Junior fellowship from the Government of India in the year 1996.\n[1]\n\nHe has been associated with the Doordarshan and Akashavani through various programmes for over 30 years; he is a \"Grade A\" Edaykkya artist in Doordarshan and Akashavani.\n\nKrishnadas has rendered edaykkya recital as a solo as well as an accompanying instrument in 3000+ cassettes and over 60 Malayalam films, a unique achievement among the contemporary edaykkya artists.\n\nHe is a regular participant of International Music festival at Paris, held every summer along with being honoured as a senior edaykkya artist to participate in the Annual Chembai Music Festival (also called Chembai Sangeetholsavam) held every Nov–Dec in the holy shrine of Guruvayoor every year.[2]\n\nIn January 2011, the Govt of Kerala conferred him with the highest accolade for an instrument artist at the state level \"Pallavur Appu Marar Award\", for the excellence in the field of development of Edaykka and Chenda.\n\nIn Autumn 2011, the Kanchi Ashram of Sree Sankaracharya recognised his talent by giving him the title of Aasthana Vidwan, (presiding artist).[3]\n\nThe Rotary club of Kochi honoured him with the Vocational Excellence award in October 2012.\n\nHis most notable rendition is in the 1993 Malayalam super hit Devasuram where in Oduvil Unnikrishnan plays the instrument and sing a song to the ailing hero. The original score was sung by M. G. Radhakrishnan, famous music director of Kerala, with Krishnadas playing edaykkya, eloquently as always, which made Krishndas very popular in the Kerala film industry and brought him huge accolade. This is still regarded as a masterpiece among the music fraternity in the Malayalam film industry.[4]\n[5]\n\nSome of the notable films in which Krishnadas rendered his Scores of edaykkya:\n\nAshtapathi\nDevasuram\nMayamayooram\nKalyana Raman\nVasanthiyum Laksmiyum Pinne Njanum\nMore recently in Urumi....\n\nKrishnadas is a highly gifted artist, and perhaps the only artist who can play edaykkya with any genre of music, Carnatic classical, Hindustani, Pop, western, Jazz.[6]\n\nKrishnadas is believed to be the major pioneer inspiring the introduction and usage of edaykka with any genre of music, Carnatic classical, Hindustani, Pop, western, Jazz.\n",
  "concepts": [
    "Tripunithura Krishnadas",
    "krishnadas",
    "edaykkya",
    "music",
    "artist",
    "kerala",
    "instrument",
    "western",
    "classical",
    "tripunithura",
    "field"
  ],
  "findings": [
    "Music career",
    "Awards and recognitions",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:16.873314"
}