{
  "title": "Runnymede station",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Runnymede_station",
  "content": "Runnymede is a subway station on Line 2 Bloor–Danforth of the Toronto subway in Toronto, Ontario, Canada. It is located just north of Bloor Street West, spanning the block east of Runnymede Road to Kennedy Avenue, with bus platforms at the surface level and entrances at both ends.\n\nThe station opened in 1968 as part of the westerly extension of the subway line from Keele to Islington station.[2]\n\nExtensive rehabilitation of the concrete station structure was undertaken in 2010.[3] This work involved replacing the concrete slab and columns of the bus platform, and the bus driveway structural paving.[4]\n\nInstallation of three elevators to make the station fully accessible commenced in late November 2018. The construction took two years to complete.[5]\n\nThe station has two entrances, one on Runnymede Road and the other at Kennedy Avenue. The station is barrier free from the street to the bus platforms. The bus platforms are not in a fare-paid area. The station has three levels: street, concourse and platform.[6]\n\nRunnymede station features public art by artist Elicser Elliott titled Anonymous Somebody. The artwork consists of images of people that one may see in Bloor West Village, the neighbourhood where the station is located.[7]\n\nThe line is tunneled westward toward Jane station. About halfway east towards High Park station, just after at Kennedy Park Road, the line comes to the surface at the Clendenan Portal and crosses over Clendenan Avenue.\n\nNearby landmarks include the former Runnymede Theatre in Bloor West Village, the Runnymede branch of the Toronto Public Library,[8] Runnymede Junior & Senior Public School, Western Technical-Commercial School, and Runnymede United Church.\n\nThe station's bus platform is not within the fare-paid area.\n\nTTC routes serving the station include:\n\n Media related to Runnymede station at Wikimedia Commons\n",
  "concepts": [
    "Runnymede station"
  ],
  "findings": [
    "History",
    "Description",
    "Subway infrastructure in the vicinity",
    "Nearby landmarks",
    "Surface connections",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:09:12.801033"
}