{
  "title": "Ove Rainer",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Ove_Rainer",
  "content": "Anders Ove Rainer (14 September 1925 – 27 January 1987) was a Swedish civil servant and politician. He served as minister for justice from 1982 and 1983.[1] Rainer was a jurist by profession.[2] In addition, he served as the head of the Swedish Ice Hockey Association between 1973 and 1978.[1][3] He was also state secretary and director-general of the Swedish Postal Agency from 1973 to 1982.[1]\n\nRainer was born on 14 September 1925 in Gävle, Sweden, the son of Gustaf Rainer, a chartered accountant, and his wife Ella (née Schulze).[4] He passed studentexamen in 1944 and obtained a Candidate of Law degree from Stockholm University College in 1949.[5]\n\nRainer did his clerkship at Sollentuna and Färentuna judicial districts from 1949 to 1951 and worked as an extra legal clerk in Svea Court of Appeal in 1952.[5] He was an expert in the Ministry of Health and Social Affairs from 1958 to 1960, an assessor in the Svea Court of Appeal in 1959 and head of the legal bureau in the Ministry of Justice in 1962 (acting in 1960). Rainer served as acting director general for Administrative Affairs in 1964, was appointed state secretary in 1965 and Hovrättsråd in 1969. He then served as director-general of the Swedish Postal Agency from 1973 to 1982 when he was appointed minister for justice.[5]\n\nRainer became a member of the Social Democratic Party only after he was made justice minister in the second cabinet of Olof Palme.[2] He resigned from office in 1983 due the reports of his using legal tax loopholes.[6][7] These reports were first published in Aftonbladet, and one week later Rainer submitted his resignation.[2] On 9 November 1983 Prime Minister Olof Palme and Ove Rainer made a press conference where the latter announced his resignation from the office.[8]\n\nPrime Minister Olof Palme, who kept a low profile and hitherto avoided commenting on the course of events, immediately arranged for Rainer, who had long been a good friend of his, to become a justice of the Supreme Court of Sweden. On 18 November, it emerged that Rainer - with Sveriges Riksbank's permission - had transferred SEK 5 million to Switzerland to buy shares, in order to take control of a company that belonged to a deceased relative. Now Palme – who denied prior knowledge of the Swiss affair – also reacted. The following day, Rainer was also forced to resign as supreme court justice.[9]\n\nRainer also served as expert in the Nordic joint committee concerning the legal community. He was chairman of the joint organization for EDP in the legal system, the 1967 police investigation, the committee for criminological treatment research, the correctional treatment commission, the crime Commission, the mass media concentration inquiry and the energy commission.[4] Rainer was also a member of the Nordic government officials committee and the Nordic organizing committee. He served as chairman of the Swedish Ice Hockey Association from 1973 to 1978.[4]\n\nIn 1951, Rainer married Maud Jensen. They had one child: Hans (born 1956).[5] In 1973, he married journalist Lena Holm (born 1941), the daughter of police senior intendant Otto Holm and division head Hillevi (née Forssberg).[4]\n\nRainer died on 27 January 1987 and was interred at Norra begravningsplatsen in Stockholm on 11 June 1987.[10]\n\n Media related to Ove Rainer at Wikimedia Commons\n",
  "concepts": [
    "Ove Rainer"
  ],
  "findings": [
    "Early life",
    "Career",
    "Early career",
    "Minister for Justice and the Rainer affair",
    "Other work",
    "Personal life and death",
    "References",
    "Bibliography",
    "Further reading",
    "External links"
  ],
  "timestamp": "2025-04-11T10:19:41.245524"
}