{
  "title": "Earls (restaurant chain)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Earls_(restaurant_chain)",
  "content": "Earls Kitchen + Bar is a Canadian-based premium casual dining chain that operates a total of 70 restaurants in Canada and the United States. Their head office is in Vancouver, British Columbia, Canada.\n\nLeroy Earl \"Bus\" Fuller (1928–2019),[2] the founder of Earls, was a Korean War veteran and an experienced restaurateur with over twenty successful and failed restaurants to his name. His first restaurant was opened in Sunburst, Montana, United States, in 1954 under the name \"Green & White\". In the late 1950s, Fuller moved his young family to Canada and operated a series of A&W (Canada) locations in Edmonton, Alberta.  Soon, the Fullers were operating thirty locations[3][4] and a series of Fuller’s, a Denny’s type of chain.[5] In the 1970s, the Fullers moved west to Vancouver, British Columbia, Canada.\n\nIt was during this time that Fuller went into business with his son Stan Fuller, founding the first Earls restaurant in 1982 in Edmonton.[5]  The chain quickly grew when the Fullers set up an Earls restaurant in their new home town of Vancouver in 1983.  Although its menu originally consisted mostly of burgers and beer, Earls has changed the menu to offer \"dishes inspired by trips around the world.\"[3]  Over the years, Earls restaurants have spread across Western Canada, the United States, and Ontario.\n\nWhile the chain was originally a family business, in 2013, Mo Jessa became the first non-Fuller to be named as company president.[1]\n\nThe Fullers are involved in a number of other Western Canadian restaurant chains.  Jeff Fuller and Stewart Fuller, two other sons of Leroy, are involved in JOEY (a western Canadian restaurant chain) and Cactus Club Cafe, respectively. CEO Stan Fuller owns a 20% share of the latter establishment after the other brothers dropped out.[6]\n\nIn December 2017, Earls announced that they would be closing one of their first locations, on Marine Drive in North Vancouver.[7] In early 2018, the chain opened a concept restaurant at Ambleside Beach in West Vancouver as a replacement.\n\nIn early 2024, longtime executive Mark Hladik was named company president, succeeding Mo Jessa.\n\nThe Earls chain has utilized chicken raised cage-free, and sustainable seafood vetted by Ocean Wise and the Marine Stewardship Council.[8]\n\nIn April 2016, following a trial at its flagship locations, Earls announced that all of its locations would only serve beef sourced from farms accredited under Humane Farm Animal Care's \"Certified Humane\" standards. While Canadian suppliers were used for the trial, Earls stated that there were not enough suitable farms to meet the required demand across their entire chain. As such, the chain chose to source its meat from an accredited farm in Kansas, United States. Following the announcement, Earls faced criticism from government officials for its decision to stop using domestic beef; Rob McNabb, head of the Canadian Cattlemen's Association, criticized the implication that Canadian cattle producers were not working towards humane cattle raising practices, and stated that they were \"second to none in ensuring the welfare of their animals\". The Earls company stated that it would use a Canadian supplier if it met these standards while meeting its supply demands,[9][10] but on May 5, 2016, the chain decided to reverse its decision entirely. Company president Mohammad Jessa explained that the decision was a \"mistake\", and stated that the company planned to work with ranchers in Alberta to encourage humane practices.[11]\n",
  "concepts": [
    "Earls (restaurant chain)",
    "earls",
    "chain",
    "fuller",
    "canadian",
    "restaurant",
    "canada",
    "vancouver",
    "locations",
    "company",
    "united states"
  ],
  "findings": [
    "History",
    "Founding",
    "Recent",
    "Sustainability",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T14:32:52.381422"
}