{
  "title": "Alison Cockburn",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Alison_Cockburn",
  "content": "Alison Cockburn also Alison Rutherford, or Alicia Cockburn (8 October 1712 – 22 November 1794) was a Scottish poet, wit and socialite who collected a circle of eminent friends in 18th-century enlightenment Edinburgh including Walter Scott, Robert Burns and David Hume.\n\nBorn at Fairnilee House, in the Scottish Borders, between Galashiels and Selkirk, she was the daughter of Robert Rutherford of Fernilee. She married an impoverished advocate, Patrick Cockburn of Ormiston in 1731. Unable to afford a home of their own they lived for 4 years in the house of her elderly father-in-law, \"an old Presbyterian of the deepest dye\" who condemned as ungodly cards, plays, and dancing. On the death of the old man they moved to Edinburgh, and she began to mix in society where her liveliness and wit made her welcome in spite of her relatively lowly status.\n\nIn 1745 during the Jacobite rising she vented her Whiggism in a squib upon Bonnie Prince Charlie, and narrowly escaped being taken by the Highland guard as she was driving through Edinburgh in the family coach of the Keiths of Ravelston, with the parody in her pocket.[1]\n\nHer husband died in 1753, and left her a small income.[2] She continued to mix in artistic and intellectual circles from her home in Bristo Street, on Castlehill, Edinburgh. Despite the added loss of her only son in infancy we are told of, \"her insatiable love of mischief, mockery and match-making, everywhere welcome, both in town and country, a good companion, a wise friend, ready to jest over her own ailments.\"\n\nIn 1765 she published her lyrics to the traditional Border Ballad the Flowers of the Forest beginning \"I've seen the smiling of Fortune beguiling\". It is said to have been written before her marriage in 1731[3] and concerns a financial crisis that had ruined the fortunes of a number of the Selkirk Lairds. Later biographers, however, think it probable that it was written on the departure to London of a certain John Aikman, with whom Alison appears to have had an early attachment.[1] Another later set of lyrics to the song by Jean Elliot of Minto written in 1756 is also in circulation and should not be confused with Rutherford's.\n\nIn 1773 she was living at St Andrew Square in a then-new house in Edinburgh's New Town.[4]\n\nIn 1777 she remarked of a young Walter Scott that he was \"the most extraordinary genius of a boy I ever saw.\" She befriended Robert Burns in 1786, whom she described as having \"a most enthusiastic heart of love\". She was a great friend of the philosopher David Hume.[5]\n\nShe was an indefatigable letter-writer and a composer of parodies, squibs, toasts and \"character sketches\", then a favourite form of composition. The \"Flowers of the Forest\" however is considered the only thing she wrote that possesses lasting literary merit.[1][5] However her correspondence and writing about the governess Henrietta Fordyce, who became her confidante and protégé, is credited with establishing Fordyce's notability.[6]\n\nAt her house on Castlehill, and afterwards in Crichton Street, she received many illustrious friends, among whom were Henry Mackenzie, William Robertson, David Hume, John Home, Lord Monboddo,[7] the Keiths of Ravelston, the Balcarres family and Lady Anne Barnard, the author of \"Auld Robin Gray.\" As a Rutherford she had a connection with Sir Walter Scott's mother, and was her intimate friend. Lockhart quotes a letter written by Mrs Cockburn in 1777, describing the conduct of little Walter Scott, then scarcely six years old, during a visit which she paid to his mother, when the child stated that he liked Mrs Cockburn due to her being \"a virtuoso like [himself].\"[1][5]\n\nCockburn died on 22 November 1794.[5] She is buried in the kirkyard of Buccleuch Parish Church (aka St. Cuthbert's Chapel of Ease) in south Edinburgh.\n",
  "concepts": [
    "Alison Cockburn"
  ],
  "findings": [
    "Life",
    "Bibliography",
    "References",
    "Sources",
    "External links"
  ],
  "timestamp": "2025-04-11T10:20:24.966082"
}