{
  "title": "W. H. Allen (artist)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/W._H._Allen_(artist)",
  "content": "William Herbert Allen (1863–1943) was an English landscape watercolour artist whose career spanned more than 50 years from the 1880s to the 1940s. He was invariably referred to as \"W. H.\" rather than by his given name. Born 14 September 1863 in West Brompton, London, of parents from Alton, Hampshire, Allen was for many years Director of the Farnham School of Art in Surrey. He produced several thousand watercolours, chalk and pencil sketches mainly of the landscapes, traditions and people of West Surrey and North-east Hampshire. In addition, he produced scenes of other parts of the British Isles and various parts of continental Europe. These works included commissions in Italy for the Victoria and Albert Museum, Dublin, Edinburgh and Preston museums.[1] He was made a member of the Royal Watercolour Society in 1903 and the Royal Society of British Artists in 1904[1] and his work was exhibited at the Royal Academy in 1927. He moved from Surrey to Wylye, Wiltshire in 1932 and is buried at St Nicholas's Church, Fisherton de la Mere. Many of Allen's paintings are regularly displayed at the Allen Gallery in Alton. These include landscapes of the local East Hampshire countryside at the beginning of the 20th century.\n\nMany of his paintings were produced \"in the field\" and are bold in their depiction of light and shadows, or of  changing weather conditions. His studio works are generally larger and of greater detail. Very few were sold on the open market, but he did exhibit regularly at the major galleries and annual exhibitions.[2]\n\nAllen embraced many styles and techniques from vivid, almost abstract, watercolours to more traditional oils and watercolours. His field sketches and studies are considered to be particularly successful and were painted in all weathers and conditions.[2]\n\nHe was a private and modest man who changed peoples' perception of their surroundings. In this he was helped by fellow Farnham resident and friend George Sturt, whose writings reflect Allen's approach to the recording of rural life and change. Thanks to their work, urban and rural landscapes began to be preserved at a time when \"progress\" was causing sweeping changes.[2]\n\nIn the 1880s, the depiction of life and work in the countryside was subject to two very different approaches, the traditional rural romanticism/sentimentality - thatched cottages with roses around the door and contented happy harvest scenes (e.g. Myles Birkett Foster), and that of social realism - recording child labour and exploitation, agricultural depression, bad weather, hard work and hard labour (e.g. Sir George Clausen). By the time Allen started recording the countryside around Farnham in the 1890s, Britain was in the grip of a severe agricultural depression which continued until the late 1930s, mirroring his artistic output.[2]\n\nAllen entered the Royal College of Art in 1884, where he came under the influence of its director, Thomas Armstrong, a disciple of William Morris and the Arts and Crafts movement. This was to remain his predominant influence throughout his working life as an artist and teacher. In 1888 he was awarded a silver medal and a scholarship of £50, enabling him to travel to Europe, the first of many continental trips which resulted in some of his finest work.[2]\n\nAllen was still a student at the Royal College of Art when he became an evening lecturer in Design, being awarded the college's Diploma of Associateship at the same time. He then became master of the Sydenham Art Class, after receiving a reference from his college principal, who considered him \"the most successful lecturer and instructor I have known\".[2]\n\nIn November 1889 Allen was appointed Master of Farnham Art School where his abilities were soon recognised by Farnham Urban District Council and later Surrey County Council, as he was made Director of the Art School, a post he retained until his retirement in December 1927. Allen gave private wood carving lessons to Harold Falkner who later became an architect and leading light in the preservation of Georgian Farnham.\n\nBy 1897 Allen was sufficiently settled in the Farnham area to commission Harold Falkner to design a house for him. Situated on the Tilford Road, \"Strangers Corner\" was to remain Allen's home until 1932, and is the subject of one of his best-known paintings, now in the Farnham Museum.[3] Falkner later paid tribute to Allen's contribution to the early building conservation movement in an article published in Country Life in July 1942: \"Allen transformed our outlook, which thought nothing of our Georgian past and relegated its furniture to the attics if it were not sawn up\".\n\nThis gallery, whilst dedicated to the memory of Allen, shows works by a wide variety of artists and has frequently changing exhibitions, including occasional large exhibitions of Allen's work. Allen's work permanently on display here comprises the following watercolours:\n",
  "concepts": [
    "W. H. Allen (artist)"
  ],
  "findings": [
    "Style and influences",
    "Royal College of Art and early study tours",
    "Teaching",
    "Stranger's Corner",
    "The Allen Gallery, Alton",
    "Further reading",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:11:47.693252"
}