{
  "title": "Riverside Hotel (St. Francis, Minnesota)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Riverside_Hotel_(St._Francis,_Minnesota)",
  "content": "The Riverside Hotel is a historic former hotel in St. Francis, Minnesota, United States.  It was originally built around 1860 as a residence, then expanded into a hotel beginning in 1891.  This period spanned the heyday of the local lumber industry that urbanized present-day Anoka County, Minnesota.[2]  The property was listed on the National Register of Historic Places in 1979 for its local significance in the theme of commerce.[3]  It was nominated for being the only surviving commercial building dating to St. Francis's settlement as a lumber boomtown, and its association with the Woodbury family that helped found St. Francis and Anoka, Minnesota.[4]\n\nThe building is now a restaurant called the Rum River Inn.[4]\n\nIn 1855, Dwight Woodbury immigrated west to Anoka to join his son, Albert, who had preceded him. Dwight would go on to build the Woodbury House in Anoka, but he first made his mark in St. Francis. Members of the Woodbury family platted both cities and built dams and sawmills at both locations.[2]\n\nWoodbury built a house overlooking the Rum River for himself and his family in about 1860. The two-story, Gothic Revival building has clapboard siding with a gable on the front façade, which makes an \"L\" shape. According to the National Register of Historic Places nomination form submitted in 1979, \"the original architectural design features are limited to the semi-circular windows in the east gable end and in the front projecting gable\" and brick now covers a portion of the building façade.[2]\n\nAfter Dwight Woodbury's death in 1884, his son John Woodbury moved to St. Francis. In 1891, he built a large gristmill in town to produce all types of flour, then expanded the family home and began to rent rooms to seasonal workers at his mill. The population of St. Francis peaked at the turn of the 20th century, which corresponded with the period of highest demand for industrial laborers' housing, when local industries included Shaddick Creamery, St. Francis Mill, St. Francis Starch Factory, and the St. Francis Canning factory.[2]\n\nIt was during this time the home took on the name of Riverside Inn. Contemporary newspaper advertisements indicate that different owners ran the hotel after 1900, with a J. H. Space the proprietor in 1906, and an Alex Simpson advertising his new ownership at another time. The inn continued to provide lodging to workers until the mill's closure in 1923.[2]\n",
  "concepts": [
    "Riverside Hotel (St. Francis, Minnesota)",
    "st francis",
    "st",
    "francis",
    "woodbury",
    "hotel",
    "family",
    "built",
    "building",
    "anoka",
    "minnesota"
  ],
  "findings": [
    "Origin",
    "Conversion to inn",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:17.503822"
}