{
  "title": "Buckden, North Yorkshire",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Buckden,_North_Yorkshire",
  "content": "Buckden is a village and civil parish in the Craven district of North Yorkshire, England. Historically part of the West Riding of Yorkshire, Buckden is situated in the Yorkshire Dales National Park, and on the east bank of the River Wharfe in Wharfedale. The civil parish includes the hamlet of Cray and the whole of Langstrothdale. According to the 2011 Census the parish had a population of 187.[1]\n\nThe etymology of the name derives from the Old English words of bucca and denu meaning he-goat and valley respectively.[2][3]\nA bridge at Buckden was destroyed in a flood in 1748. A later and present bridge is known as 'Election Bridge', as a prospective MP made the promise of a replacement bridge an electoral pledge.[4]\n\nOn 5 July 2014, the Tour de France Stage 1 from Leeds to Harrogate passed through the village.[5]\n\nThe village of Buckden is situated where Buckden Gill, which rises on Buckden Pike, joins the River Wharfe. Along the Gill is a disused lead mine, Buckden Gavel Mine, which has been designated an ancient monument.[6] Where Langstrothdale joins Wharfedale is the village of Hubberholme, which contains a Norman church and inn. The Dales Way passes close to the village, on the opposite bank of the Wharfe. A footpath leads north-east from the village to the top of Buckden Pike, and another south-west to Litton, above Arncliffe, in Littondale.\n\nBuckden has a village shop, a residential outdoor education centre and a public house, the Buck Inn. Denis Healey, the former Labour Chancellor of the Exchequer (1974–1979), stated that he spent his honeymoon in a converted stable next to the Buck Inn.[7]\n\nThe population according to the 2011 census was 187 of which 54.3% were male and 45.7 female. There were 81% of the population who stated they were Christian, with the rest declaring no religion or not stating one. The entire population described their ethnicity as White/British. There were 125 dwellings listed within the parish boundary.[8]\n\nThe population according to the 2011 census was 187 of which 51.3% were male and 48.7 female. There were 69.5% of the population who stated they were Christian, with the rest declaring no religion or not stating one. The entire population described their ethnicity as White/British. There were 135 dwellings listed within the parish boundary.[1]\n\nBuckden was historically a township in the ancient parish of Arncliffe, part of Staincliffe Wapentake in the West Riding of Yorkshire.[9]  Buckden became a separate civil parish in 1866.[10] Buckden was transferred to the new county of North Yorkshire in 1974.\n\nThe parish lies within the Skipton and Ripon UK Parliament constituency. It also lies within the Mid Craven electoral division of North Yorkshire County Council and the Upper Wharfedale ward of Craven District Council.[11]\n\nThe Parish Church of St Michael and All Angels is located in the nearby hamlet of Hubberholme. It is a Grade II listed building built in the 12th century with rebuilding work done from the 16th Century onwards.[12]\n",
  "concepts": [
    "Buckden, North Yorkshire",
    "buckden",
    "parish",
    "village",
    "population",
    "yorkshire",
    "north",
    "bridge",
    "wharfedale",
    "wharfe",
    "west"
  ],
  "findings": [
    "History",
    "Geography",
    "Demographics",
    "2001 Census",
    "2011 Census",
    "Governance",
    "Religion",
    "Location grid",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:30:59.913906"
}