{
  "title": "List of Soviet and Russian football champions",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/List_of_Soviet_and_Russian_football_champions",
  "content": "\nFootball had been played in Russia since the Russian Empire days in the early 1900s, but it was not until 1936, 19 years after the Russian Revolution, that the Soviet Union established a national championship of clubs. Before then local leagues in Moscow and Saint Petersburg/Leningrad were the only prominent league competitions in the country, with some national championships held intermittently from 1912 to 1933, made up of city selections.[citation needed]\n\nTeams in bold indicates doubles won with the Soviet Cup before 1992 and with the Russian Cup thereafter. Teams in italics include Cup winners between the 2nd and 3rd league places.\n\nNote: according to Dynamo sports society, the first Soviet football championship took place in 1924,[1] while other sources (megabook.ru) indicate that the first championship took place earlier in 1923. In Moscow it was decided to consider the football tournament of the 1924 All-Union festival of physical culture as the first national championship.[2]\n\nRepublican level competitions among teams from the Russian SFSR. Until 1960 it included teams that were considered amateurs, after 1960 the competition was conducted as part of the Soviet Second League.Source: Footballfacts.ru\n\nSpartak Moscow are the most successful club in the overall ranking, having won 22 national titles. They are followed by city rivals CSKA Moscow with thirteen. Dynamo Kiev also have thirteen titles, although the team no longer competes in the Russian football system, since it is now part of Ukraine. Fourth place is taken by Dinamo Moscow, who were the dominant team in Soviet Russia during the 1930s and 1950s. Dinamo Moscow has won eleven titles, although their last title came in 1976. Zenit Saint Petersburg is by far the most successful Russian team outside of Moscow. They have won seven titles, mostly in the 2000s and 2010s.\n\nAll clubs are included with all national titles:\n\nNote: Teams in bold are teams from Russia, flags indicate a club based outside Russia, namely  Ukraine,  Georgia,  Armenia and  Belarus. These teams are no longer eligible for the championship as they play in their own leagues.\n\nTable shows best-finish achievements in major European competitions starting from 1965-66 season. For non-Russian teams it is provided the results for Soviet period only.\n\nTable sorted by success at European Cup / UEFA Champions League first and foremost.\n",
  "concepts": [
    "List of Soviet and Russian football champions"
  ],
  "findings": [
    "Football championship of Russian Empire",
    "Football championship of Russian SFSR among city teams",
    "USSR championship",
    "Russian SFSR championship",
    "Soviet League (1936–1991)",
    "Soviet Group A",
    "Soviet First Group",
    "Soviet Class A",
    "Soviet Class A, 1st Group",
    "Soviet Supreme League (Soviet Top League)",
    "Russian League (1992–present)",
    "Russian Top League",
    "Russian Top Division",
    "Russian Premier League",
    "Performances by club",
    "Best finish in Europe by club",
    "Further reading",
    "References"
  ],
  "timestamp": "2025-04-11T10:06:26.241590"
}