{
  "title": "Van Pelt Manor",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Van_Pelt_Manor",
  "content": "Van Pelt Manor was the name given to an area of Brooklyn, New York, that today is part of the section of Bensonhurst. In the early part of the 20th century, it gave its name to a railroad station, a post office, and Public School 128 [1] was known as Van Pelt Manor grammar school.[2] The house purchased or raised by Aert Teunisse Van Pelt about 1670-1690 stood on modern-day 18th Avenue between 81st and 82nd Streets, east of the old village square and north of the pre-revolutionary Dutch Church of New Utrecht.[3]\n\nVan Pelt Manor was an area in New Utrecht one of the Dutch towns in Brooklyn. Van Pelt Manor was originally owned by the descendants of Teunis Laenen van Pelt, an early Dutch settler. Some authors have written that Teunis Van Pelt was a \"Patroon\" who was granted manorial rights. Several other tracts of land in New York were designated as \"manors', such as Pelham Manor and Livingston Manor. However, author Harold D. Eberlein states: \"there never was a duly and legally constituted Van Pelt Manor and this appellation has no defense whatever on any historic grounds. In 1675, 1678 and 1680 considerable tracts of land were acquired by Teunis Van Pelt, the emigre, and added to what he already had previously. These additional holdings in New Utrecht, mentioned in Governor Dongan's Patent of 1686, may have created the impression that the Van Pelts, who were always a prominent family in the neighbourhood, were paving the way for the erection of their possessions to the legal and administrative status of a manor, but if they cherished any such intention it was never consummated.\"[4]\n\nEight generations of the Van Pelt family lived at Van Pelt Manor. Some of the more noteworthy were Captain Petrus Van Pelt, who  was elected to the New York Provincial Congress in 1776, Teunis Van Pelt Talmage, elected to the New York State Assembly, and John V.B. Van Pelt, the last elected Supervisor (mayor) of New Utrecht before it was annexed by the City of Brooklyn in 1894. Townsend Cortelyou Van Pelt, brother of Supervisor Van Pelt, deeded the Van Pelt Manor House and surrounding grounds to the City of New York for one dollar in 1910.[5] The Manor House was torn down after a fire in 1952, but the grounds, known as Milestone Park, are administered by the New York City Department of Parks as a small recreation area. In the early 1950s the house which was unprotected was used by neighborhood children to play in. The fire was suspected to have started by children whom often built small fires to stay warm while playing in the structure.\n\n40°36′34″N 74°00′00″W﻿ / ﻿40.60939°N 73.99991°W﻿ / 40.60939; -73.99991\n",
  "concepts": [
    "Van Pelt Manor",
    "van",
    "van pelt",
    "pelt",
    "manor",
    "new",
    "pelt manor",
    "york",
    "new york",
    "utrecht",
    "teunis"
  ],
  "findings": [
    "Sources"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:30:57.526355"
}