{
  "title": "Volcker Commission",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Volcker_Commission",
  "content": "The Volcker Commission, also known as the Independent Committee of Eminent Persons (ICEP), was established in 1996 to investigate the accounts lying dormant since the Second World War in various banks in Switzerland. The committee was headed by former United States Chairman of the Federal Reserve Paul Volcker and was composed of three representatives from the Swiss Bankers Association and three appointed by Jewish organizations.\n\nDue to Switzerland's status as a neutral country bordering on Germany and Austria, many Jews fleeing the Holocaust deposited large amounts of money and valuables in Swiss banks.[1]  However, when survivors' or victims' heirs tried to recover their money following the war, many faced bureaucratic stonewalling by the banks which often seemed not to recognize the special conditions which had been experienced by Holocaust victims.  A number of times after the end of World War II, Swiss banks came under criticism for their behaviour, particularly over the issue of the handling of dormant accounts, most of which were presumed to have belonged to victims of the Holocaust. During the next forty years, a number of rather feeble responses were undertaken. However, during the 1990s it became clear that there was a need for a more robust response to the criticism.[2][3]\n\nThe Commission was established by a memorandum of understanding on May 2, 1996, between the World Jewish Restitution Organization, the World Jewish Congress and the Swiss Bankers Association. The MOU indicated two objectives for the committee: \"(a) to identify accounts in Swiss banks of victims of Nazi persecution that have lain dormant since World War II or have otherwise not been made available to those victims or their heirs; (b) to assess the treatment of the accounts of victims of Nazi persecution by Swiss banks.\"[4]\n\nThe committee used the services of five independent accounting firms with international reputations who were licensed to audit banks in Switzerland. The investigation covered a period of some 60 years, from 1933 to 1995. Some 254 Swiss banks existing in 1945 were investigated, which covered 82% of the banking system. External costs which were borne by the Swiss banks totaled some CHF 300 million and some 650 accountants participated in the study.  At the outset, there was a certain uneasiness in some of the banks with such an intrusive process. However, this changed, and the committee was able to report that only one bank, the Banque Cantonale de Geneve, refused to cooperate with the investigation.[5]\n\nThe raw materials for the work was provided by identifying all accounts that were open or opened in Swiss banks during the period 1933-1945. This yielded some 4.1 million accounts. There were no remaining records for 2.8 million additional accounts. The account names were compared by computers with the names of Nazi victims drawn from lists held by Holocaust researchers. Secondly, a selective non-automated examination of account-by-account analysis of available documentation.[6]\n\nIn 1999, the Volcker Commission found 53,886 Swiss bank accounts that likely belonged to victims of the Holocaust, in addition to the 5,570 accounts first discovered during the 1997 self-audit. 10,471 of the newly discovered accounts were Category 1 accounts, which meant that they were matched to the names of known Holocaust victims, or Category 2 accounts, which meant there was probable relationship between the account holder and Nazi persecution.[7] These accounts together contained an estimated value of 31.5 million Swiss Francs, however many accounts lacked necessary fiscal information to make a sound determination. Category 3 and 4 accounts, which had weaker and weakest Holocaust nexus respectively, added 43,415 accounts and 4.2 million Swiss Francs to the tally.[7]\n\nIn 1998, a United States class-action lawsuit resulted in a settlement of $1.25 billion by the two largest Swiss banks, which is supposed to cover claims by victims and their heirs.[8]\n",
  "concepts": [
    "Volcker Commission"
  ],
  "findings": [
    "Background",
    "Memorandum of Understanding",
    "Methodology",
    "Members",
    "Results",
    "Notes",
    "References"
  ],
  "timestamp": "2025-04-11T10:12:58.578222"
}