{
  "title": "Neighbourhoods of Charlottetown",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Neighbourhoods_of_Charlottetown",
  "content": "There are various neighbourhoods within the Canadian city of Charlottetown, Prince Edward Island.\n\nDowntown Charlottetown is the original boundaries of Charlottetown as surveyed in 1764 and comprises all property south of Euston Street and west of the rail corridor (now the Confederation Trail). The original 500 residential lots from this survey have been kept largely intact, except for some office and retail development in the centre of the city.[1]\n\nDowntown Charlottetown is dominated by federal and provincial government offices such as the Province House and the City Hall, as well as service industry employers like the Confederation Court Mall and the Founders’ Food Hall & Market. The city's cultural centre, the Confederation Centre of the Arts, and the city's main library are located here. Some other famous historical sites in the area are the Victoria Park, Beaconsfield Historic House, St. Paul’s Parish, and St. Dunstan’s Basilica.\n\nDowntown Charlottetown covers 0.497 km2 (0.192 sq mi) and houses 914 people for a population density of 1,839.0/km2 (4,763.1/sq mi). Surrounded neighborhoods are Brighton, Spring Park, Sherwood, and Parkdale.\n\nBrighton is roughly delineated by Colonel Gray Drive, Brighton Road, and bordered Victoria Park to the South. It is Charlottetown's most well-renowned neighbourhood, comprising houses over 100 years old as well as newer developments from the 1970s to the 1990s.[2]\n\nHouses with proximity to Charlottetown Harbour and the North River Road tend to be more prestigious with their large lots along a former cottage area.  Mature trees line newer developments along Queen Elizabeth Drive, Edinburgh Drive, Inkerman Drive, and Prince Charles Drive. \n\nOlder Victorian homes are situated in Old Brighton which is a smaller neighbourhood east of North River Road, being bounded by McGill Avenue, North River Road, Ambrose Street, and Brighton Road.\n\nSpring Park is situated in the central western part of the city. It borders West Royalty to the north, Downtown Charlottetown to the south, Parkdale and Sherwood to the east.[3]\n\nThe neighbourhood got its name in 1925 from the Spring Park Road, which ran through it to northern Downtown Charlottetown. Spring Park existed as a village until it was dissolved through amalgamation with Charlottetown in 1958. During the 1960s, Spring Park expanded significantly with the construction of Colonel Gray High School and residential units such as Holland Park and Skyview in the 1970s, and Westwood and Marysfield in the 1980s and 1990s.  \n\nThis is likely the most accessible Charlottetown neighbourhood to services within walking distance with several popular churches, restaurants, schools and employment locations within and adjacent to the area. \n\nThe former town of Parkdale is located in Central Queens County, borders with the northeast of Downtown and the southwest of Sherwood.[4]\n\nParkdale was originally a farming community until November 6, 1958, when it became a city. In the year 1973, it was inaugurated as a city and in 1995, merged with Charlottetown. Parkdale developed during the 1940s and 1950s into a suburb of the city and was home to several industries served by the railway, as well as hosting the city's harness racing track and exhibition grounds. The area is primarily middle class and has smaller homes.\n\nThe neighbourhood is bounded by Mount Edward Road, Belvedere Avenue, Falconwood Drive, Riverside Drive, Park Street and Belmont Street.  Parkdale Elementary School is the only school located within the former town, though Birchwood Junior High School is located several hundred metres from the former municipal boundary with Charlottetown.\n\nSherwood is situated in the northeast portion of the city. Sherwood is roughly delineated by Mount Edward Road, Sherwood Road, Brackley Point Road, Oak Drive, Riverside Drive, Kensington Road, Falconwood Drive and Belvedere Avenue. \n\nThe Charlottetown Airport and the Sherwood Industrial Park are situated on its northern boundary, a retail centre is situated at the junction between Belvedere Avenue, St. Peters Road and Brackley Point Road, and Queen Elizabeth Hospital and Hillsborough Hospital is located at Falconwood.[5]\nThe neighbourhood was merged with Charlottetown on April 1, 1995 and has since been seeing a lot of development. There are many multi unit apartment buildings being built toward the boundary between Sherwood and East Royalty, as well as single-family homes and duplexes throughout the new developments. Schools within walking distance include Stonepark Intermediate School and Sherwood Elementary School.\n\nThe former village of East Royalty occupies the eastern part of the Queens Royalty, Prince Edward Island.  It lies east of the airport and northeast of Riverside Drive, fronting the East (Hillsborough) River.[6][7]\n\nThe southern part of the neighbourhood is dominated by the Hillsborough Park subdivision, developed by the provincial government in the 1970s and 1980s to provide affordable housing, which contains a variety of apartment buildings, townhouses, duplexes, as well as smaller single-family homes.\n\nThe northern part of East Royalty is defined by St. Peters Road and Norwood Road, occupying small farming areas and several new subdivisions. The Lucy Maude Montgomery Elementary School was constructed in the 1980s to serve new residential developments.\n\nWest Royalty is situated in the northwest portion of the city, bordered on the west by the North River, on the north by the former village of Winsloe (also part of Charlottetown), on the east by Route 2, and on the south by Spring Park.[8]\n\nIt was granted a residence title in 1939, became a village in 1980, and joined Charlottetown in early April of 1995. It is home to primarily upper-middle-class families.  Lewis Point is one of the first neighbourhoods in West Royalty which was built in the 1970s and 1980s.[9]\n\nCharlottetown Rural High School, Grace Baptist Christian School, and West Royalty Elementary are the only schools within walking distance. The original West Royalty Elementary School was a one-room school located on the Lower Malpeque Road until the 1990s when it was replaced by the present modern structure relocated to the northern part of the neighbourhood to service several new subdivisions.\n\nWinsloe is a neighbourhood in the northwestern part of Charlottetown, Prince Edward Island. The place got its name from John Hodges Winsloe since he owned the largest area of the land in mid of the 19th century.[10]\n\nIn 1872 the Prince Edward Island railway was inaugurated to connect Winsloe placed towards the mainline between Charlottetown and Summerside and afterwards towards the Port Borden. Many developments were created in the community in 1970s - 1990s. On April 1st, 1995 its status was upgraded to villages and several subdivisions. The Winsloe village development happened very quickly the major improvement was seeing in Winsloe soccer club and neighborhood development.\n\nOn April 1, 1995, Winsloe became a part of Charlottetown. And in the 20th century, the construction of the route 2 made Winsloe as a suburb part of Charlottetown.\n",
  "concepts": [
    "Neighbourhoods of Charlottetown",
    "charlottetown",
    "road",
    "park",
    "city",
    "school",
    "drive",
    "sherwood",
    "royalty",
    "neighbourhood",
    "winsloe"
  ],
  "findings": [
    "Downtown Charlottetown",
    "Brighton",
    "Spring Park",
    "Parkdale",
    "Sherwood",
    "East Royalty",
    "West Royalty",
    "Winsloe",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:45.443850"
}