{
  "title": "Frank W. Wozencraft",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Frank_W._Wozencraft",
  "content": "Frank Wilson Wozencraft (June 7, 1892 – September 3, 1966) was mayor of Dallas from 1917 to 1921.\n\nFrank Wilson Wozencraft was born on June 7, 1892, in Dallas, Texas, to Gen. Alfred Prior Wozencraft and Virginia Lee Wilson.  His father had been attorney general of Texas. He married Mary Victoria McReynolds, daughter of Dr. John Oliver McReynolds and Katherine Seay on June 21, 1922, in Dallas, Texas.  They had two sons.\n\nHe attended St. Matthew's School for Boys in Dallas, graduated from Dallas High School (1909), and received his B.A. (1913) and LL.B. (1914) degrees from the University of Texas[1]  where he became a member of the Delta Chi fraternity. His first position was in his father's law office. He worked as an attorney for Southwestern Telephone and Telegraph. At the outbreak of World War I, he organized the Dallas Greys.  He transferred to Company B, 144th Infantry, 36th Division.\n\nAt age 26, Frank Wozencraft was the youngest individual elected Mayor of Dallas, defeating the incumbent mayor who was running for re-election.\n\nAfter refusing re-nomination as mayor, he practiced law with the firm of Leake, Henry, Wozencraft & Frank in Dallas. In 1931 he joined Radio Corporation of America in New York City as the corporation's legal counsel.  He resigned to serve in World War II first as Lt. Colonel and later Colonel with American-British Combined Communications Board of the Combined Chiefs of Staff.[2]\n\nAfter the war, he returned to Dallas where he was a partner with former FCC commissioner Norman S. Case in the Washington, D.C., law firm of Case & Wozencraft[3] and later with Leake, Henry, Golden, Burrow and Potts. He was a 32nd degree Freemason, Knight Templar, Shriner and a Rotarian. He was active with the Boy Scouts of America and a member of the local, state and American bar associations.[4]\n\nFrank Wozencraft died September 3, 1966, in Dallas, Texas, and was interred at the Greenwood Cemetery, Dallas.[5][6]\n",
  "concepts": [
    "Frank W. Wozencraft",
    "dallas",
    "wozencraft",
    "texas",
    "frank",
    "mayor",
    "wilson",
    "war",
    "law",
    "june",
    "dallas texas"
  ],
  "findings": [
    "Biography",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:37.169083"
}