{
  "title": "Michael Wang (basketball)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Michael_Wang_(basketball)",
  "content": "Wang Quanze (Chinese: 王泉泽; pinyin: Wáng Quánzé; born June 8, 2000), known as Michael Wang, is a Chinese basketball player for the Xinjiang Flying Tigers of the Chinese Basketball Association (CBA). He was a member of the China national under-19 team in 2018, and (while attending the Wharton School of the University of Pennsylvania) played college basketball for the  University's team named the Quakers, which plays in the Ivy League.\n\nWang was born in Taiyuan, Shanxi, but spent part of his childhood in Beijing, where he played basketball at Beijing No. 4 Junior High School.[1]\n\nWang moved to the United States at age 14.[2] He enrolled at Mater Dei High School in Santa Ana, California and played power forward for the majority of his high school career.[3][4] While in high school, he lived with teammate Spencer Freedman's family.[2]\n\nAfter graduating from high school, Wang played in the Amateur Athletic Union in the summer of 2018.[4][5]\n\nIn 2018, Wang enrolled in the Wharton School at the University of Pennsylvania.[3]\nDuring his freshman year with the Quakers, Wang averaged 8.5 points and 3.6 rebounds per game.[6] On December 4, 2018, Wang scored a career-high 23 points off the bench in an 89–75 upset win over Miami.[7] Wang missed the entirety of his sophomore season due to knee tendonitis.[8]\n\nWang competed for the China national under-19 basketball team in the 2018 FIBA Under-18 Asian Championship.[4][5] During the tournament, he averaged 20 points, 13 rebounds, 3.6 assists, and 1.3 steals per game en route to the team's third place finish.[9][1] He led the tournament in rebounds and was selected in the team of the tournament.[9]\n",
  "concepts": [
    "Michael Wang (basketball)"
  ],
  "findings": [
    "Early life",
    "High school career",
    "College career",
    "National team career",
    "Career statistics",
    "College",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:23:01.049381"
}