{
  "title": "Samantha Grey",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Samantha_Grey",
  "content": "Samantha Steffi Grey Bermeo (born 7 March 1995) is an Ecuadorian actress, television presenter, singer and dancer. She is the daughter of the late singer Sharon la Hechicera. She participated in several dance and singing reality shows such as Soy el mejor,[1] in which she won in 2015.\n\nGrey is the daughter of the late technocumbia singer Sharon la Hechicera and Eduardo Gray, leader of the orchestra \"Los Hechiceros\".[2][3][4][5] From the age of 4, she dedicated herself to dancing, studying at the Yesenea Mendoza academy, where she later devoted herself to teaching. She has participated in two world dance competitions in Orlando, Florida, placing fourth in her first participation.[6]\n\nIn 2005, Grey participated in the telenovela Amores que matan on Ecuavisa. She then she was part of the program Soy el mejor on TC Televisión, of which she was the winner in its third season.[1] In 2016, she landed her first leading role in the telenovela La Trinity on Ecuavisa, where she portrayed Susanita, who was living a love story with Luis Fernando, the role played by José Andrés Caballero.[7][2] After the end of the first season, she was part of the management team of the program En Contacto.[7] She was part of a reality show in the program En Contacto, where the process of her transformation to play her mother was shown.[7] She then auditioned for the production of a soap opera based on the life of her mother called Sharon la Hechicera, and was cast to portray her in her career between 20 and 30 years of age.[7]\n\nIn 2018, Grey temporarily rejoined En Contacto as an entertainer, along with Henry Bustamante, Efraín Ruales and Gabriela Pazmiño, after she replaced Úrsula Strenge.[8]\n",
  "concepts": [
    "Samantha Grey",
    "la",
    "grey",
    "singer",
    "sharon la",
    "sharon",
    "program",
    "participated",
    "la hechicera",
    "hechicera",
    "en contacto"
  ],
  "findings": [
    "Biography",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:56.402222"
}