{
  "title": "Treaty of Wuchale",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Treaty_of_Wuchale",
  "content": "The Treaty of Wuchale (also spelled Treaty of Ucciale; Italian: Trattato di Uccialli, Amharic: የውጫሌ ውል) was a treaty signed between the Ethiopian Empire and the Kingdom of Italy. The signing parties were King Menelik II of Shewa, acting as Emperor of Ethiopia, and Count Pietro Antonelli [it] representing Italy, on 2 May 1889, established the treaty after the  Italian occupation of Eritrea.  It was signed in the small Ethiopian town of Wuchale, from which the treaty got its name. The purpose of the treaty was to promote friendship and trade among the two countries.[1] It was a treaty to maintain a positive long-lasting relationship between the two empires.[2] The treaty has twenty articles written in two languages, Amharic and Italian; however, there were marked differences in the Italian and the Amharic versions of the treaty, which created miscommunications between the two countries. Specifically, Article 17 of the treaty was translated and interpreted differently by Ethiopia and Italy. Italy claimed the article imposed a protectorate over Ethiopia, while Ethiopia claimed the article allowed international diplomacy to be conducted through Italy by choice. When Menelik II denounced the treaty in 1893,[3] Italy attempted to forcefully impose the protectorate over Ethiopia[4] in the First Italo-Ethiopian War, which ended with Italy's defeat at the Battle of Adwa and the resulting Treaty of Addis Ababa.[5]\n\nAround the time the treaty was signed, European colonization was greatly expanding in Africa. Vast territories of Eritrea and Somalia, Ethiopian-bordering countries, were under Italian occupation. Italy desired to expand its territories by colonizing Ethiopia. Emperor Menelik II of Ethiopia was highly resistant to this and agreed to establish a treaty instead. He yielded some territories of Ethiopia to Italy in return for assurance of Ethiopia's independence as well as financial and military assistance from Italy.[6]\n\nArticle 1 of the treaty states that there will be peace between the Emperor of Ethiopia and the King of Italy and between their successors. \n\nArticle 2 states that each country may each appoint \"consuls, agents, and consular officers\" in the other, protected under standard European customs. \n\n\nArticle 3 created permanent boundary lines between regions of Eritrea that were under Italy's control and regions of Ethiopia. It stated which regions were under the control of which empire and marked the territory limit of each empire. The highland areas to be the boundary between Ethiopia and Italy. From Rafali, Haliy and Segheneiti will be under Italy. In the Bogos front, Adi Nefas, Adi wans will be under Italy. These villages horizontally delaminate the boundary. \n\nArticles 4, 5, and 6 focused on specific regions located in the Italian regional zone; the monastery of Debra Bizen and Massawa, Eritrea. Article 4 stated that the monastery of Debra Bizen shall remain under the control of the Ethiopian government but could not be used for military purposes. Article 5 stated that Ethiopia had to pay an eight percent port duty to import or export goods through Massawa. Article 6 stated that the Emperor of Ethiopia could transport the army from and through Massawa free of charge. \n\n\nArticle 7 declared that travel and trade exchanges between the two countries were allowed.\n\nArticles 8 and 9 focused on the rights people from Ethiopia's territories had while they were in Italy's territories and vice versa. Article 8 said that the people in the Ethiopian and Italian territories exercised the same rights while present in each other's territories and Article 9 stated that these people had the freedom to exercise their religion in the territories where they were. \n\n\nArticle 10 dealt with disputes between residents of Ethiopian and Italian territories and stated that these disputes were to be resolved by delegates from both territories. \n\n\nArticle 11 said that if an Ethiopian resident died in an Italian territory or vice versa, his/her properties would be given to the territory he/she belongs to.\n\nArticles 12 and 13 dealt with crimes. Article 12 stated that people who committed crimes would be judged in their own territory regardless of where they committed the crime, whereas article 13 mentions that the kings of both empires are obliged to extradite people with criminal records. \n\n\nAccording to Article 14, the Emperor of Ethiopia had the right to take any measures to fight slavery and slave trading in his territory. Menelik II opposed slavery and this article was an assurance that slavery would not be practiced in Ethiopian regions. \n\n\nArticle 15 validated the treaty in all territories of Ethiopia. \n\n\nArticle 16 set rules and restrictions regarding future changes to the treaty. It stated that it could be amended after five years with a year's notice before any change and articles regarding boundaries might not be amended. \n\n\nArticle 17 was written differently in the Ethiopian and Italian versions of the treaty as addressed in details below. \n\n\nArticle 18 stated that the Emperor of Ethiopia would give preference to Italian nationals if he had to choose whether to offer a privilege to a third state or to Italy.  \n\n\nArticle 19 said that the treaty would be written in both languages and both versions would present the same information. \n\n\nArticle 20 stated that this treaty shall be approved.[1]\n\nThe misunderstanding, according to the Italians, was due to the mistranslation of a verb, which formed a permissive clause in  Amharic and a mandatory one in  Italian.[7]  In the Amharic version of the treaty, Article 17 states that “His Majesty the King of Kings of Ethiopia can use the Government of His Majesty the King of Italy for all business with other powers or governments.”[1] According to this version, the Emperor of Ethiopia was granted a choice and was not mandated to use the Italian government to conduct foreign relations; the  Amharic version therefore gave Ethiopia considerable autonomy, with the option of communicating with third powers through the Italians.[8] On the other hand, the Italian version stated that Ethiopia was obliged to conduct all foreign affairs through Italian authorities, in effect making Ethiopia an Italian protectorate. Menelik II was not in favour of this and rejected protection from Italy.[9] However, in October 1889, the Italians informed all other European governments that Ethiopia was now an Italian protectorate because of the Treaty of Wuchale and therefore other European nations could not conduct diplomatic relations with Ethiopia.[10] With the exceptions of the Ottoman Empire, which still maintained its claim to Eritrea, and Russia, which disliked the idea of an Orthodox nation being subjugated to a Roman Catholic nation, all of the European powers accepted the Italian claim to a protectorate.[10] Unable to resolve this disagreement, the treaty was eventually denounced by Menelik II in 1894 and the Italians invaded Ethiopia in 1895.[10] A battle took place in Adwa and ended after two days with Ethiopia's victory, safeguarding its independence.[11]\n",
  "concepts": [
    "Treaty of Wuchale"
  ],
  "findings": [
    "Background",
    "Articles",
    "Disputes",
    "Notes",
    "Further reading"
  ],
  "timestamp": "2025-04-11T10:11:35.941018"
}