{
  "title": "Political positions of Richard Gordon",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Political_positions_of_Richard_Gordon",
  "content": "Richard Gordon was the presidential candidate of the Bagumbayan - Volunteers for a New Philippines for the 2010 Philippine presidential elections. \nOne of the key elements in the scandal-rigged administration of President Gloria Macapagal Arroyo was the appointment of Merceditas Guttierez, a colleague of First Gentleman Mike Arroyo in law school and a former presidential counsel, as the head of the Ombudsman office, which is responsible for the investigation and prosecution of corrupt officials in the government. Thus, Gordon plans to make the Ombudsman an elective post rather than an appointive post.[1]\n\nGordon is against the reinforcement of the death penalty, mainly because he believes that the nation's police forces \"are lawful in terms of their investigative capabilities\". For him, the reimposition of the death penalty would only promote injustice since the Philippine society tends to put the blame on people but never try to provide real solutions to the problems.[2]\n\nGordon advocates for the modernization of education in the Philippines. He has stated on several occasions in the presidential campaign that he plans to allocate around P 85 million for a project aimed at providing 17 million students with an Amazon Kindle, a device that allows a user to read electronic books as well as other digital media. Aside from that, he also plans to increase the teachers' monthly salary to P 40,000 from the current range of around P 12,000 to P 15,000, saying that an increase in the teachers' salary will help attract skilled graduates to the teaching profession that can raise the academic performance of students in the country.[1]\n\nHe plans to acquire funding for the said projects through one of the following means: (1) cutting down on corruption, which will give P 300 billion to the budget; (2) improving the mining industry, which can give P 1 trillion to the budget; and (3) launching a \"text for education\" campaign wherein P 0.50 of every text message sent will be used to fund the projects.[1]\n\nGordon is in favor of the utilization of nuclear power to provide more energy in the country, saying that the alternative energy is a \"clean and cheap energy source\". However, he would only support the opening of the abandoned Bataan Nuclear Power Plant (BNPP) only if the people approve of the project and if the nation's scientists could verify with certainty that the power plant is safe to use.[3]\n",
  "concepts": [
    "Political positions of Richard Gordon",
    "gordon",
    "presidential",
    "plans",
    "power",
    "energy",
    "000",
    "text",
    "teachers",
    "students",
    "saying"
  ],
  "findings": [
    "Corruption",
    "Ombudsman as an elective position",
    "Death penalty",
    "Education",
    "Nuclear energy",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:07.302717"
}