{
  "title": "Alexander Balmain Bruce",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Alexander_Balmain_Bruce",
  "content": "Alexander Balmain Bruce (31 January 1831 – 7 August 1899) was a Scottish churchman and theologian. He was a minister of the Free Church of Scotland.\n\nHe was born at Aberdalgie in the parish of Abernethy, Perthshire, on 13 January 1831, was the son of David Bruce, a farmer. His elder brother was the Presbyterian minister David Bruce.[1] He was educated at Auchterarder parish school.\n\nAt the Disruption of 1843 his father relocated with his family to Edinburgh.\n\nBruce entered Edinburgh University in 1845 and the divinity hall of the Free Church of Scotland in 1849.\nHis early faith was subjected to severe trials during his studies, and he was at times 'precipitated down to the ground floor of the primaeval abyss.'\nThese doubts, however, he surmounted and entered the Free Church ministry.[2]\n\nAfter acting as assistant, first at Ancrum and then at Lochwinnoch, he was called to Cardross in Dumbartonshire in 1859.[3]\nIn 1868, he was translated to the east Free Church at Broughty Ferry in Forfarshire, and in 1871 he published his studies on the gospels entitled The Training of the Twelve, which established his reputation as a biblical scholar and a writer of ability.\nThey were originally delivered from the Cardross pulpit, and reached a second edition in 1877. In 1874, Bruce was Cunningham lecturer, taking as his subject The Humiliation of Christ (Edinburgh, 1876, 8vo; 2nd edit. 1881); and in 1875, on the death of Patrick Fairbairn, he was appointed to the chair of apologetics and New Testament exegesis in the Free Church Hall at Glasgow.\nIn the twenty-four years during which he occupied this chair he exercised the strongest influence over students, both from his wide knowledge and on account of the magnetism of his mind.\nAt the same time he published a number of exegetical works which established his fame with a wider circle.\nAmong the more noteworthy were St. Paul's Conception of Christianity (1894), his 'Commentary on the Synoptic Gospels' in the Expositor's Greek Testament (1897), and The Epistle to the Hebrews: the First Apology for Christianity (1899).\nHe and William Robertson Smith were the first Scottish scholars whose authority was regarded with respect among German biblical critics.[2]\n\nThe boldness of Bruce's views was not, however, entirely pleasing to his colleagues in the Free Church.\nIn 1889, he published The Kingdom of God; or, Christ's Teachings according to the Synoptic Gospels (Edinburgh, 8vo), a work which gave rise to considerable criticism owing to his treatment of the inspired writings.\nIn 1890, the tendency of his views and those of Dr. Marcus Dods was considered by the general assembly, but that body came to the conclusion that while some of their statements had been unguarded, their writings were not at variance with the standards of the church (HOWIE, Reply to Letter of Professor Blaikie, 1890 ; Kere, Vivisection in Theology, 1890 ; Richardson, Dr. Bruce on the Kingdom of God, 1890 ; The Case Stated, 1890).[2]\n\nBruce rendered great services to the music of his church. He acted as convener of the hymnal committees which issued the 'Free Church Hymn Book' in 1882,[3] and in 1898 the 'Church Hymnary' for all the Scottish presbyterian churches. He was Gifford lecturer in Glasgow University for 1896–7, choosing as his subjects 'The Providential Order of the World' (London, 1897, 8vo) and 'The Moral Order of the World in Ancient and Modern Thought' (London, 1899, 8vo). From 1894 he assisted Canon T. K. Cheyne in editing the 'Theological Translation Library.'[2]\n\nBruce died on 7 August 1899 at 32 Hamilton Park Terrace, Glasgow, and was buried on 10 August at Broughty Ferry.[2]\n\nIn 1860 he married Jane Hunter Walker (1832–1900), daughter of James Walker of Fodderslee in Roxburghshire. She survived him with a son David, a Glasgow writer, partner in the firm of Mitchell & Bruce, and a daughter, who married Milward Valentine of Manchester and New York.[2]\n\nBesides the works mentioned he was the author of:\n\nSt. Paul's Conception of Christianity,\nEdinburgh, 1896\n\nArticles:\n'Theological Agnosticism,' The American Journal of Theology, The University of Chicago Press, Jan. 1897\n\nAttribution:\n",
  "concepts": [
    "Alexander Balmain Bruce"
  ],
  "findings": [
    "Life",
    "Family",
    "Works",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:09:58.265038"
}