{
  "title": "2006 Independence Bowl",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/2006_Independence_Bowl",
  "content": "The 2006 PetroSun Independence Bowl, part of the 2006–07 NCAA football bowl season, took place on December 28, 2006 at Independence Stadium in Shreveport, Louisiana. The competing teams were the Oklahoma State Cowboys, from the Big 12 Conference, and the Alabama Crimson Tide, representing the Southeastern Conference.  Oklahoma State won the game, 34–31.\n\nThis was the only 2006–07 bowl game in which both teams finished 6–6 in the regular season, and the first meeting between the programs on the gridiron. With the dismissal of Alabama head coach Mike Shula occurring in November, Joe Kines served as the Tide's head coach for this contest, with Nick Saban being hired as coach the following January.\n\nAlabama played Oklahoma State in the Independence Bowl on December 28, 2006. The Cowboys scored first on a Dantrell Savage 1-yard touchdown run to lead, 7–0. Alabama responded later in the first quarter on a Matt Caddell 18-yard touchdown reception from John Parker Wilson to tie the game at 7–7. Oklahoma State responded with 10 consecutive points on a Keith Toston 4-yard touchdown run and later on a 28-yard field goal by Jason Ricks to take a 17-7 lead. Alabama responded with Tim Castille 1-yard touchdown run, only to have the Cowboys get a Keith Toston 7-yard touchdown run to take a 24-14 lead at the half.[2]\n\nAfter bringing the score to 24-17 in the third on a 24-yard field goal by Jamie Christensen, Oklahoma State responded with an Adarius Bowman 10-yard touchdown reception from Bobby Reid early in the fourth to extend their lead to 31–17. The Tide responded with 14 straight points on an 86-yard punt return by Javier Arenas and a throwback to offensive tackle Andre Smith  at the 2-yard line to even the score at 31–31. The Cowboys would seal the victory with only 00:08 remaining in the game on a 27-yard, game-winning field goal by Jason Ricks.[2] For the game, the Cowboys' 34 points and 419 yards were the most allowed by the Alabama defense for the 2006 season.[2]\n\n[2]\n\n# denotes national championship game; † denotes College Football Playoff semifinal game\n",
  "concepts": [
    "2006 Independence Bowl"
  ],
  "findings": [
    "Game summary",
    "Statistics",
    "Oklahoma State",
    "Alabama",
    "Notes",
    "References"
  ],
  "timestamp": "2025-04-11T10:21:00.492696"
}