{
  "title": "I Smell Smoke",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/I_Smell_Smoke",
  "content": "I Smell Smoke is an album by the American musician Michael Burks, released in 2003.[1][2] It was his second album for Alligator Records.[3] I Smell Smoke peaked at No. 12 on Billboard's Top Blues Albums chart.[4] Burks supported it with a North American tour.[5] I Smell Smoke was nominated for a W. C. Handy Award for best \"Contemporary Blues Album\".[6]\n\nRecorded at Ardent Studios, in Memphis, the album was produced by Burks, Bruce Iglauer, and Jim Gaines.[7][8] The son of a blues musician, Burks was told \"the right way to play\" guitar by family friends such as Albert Collins and Freddie King.[9] Burks felt that emotional conviction was more important than guitar technique, and would often work out the songs in a darkened room.[10] It was also important to Burks that the music remain more in a blues idiom than blues rock.[11] \"Let the Door Knob Hit You\" is a cover of the Latimore song.[12]\n\nThe Charleston Daily Mail wrote that \"Burks takes his blues roots and channels them into a stinging blend of soul and R&B with some Santana-esque overtones.\"[15] The Age noted that, \"buried deep in Michael Burks' soul are the relics of Stax Records' heady early-'70s period, when Albert King was riding high with his Gibson Flying V guitar.\"[16] The Tallahassee Democrat said that \"Burks' deep, soulful voice is the perfect counterpoint to the music's smoldering sound.\"[17] The Fort Worth Star-Telegram concluded that \"the songs are better this time around.\"[13]\n\nAllMusic wrote that, \"with a tone sounding at times like Eric Clapton's psychedelic work in Cream and a rugged four-piece band supporting him, this is a tough, uncompromising contemporary blues/blues-rock/R&B album that doesn't pull punches.\"[12]\n",
  "concepts": [
    "I Smell Smoke",
    "burks",
    "blues",
    "album",
    "smoke",
    "smell smoke",
    "smell",
    "guitar",
    "12",
    "wrote",
    "work"
  ],
  "findings": [
    "Production",
    "Critical reception",
    "Track listing",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:23.961319"
}