{
  "title": "Willing to Trust",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Willing_to_Trust",
  "content": "\"Willing to Trust\" is a song by American musicians Kid Cudi and Ty Dolla Sign. It was released on September 23, 2022, as the second single from Cudi’s eighth studio album, Entergalactic (2022). The lyrics were handled by Cudi and Ty Dolla Sign, while the music was written and produced by Cudi, alongside Dot da Genius, E. Vax and Ramii. \n\nThe song was also featured in Cudi’s adult animated TV special Entergalactic (2022), which Cudi and Ty Dolla Sign both star in. The song won the award for Original Song – TV Movie Streamed at the 13th Hollywood Music in Media Awards.[1]\n\nWhen speaking on the song with Billboard, Cudi said “It’s a song [that’s] a big moment in the show. It’s a tender moment and the beat is crazy. Ty Dolla $ign does his f–king thing on there and he’s really amazing. It’s a really beautiful song from beginning to end. It’s a perfect love song.”[2]\n\nThe song marks the third collaboration between Cudi and Ty Dolla Sign, previously working together on \"Freeee (Ghost Town, Pt. 2)\" from Kids See Ghosts (2018) and on \"Temptations\" from Featuring Ty Dolla Sign (2020).\n\nThe song was released in promotion for the album and TV special of the same name, for streaming and digital download on September 23, 2022.[3] \"Willing to Trust\" runs for a duration of four minutes and 42 seconds.[4] Rolling Stone called the song a \"characteristically woozy Kid Cudi cut, anchored by deep bass grooves, awash with heavy synths, and sprinkled with some spaced-out guitar riffs. Cudi and Ty trade off vocal duties on the verses before linking up on the simple, yet affecting refrain.\"[5] The song bears elements of contemporary R&B and neo soul.[6]\n\nNick Polak of Atwood Magazine gave a positive review, when he wrote “addictive on first listen, ‘Willing to Trust’ is a foray into a hidden part of Kid Cudi’s life as he presents his candid feelings about love over a soothing bass and harmonious backing vocals.”[7]\n\nOn September 28, 2022, Cudi appeared on The Tonight Show Starring Jimmy Fallon, where he was interviewed to promote the album and TV special, during the show he also performed the single \"Willing to Trust\" alongside Ty Dolla Sign.[8]\n",
  "concepts": [
    "Willing to Trust"
  ],
  "findings": [
    "Background",
    "Release and composition",
    "Reception",
    "Live performances",
    "Charts",
    "Release history",
    "References"
  ],
  "timestamp": "2025-04-11T10:14:57.394796"
}