{
  "title": "Arado Ar 76",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Arado_Ar_76",
  "content": "The Arado Ar 76 was a German aircraft of the 1930s, designed as a light fighter with a secondary role as an advanced trainer in mind.[1]\n\nArado's response to a requirement by the Reichsluftfahrtministerium (RLM) for a light / emergency fighter aircraft, was the Ar 76 which was evaluated against the Heinkel He 74, Focke-Wulf Fw 56, the Henschel Hs 121 and Hs 125 in 1935. Although the Fw 56 was selected for the main production contract, the RLM was sufficiently impressed by the Ar 76 to order a small number of production aircraft as well.[1]\n\nThe Ar 76 was a parasol-wing monoplane with fixed, tailwheel undercarriage. The wings were constructed of fabric-covered wood, and the fuselage was fabric-covered steel tube.[1]\n\nIt was powered by an Argus As 10C inverted V8 which produced 240 horsepower (180 kW) and was capable of propelling the Ar 76 up to a maximum speed of 267 km/h (166 mph) and to a maximum altitude of 6,400 m (21,000 ft).[3]\n\nWhen used as a fighter the Ar 76 was armed with twin 7.92mm MG 17 machine guns which were mounted above the engine and each had access to 250 rounds. However, when used as an advanced trainer, it only carried a single MG 17.[3] Alongside this it could also carry two 10 kg (22 lb) SC 10 bombs, one under each wing.[3]\n\nProduction Ar 76A aircraft were used by Jagdfliegerschulen (fighter pilot schools) from 1936.[1]\n\nData from:[1]\n\nData from Aircraft of the Third Reich,[1] Flugzeug Typenbuch 1936[4]Luftwaffe Warbird Resource Group[3]\nGeneral characteristics\n\nPerformance\n\nArmament\n\n\nRelated lists\n\nNote:  Official RLM designations had the prefix \"8-\", but this was usually dropped and replaced with the manufacturer's prefix.\n",
  "concepts": [
    "Arado Ar 76",
    "ar",
    "ar 76",
    "76",
    "aircraft",
    "fighter",
    "used",
    "rlm",
    "production",
    "wing",
    "trainer"
  ],
  "findings": [
    "Development",
    "Design",
    "Operational history",
    "Variants",
    "Operators",
    "Specifications (Ar 76A-0)",
    "See also",
    "References",
    "Citations",
    "Bibliography"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T14:45:55.157548"
}