{
  "title": "2021 Calgary municipal election",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/2021_Calgary_municipal_election",
  "content": "Naheed Nenshi\n\nJyoti Gondek\n\nThe 2021 Calgary municipal election was held on October 18, 2021, to elect a mayor and fourteen councillors to the Calgary City Council.\n\nIn conjunction with the elections for Calgary City Council, residents cast ballots for trustees of the Calgary Board of Education and the Calgary Catholic School District, a municipal vote on the question of returning to fluoridation of the city's water supply, and three provincially mandated votes: a Senate nominee election, as well as referendums on provincial equalization and on the adoption of permanent daylight saving time.[1]\n\nCalgary City Council is the fifteen-member elected body that governs the City of Calgary under the council–manager government. Council is led by the Mayor elected at-large, which is the designated Chief Elected Official. Under the Municipal Government Act the Mayor is treated as an equal member of council, with the only significant power provided to the mayor is de facto membership on all council committees. The remaining members of Calgary City Council are fourteen councillors elected by residents of the fourteen wards dividing the city. The Calgary municipal election is held under the first-past-the-post method of voting, where the candidate with the most votes is elected to a four-year term.\n\nThe 2021 Calgary municipal election was the 103rd municipal election in the City of Calgary's history and the first to elect a woman as its mayor.\n\nA number of incumbent councillors declined to contest the 2021 election including Druh Farrell (Ward 7),[2] Shane Keating (Ward 12),[3] Evan Woolley (Ward 8),[4] and Ward Sutherland (Ward 1).[5] On July 8, incumbent Ward 5 councillor George Chahal withdrew from the municipal election to accept the nomination for the Liberal Party of Canada in the Calgary Skyview district in the 2021 Canadian federal election.[6] Chahal was subsequently elected to the House of Commons of Canada.[7]\n\nLong-time councillor Ray Jones (Ward 10), resigned effective October 19, 2020, due to heath issues, no by-election was required to fill the councillor position due to the proximity of Jones' resignation to the 2021 municipal election. Jones was first elected in the 1993 by-election, and served as a councillor for 27 years.[8][9]\n\nA union-backed Third Party Advertiser “Calgary’s Future” endorsed Jyoti Gondek and a list of 13 candidates for the 14 council positions, and 8 of the 13 were elected.[10][11][12][13]\n\nOn April 6, 2021, incumbent three-term Mayor Naheed Nenshi announced on he would not seek a fourth term as mayor.[14][15]\n\nFormer Liberal Member of Parliament and Member of the Legislative Assembly of Alberta Kent Hehr announced he would run for Mayor on September 6, 2021,[16] but subsequently withdrew prior to the nomination date on September 20.[17]\n\nX = incumbent.\nCandidates as listed have filed the necessary paperwork with the City of Calgary.[18]\n\nCalgary's 2021 municipal election included one plebiscite question regarding whether to reintroduce fluoridation to the water supply.[19]\n\nOn February 1, 2021, Calgary City Council approved a vote on a question on whether Calgarians support reintroducing fluoride to the city's water supply. The plebiscite was the seventh time Calgarians have been asked whether fluoride should be added to the municipal water system, with the plebiscites failing to gain support in the first four instances in 1957, 1961 1966, and 1971, and finally succeeding in 1989 and reaffirmed by voters again in 1998.[20] Calgary City Council previously voted to remove fluoride from the water supply in February 2011, the program at the time cost $750,000 annually, and faced upcoming $6-million upgrade to water treatment plants to continue the program.[21]\n\nThe Alberta Dental Association and College estimates that there is somewhere between 0.1 and 0.4 parts per million of fluoride naturally occurring in drinking water.[22] City of Calgary administration planned that if reintroduced, the city's drinking water supply would be regulated at 0.7 parts per million of fluoride, at a cost of $30 million over 20 years.[22]\n\nFollowing the release of the Fair Deal Panel's recommendations in June 2020, Premier Jason Kenney announced a provincial referendum on a measure to remove equalization payments from the Constitution of Canada would be held in conjunction with the 2021 Alberta municipal elections. The announcement was criticized by Calgary Mayor Naheed Nenshi arguing it was a distraction for voters who should be focused on local issues.[23] Mount Royal University political scientist Duane Bratt noted the inclusion of a generally conservative ballot issue would likely have the effect of increasing conservative participation and therefore conservative leaning candidate success in the otherwise non-partisan election.[24]\n\nThe referendum question proposed by the Fair Deal Panel was \"Do you support the removal of Section 36, which deals with the principle of equalization, from the Constitution Act, 1982?\"[24] The final wording of the question was changed slightly prior to approval by the Legislature to \"Should Section 36(2) of the Constitution Act, 1982 — Parliament and the Government of Canada’s commitment to the principle of making equalization payments — be removed from the Constitution?\"[25]\n\nIn response to the provincial question, Calgary City Council began preparing a vote on a question asking if city had a fair fiscal relationship with the provincial government,[26] however ultimately City Council decided not to include the question as a plebiscite during the election.[27]\n\nOn July 15, Premier Jason Kenney announced that in addition to the referendum on equalization, Albertans would also vote on whether to end the practice of observing daylight saving time.[28] Albertans had previously voted on implementing daylight saving time twice, first in 1967 when Albertans rejected the proposal by a narrow margin with 48.75 per cent approving. Four years later in 1971, Albertans voted on daylight saving time again, this time overwhelmingly approving the proposal with 61.47 per cent supporting.\n\nBetween 1989 and 2012 Alberta has been the only province to hold Senate nominee elections. The 1989 and 1998 Alberta Senate nominee election were held in conjunction with the Alberta's municipal elections, while the 2004 and 2012 Alberta Senate nominee election were held in conjunction with elections for the Legislative Assembly of Alberta. The New Democratic government allowed the Senatorial Section Act to expire in 2016,[29] which was subsequently reintroduced by the United Conservative government in 2019.[30] Of the 10 nominees (often called \"senators-in-waiting\") in the previous votes, only five have been appointed to the Senate of Canada.\n\nCalgary mayor candidate Kevin J. Johnston posted a video on social media criticizing public health measures related to the COVID-19 pandemic in Alberta. Johnston stated as mayor he would go to the homes of Alberta Health Services (AHS) Environmental Public Health staff homes while armed, and vowed to dox a member of AHS. On May 14, 2021, a justice of Court of Queen's Bench of Alberta granted AHS a restraining order against Johnston, forbidding obstructing or interfering with AHS employees, taking video, photos or audio of employees or coming within 100 metres of AHS employees.[31] Johnston was arrested the next day by Calgary Police Services after attending an illegal public gathering in contradiction of public health orders.[32][33]\n\nThe City of Calgary investigated legal options to prevent the city's electors list from being shared with Johnston. Under the Local Authorities Election Act and the city's bylaws, the city was obligated to provide the electors list with all candidate. Alberta Health Services, other candidates and the media aired concerns of providing the names and addresses of all Calgarians, including AHS health inspectors which Johnston had previously doxed and made threats against.[34] On May 18, 2021, the City of Calgary responded to the public concern by deciding not to create a voter list for the 2021 municipal election, meaning no candidate would receive information about voters names or addresses from the city.[35]\n\nOn July 12, 2021, Johnston pleaded guilty to one charge of harassment and one charge of causing a disturbance related to two separate incidents after serving 48 days in custody. Johnston was sentenced to two consecutive 9 month periods of probation.[36][37] In September 2021, Johnston pleaded guilty to breaching three court orders to comply with public health measures to reduce the spread of COVID-19, and was sentenced to 40 days in jail and to pay costs to Alberta Health Services of $20,000.[38][39] In January 2022, he was arrested at the Alberta-Montana border, having failed to show up for jail sentences.[40]\n\nJohnston had previously ran as a mayoral candidate in the 2018 Mississauga municipal election, coming in second with 13.5 per cent of the popular vote. After the election, Johnston was sued and found liable for defamation. He was required to refrain from making defamatory statements about the plaintiff, and to pay $2.5 million in damages. The defamation was described by the judge as \"hate speech at its worst\".[41] On October 4, 2021, Johnston was sentenced to 18 months in jail by the Ontario Superior Court for six instances of contempt of court in relation to comments made on social media about the original 2019 injunction.[41]\n",
  "concepts": [
    "2021 Calgary municipal election",
    "calgary",
    "city",
    "election",
    "2021",
    "municipal",
    "alberta",
    "council",
    "johnston",
    "mayor",
    "municipal election"
  ],
  "findings": [
    "Background",
    "Candidates",
    "Mayor",
    "Ward 1",
    "Ward 2",
    "Ward 3",
    "Ward 4",
    "Ward 5",
    "Ward 6",
    "Ward 7",
    "Ward 8",
    "Ward 9",
    "Ward 10",
    "Ward 11",
    "Ward 12",
    "Ward 13",
    "Ward 14",
    "Public school trustees",
    "Separate school trustees",
    "Plebiscite",
    "Mayoral opinion polling",
    "Issues",
    "Fluoride plebiscite",
    "Equalization referendum",
    "Daylight saving time referendum",
    "Senate nominee election",
    "Candidacy of Kevin J. Johnston",
    "See also",
    "References",
    "Opinion poll sources",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:04.820229"
}