{
  "title": "Riverbend (Columbus, Ohio)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Riverbend_(Columbus,_Ohio)",
  "content": "Riverbend is a neighborhood in southwest Columbus, Ohio.  Riverbend itself is a single subdivision that is located next to Big Run Park.  Because Riverbend is at the southwest border of the city, it was not annexed into the city until the late 1960s.  A major road that serves as the northern boundary of the neighborhood, Clime Road, has segments that have yet to be annexed into the city.\n\nRiverbend is located approximately 7 miles away from the Ohio Statehouse downtown.  It is bordered by Clime road to the north, a railroad track that was formally used by the Baltimore and Ohio Railroad to the East, Alkire Road to the south, and Georgesville Road and Interstate 270 (Ohio) to the west.[citation needed][1]\n\nRiverbend was first settled as a farming community in what was at the time the small village of Columbus. The farm first settled was located on what was formally the Virginia Military District by William T. Clime in 1834.[citation needed]  Clime started a 116-acre farm on the military land, and eventually expanded the farm into a 260 land holding where he bred Poland China hogs.  As the farm got passed down through the family, more and more land was acquired until William's grandson Lester owned over 400 acres of land in what is today the Riverbend neighborhood area.  William Clime and the rest of the Clime family are the namesake of the northern border of the neighborhood, Clime Road.[2]\nThe neighborhood's southern border, Alkire Road, is named after an elected postmaster, Adam Alkire, who served from 1840 to 1846 and from 1852 to 1855.[3]\nMost of the neighborhood, including Big Run Park, was annexed into the city in the late 1960s and the early 1970s.  There are small segments of Riverbend that lie directly south of Clime road that have yet to be annexed into the city of Columbus, and are technically part of Franklin Township, Franklin County, Ohio.[4]\n\nBig Run Park is located at 4201 Clime Rd Columbus, OH 43228. The Big Run Park is the largest parks in the Columbus Parks system. The park is heavily wooded and is surrounded by wetlands in the South East corner. This Columbus area park is home to the Big Run Soap Box Derby. Inside Big Run Park is the Big Run Sports Complex. The Big Run Sports Complex is an indoor facility located in the right corner of the park. The complex is home to indoor volleyball and basketball. Inside the park is located a City of Columbus Police Sub-Station. The park has 241.71 acres.[5]\n\nRiverbend is also home to the Columbus chapter of The American Legion.  The Legion is dedicated to providing temporary financial assistance to veterans.  The Legion itself was chartered in 1919 by veterans.  Nationwide, The Legion has over 2.4 million active members, with 14,000 locations throughout the country.  The branch in Riverbend is located on 1571 Demorest Road, directly west of Big Run Park.[6]\n\nPost Oak Station is an affordable housing project for low income families located on 1383 Vida Way, only 2 blocks south of Clime Road.  One must apply for a potential lease agreement through the Columbus Metropolitan Housing Authority (CMHA), and acceptance to be able to lease does not mean one can move in immediately, due to high demand of housing an applicant is usually expected to be placed on a wait list.[7]\n",
  "concepts": [
    "Riverbend (Columbus, Ohio)"
  ],
  "findings": [
    "Geography",
    "History",
    "Landmarks and notable locations",
    "Big Run Park",
    "The American Legion",
    "Post Oak Station",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:23:13.271433"
}