{
  "title": "American Equipment Racing",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/American_Equipment_Racing",
  "content": "American Equipment Racing was a racing team that competed in the SCCA Trans-Am series in the 1980s and 1990s, and in the NASCAR Busch Grand National and Winston Cup Series during the mid-1990s.\n\nOwned by American Equipment Company owner Buz McCall, AER competed in IMSA sports-car racing and the Trans-Am series in the 1980s and early 1990s; the team won four consecutive Trans-Am championships with drivers Scott Sharp, Jack Baldwin, and Scott Pruett from 1991 to 1994.[1]\n\nThe team moved to NASCAR starting in 1994, competing in the Busch Grand National Series with Trans-Am Champion Jack Baldwin driving in two races, running the No. 95. Signing rookie driver John Tanner and sponsor Caterpillar Inc. for 1995, the team ran half of the 1995 season; Tanner was released after a handful of races and replaced for the majority of the team's races with Ward Burton. For 1996 AER signed 1994 Busch Series champion David Green to run for full-time in 1996. Finishing 2nd in series points,[2] Green and AER moved up to the Winston Cup Series in 1997, where after a difficult season Green finished 37th in points. After twelve races in 1998, Green was released by the team, and a variety of drivers, including Hut Stricklin and Steve Grissom, drove for the team to finish out the year; the team closed following the 1998 season when they lost the Caterpillar sponsorship.[3]\n\n(key) (Bold – Pole position awarded by qualifying time. Italics – Pole position earned by points standings or practice time. * – Most laps led.)\n\n(key) (Bold – Pole position awarded by qualifying time. Italics – Pole position earned by points standings or practice time. * – Most laps led.)\n\nThis NASCAR-related article is a stub. You can help Wikipedia by expanding it.\nThis article about a sports team in North Carolina is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "American Equipment Racing",
    "team",
    "series",
    "time",
    "trans",
    "races",
    "position",
    "pole position",
    "pole",
    "points",
    "green"
  ],
  "findings": [
    "Motorsports career results",
    "Winston Cup results",
    "Busch Grand National results",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:42.239366"
}