{
  "title": "New Zealand cricket team in England in 2008",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/New_Zealand_cricket_team_in_England_in_2008",
  "content": "The New Zealand national cricket team toured England and Scotland during the northern summer of 2008. They played three Test matches and five One Day Internationals and one Twenty20 International against England. Although New Zealand lost the Test series 2–0, they triumphed in the ODI series, winning three matches and losing one. The only Twenty20 match saw an England victory.\n\nThe fourth ODI was marred with controversy. Paul Collingwood appealed a controversial run out of Grant Elliott after Elliott had collided with Ryan Sidebottom and injured himself. While this action initially drew criticism from the New Zealand dressing room, Daniel Vettori admitted during the post-game press conference that the Black Caps' reaction was \"a little bit over the top\"[1] Collingwood also admitted that he probably made the wrong decision in not withdrawing the appeal. Later, the ICC banned Collingwood for four ODI matches due to England's slow over rate, with England having bowled only 47 overs in the required time. The ICC also fined the rest of the English team 15% of their match fee.[2] Kevin Pietersen was called upon to take over as captain for the final game.[3]\n",
  "concepts": [
    "New Zealand cricket team in England in 2008"
  ],
  "findings": [
    "Test series",
    "1st Test",
    "2nd Test",
    "3rd Test",
    "T20I series",
    "Only T20I",
    "ODI series",
    "1st ODI",
    "2nd ODI",
    "3rd ODI",
    "4th ODI",
    "5th ODI",
    "Other ODIs",
    "New Zealand v Ireland",
    "New Zealand v Scotland",
    "Tour matches",
    "List A: Marylebone Cricket Club v New Zealanders",
    "First-class: Kent v New Zealanders",
    "First-class: Essex v New Zealanders",
    "First-class: England Lions v New Zealanders",
    "First-class: New Zealanders v Northamptonshire",
    "List A: New Zealanders v Worcestershire",
    "Notes",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:23:38.509908"
}