{
  "title": "Ice hockey goaltending equipment",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Ice_hockey_goaltending_equipment",
  "content": "In ice hockey, the goaltender wears specialized goaltending equipment to protect themselves from the impact of the puck, and to assist in making saves. Ringette and rinkball goaltenders use the same equipment with some exceptions. This article deals chiefly with the sport of ice hockey.\n\nMost modern goaltending equipment is made from hydrophobic synthetic leather and nylon on the outside and dense closed-cell foams and plastics inside. In the past, pads were often made out of leather and stuffed with horse hair. Professional pads were stuffed with deer hair, which is hollow, giving more protection.\n\nPrior to the 1980's, the weight of the materials used subjected goaltending equipment to practical size limitations. The use of lighter materials made larger equipment feasible, with an emphasis on larger pads in particular. Once it became obvious that this was causing a dramatic decrease in scoring, the National Hockey League (NHL) and International Ice Hockey Federation (IIHF) along with other leagues and governing bodies began mandating maximum dimensions of goaltending equipment to encourage reasonable levels of scoring and prevent goaltenders from having an unfair advantage.[1] Most European professional leagues and many non-professional leagues adhere to equipment size regulations based on IIHF rules.[2]\n\nThe blocker consists of a glove with a rectangular board attached to the backhand side. The board is usually curved up at one end, which is designed to help control the deflection of the puck and will create a tougher angle on a shot if a goaltender uses the shaft-down technique. The blocker is worn on the hand that holds the stick, so a right-handed goaltender wears the blocker on the right hand, and a left-handed goaltender wears it on the left hand. This is called a \"full right goalie\" as the goaltender wears the catch glove in the right hand. A blocker is sometimes called a waffle, and less commonly as a domino, in reference to older models, which were covered with real leather, but had holes cut in the leather to save weight, giving the blocker a waffle-like appearance. The placement of the palm on the back of the blocker varies though it has been traditionally placed in the middle. Newer models tend to place the palm further to the inside of the glove in order cover more of the net. Typically, the goaltender wears only one blocker. However, near the end of his career, retired goaltender Dan Blackburn played with two blockers after nerve damage rendered him incapable of closing his glove hand.\n\nThe Catcher or glove is the glove worn on the free hand. It is similar to a baseball mitt, but has additional padding to protect the lower forearm, wrist, palm, fingers and thumb, and has a deeper pocket. The first goaltender trapper, worn by Reid Miller in 1948, who played for the Wadena Wolverines and the North Stars, was a baseball first baseman's mitt. Common variations among trappers include the pocket angle or \"break\": this refers to the angle at which the glove closes, usually measured from 60 - 90 degrees.[clarification needed] Trappers tend to be one of the most cared-for pieces of equipment for the goaltender. In order to prevent what is called a \"pancake pocket\", goaltenders often deepen the pocket by strapping objects inside the glove when not in use. The trapper's fit is extremely important as well as the goaltender's sense of the pocket and angles of the trapper. As a result, transitioning to a new glove may be difficult because of the significant break-in time. The total circumference of a trapper is 45 inches, modified down from 48 inches.[3][citation needed]\n\nThe chest and arm protector or arm and body pad is designed to protect the chest, shoulders, arms, and collarbone area from the impact of pucks and is worn under the hockey jersey. The chest and arm protector has continually become more protective in recent years. Particular attention is now being given to protecting the goaltender's heart from physical shock, since it is well-known that an impact in that area can unpredictability cause immediate cardiac arrest.\n\nIn the early days of goaltending, it was much smaller and less protective, consisting mostly of thick felt. In effect, these pads were little better than what baseball catchers wear today. With the advent of better materials such as high density plastics and foams, chest protectors can be made to protect the body from injury. However, even with modern chest protectors, goaltenders still receive bruises and other minor injuries from pucks that hit them in the torso.\n\nA goaltender jock with a cup pocket, which protects the pelvic area, is more protective than a common jockstrap with protective cup, though it generally uses the same internal plastic cup, or maybe a bit larger. The jock has padding over the internal plastic cup and additional padding from the top of the cup to the waist. Many modern jocks use two cups, one in front of the other, in order to provide more protection. Instead of a jock, female goaltenders wear a pelvic protector known as a jill.\n\nGoaltenders wear special leg pads to protect their legs and knees. Leg pads have evolved significantly over the years. The earliest leg pads were very similar to the cricket pads from which they were adopted. They were constructed of leather and stuffed with deer hair and sometimes Kapok,[4] a material that was used in life preservers on ships. In the 1930s, leg pads became more specialized, becoming wider and thicker. In the 1940s, an extra roll of material, called a skip-over roll, was added to the outside edge of each pad face, extending from the lowest point of the pad covering the foot, called the boot break, to just below the knee rolls. In the 1950s, the skip-over roll was extended to the very top of the leg pad. In the 1980s, additional padding was added to protect the inside areas of the legs and knees. Toe foils, a plastic shield that was affixed to the bottom outside edge of the goaltender pad, began to be used but were later not allowed by equipment regulations. Leg pad design and construction remained static until the 1990s when synthetic leathers and high density foams began to be used in pad construction. Advantages of synthetic materials were lighter weight and less saturation from water, lower cost, a quick break-in period, and leg pads that could be manufactured in the colors of the goaltender's team. Some leg pad manufacturers replaced the leather toe strap with a toe bridge to affix the front of the leg pad to the front of the goalie skate. Starting around 2000, the \"box\" style leg pads became popular as goaltending playing technique evolved to a blocking style versus the reacting style of the past. In the \"box\" style pad, the edge between the pad face and the pad inside edge is square, keeping the pad face more perpendicular with the ice surface and maximizing the blocking area when the goaltender is in the \"butterfly\" position. Currently, ice hockey regulations require that leg pads be no wider than 11 inches (28 cm) and can be no longer than 38 inches (97 cm). The NHL has also brought in rules stating that each goaltender will be measured for height, and then the height of allowable pads will be calculated in proportion to the height of the goaltender.\n\nThe first modern goaltender mask was pioneered by professional goaltender Jacques Plante. Early masks were constructed from fiberglass and were molded to the shape of the wearer's face. These became less popular in the year 1969 in North America when a series of severe and career ending injuries struck down many NHL goaltenders using molded masks and prompted the Canadian Standards Association to outlaw molded masks in 1978. Assuredly, it was also Vladislav Tretiak's brilliant play during Canada-USSR 1972 Summit Series, that North American players first began to notice the superiority of the helmet/cage-type mask as opposed to the form-fitting fiberglass model, especially in terms of increased vision. Another significant advance in mask design came during the 1974-75 season, when goaltending great Tony Esposito, who had experienced puck and stick injuries to his eyes, fitted a steel cage over the eyeholes of his molded mask and crafted a fiberglass extension to protect the top of his head, thereby setting the groundwork for the next step in mask evolution, the modern goaltender mask, commonly referred to as the \"hybrid\" mask.\n\nToday, most goaltenders utilize hybrid masks made of fiberglass, kevlar, carbon fiber, and other composite materials. Modern masks have a large cutout in the eye and nose area covered by a steel or titanium cage. \nMany goaltenders are able to be identified by the custom artwork airbrushed on their masks. Some maintain the same theme throughout their career, changing the colors to match their team's colors. Examples include Curtis Joseph's Cujo, Ed Belfour's eagle, Félix Potvin's abstract cat design, Martin Brodeur's generic Devils mask, or Patrick Lalime's Marvin the Martian. Some goaltenders have more generic team-specific artwork, while others vary the artwork over the course of their careers.\n\nAn alternative to the mask, is the earlier mentioned \"bird-cage\" helmet and cage combo, which consists of a wire facemask attached to a standard hockey helmet. This became popular during the 1970s since a cage provides better sightlines than a molded fiberglass mask. Its popularity peaked during the 1980s, yet started to decline during the 1990s, as hockey equipment manufacturers discontinued the production of helmets and cages favored by goaltenders. By the turn of the 21st century, only a few professional goalies still wore a helmet/cage combo. Included in this small group were Chris Osgood of the Detroit Red Wings and Rick DiPietro[5] of the New York Islanders in the NHL, Martin Prusek of Dinamo Riga in the KHL, and Marco Bührer of SC Bern in the Swiss National League A. Dominik Hašek also wore the helmet/cage combo for the duration of his career.\n\nThere were various helmet/cage combinations used by professionals. One was the Cooper SK600 helmet with the Cooper HM30 cage (worn by Ken Wregget and Billy Smith). Another was the Cooper SK2000 helmet with either the Cooper HM30 cage (previously used by Osgood and Dan Cloutier) or the Cooper HM50 cage (previously used by Hašek). Another one was the Jofa 280 Helmet with the 260.51 cage, which was last worn by Arturs Irbe. Don Beaupre wore a Cooper SK600 with a Jofa 260.51 cage. After Nike acquired Cooper and consolidated it as Nike Bauer, the SK2000 and HM50 were discontinued, while the HM30 was marketed as a field hockey mask (and subsequently discontinued in 2004). Jofa eventually phased out the 280 helmet and its respective cage, but now offer the RBK 3K helmet and 287 cage for the European market since consolidating with Reebok.\n\nThere are currently two models of goaltender masks which are both available to the North American market and based on the helmet/cage combination. The first model is the Hasek Pro Style 357, manufactured by the Warwick Mask Company, which follows the traditional helmet/cage style of masks. Current users of these helmets include Prusek and Bührer, while Hašek used this model from the 2001-02 season up to his retirement. The second is the Mage, manufactured by Sportmask. The difference between the Mage and other helmet/cage combinations is that the Mage's cage attaches to a helmet with a back plate as opposed to a helmet that's enclosed. Mage users include Florida Panthers goaltender Tim Thomas and Genève-Servette HC goaltender Tobias Stephan.\n\nGoaltenders' pants are similar in appearance to the pants that forwards and defensemen wear. Goaltender pants are heavily padded all down the front and sides, with a tailbone protector incorporated into the rear of the pant. They also have protective foams on the inner thigh for increased protection from shots. They also have attachments for the options of suspenders.\n\nGoal skates differ from regular hockey skates: the blade is longer, wider, and flatter to provide the goalie with more stability and to prevent the blade from bending when hit by shots. The blades are usually made from stainless steel, carbon steel, or titanium nitride. The blade holder, which is molded to the cowling or affixed directly to the boot, was historically shorter vertically so that the goaltender is lower to the ice. Modern goalie blades have become much taller to give goalies the ability to have a wide stance without losing their blade edge contact with the ice. The boot does not have a tendon guard, which is the piece of a regular hockey skate that extends up the back of the ankle to protect the Achilles' tendon. Finally, the boot used to be inside a rigid cowling to protect the foot from direct impact. The current trend is to remove the cowling. Cowlings made the skates wider, especially at the bottom of the boot.  When the modern goaltender went into a deep \"butterfly\" position, to see between the players in front of him, the cowl would lift the blade off the ice. The new goaltender skate is made out of newer materials, allowing the boot itself to provide the needed protection. The cowlings are being phased out of professional play.\n\nThe special hockey stick goaltenders use has a blade that is approximately 3+1⁄2 inches (8.9 cm) wide. The lower 25 to 28 inches (64 to 71 centimetres) of the shaft is widened to provide more blocking surface. This area is called the paddle. Although traditional goaltender sticks were usually made completely of wood, most modern sticks are reinforced with graphite and fiberglass and the paddle and blade are injected with foam to make them lighter. Recently, manufacturers have begun to produce sticks made completely from composite materials, which are lighter.[citation needed] However, it may be argued that composite sticks are less durable than their wooden counterparts. While these sticks are widely sold, most professional goaltenders have continued to use the foam core paddle-wood shaft type, even though it may be painted to look composite. The reason is both durability and the ability of the \"old\" style construction to absorb shock. Player sticks are made to transmit feeling (i.e. of the puck) to the player's hands when stickhandling. Goaltenders need the stick to absorb the shock of the puck impact when making a save.\n",
  "concepts": [
    "Ice hockey goaltending equipment"
  ],
  "findings": [
    "Blocker",
    "Catcher",
    "Chest and arm protector",
    "Jockstrap",
    "Leg pads",
    "Mask",
    "Pants/Breezers",
    "Skates",
    "Stick",
    "References"
  ],
  "timestamp": "2025-04-11T10:13:34.621017"
}