{
  "title": "Jeff Burch",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jeff_Burch",
  "content": "Jeff Burch is a Canadian politician, who was elected to the Legislative Assembly of Ontario in the 2018 provincial election.[1] He represents the electoral district of Niagara Centre as a member of the Ontario New Democratic Party.\n\nPrior to his election to the legislature Burch was the executive director of Niagara Folk Arts, a non–profit social services agency, and served as city councillor for Merritton Ward for St. Catharines City Council.\n\nJeff Burch is a graduate from Brock University, with an honours BA in philosophy. Burch then spent three years as a graduate student and teaching assistant at Brock, teaching seminars in social issues and women's studies. He left his studies in 1996 after being elected president of a United Steelworkers local union.[2]\n\nBurch ran as the Ontario New Democratic Party's candidate in St. Catharines in 1995, losing to Liberal Jim Bradley.[citation needed] He was elected as a city councillor in St. Catharines, Ontario, in 2006. He served from 2006 to 2014, including four years as budget chair.[3] He ran for mayor of St. Catharines in 2014, losing to Walter Sendzik by fewer than 2000 votes.\n\nIn February 2018, Burch won the NDP nomination in Niagara Centre.[4] The riding has been an NDP stronghold for 44 years[citation needed] with Mel Swart, Peter Kormos and Cindy Forster holding the seat. On June 7, 2018, Burch won the seat.[5]\nBurch currently serves as the Official Opposition critic for Municipal Affairs[6] as well as the chair of the Official Opposition caucus.\n\nThree months after his election in 2018, he scored a major victory by winning unanimous support for his motion to bring two-way all-day GO Transit rail service to Niagara.[7]\n",
  "concepts": [
    "Jeff Burch"
  ],
  "findings": [
    "Background",
    "Politics",
    "Electoral record",
    "2014 St. Catharines Mayoral Election",
    "2010 St. Catharines City Council Election - Ward 1 - Merriton",
    "2006 St. Catharines City Council Election - Ward 1 - Meritton",
    "References"
  ],
  "timestamp": "2025-04-11T10:10:12.762129"
}