{
  "title": "74th Locarno Film Festival",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/74th_Locarno_Film_Festival",
  "content": "The 74th annual Locarno Festival was held from 4 August to 14 August 2021 in Locarno, Switzerland.[1] The opening film of the festival was Beckett by Ferdinando Cito Filomarino, which had its world premiere on 4 August.[2] The 74th edition of Locarno Film Festival hosted 14 films including 7 world premieres in Piazza Grande among which half were European productions.[3][4] More than 75,000 spectators attended the festival. 50% less than the attendance rate in 2019 before the COVID-19 pandemic.[5]\n\nThis event will be held from 30 July to 14 August. It is Locarno Film Festival’s communal space, which embraces existing audience and greets new people. It will have following platforms:\n\nDuring the course of the film festival, it will be a stage for exchanging and debating ideas and perspectives. It will have encounters with people from the world of art, photography, cinema music, politics and science.\n\nThis is an initiative open to 28 final year students of high school or vocational school of Switzerland and Northern Italy, aged between 18 and 23. They will be privileged viewers as they may watch the screenings, meet directors and actors/actresses, attend specially organized introductory lectures on film language. In addition they will have access to the sidebar events.\n\nThe following films were selected to receive screening in the sections below:[6][7][8][9][10][11][12][13][14][15]\n\nHighlighted title indicates winner\n\nHighlighted title indicates winner\n\nHighlighted title indicates winner\n\nHighlighted title indicates winner\n\nThe following awards were presented for films shown in competition:[16][17]\n",
  "concepts": [
    "74th Locarno Film Festival",
    "festival",
    "film",
    "winner",
    "title indicates",
    "title",
    "locarno",
    "indicates winner",
    "indicates",
    "highlighted title",
    "highlighted"
  ],
  "findings": [
    "Events",
    "Rotonda by la Mobiliare - Come together!",
    "Locarno Talks la Mobiliare",
    "Cinema and Youth",
    "Juries",
    "International competition",
    "Filmmakers of the present competition",
    "Leopards of Tomorrow",
    "First Feature",
    "Sections",
    "Pre-Festival",
    "Piazza Grande",
    "International competition (Concorso internazionale)",
    "Filmmakers of the Present (Concorso Cineasti del presente)",
    "Leopards of Tomorrow (Pardi di domani)",
    "Out of Competition (Fuori Concorso)",
    "Open Doors Screenings",
    "History (s) of cinema (Histoire(s) du cinéma)",
    "Retrospective (Retrospettiva)",
    "Locarno Kids",
    "Swiss Panorama (Panorama Suisse)",
    "International Critics' Week (Semaine de la critique)",
    "Official Awards",
    "International Competition",
    "Filmmakers of the Present Competition",
    "Leopards of Tomorrow",
    "First Feature",
    "Special Awards",
    "Leopard of Honour (Pardo d’onore Manor award)",
    "Excellence Award Davide Campari",
    "Locarno Film Festival Short Film Candidate for the European Film Awards",
    "Special Lifetime Achievement Award",
    "Prix du public UBS Award",
    "Variety Piazza Grande Award",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T17:04:17.725558"
}