{
  "title": "RAF Northleach",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/RAF_Northleach",
  "content": "Royal Air Force Northleach or more simply RAF Northleach is a former Royal Air Force Satellite Station near the Cotswold town of Northleach, Gloucestershire. Though named after the nearby town the land the airfield occupied was located in the nearby parishes of Hampnett and Turkdean.[2]\n\nConstructed during 1941[3] the 200-acre (0.81 km2) airfield was designated an emergency landing ground until July 1942 when it was assigned to No. 3 Glider Training School RAF from nearby RAF Stoke Orchard which provided basic elementary training for pilots of the Glider Pilot Regiment.[4]\n\nDuring September 1942 the airfield was used to train soldiers of the RAF Regiment detachment from Stoke Orchard until they moved to Mythe Camp near Tewkesbury.[5] It then became a Relief Landing Ground (RLG) for RAF Stoke Orchard on 2 November 1942 with a flight of Miles Master II GT tug aircraft and General Aircraft Hotspur II gliders arriving on 16 November 1942. Flying training for men of the Glider Pilot Regiment began the very next day with the first course arriving by bus.[5]\n\nDuring the winter of 1942 the flying surface of the airfield became so waterlogged that the airfield was unusable and all flying training returned to Stoke Orchard until February 1943. Flying continued at Northleach through the middle of 1943 but water-logging again became a problem resulting in an additional detachment being sent to RAF Wanborough, Wiltshire to maintain the level of training.[6]\n\nIn May 1944 RAF Northleach was re-classified in status as a full satellite airfield but the planned upgrade to add additional hangars and services was not carried out.[5]\n\nThe winter of 1944 saw Northleach and Stoke Orchard yet again suffer from  water-logging which resulted in the cessation of flying at Northleach and relocation to RAF Zeals, Wiltshire on 21 October 1944. This would be the last time the airfield was used for flying.[5]\n\nOn 11 January 1945 No. 3 Glider Training School left RAF Stoke Orchard and RAF Northleach for good, relocating to RAF Exeter, Devon and its satellite of RAF Culmhead, Somerset. RAF Northleach was placed under \"Care and Maintenance\" thereafter until the site was de-requisitioned and wholly abandoned by the RAF in May 1946.[3]\n",
  "concepts": [
    "RAF Northleach"
  ],
  "findings": [
    "References"
  ],
  "timestamp": "2025-04-11T10:15:27.337246"
}