{
  "title": "Uryankhay Republic",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Uryankhay_Republic",
  "content": "The Uryankhay Republic (Chinese: 烏梁海共和國; pinyin: Wū liáng hǎi gònghéguó; Tuvan: Урянхай) was a nominally independent state that broke away from the Qing dynasty of China during the Xinhai Revolution. It was proclaimed as a republic in 1911 by the Tuvan separatist movement and was encouraged by the Russian Empire. On 1 December 1911, Outer Mongolia declared independence from Qing China. Throughout the rest of December, bands of Uriankhai began to plunder and burn Chinese-owned shops.[2]\n\nUriankhai nobles were divided on their course of political action. The Uriankhai governor (amban-Noyon), Gombo-Dorzhu, advocated becoming a protectorate of Russia, hoping that the Russians would appoint him Governor of Uriankhai. However, Balzhin'nima and Toqamid, the noyans (Mongolian for \"mandarin\"[3]) of two other kozhuuns (Tuvan for \"banner\") preferred to submit to the new Outer Mongolian state under the theocratic rule of Buddhist spiritual leader Jebstundamba Khutukhtu of Urga.[4]\nUndeterred, Gombu-Dorzhu sent a petition to the Russian Tsar's Frontier Superintendent at Usinsk, stating that he had been chosen as leader of an independent Tannu Uriankhai state. He asked for protection and proposed that Russian troops be sent immediately into the country to prevent China from restoring its rule over the region. There was no reply – three months earlier, the Tsarist Council of Ministers had decided on a policy of cautious gradual absorption of Uriankhai by encouraging Russian influence. The Council feared that precipitate action by Russia might provoke China.[5] Tsar Nicholas II ordered Russian troops into the Uryankhay Republic in 1912, under the pretext that Russian migrants were allegedly attacked.\n\nHowever, this position changed as a result of pressure from commercial circles in Russia for a more activist approach. Additionally, a Russian-sponsored petition from two Uriankhai khoshuuns in the fall of 1913 requested they be accepted as a part of Russia. Other Uriankhai khoshuuns soon followed suit. On 14 April 1914, the Uryankhay Republic became a Russian protectorate as the Uryankhay Krai.[6][7]\n",
  "concepts": [
    "Uryankhay Republic",
    "uriankhai",
    "russian",
    "uryankhay",
    "russia",
    "republic",
    "china",
    "uryankhay republic",
    "tuvan",
    "state",
    "uriankhai khoshuuns"
  ],
  "findings": [
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T14:45:05.150479"
}