{
  "title": "Spotted Demon (bull)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Spotted_Demon_(bull)",
  "content": "Spotted Demon #35 (born April 7, 2008) is an American retired bucking bull. In his career, he competed in the Professional Rodeo Cowboys Association (PRCA) and Professional Bull Riders (PBR) circuits. He was the 2018 PRCA Bull of the Year,  as well as the 2018 Bull of the National Finals Rodeo (NFR). \n\nIn 2023, Spotted Demon was ranked No. 24 on the list of the top 30 bulls in PBR history.[1]\n\nSpotted Demon was born on April 7, 2008.[2] He is a black colored bull with distinctive white markings on his forehead and body.[3] His brand number is 35. His breed is American Bucking Bull, and his ABBI No. is 10077592.[4] His weight has fluctuated between 1,650 pounds (750 kg) to 1,800 pounds (820 kg).[5]\n\nSpotted Demon's sire, Playboy Skoal, was the 1990 PRCA Bucking Bull of the National Finals Rodeo (NFR) and the 1991 PRCA Reserve Bucking Bull of the Year. He was also the sire to PBR World Finals bull Rango. Spotted Demon's dam, Oakes 10, was a daughter of ABBI Futurity Champion, ABBI Classic Champion, and PBR World Finals bull, Stray Kitty.[6]\n\nJulio Moreno of Oakdale, California, and Dallas Schott of McLaughlin, South Dakota, co-own Spotted Demon, a contender for a PBR World Champion Bull title several years.[7] Moreno and his wife Kindra recently moved their entire enterprise from Oakdale to Merced, California. They keep all of their active and retired bucking bulls on this ranch. Julio Moreno is most well-known for his bucking bull, Bushwacker. The three-time PBR World Champion bull is considered by many to be the greatest bucking bull ever.[8]\n\nMoreno has a very particular feeding program for the bulls. He also keeps them exercised by giving them an acre of dirt to play in. After the dirt, they run the bulls. In 2018, they intended for 2019 to be Spotted Demon's last year bucking. However, he did so well that Moreno bucked him in 2020.[9]\n\nSpotted Demon is a member of the ProBullStats Hall of Fame.[10]\n\nSpotted Demon bucked in both the PRCA and PBR circuits from 2012 through 2020.[4]\n\nSpotted Demon bucked off all of his riders this season. First, at the PBR Touring Pro Division (TPD) event in Livingston, Montana, he bucked off Lachlan Richardson in 5.27 seconds for a bull score of 44 points. Then, at the PBR Built Ford Tough Series (BFTS) event in Grand Rapids, Michigan, he bucked off Stetson Lawrence in 3.52 seconds for a bull score of 44.5 points.[3]\n\nThis season, Spotted Demon qualified for the PBR's Built Ford Tough World Finals in Las Vegas, Nevada. His first out was bucking off Jory Markss in 7.29 seconds for a bull score of 45 points. Then, he bucked off Ben Jones in 5.55 seconds for a bull score of 43.25 points.[3]\n\nAt the BFTS event in Chicago, Illinois, he bucked off Josh Faicloth in 5.55 seconds for a bull score of 40.75 points. The next day in Chicago, he was ridden by Claudio Crisostomo for a low score of 58.25 points. Despite the successful ride, Crisostomo struggled to stay mounted for the eight  seconds and Spotted Demon bucked poorly. At the Touring Pro Division event in Bismarck, North Dakota, Spotted Demon bucked off Jay Miller in 4.40 seconds for a bull score of 44.50 points. The next day in Bismarck, he bucked off Gage Gay in 4.82 seconds for a bull score of 46.00 points.[11] This out made him the top bull of the event.[12] At the BFTS event in Nashville, Tennessee, he bucked off Nathan Schaper in 2.3 seconds for a bull score of 43.25 points. At the BFTS event in Springfield, Missouri, he bucked off Ryan Dirteater in 5.42 dseconds for a bull score of 42.5 points.[3]\n\nThis season, Spotted Demon again qualified for the PBR World Finals. His first out was bucking off Ryan Dirteater in 6.31 seconds for a bull score of 45.75 points. Next, he bucked off 2008 PBR World Champion Guilherme Marchi in 4.23 seconds for a bull score of 45 points.[3]\n\nThis season, Spotted Demon bucked off all of his BFTS riders. At the BFTS event in Chicago, he bucked off Ryan Dirteater for 2.60 points for a score of 44.75 points. At the BFTS event in Kansas City, Missouri, he bucked off Bonner Bolton in 3.93 seconds for a score of 45 points. At the American Rodeo in Arlington, Texas, he bucked off Guilherme Marchi in 3.29 seconds for 42.5 points. At the BFTS event in Sioux Falls, South Dakota, he bucked off Matt Triplett in 5.55 seconds for 44.25 points. At the BFTS event in Seattle, Washington, he bucked off Robson Aragao in 3.05 seconds for a bull score of 44.5 points. At the BFTS event in Billings, Montana's 15/15 Bucking Battle, he bucked off 2004 PBR World Champion Mike Lee in 4.57 seconds for score of 43.75 points. Then, at the BFTS event in Des Moines, Iowa's 15/15 Bucking Battle, he bucked off 2011 PRCA World Champion bull rider Shane Proctor in 5.05 seconds for a score of 44.75 points.[3]\n\nSpotted Demon again qualified for the PBR World Finals this year. His first out, he bucked off Shane Proctor in 2.38 seconds for a bull score of 43.25 points. Then, he bucked off Stormy Wing in 2.79 seconds for a bull score of 43.5 points.[3]\n\nIn January, at the start of this season, top PBR bull rider Ryan Dirteater was asked who he considered were the best bulls on tour. He answered Long John, Stone Sober, Air Time, and Spotted Demon.[13]\n\nThis season, Spotted Demon again bucked off all of his BFTS riders. In the season opener in Chicago, he bucked off four-time PRCA World Champion bull rider J. W. Harris in 5.47 seconds for a bull score of 43.75 points. At the BFTS event in Oklahoma City, Oklahoma's 15/15 Bucking Battle, he bucked off Emilio Resende in 2.29 seconds for a bull score of 43.25. At the BFTS event in St. Louis, Missouri, he bucked off Kasey Hayes in 6.38 seconds for a bull score of 43.25 points. At the BFTS event in Arlington, Texas, he bucked off Mike Lee in 3.76 seconds for a bull score of 43.75. At the BFTS event in Phoenix, Arizona, he bucked off Cody Nance in 4.34 seconds for a score of 43.75 points. At the BFTS event in Sioux Falls, South Dakota, he bucked off Jorge Valdiviezo in 5.03 seconds for a score of 43.75 points. In Clovis, California, at the PBR Touring Pro Division event held in conjunction with the PRCA-sanctioned Clovis Rodeo, he bucked off Luis Blanco in 4.34 seconds for a score of 44.5 points. At the PBR Velocity Tour event in Salinas, California, held in conjunction with the PRCA-sanctioned California Rodeo Salinas, he bucked off Stormy Wing in 3.4 seconds for a score of 44.5 points. In Santa Barbara, California, at the PBR Touring Pro Division held in conjunction with the PRCA-sanctioned Old Spanish Days Fiesta Stock Horse Show and Rodeo, he bucked off Ernan Rubio in 3.34 seconds for a score of 45 points. At the BFTS event in Eugene, Oregon's 15/15 Bucking Battle, he bucked off Derek Kolbaba in 4.30 seconds for a score of 44.25 points. At the BFTS event in San Jose, California, he bucked off Jess Lockwood in 4.67 seconds for 44.75 points.[3]\n\nSpotted Demon again qualified for the PBR World Finals, where he bucked off Tanner Byrne in 4.63 seconds for a bull score of 43.75.[3]\n\nAt the BFTS event in Sacramento, California's 15/15 Bucking Battle, Spotted Demon bucked off Jess Lockwood in 4.66 seconds for a bull score of 45.5 points. At the BFTS event in Anaheim, California, he bucked off Guilherme Marchi in 7.44 seconds for a score of 44.25 points. At the BFTS event in Arlington, Texas, he bucked off Wallace de Oliveira in 2.98 seconds for a bull score of 45 points. The next day at the American Rodeo, also in Arlington, Texas, he bucked off Mike Lee in 4 seconds flat for a bull score of 44.75 points. At the BFTS event in Glendale, Arizona, Spotted Demon was ridden by 2016 PBR World Champion Cooper Davis for 90.5 points. The bull scored 44.75 points. Davis broke Spotted Demon's consecutive buckoff streak of 24. He admitted that he never could understand why other riders had trouble with him. After riding him, he realized that the bull was much stronger than he had thought. He was always trying to pull the rider down. Davis had to adjust for that tactic.[14]\n\nAt the BFTS event in Tacoma, Washington's 15/15 Bucking Battle, Spotted Demon bucked off two-time PBR World Champion J.B. Mauney in 4.74 seconds for a score of 44.75. The next day in Tacoma, during the regular BFTS event, he bucked off Cody Nance in 6.19 for a score of 44 points. At the BFTS Last Cowboy Standing event held in Conjunction with Las Vegas' PRCA-sanctioned Helldorado Days rodeo, Kaique Pacheco successfully defended his Last Cowboy Standing title. He rode Spotted Demon for a score of 90 points in Round 3. He was the defending champion of the event and the ride helped him clinch the title for a second consecutive year. The bull earned a bull score of 43.75 points. Pacheco won $150,000.[15][11]\n\nAt the Velocity Tour event in Salinas, California, held in conjunction with the California Rodeo Salinas, Spotted Demon bucked off Rubens Barbosa in 7.06 seconds for 46 points. He was then successfully ridden at the rodeo in California Rodeo Salinas by Tyler Taylor, who was scored 89.5 points.[11][3] At the Velocity Tour event in Santa Barbara, California, held in conjunction with the Old Spanish Days Fiesta Stock Horse Show and Rodeo, he bucked off Chandler Bownds in 0.13 second season for a score of 45.5. At the BFTS event in Nampa, Idaho, he bucked off Stormy Wing in 6.05 second season for a low score of 41 points. At the BFTS event in San Jose, California, he bucked off Kaique Pacheco in 3.53 seconds for another subpar score of 42.75.[3]\n\nSpotted Demon did not make the cut for the PBR World Finals this year. Later, Julio Moreno divulged that the bull had suffered an abscess in his foot. The abscess seriously affected his performance. When he got to the PRCA's National Finals Rodeo (NFR), having treatment, he did better.[16]\n\nSpotted Demon performed well here; one out was excellent, one was average. First, he took on Jordan Spears and bucked him off in 2.20 seconds for a score of 45.00 points. Then, he bucked off Trevor Reiste in 1.80 seconds for a score of 43.50.[11]\n\nAt the PBR Velocity Tour event in Bakersfield, California,  Spotted Demon bucked off Cory Clark in 2.15 seconds for a score of 44 points. The PBR's elite Built Ford Tough Series (BFTS) changed title sponsors this year, and was now known as the Unleash the Beast Series (UTB). At the UTB event in Sacramento, California's 15/15 Bucking Battle, Spotted Demon bucked off Claudio Montanha Jr. in 2.29 seconds for 44.75.[11][3][7] At the UTB event in Anaheim, California, he bucked off Brennon Eldred in 3.50 seconds for a score of 46.00 points. This out brought him the Bull of the Event title.[17][11][3]\n\nJulio Moreno said, \"Spotted Demon is a big, athletic bull.\" He was second place to Bruiser for the PRCA Bull of the Year title the previous year. If he continued bucking the way he started this season off, he could have been a contender for the PBR World Champion Bull title. Moreno also stated that he got the bull to slim down a little. Because of his problem feet, the bull did better at a lower weight. It is not just that he is big that scared the bull riders; he also whipped his head around.[7] Moreno's answer to a comment that his bull had a reputation as a mean bull is, \"Yeah, that's pretty much what everyone says,\" Moreno remarked.[13] \"But I think that's because he hurt a few people in his younger years. He really throws his head a lot, which sometimes connects with a cowboy's face.[13] I really don't think he is that mean.[18][13] He's just big and awesome.\"[9][18]\n\nSpotted Demon bucked out of the right-hand delivery. He was very similar in the chute to what Bushwacker would do. He stood very still and waited for the chute gate to open. He always spun to the right. He had a tendency to stick close to the chutes.[9]\n\nAt this point in his career, Spotted Demon had a 92 percent buckoff percentage. In 64 outs, he was ridden five times. He had 19 round winning outs. He had 3 rider round wins. The nine-year-old bull was ranked first in the standings with a bull point average score of 45.38.[7]\n\nAt the UTB event in Arlington, Texas, Spotted Demon bucked off Dakota Louis in 5.14 second season for 44.25 points. At the UTB event in the Glendale, Arizona's 15/15 Bucking Battle, he bucked off Jose Vitor Leme in 5.99 seconds for 46 points. At the UTB event in Tacoma, Washington, he bucked off Kaique Pacheco in 4.23 seconds for 45.5 points. At the UTB Last Cowboy Standing event in Las Vegas, he bucked off Tanner Byrne in 5.91 seconds for 43.75 points. At the Touring Pro Division event in Salinas, California, held in conjunction with the California Rodeo Salinas, he bucked off Wallace Vieira de Oliveira in 1.72 seconds for a score of 45.50. He had the highest score, so he was named Bull of the Event. The bull's record so far this season was 6-0. His record to date got him into the World Champion Bull race.[19][11][3]\n\nIn August, Spotted Demon was ranked the No. 2 bull in the PBR World Champion Bull standings. However, the bull wasn't idle in the summer. He spent it in the PRCA in four substantial outs, with three 47s and one 48 point bull score. The bull was 10 years old; those scores were not typical at his age.[20] Owner Julio Moreno said that he became a partner with Dallas Schott on the bull when he was six years old. It happened after Moreno's World Champion Bull contender Roy, who was a half-brother to Bushwacker, had to be put down. Roy had broken both front legs at a BFTS event in 2016. Roy had a championship round average of over 45 points. Even with broken legs, the bull had the character to earn a bull score of 46.5 during that out.[20] So, Schott offered Moreno a buy-in on several bulls, but Moreno was not impressed with Spotted Demon's bucking at first.[20] He related that the bull needed to drop some weight; that he loved to eat.[18][16][20] Moreno put the bull on his special program to get the bull in shape.[18][20] Spotted Demon did not appreciate the new feeding program, and he let Moreno know it.[20] However, the program had significant results.[20] In 2014, Spotted Demon had an average bull score of 40.792. In 2015, his average bull score climbed to 44.219 bull points. His average bull score was now 45.04 bull points. Moreno believed that the 10-year-old bull now bucked like a one-year-old bull. And he attributed it directly to his feeding program. Spotted Demon was now a bull that riders want to ride. He had a proud attitude when Moreno walked him up the alleyway to exercise. But on the other hand, he got along with the other bulls in the pens.[20]\n\nAs of August 9, Julio Moreno claimed Spotted Demon as his top bull. He had plans to bring Spotted Demon to the UTB event in Springfield, Missouri, in September to get another out, as the bull needed two more outs to become eligible for the PBR World Champion Bull title.[21] However, Moreno didn't get to Springfield, so he had Spotted Demon take two outs at the UTB event in Nampa, Idaho. First, Spotted Demon bucked off Marco ",
  "concepts": [
    "Spotted Demon (bull)",
    "bull",
    "points",
    "spotted demon",
    "spotted",
    "demon",
    "score",
    "bucked",
    "event",
    "seconds",
    "pbr"
  ],
  "findings": [
    "Background",
    "Career",
    "Season 2013",
    "Season 2014",
    "Season 2015",
    "Season 2016",
    "Season 2017",
    "Season 2018",
    "Season 2019",
    "Season 2020",
    "References",
    "Bibliography",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:24.090320"
}