{
  "title": "Wisconsin Plan",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Wisconsin_Plan",
  "content": "The Wisconsin Plan (also known as the Wales Plan and Canada Plan; originally Continuous Mediation Without Armistice)[1] was a proposal created by Julia Grace Wales to end the First World War.[2]\n\nJulia Grace Wales was a Canadian-born Wisconsin university professor who was deeply troubled by reports of the war. She spent the autumn of 1914 considering possible methods for finding a peace solution.[2][3] The United States was neutral at the time, and President Woodrow Wilson asked his compatriots to remain \"impartial in thought\". In December, Wales prepared a plan. She proposed that the United States organize a conference (a \"world thinking organ\") composed of delegations from neutral countries, who would mediate between the warring powers and disseminate peace proposals, with the goal of eventually reaching a fair settlement. The conference was to last for as long as the war continued.[2][3][4] Two main principles were meant to guide the mediators: no nation could be humiliated by the peace, and there could be no compromises that could later lead to another war.[3] The plan was carefully revised many times.[2]\n\nThe newly formed Wisconsin Peace Party and the National Peace Party, led by Jane Addams, both endorsed Wales' plan. The former party started printing and distributing the Wisconsin Plan as pamphlets in early 1915. The National Peace Party sent a delegation to present the idea to President Wilson and to the United States Congress, to which it was recommended by Wisconsin's Senator Robert M. La Follette, Sr.[3] Rosika Schwimmer, who had independently devised a similar idea, proposed the plan at the International Congress of Women, and Wales seconded it.[2] The ICW received several proposals but unanimously agreed that the Wisconsin Plan was the most plausible method. Thousands of pamphlets, printed in four languages, were distributed in Europe and North America.[3]\n\nWilson appeared to be interested in the proposal, but the sinking of the RMS Lusitania by the Germans in March 1915 and the resulting deaths of 1,198 people (128 of whom were U.S. citizens) brought about an uncertainty about the neutrality policy, leading government officials to back away from mediation. The industrialist Henry Ford started advocating the Wisconsin Plan and accompanied Wales to Europe, but the movement began declining. The United States entered the war in April 1917, rendering the plan a dead letter.[3]\n",
  "concepts": [
    "Wisconsin Plan"
  ],
  "findings": [
    "Origin and purpose",
    "Reactions",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:08:12.980370"
}