{
  "title": "Dream of Love (Adventure Time)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Dream_of_Love_(Adventure_Time)",
  "content": "\"Dream of Love\" is the fourth episode of the fourth season of the American animated television series Adventure Time. The episode was written and storyboarded by Bert Youn and Somvilay Xayaphone, from a story by Patrick McHale, Kent Osborne, and Pendleton Ward. It originally aired on Cartoon Network on April 23, 2012. The episode guest stars Ron Lynch as Mr. Pig.\n\nThe series follows the adventures of Finn (voiced by Jeremy Shada), a human boy, and his best friend and adoptive brother Jake (voiced by John DiMaggio), a dog with magical powers to change shape and grow and shrink at will. In this episode, Tree Trunks (voiced by Polly Lou Livingston) is courted by Mr. Pig, but their over-expressive love begins to make many people uncomfortable. The two are separated, but due to the power of their love, they are allowed to be reunited.\n\nThe episode contains the eponymous song, which was crafted by McHale to be reminiscent of a duet between Dolly Parton and Meat Loaf. Together with other Cartoon Network programming, \"Dream of Love\" helped the network rank as the number one television destination for boys aged 2–11, 6–11, and 9–14 on Monday nights. The episode received mixed critical reviews; Oliver Sava of The A.V. Club felt that the episode was juvenile, whereas Mike Lechevaillier of Slate magazine praised the installment for its original and effective presentation of the nature of relationships.\n\nFinn and Jake venture to Tree Trunks's (voiced by Polly Lou Livingston) house to acquire apple pie. While there, they discover that Tree Trunks has entered into a relationship with Mr. Pig (voiced by Ron Lynch). Finn asks Tree Trunks if she would be willing to make apple pie for Princess Bubblegum's musical concert, to which she agrees. Later at the concert, however, Tree Trunks and Mr. Pig arrive, sans apple pie. During the performance, Mr. Pig and Tree Trunks begin to passionately kiss, which makes the entire audience feel uncomfortable.\n\nAfter the concert, the two are told to stop displaying their affection in public. However, try as they might, they are unable to restrain their love for one another. As a last-ditch effort, Finn and Jake physically separate and isolate the two. Distressed, both fall into a depression and perform the song \"Dream of Love\", which expresses their sadness. The song is so moving that both Finn and Jake allow Tree Trunks and Mr. Pig to be reunited. Their relationship still manages to disgust people, although Finn and Jake are no longer worried about how Tree Trunks and Mr. Pig behave.\n\n\"Dream of Love\" was written and storyboarded by Somvilay Xayaphone and Bert Youn, from a story developed by series creator Pendleton Ward, Patrick McHale, and Kent Osborne.[2] Ward later admitted in the DVD commentary for the episode that while he and the show's storyline writers had fun developing the premise to \"Dream of Love\", the finalized episode was somewhat \"weird\" and \"gross\", due to the excessive amount of kissing between Tree Trunks and Mr. Pig.[3]\n\nRon Lynch reprises his role as Mr. Pig in the episode; after production of \"Apple Thief\" was finished, Ward insisted that Mr. Pig to come back because he felt that both the character and Lynch's voice acting were funny.[4] The titular song was written by McHale. When he was writing and recording the demo version, McHale, who has a penchant for \"smooth music\",[5] envisioned the female part to sound like Dolly Parton, and for the male part to be reminiscent of Meat Loaf.[6] McHale later released the demo version on his Twitter account.[7]\n\n\"Dream of Love\" first aired on Cartoon Network on April 23, 2012. Together with other episodes of Cartoon Network programming, \"Dream of Love\" helped the network rank as the number one television destination for boys aged 2–11, 6–11, and 9–14 on Monday nights, according to Nielsen ratings.[8] The episode first saw physical release as part of the complete fourth season DVD in October 2014.[9]\n\nOliver Sava of The A.V. Club awarded the episode a \"C−\", noting that episode's plot was \"juvenile\" when compared to other Adventure Time episodes that deal with relationships.[10] Despite this, Sava complimented the show for exploring the idea that while public displays of affection may cause some to feel uneasy, people should not have to hide their affection so as to appease others. Sava also felt that the titular song was \"an easy way of conveying a lot of feeling in a short amount of time\".[10]\n\nMike Lechevaillier of Slate magazine, in a review of the fourth season, argued that the episode \"present[s] determinedly adult interrelations through the eyes of the inexperienced Finn\" and delves \"into the societal rift created by the public displays of affection between a tiny pachyderm and a pig (complete with Beat Happening-style musical number).\"[11] Lechevaillier compared and contrasted the episode with the previous episode \"Web Weirdos\", noting that both deal with relationships in different ways, \"yet do so with such originality, humbleness, and poise that any viewer, from age six to 60, can find something to identify with.\"[11]\n",
  "concepts": [
    "Dream of Love (Adventure Time)"
  ],
  "findings": [
    "Plot",
    "Production",
    "Reception",
    "Explanatory notes",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:18:24.854175"
}