{
  "title": "1971 Philippine Senate election",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/1971_Philippine_Senate_election",
  "content": "Gil Puyat\nNacionalista\n\nGil Puyat\nNacionalista\n\nA senatorial election was held on November 8, 1971 in the Philippines. The opposition Liberal Party won five seats in the Philippine Senate while three seats were won by the Nacionalista Party, the administration party; this was seen as a consequence of the Plaza Miranda bombing on August 21, 1971, which wounded all of the Liberal Party's candidates and almost took the lives of John Henry Osmeña and Jovito Salonga. Their terms as senators were cut short as a result of the declaration of martial law by President Ferdinand Marcos on September 23, 1972.\n\nDue to the ratification of a new constitution in 1973, the Senate was abolished and the unicameral parliamentary Batasang Pambansa was instituted. In 1987, a new constitution was approved that reverted to the presidential and bicameral legislative system. This means that this would be the last election for the Senate until the 1987 election.\n\nPhilippine Senate elections are held via plurality block voting with staggered elections, with the country as an at-large district. The Senate has 24 seats, of which 8 seats are up every 2 years. The eight seats up were last contested in 1965; each voter has eight votes and can vote up to eight names, of which the eight candidates with the most votes winning the election.\n\nThe Liberal Party won five seats, while the Nacionalista Party won three.\n\nTwo Liberal incumbents successfully defended their seats: Genaro Magsaysay and Jovito Salonga, while Alejandro Almendras and Eva Estrada Kalaw of the Nacionalistas successfully defended their seats, as well.\n\nThe other four winners are neophyte senators: Eddie Ilarde, Ramon Mitra Jr., and John Henry Osmeña of the Liberals, and Ernesto Maceda of the Nacionalistas.\n\nNacionalista Senator Dominador Aytona lost his reelection bid.\n\nKey:\n",
  "concepts": [
    "1971 Philippine Senate election"
  ],
  "findings": [
    "Electoral system",
    "Retiring incumbents",
    "Results",
    "Per candidate",
    "Per party",
    "Defeated incumbents",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:13:13.075052"
}