{
  "title": "Mato Franković",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Mato_Franković",
  "content": "Mato Franković (listenⓘ; born 23 February 1982) is a Croatian politician who has been mayor of Dubrovnik since 2017.[1] A member of the Croatian Democratic Union (HDZ), he served as a member of the Croatian Parliament from 2016 to 2017, and is serving since 2020.[2][3]\n\nFranković was born in Dubrovnik. He finished elementary school in Ponikve [hr] on the Pelješac peninsula, and first three grades of high economic school in his hometown.[4]\n\nHe continued his education in the United States, where he finished fourth grade of high school through an international student exchange program. After Franković came back to Croatia, he enrolled the Rochester Institute of Technology and obtained a high school qualification Associate in Applied Sciences.[4]\n\nIn 2003 Franković started to work in Generalturist tourist agency, where he passed all positions from airport operative through operations manager all the way to branch manager and regional director and director of subsidiary Lanta Generalturist in Montenegro.[4]\n\nIn 2009 Franković was appointed as the director of ACI Marina Dubrovnik. In the last seven years under his leadership, ACI Marina Dubrovnik has won seven awards for the best marina in category of medium marina, and financially the last five years has recorded the best results in the chain of ACI marinas.[4]\n\nHe retained position of the director of ACI Marina Dubrovnik for eight years, up until the year 2017, when he was elected Mayor of Dubrovnik. He also took on the role of regional coordinator for covering the South Adriatic region (2013–2015).[5]\n\nFranković was also chairman of Hotel Maestral's advisory board (2006–2012). At the regular election assembly of the Croatian Tourist Board (HTZ) in 2016, he was elected to the tourist board of the HTZ, the so-called tourist government of the country.[4]\n\nFranković is an active member of the ruling Croatian Democratic Union (HDZ) and has been chairman of party's branch in Dubrovnik since 2014.[4][6]\n\nFranković served as a member of Dubrovnik-Neretva County in three terms, and as president of the Dubrovnik City Council from 2015 until January 2017.[4][7]\n\nIn the 2016 Croatian parliamentary election, Franković was elected as a member of the Croatian Parliament and until 9 June 2017, when he took the mayor role, served as member of the parliament's Committee on Local and Regional Self-Government, the Committee on Tourism and the Committee on Inter-Parliamentary Cooperation.[2][4]\n\nIn the 2017 local elections, Franković was elected Mayor of Dubrovnik.[8] He was reelected as mayor in the 2021 local elections.[9]\n\nIn the 2020 Croatian parliamentary election, Franković was reelected to the Croatian Parliament and became member of the parliament's Committee on Tourism and the Committee on Inter-Parliamentary Cooperation.[3]\n\nIn July 2024 Franković faced criticism for his use of a fascist greeting Za dom spremni during the opening ceremony of a memorial park in Cista Velika in Cista Provo municipality.[10] The event honoured fallen Croatian Defence Forces soldier Mate Vučko Čigra and was attended by Deputy Prime Minister Tomo Medved and other officials.[10] Franković's use of the phrase, historically associated with the Ustashe regime and later adopted by the Croatian Defense Forces in 1991, sparked a public debate.[10][11] Franković subsequently explaining that the greeting deserves condemnation when associated to the quisling Ustaše regime but asserted his belief that the phrase symbolized legitimate resistance in the 1990s.[11]\n\nThis article about a mayor in Croatia is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Mato Franković",
    "franković",
    "croatian",
    "dubrovnik",
    "member",
    "mayor",
    "2017",
    "parliament",
    "marina",
    "committee",
    "tourist"
  ],
  "findings": [
    "Early life and education",
    "Business career",
    "Political career",
    "Controversies",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:09.835815"
}