{
  "title": "Coronation of George III and Charlotte",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Coronation_of_George_III_and_Charlotte",
  "content": "The coronation of George III and his wife Charlotte as king and queen of Great Britain and Ireland took place at Westminster Abbey, London, on Tuesday, 22 September 1761, about two weeks after they were married in the Chapel Royal, St James's Palace. The day was marked by errors and omissions; a delayed procession from Westminster Hall to the abbey was followed by a six-hour coronation service and then a banquet that finally ended at ten o'clock at night.\n\nOn the death of his grandfather, George II, George ascended to the throne on 25 October 1760 at the age of 22.[1] The young king was yet to be married, and so he inquired Lord Bute on suitable Protestant German princesses to be his wife and consort. In July 1761, it was decided that the King would marry the 17-year-old Princess Charlotte of Mecklenburg-Strelitz, who lacked interest in political affairs much to George's favour.[2][3]  After she arrived at St James's Palace accompanied by her brother, Duke Adolphus Frederick, on 8 September 1761 to meet the King, George and Charlotte were married at the Chapel Royal, St James's Palace the same day.[3] They were married just in time for the coronation ceremony two weeks later.\n\nThe coronation was budgeted at £9,430[4] (some sources give a figure of around £70,000.[5]) By tradition, ceremonial preparations ought to have been conducted by the hereditary Earl Marshal, Edward Howard, 9th Duke of Norfolk; however, being a Roman Catholic, he was debarred, and the role was deputised to his distant relative, Thomas Howard, 2nd Earl of Effingham.[6] The liturgy of the coronation service was the responsibility of the Archbishop of Canterbury, Thomas Secker, who made only minimal changes from the previous service, mainly to accommodate the consort's coronation and to reflect the fact that Britain was in the course of fighting the Seven Years' War with France.[7]\n\nThe abbey building was transformed with numerous wooden galleries erected in the quire for Members of Parliament, ambassadors and musicians, while in the nave, three tiers of galleries for the public were built into the arcade.[8] Tickets for a front seat cost 10 guineas (£10.50) each, while a higher box of twelve seats cost 50 guineas (£52.50).[9] The builders boasted that they had damaged \"a whole legion of angels\" during the construction work.[10]\n\nWestminster Hall was also transformed, as it was generally divided by wooden partitions into various courtrooms. A wooden floor was installed, along with three tiers of galleries for spectators. The highest of these was attached to the hammerbeams of the roof,[11] while the lowest was fitted with a sluice \"for the reception of urinary discharges\".[12] Over the north door, a triumphal arch designed by William Oram was erected,[12] surmounted by a balcony for musicians and a pipe organ. Illumination was provided by twenty-five huge chandeliers. Outside, temporary stands giving a view of the procession between the hall and the abbey were erected by enterprising builders, some seating up to 1,500 people, while renting a house which overlooked the scene for the day, could cost up to £1,000.[13]\n\nA Gold State Coach, an enclosed, eight-horse-drawn carriage, was commissioned for £7,562 (£3.54 million = US$4.188 million in 2022, adjusted for inflation)[14][15] for the coronation in 1760 by Francis Rawdon-Hastings, 1st Marquess of Hastings, and designed by Sir William Chambers. It was built in the London workshops of Samuel Butler. It was not ready in time;[16] it was completed in 1762, and used for the coronation of every British monarch since William IV in 1831.\n\nThe coronation proved to be an anticipated affair, for the morning of the ceremony was marked with crowded streets as well as overflown inns, rooms, and homes waiting for the appearance of the new king and queen. Reportedly a great many carriages hastily arrived at Westminster Abbey on the day of the coronation, many of them colliding in ensuing chaos. At around 9:00 am, George and Charlotte departed from St James's Palace and were carried separately to Westminster Hall in sedan chairs, where invited nobility, government officials and members of the royal household had gathered.[17]\n\nFollowing ancient tradition, the assembled participants in the hall awaited the arrival of a procession of senior clergy from the abbey bearing the crowns and regalia; these were then distributed to those who had the right to carry them in the main procession from the hall to the abbey.[18] On this occasion, there was a lengthy delay because the deputy earl marshal had forgotten some important items; no chairs had been provided for the king and queen, there was no sword of state, so one had to be borrowed from the Lord Mayor of London, and also there was no canopy under which the king and queen were supposed to process and one had to be improvised.[19][20]\n\nThe short procession on foot between Westminster Hall and Westminster Abbey was the only part of the ceremonial to be visible to the general public and a huge crowd filled not only the pavements but also the windows and roofs of the surrounding houses, as well as specially built wooden grandstands. The route ran from New Palace Yard, along Parliament Street, Bridge Street and King Street to the west door of the abbey, along which a temporary wooden walkway had been constructed, 3 feet (0.91 m) high and 15 feet (4.6 m) wide so that the participants could be seen more easily. However, the 2,800 soldiers standing on either side obstructed the view and they had to beat back the eager crowds with the flat side of their swords and the butts of their muskets.[21] The King and Queen entered the Abbey shortly after 1:30 p.m., with the dignity of the royal couple and the “reverent attention which both paid to the service” being favourably commented on.[17] The procession and ceremony were so long the King was not crowned until 3:30 that afternoon.[22]\n\nThe coronation ceremony was conducted by Archbishop Secker. The first part of the ceremony, the recognition and oath, required the congregation to give their assent by shouting \"God save King George\", after which the king swore and signed the coronation oath. At this point, a brief 15-minute sermon was given by the Bishop of Salisbury, Robert Hay Drummond[23][24] (some sources incorrectly state that it was given by the archbishop[17]). Then followed the anointing with holy oil, the investing with the regalia and at the climax of the ceremony, crowned King of Great Britain and Ireland by the archbishop. This point in the service was reached at 3.30 pm; it was accompanied by trumpet fanfares in the abbey and a man perched high on the roof gave a signal for the firing of gun salutes in Green Park and on the other side of the city at the Tower of London. The enthronement and homage saw each of the peers in turn pledge their loyalty, during which, gold and silver coronation medallions were scattered amongst the congregation. This was followed by the queen's briefer crowning and finally the king and queen received Holy Communion.[25] After changing out of their ceremonial robes, the king, queen, nobles and bishops processed back to Westminster Hall in the same order in which they had come; the service had lasted six hours and it was dark by the time that they left the abbey.[26]\n\nOn the way to the abbey, the Bishop of Rochester nearly dropped the crown he was carrying; fortunately it had been pinned to the cushion on which it sat.[19] One spectator noted that the heralds made \"numerous mistakes and stupidities\", another that \"the whole was confusion, irregularity and disorder\".[27] The King felt it inappropriate to take Communion wearing his crown, and asked the archbishop if it should be removed, the archbishop in turn asked the Dean of Westminster, but had to report that neither knew what the usual form was; the king removed his crown anyway.[28] At some point in the proceedings, a large jewel is reputed to have fallen from the crown, which was later said to have been an omen presaging American Independence.[29][30] During the sermon, the congregation in the nave who were unable to hear it, began to eat, mainly cold meat and pies, and drink wine brought with them and given out by servants; the ensuing clatter of cutlery resulted in an outburst of laughter. When the queen wanted to visit the \"retiring-chamber\" which had been constructed for her use in St Edward's Chapel behind the high altar, she found it already occupied by the Duke of Newcastle, prime minister, who was making use of the queen's close stool.[31] When the king complained to Effingham about these problems, he admitted that there had been \"some neglect\", but that he would make sure that the next coronation would be organised properly (when, of course, the king would be dead). George was highly amused by the answer and made Effingham repeat it several times.[32][20]\n\n1761 is the only known coronation where almost all the music was written by the same composer, William Boyce, who was the master of the king's music. Boyce believed, probably incorrectly, that he had been commissioned to write new musical settings for all of the traditional coronation texts. Although he completed eight choral pieces for the service,[33] he wrote to Archbishop Secker declining to rewrite the music for the anthem Zadok the Priest because \"it cannot be more properly set than it has already been by Mr. Handel\" (Handel had written four of the anthems at the previous coronation). The archbishop wrote back to say that the king had agreed, and Handel's setting of Zadok has been used at every coronation since.[34] Boyce's setting of the entrance anthem, I was glad, was probably sung in two parts to allow the boys of Westminster School to shout their traditional Vivat! acclamation.[35]\n\nThe combined choirs of Westminster Abbey and the Chapel Royal probably numbered 42 singers and there was an orchestra of about 105 musicians. The choir was arranged in the front rows of the galleries that had been erected in the eastern end of the abbey, with the orchestra in a gallery over the rood screen. Boyce asked for the top of the tall reredos of the high altar to be dismantled so that all the choristers could see the conductor, but even so, an assistant conductor was required.[36] The music seems to be the only element of the coronation to have gone without a hitch, perhaps because Boyce held three full rehearsals in the abbey, to which the public were admitted by ticket, the last being on the day before the service.[37]\n\nThe ceremony ended with a coronation banquet, the Lord Steward, the Lord High Constable and the deputy Earl Marshal presided on horseback. The distinguished diners had to sit in the dark until, on the entry of the king and queen, all 3,000 candles were lit almost at once by means of a network of linen tapers[38] which, while spectacular, showered the guest with flakes of ash.[39]\n\nHere again, poor organisation came into play, much of the blame for which attached to the Lord Steward, William Talbot, Earl Talbot, a boxing enthusiast who was noted for his \"swaggering manners and rude demeanour.\" No tables were provided for the Barons of the Cinque Ports and the aldermen of the City of London, who ought to have had prominent places set for them. The aldermen were given the table of the Knights of the Bath, who in turn displaced the Great Officers of State.[12] The unfortunate Cinque Port barons were only silenced by Talbot challenging them to a duel. Talbot had carefully trained his horse to walk backwards away from the thrones, however the horse could not be prevented from repeatedly entering the hall backwards with its hindquarters towards the king, causing much mirth among the onlookers.[40]\n\nBetween the first and second courses, the hereditary King's Champion, John Dymoke, entered the hall in full armour, allegedly mounted on the same grey horse that King George II had ridden at the Battle of Dettingen eighteen years earlier.[41] Spectators reportedly let down baskets and handkerchiefs to the eaters at the banquet tables below, who would send up chicken and wine.[42] The banquet finally ended at 10 pm when the king and queen left in their sedan chairs; as tradition demanded, the doors of the hall were then thrown open to the public, who carried off anything that had been left behind,[43] including plates, cutlery and table cloths.[44]\n\nIn London, large crowds celebrated in the streets. Although the Privy Council had forbidden bonfires to be lit on coronation night for safety reasons, this seems to have been widely ignored, despite the patrolling troops of cavalry. The prime minister, the Duke of Newcastle, had one lit outside his London home and gave away beer to the crowds, while others illuminated their houses with lanterns. Elsewhere, Coronation Day was marked by thanksgiving services in churches, civic banquets, fireworks and feasts laid on for the poor by wealthy benefactors.[45] In the following weeks the theatres in the West End of London staged elaborate recreations of the coronation; the show at the Theatre Royal, Drury Lane ended with \"a real bonfire and a real mob\" on stage, while the production at the Theatre Royal, Covent Garden featured the actual choir of Westminster Abbey.[46]\n",
  "concepts": [
    "Coronation of George III and Charlotte"
  ],
  "findings": [
    "Background",
    "Preparations",
    "Procession",
    "Service",
    "Mishaps",
    "Music",
    "Banquet",
    "Other celebrations",
    "References",
    "Sources"
  ],
  "timestamp": "2025-04-11T10:12:49.278202"
}