{
  "title": "Buster Brown",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Buster_Brown",
  "content": "Buster Brown is a comic-strip character created in 1902 by Richard F. Outcault. Adopted as the mascot of the Brown Shoe Company in 1904, Buster Brown, along with Mary Jane, and with his dog Tige, became well known to the American public in the early 20th century; the character's name was applied to a popular style of suit for young boys, the Buster Brown suit, that reflected his outfit.[1][2][3]\n\nThe character of Buster Brown was loosely based on Granville Hamilton Fisher, a son of Charles and Anna Fisher of Flushing, New York. Fisher's physical appearance, including the characteristic pageboy haircut, was copied by Outcault and given to Buster Brown. The name \"Buster\" came directly or indirectly from the popularity of Buster Keaton, then a child actor in vaudeville.[4] Another boy, Roger Cushman Clark (1899–1995) of Deadwood, South Dakota, was also described as the \"original model\" for the Buster Brown character.[5][6]\n\nThe character of Mary Jane was also drawn from real life, as she was also Outcault's daughter of the same name. In Outcault's own words—and his daughter's—she was the only character drawn from life in the Buster Brown strip, although \"Mrs. Brown\" did resemble Outcault's wife.[citation needed]\n\nThe comic strip began in the New York Herald on May 4, 1902. Outcault left for William Randolph Hearst's employ in January 1906, and after a court battle, Outcault continued his strip, now nameless, in Hearst papers, while the Herald continued their own version of Buster Brown with other artists. The latter lasted until January 1911, and Outcault's version until May 13, 1923.[7]\n\nThe character of Buster Brown inspired many imitators, including Perry Winkle from the Winnie Winkle newspaper strip, and the Bobby Bumps animated film series.\n\nThe series was translated into Portuguese and published in the Brazilian children's magazine O Tico-Tico[8] (where Buster Brown was known as Chiquinho); its stories were loosely adapted by Brazilian writers.\n\nBuster Brown is a young city-dwelling boy with wealthy parents. He is disturbingly pretty (contrast him to Outcault's own The Yellow Kid, or Frederick Opper's creations), but his actions belie his looks. He is a practical joker who might dress in a girl's outfit and have her wear his clothes, break a window with his slingshot, or play a prank on a neighbor. The trick or transgression is discovered and he is punished, usually by being spanked by his mother, but it is unclear if he ever repents. Many strips end with Buster delivering a self-justifying moral which has little or nothing to do with his crime.  For example, a strip from May 31, 1903, shows him giving Tige a soda from a drugstore soda fountain.  The drink splashes, not only the front of his own clothes, but the skirts of a woman's splendid dress.  Horrified by his clumsy misadventure, Buster's mother takes him home and flogs him with a brush.  In the last panel the boy has written a message beginning, \"Resolved! That druggists are legalized robbers; they sell you soda and candy to make you ill, then they sell you medicine to make you worse.\"\n\nMary Jane is Buster's girlfriend.\nShe is based on R. F. Outcault's daughter of the same name.\nHer parents are never mentioned, though at many of the comic headers there are letters addressed to her from her mother.\nShe has curly black hair and brown eyes.\nShe usually wears a blue, frilly dress, a large bow, and Mary Jane shoes with black stockings.\n\nTige is thought to be the first talking pet to appear in the comics. Unlike the characters presented under this trope, Tige's speech is acknowledged by adults, and many are shocked by this. This popular character was the subject of a book in 1905 with the title, \"Tige\" His Story.\n\nOutcault traveled to the 1904 St. Louis World's Fair, selling licenses to up to 200 companies to use the Buster Brown characters to advertise their products. Buster Brown's association with shoes began with John Bush, a sales executive with the Brown Shoe Company; he persuaded his company to purchase rights to the Buster Brown name, and the brand was introduced to the public at the 1904 World's Fair.\n\nLittle people were hired by the Brown Shoe Co. to play Buster in tours around the United States. These actors, each accompanied by a dog, performed in department stores, theaters and shoe stores from 1904 until 1930. Richard Barker played Buster Brown in many of these Brown Shoe Company advertising campaigns; his story is told in a biography called Buster Brown and the Cowboy.\n\nIn the 1940s and '50s, the Brown Shoe Company made a foray into the comic book publishing industry with Buster Brown Comics, on which a retailer could rubber-stamp their address.[9] The comics featured the characters on the cover, but contained different adventure features, such as Robin Hood.\n\nThe characters were revived with an updated, more contemporary look for a brief advertising campaign in the 1980s and 1990s.[10]\n\nBuster Brown comics were given away as premiums in shoe stores from 1945 to 1959. Some contain art by Reed Crandall and other notable cartoonists. In the 1950s other comics based on the radio show were produced by Custom Comics and Dell Comics, and a coloring book was also produced.\n\nA series of live-action two-reelers were produced from 1925 to 1929 by the Stern Bros. for Universal Pictures. Buster was played by the actor Arthur Trimble. Pal the Wonder Dog (who played Tige) and director Gus Meins were both later associated with the popular Our Gang (Little Rascals) comedies, where Pal at some point came to be known as Pete the Pup, a name inherited by one of his pups, who carried on the role after Pal died of poisoning in 1930.\n\nIn 1905, a play was performed on Broadway at the Majestic titled Buster Brown. It starred a 21-year-old adult dwarf actor named Master Gabriel (1882–1929), born Gabriel Weigel.[11] Photos of Master Gabriel in the role show him very convincing as a child.[12] Gabriel appeared in another children's-oriented play in 1908 Little Nemo and a return engagement as Buster Brown in 1913.[13] It also featured famous animal actor George Ali as Tige.\n\nA Buster Brown radio series began in 1943 with Smilin' Ed McConnell on the West Coast NBC Radio Network.[14] It included such characters as Froggy the Gremlin (\"Plunk your magic twanger, Froggy!\")[9] and Midnight the Cat (\"What do you say to the kids, Midnight?\" \"Nice.\")[15]\n\nMcConnell moved the show to television in 1950, where it ran under the titles Smilin' Ed's Gang and The Buster Brown Show for four years.[14] Andy Devine took over in 1955 after McConnell's death, but Devine's show was titled Andy's Gang.[16]\n\nBuster Brown makes an appearance in several children's playground games.  There is a skipping rope rhyme that starts \"Buster Brown | Went to town | With his pants | On upside down.\"[17] There is also a game played on a seesaw where one rider will stop the seesaw with the other rider in the air and chant, \"Buster, Buster, Buster Brown, what will you give me if I let you down?\"  The rider stuck in the air then offers an imaginary payment of grandiose proportions (e.g., \"every Barbie doll ever\", \"the Moon and all the stars\").[18][19]\n",
  "concepts": [
    "Buster Brown"
  ],
  "findings": [
    "Origins",
    "Publication history",
    "Characters and story",
    "Buster Brown",
    "Mary Jane",
    "Tige",
    "Brown Shoe Company mascot",
    "In other media",
    "Comic books",
    "Film",
    "Theater",
    "Radio",
    "Television",
    "Playground games",
    "Gallery",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:24:14.057555"
}