{
  "title": "Survivor Series",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Survivor_Series",
  "content": "Survivor Series, branded as Survivor Series: WarGames since 2022, is a professional wrestling event produced annually since 1987 by WWE, the world's largest professional wrestling promotion. Held in November generally the week of Thanksgiving, it is the second longest-running pay-per-view (PPV) event in history, behind WWE's flagship event, WrestleMania. In addition to traditional PPV since the inaugural 1987 event, it has aired via livestreaming since the 2014 event. It is also considered one of the company's five biggest events of the year, along with WrestleMania, Royal Rumble, SummerSlam, and Money in the Bank, referred to as the \"Big Five\".\n\nFrom 1987 to 2021, the event was characterized by having Survivor Series matches, which were tag team elimination matches that typically featured teams of four or five wrestlers against each other. Stipulations had also been added to these matches, such as members of the losing team being (kayfabe) fired. During these years, only two events did not feature Survivor Series matches: the 1998 event, which hosted an elimination tournament for the vacant WWF Championship (now WWE Championship), and the 2002 event, which saw the debut of the Elimination Chamber, a type of six-person steel cage match won by eliminating all other opponents. Since 2022, the event has been based around WarGames matches for the men and women. WarGames is a team-based steel cage match where the roofless cage surrounds two rings placed side by side and the two teams typically have four to five members each but it is decided by one fall instead of eliminating all opponents. As a result, the events since 2022 have also not featured Survivor Series matches.\n\nAfter WWE reintroduced the brand extension in 2016, the events from 2016 until 2021 centered around competition between wrestlers from the Raw and SmackDown brands for brand supremacy; NXT was also involved in 2019. In addition to Survivor Series matches between the brands, the champions of each brand faced off in non-title matches. In 2022, the brand supremacy concept was dropped and the event was rebranded as \"Survivor Series: WarGames\", marking WWE's first main roster event to feature the match; NXT had its own WarGames event from 2017 to 2021 and it was discontinued after the match was moved to Survivor Series in 2022.\n\nThe first Survivor Series, held in 1987,[1] came on the heels of the success of WrestleMania III, as the World Wrestling Federation (WWF) began to see the lucrative potential of the pay-per-view (PPV) market. The first event capitalized on the big time feud between André the Giant and Hulk Hogan, who wrestled each other at WrestleMania III. Survivor Series was originally created to counter WCW's Starrcade. The first eight Survivor Series events took place on either Thanksgiving Day (1987–1990) or Thanksgiving Eve (1991–1994). Beginning with the 1995 event, Survivor Series was held on various Sundays before Thanksgiving. The 2005 and 2006 events were held on the Sunday after Thanksgiving, while the 2022 and 2023 events were held on the Saturday after Thanksgiving. The 1997 event was notorious as it featured the Montreal Screwjob.[2] Survivor Series was going to be discontinued and rebranded in 2010,[3][4] but following fan outcry, the company decided to continue with the event.[5] Survivor Series became the second longest running PPV event in history (behind WrestleMania),[6] and is also regarded as one of the \"Big Four\" pay-per-views, along with WrestleMania, Royal Rumble, and SummerSlam, the promotion's original four annual events and their four biggest events of the year.[7] From 1993 to 2002, it was considered one of the \"Big Five\", including King of the Ring, but that PPV event was discontinued after 2002.[8]  In August 2021, Money in the Bank became recognized as one of the \"Big Five\".[9][10]\n\nIn May 2002, the WWF was renamed to World Wrestling Entertainment (WWE) following a lawsuit with the World Wildlife Fund over the \"WWF\" initialism.[11] In April 2011, the promotion ceased using its full name with the \"WWE\" abbreviation becoming an orphaned initialism.[12] Also in March 2002, the promotion introduced the brand extension, in which the roster was divided between the Raw and SmackDown brands where wrestlers were exclusively assigned to perform[13]—ECW became a third brand in 2006.[14] The first brand extension was dissolved in August 2011,[15] but it was reintroduced in July 2016.[16] Survivor Series, along with the other original \"Big Four\" events, were the only PPVs to never be held exclusively for one brand during either brand split periods. In 2014, Survivor Series began to air on WWE's online streaming service, the WWE Network, which launched in February that year,[17] and in 2021, the event became available on Peacock as the American version of the WWE Network merged under Peacock in March that year.[18]\n\nAs a result of the COVID-19 pandemic in early 2020, WWE had to present the majority of its programming for Raw and SmackDown from a behind closed doors set at the WWE Performance Center in Orlando, Florida, beginning mid-March.[19] In August, these events were relocated to WWE's bio-secure bubble, the WWE ThunderDome, hosted at Orlando's Amway Center.[20][21][22] The 2020 Survivor Series was in turn produced from the ThunderDome[23][24] and was WWE's final PPV to present the ThunderDome from the Amway Center, as in early December, the ThunderDome was relocated to Tropicana Field in St. Petersburg, Florida.[25] In July 2021, WWE resumed live touring with fans.[26]\n\nDuring the first brand extension period (2002–2011), there were only a few Survivor Series matches that were held between wrestlers of the two brands (e.g., Team Raw vs. Team SmackDown), but it was not the focus of the event. However, with the return of the brand split in 2016, Survivor Series took on the theme of direct competition between the Raw and SmackDown brands for brand supremacy, similar to the former Bragging Rights events held during the first brand split in 2009 and 2010.[27][28][29] In addition to traditional Survivor Series matches pitting the men and women from the two brands against each (2016 and 2018 also featured matches with the brands' tag teams going against each other), there were interpromotional matches that featured the brands' champions against each other in non-title matches (e.g., the Raw Women's Champion vs. the SmackDown Women's Champion).[30]\n\nThe 2016, 2017, and 2018 events were contested between Raw and SmackDown. The 2016 event[31][32] was the genesis for what became the theme of brand supremacy that began in 2017. In 2017 and 2018, Raw won the competition with a score of 4–3 and 6–1, respectively (SmackDown's one point in 2018 occurred on the Kickoff pre-show).[33][34][35][29] The 2019 event saw the addition of the NXT brand, which previously served as WWE's developmental territory but became one of WWE's three main brands in 2019, and in turn featured the first three-way Survivor Series elimination matches for men and women. NXT subsequently won that year's competition with a 4–2–1 victory, with SmackDown having 2 points, and Raw's sole win occurring on the pre-show.[36][37] NXT would not compete at the 2020 event due to the COVID-19 pandemic. Outbreaks of the virus had occurred at both of NXT's home arenas, Full Sail University and the WWE Performance Center, prompting WWE to exclude NXT wrestlers from the event to avoid potential transmission of the virus to members of the Raw and SmackDown rosters.[38] Raw would win that year's competition with a 4–3 victory over SmackDown.[23][24] The 2021 event also did not include NXT as the brand reverted to its status as WWE's developmental territory in September of that year.[39] At the 2021 event, Raw again won the competition with a 5–2 victory over SmackDown.[40][41]\n\nOn September 19, 2022, WWE executive Triple H announced that the 2022 Survivor Series would not be based on the brand supremacy concept. Additionally, he announced that the event would feature two WarGames matches, one each for the men and women, marking the first time for a main roster WWE event to feature the match. The 2022 event was in turn renamed as Survivor Series: WarGames, and it was also the first Survivor Series held on a Saturday.[42] The NXT brand previously held an annual WarGames event from 2017 to 2021. With the WarGames match moving to the main roster for Survivor Series, this subsequently ended NXT's WarGames event, which was replaced by Deadline.[43]\n\nIn an interview with The Ringer in regards to WarGames at Survivor Series, Triple H said:\n\nThe tradition of the Survivor Series has ebbed and flowed and changed slightly over time, but this will be similar to that. This will not be Raw versus SmackDown. It will be much more story-line driven. I still look at it as a traditional component to Survivor Series in there because it's large teams of people competing. We just upped the ante a little bit with WarGames and made it evolve. Survivor Series has been an amazing event for 36 years. And it needs to evolve a little bit and this year seemed like the right time to do it.[44]\nDuring the Survivor Series: WarGames post-event press conference, Triple H was asked if the WarGames match would become a permanent fixture at Survivor Series and he said \"we'll see\", citing the success of the 2022 event. In regards to the event not including a traditional Survivor Series match, he was asked if the match was done for good and he said they \"weren't done with anything\", noting that this year was the time to freshen up the event but the traditional match could see a return at future events. Triple H also revealed that the 2022 event was the highest-grossing Survivor Series of all time as well as the most viewed.[45] The 2023 and 2024 events would also retain the WarGames concept.[46][47]\n\nFrom 1987 to 2021, the event was traditionally characterized by having the Survivor Series match, a type of tag team elimination match that typically featured two teams of four or five wrestlers against each other. In a Survivor Series match, each member of a team had to be eliminated to win. The name of the match stemmed from this stipulation, as the winners were the \"survivors\", and in some cases, there was only one survivor. On occasion, there were additional stipulation placed on the Survivor Series match, such as members of the losing team being (kayfabe) fired. While typically contested between two teams, the 2019 event had three teams against each other in three-way Survivor Series matches.[30]\n\nThe promotion had several tag team elimination matches earlier in 1987, albeit with three-man teams and the feuds loosely related. In an early break from the norm, the 1992 event had only one Survivor Series match.[48] As of 2024, five Survivor Series events have not featured any Survivor Series matches. The 1998 event, which was the first without any Survivor Series matches, instead focused on an elimination tournament for the vacant WWF Championship (now WWE Championship).[49] The 2002 event was the second event to not include any Survivor Series matches. Instead, it had an elimination tables match and a triple threat elimination tag team match (in which only one member of a team had to be eliminated to eliminate the whole team), but most notably, the event saw the debut of the Elimination Chamber, a type of six-person steel cage match where each opponent had to be eliminated to win.[50]\n\nThe 2022, 2023, and 2024 events are the most recent to not include any Survivor Series matches, or any type of elimination stipulations, as they instead featured two WarGames matches, one each for the men and women, with the 2022 event also notable for being WWE's first main roster event to feature the WarGames match. WarGames is a team-based steel cage match where the roofless cage surrounds two rings placed side by side and the two teams typically feature four to five wrestlers each but it is decided by one fall instead of eliminating all opponents.[44][51][47]\n",
  "concepts": [
    "Survivor Series"
  ],
  "findings": [
    "Origins and changes",
    "Brand competition (2016–2021)",
    "WarGames (2022–present)",
    "Survivor Series match",
    "Events",
    "Notes",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:10:25.038679"
}