{
  "title": "Black Easter Bunny",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Black_Easter_Bunny",
  "content": "Black Easter Bunny (born 1949) was a Quarter Horse racehorse who raced during the early 1950s, winning many races against some of the giants of the breed.[1]\n\nBlack Easter Bunny was foaled in 1949 and was a black Quarter Horse mare. She was sired by Hysition, a Thoroughbred stallion, and her dam was a Quarter Horse mare named Flicka.[2] Her dam traced back to Chicaro, a Thoroughbred, as well as tracing three times to Little Joe, a son of Traveler.[3]\n\nOn the track, Black Easter Bunny started 111 times, placing first in twenty-one of those races. She placed second twenty-two times and came in third thirteen times. She earned an AAA speed rating, and a total of $40,228.00 in purses and 136 AQHA racing points. In 1952 she was named Champion Quarter Running Three Year Old Mare.[2]\n\nIn 1956, Black Easter Bunny's then owner Walt Culbertson decided to retire from racing, and sold Black Easter Bunny to Mr. and Mrs. Spencer Childers of Fresno, California. Spencer Childers told Nelson C. Nye that when Black Easter Bunny came up for sale, Childers \"offered his wife the choice of a new mink coat or Black Easter Bunny for Christmas. She did not hesitate a moment.\"[4] After retiring from racing, she produced five foals. All five started races, were winners, and earned their Race Register of Merits. Four were rated AAA, and the fifth was rated AAAT. In total, her five offspring earned $122,969.00 on the racetrack.[2] Her daughter Bunny's Bar Maid was second in the 1961 All American Futurity as well as winning the Kansas Futurity.[5]\n\nBlack Easter Bunny did not live long with her new owners. “She raised some very fine horses for us,” Childers said. “But Black Easter Bunny had a relatively short breeding career. She suffered an injury while she was being bred, and that ended her career and her life. She was a wonderful mare.”[6] Black Easter Bunny was inducted into the American Quarter Horse Association's (or AQHA) Hall of Fame in 2002.[6]\n",
  "concepts": [
    "Black Easter Bunny",
    "bunny",
    "black",
    "easter bunny",
    "easter",
    "black easter",
    "quarter",
    "times",
    "quarter horse",
    "mare",
    "horse"
  ],
  "findings": [
    "Life",
    "Racing career",
    "Breeding record",
    "Death and honors",
    "Pedigree",
    "Notes",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:21.525284"
}