{
  "title": "Sīrah",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Sīrah",
  "content": "Al-Sīra al-Nabawiyya (Arabic: السيرة النبوية), commonly shortened to Sīrah and translated as prophetic biography, are the traditional biographies of the Islamic prophet Muhammad written by Muslim historians, from which, in addition to the Qurʾān and ḥadīth literature, most historical information about his life and the early history of Islam is derived.\n\nIn the Arabic language the word sīrah or sīrat (Arabic: سيرة) comes from the verb sāra, which means \"to travel\" or \"to be on a journey\". A person's sīrah is that person's journey through life, or biography, encompassing their birth, events in their life, manners and characteristics, and their death. In modern usage it may also refer to a person's resume. It is sometimes written as \"seerah\", \"sirah\" or \"sirat\", all meaning \"life\" or \"journey\". In Islamic literature, the plural form, siyar, could also refer to the rules of war and dealing with non-Muslims.[1]\n\nThe sīrah literature includes a variety of heterogeneous materials, containing mainly narratives of military expeditions undertaken by Muhammad and his companions. These stories are intended as historical accounts and are used for veneration. The sīrah also includes a number of written documents, such as political treaties (e.g., Treaty of Hudaybiyyah or Constitution of Medina), military enlistments, assignments of officials, letters to foreign rulers, and so forth. It also records some of the speeches and sermons made by Muhammad, like his speech at the Farewell Pilgrimage. Some of the sīrah accounts include verses of poetry commemorating certain events and battles.[1]\n\nAt later periods, certain type of stories included in sīrah developed into their own separate genres. One genre is concerned with stories of prophetic miracles, called aʿlām al-nubuwa (literally, \"proofs of prophethood\"—the first word is sometimes substituted for amārāt or dalāʾil). Another genre, called faḍāʾil wa mathālib — tales that show the merits and faults of individual companions, enemies, and other notable contemporaries of Muhammad.[1] Some works of sīrah also positioned the story of Muhammad as part of a narrative that includes stories of earlier prophets, Persian Kings, pre-Islamic Arab tribes, and the Rashidun.[1]\n\nParts of sīrah were inspired by, or elaborate upon, events mentioned in the Qur'an. These parts were often used by writers of tafsir and asbab al-nuzul to provide background information for events mentioned in certain ayat.[1]\n\nThe phrase sīrat rasūl allāh, or as-sīra al-nabawiyya, refers to the study of the life of Muhammad. The term sīrah was first linked to the biography of Muhammad by Ibn Shihab al-Zuhri (d. 124/741–2), and later popularized by the work of Ibn Hisham (d. 833). In the first two centuries of Islamic history, sīrah was more commonly known as maghāzī (literally, 'stories of military expeditions'), which is now considered to be only a subset of sīra[1]—one that concerns the military campaigns of Muhammad.[2]\n\nEarly works of sīrah consist of multiple historical reports, or akhbār, and each report is called a khabar.[3] Sometimes the word tradition or hadith is used instead.\n\nIn terms of structure, a hadith and a historical report (khabar) are very similar; they both contain isnads (chains of transmission). The main difference between a hadith and a khabar is that a hadith is not concerned with an event as such, and normally does not specify a time or place. Rather the purpose of hadith is to record a religious doctrine as an authoritative source of Islamic law. By contrast, while a khabar may carry some legal or theological implications, its main aim is to convey information about a certain event.[3]\n\nStarting from the 8th and 9th century, many scholars have devoted their efforts to both kinds of texts equally.[3] Some historians consider the sīrah and maghāzī literature to be a subset of Hadith.[4]\n\nThe main feature of the information that formed the basis of early historiography in Islam was that this information emerged as the irregular products of storytellers (qāṣṣ, pl. quṣṣāṣ) without details. While the narratives were initially in the form of a kind of heroic epics called magāzī, details were added later, edited and transformed into sirah compilations.[5][6] In Umayyad times, storytellers used to tell stories of Muhammad and earlier prophets in private gatherings and mosques, given they obtained permission from the authorities. Many of these storytellers are now unknown. After the Umayyad period, their reputation deteriorated because of their inclination to exaggerate and fantasize, and for relying on the Isra'iliyat. Thus they were banned from preaching at mosques.[7] In later periods, however, works of sīrah became more prominent.\n\nDuring the early centuries of Islam, the sīrah literature was taken less seriously compared to the hadiths.[1]\nToday, although the orthodox Islamic approach frequently uses sirah material in its sermons, Qur'anism and the academic community (including those called hadith or khabar and whose chain of transmission are labeled as sound by their authors) approach this material with suspicion. While Yaşar Nuri Öztürk notes that the hadiths, which have now reached millions, were initially limited to a few hundred, Mehmet Özdemir (prof.dr.) draws attention to the almost non-existent number of miracles (dalāʾil al-nubuwwa) in the first records and the hundreds of additions made in later periods.[8]\n\nLawrence Conrad Lawrence Conrad examines the early sirah books and sees that the dates of Muhammad's birth span a period of up to 85 years.  Conrad defines this as \"the fluidity (evolutionary process) continued even in the written period.\"[10]\nAnother striking example is the Qurayza massacre, which is attributed to Muhammad by various chains of attribution in sources considered authentic; The brutality of the event led researchers skeptics of traditional sources such as İhsan Eliaçık and Mustafa İslamoğlu to think that the story of 960 Jews who destroyed themselves by refusing to surrender to the Romans in the clashes between Jews and Romans believed to have taken place at Masada was adapted to Muhammad. İhsan Eliaçık states that 3-5 Jews who were considered guilty may have been killed as a result of this incident. [11][12] Regarding the Qurayza massacre, Sami Aldeeb states that the incident is included in the Jewish holy texts, but according to these sources, Jews killed non-Jews.[13]\n\nMany Western scholars suspect that there was widespread fabrication of hadith (either entirely or by the misattribution of the views of early Muslim religious and legal thinkers to Muhammad) in the early centuries of Islam to support certain theological and legal positions.[14] In addition to fabrication, it is possible for the meaning of a hadith to have greatly drifted from its original telling through the different interpretations and biases of its varying transmitters, even if the chain of transmission is authentic.[15][16]  While some hadith may genuinely originate from firsthand observation of Muhammad (particularly personal traits that were not of theological interest, like his fondness for tharid and sweets), Western scholars suggest that it is extraordinarily difficult if not impossible to determine which hadith accurately reflect the historical Muhammad.[16]\n\nMore recently, western historical criticism and debate concerning sīrah have elicited a defensive attitude from some Muslims who wrote apologetic literature defending its content.[1] Some researchers, such as Volker Popp, have gone further and argued that names such as Muhammad and Ali were not names but titles.[17]\n\nFor centuries, Muslim scholars have recognized the problem of authenticity of hadith. Thus they have developed sophisticated methods (see Hadith studies) of evaluating isnāds (chains of transmission). This was done in order to classify each hadith into \"sound\" (ṣaḥīḥ) for authentic reports, as opposed to \"weak\" (ḍaʿīf) for ones that are probably fabricated, in addition to other categories.[18] Since many sīrah reports also contain isnād information and some of the sīrah compilers (akhbārīs) were themselves practicing jurists and hadīth transmitters (muḥaddiths), it was possible to apply the same methods of hadīth criticism to the sīrah reports.[19] However, some sīrah reports were written using an imprecise form of isnād, or what modern historians call the \"collective isnād\" or \"combined reports\". The use of collective isnād meant that a report may be related on the authority of multiple persons without distinguishing the words of one person from another. This lack of precision led some hadith scholars to take any report that used a collective isnād to be lacking in authenticity.[20]\n\nAccording to Wim Raven, it is often noted that a coherent image of Muhammad cannot be formed from the literature of sīra, whose authenticity and factual value have been questioned on a number of different grounds.[1] He lists the following arguments against the authenticity of sīra, followed here by counter arguments:\n\nIf one storyteller should happen to mention a raid, the next storyteller would know the date of this raid, while the third would know everything that an audience might wish to hear about.[6]\nNevertheless, other content of sīra, like the Constitution of Medina, are generally considered to be authentic.[1]\n\nThe following is a list of some of the early Hadith collectors who specialized in collecting and compiling sīrah and maghāzī reports:\n\nThe sīrah literature is important: in the Urdu language alone, a scholar from Pakistan in 2024 produced a bibliography of more than 10,000 titles, counting multivolume works as a single book and without integrating articles, short essays and unpublished manuscripts, with the researcher also precising that the literature in Arabic is even more important.[27]\n",
  "concepts": [
    "Sīrah"
  ],
  "findings": [
    "Etymology",
    "Content",
    "Sīrat rasūl allāh",
    "Comparison to hadith",
    "Reception",
    "Authenticity",
    "Early compilations of sīra",
    "Number of prophetic biographies",
    "See also",
    "Notes",
    "References",
    "Further reading"
  ],
  "timestamp": "2025-04-11T10:14:19.021330"
}