{
  "title": "Pausanias the Regent",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Pausanias_the_Regent",
  "content": "Pausanias  (Ancient Greek: Παυσανίας) was a Spartan regent and a general. In 479 BC, as a leader of the Hellenic League's combined land forces, he won a pivotal victory against the Achaemenid Empire in the Battle of Plataea. Despite his role in ending the Second Persian invasion of Greece, Pausanias subsequently fell under suspicion of conspiring with the Persian king Xerxes I. After an interval of repeated arrests and debates about his guilt, he was starved to death by his fellow Spartans. What is known of his life is largely according to Thucydides' History of the Peloponnesian War, Diodorus' Bibliotheca historica and a handful of other classical sources.\n\nPausanias was from the royal house of the Agiads. Every male Spartan citizen earned their citizenship by dedicating their lives to their polis and its laws.[1] Pausanias would have gone through intense military training from the age of seven and was required to be a regular soldier until the age of thirty.\n\nAs a son of the regent Cleombrotus and a nephew of the recently deceased warrior king, Leonidas I, Pausanias was a scion of the Spartan royal house of the Agiads, but not in the direct line of succession as he was not the first born son of one of the kings of Sparta. After Leonidas' death, while the king's son Pleistarchus was still in his minority, Pausanias served as regent of Sparta. Pausanias was also the father of Pleistoanax who later became king. Pausanias' other sons were Cleomenes and Nasteria.\n\nIn 479 BC, Pausanias was leader of the Spartan army alongside Euryanax, son of Dorieus, as the Agiad king of Sparta Pleistarchus, son of Leonidas I, was too young to command. Pausanias led 5000 Spartans to the aid of the league of Greek cities created to resist the Persian invasion.[2] At the Greek encampment at Plataea 110,000 men were assembled along the Asopos River.  Further down the river, Mardonius, commander of the Persian forces, stationed 300,000 Persian forces alongside 50,000 Greek allies.[3]\n\nAfter eleven days of stalemate, Mardonius offered a challenge that was ignored by the Greeks.[4] With no answer to his challenge, Mardonius ordered his cavalry to pollute the Asopos from which the Greeks were getting their water, so the Athenian forces decided in the night to move towards Plataea.[5] The forces led by Pausanias headed through the ridges and foothills of the Cithaeron while the Athenian forces headed the opposite direction onto the plains.[6] Seeing this, Mardonius thought the Athenians were fleeing, so he sent his Persian forces to charge Pausanias' army while dispatching his Greek allies to go after the Athenians.[7]\n\nWith the battle underway Pausanias sent a messenger to ask for Athenian aid, but they could not spare any.  So Pausanias with 50,000 Lacedaemonians and 3,000 Tegeans prepared for battle at Plataea.[8] In the subsequent Battle of Plataea, Pausanias led the Greeks to a major victory over the Persians and their allies.[9] While the Battle of Plataea is sometimes seen as a chaotic battle,[10] others see evidence of both Pausanias' strategic and tactical skills in delaying the engagement with the Persians until the point where Spartan arms and discipline could have maximum impact.[11] Herodotus concluded that \"Pausanias the son of Cleombrotus and grandson of Anaxandridas won the most glorious victory of any known to us\".[12]\n\nAfter the victories at Plataea and the subsequent Battle of Mycale, the Spartans lost interest in liberating the Greek cities of Asia Minor until it became clear that Athens would dominate the League in Sparta's absence. Sparta then sent Pausanias back to command the Greek military.\n\nIn 478 BC, Pausanias was accused of conspiring with the Persians and recalled to Sparta. One allegation was that after capturing Cyprus and Byzantium (478 BC), Pausanias released some of the prisoners of war who were friends and relatives of the king of Persia. Pausanias argued that the prisoners simply escaped. Another allegation was that Pausanias sent a letter via Gongylos of Eretria (Diodorus has general Artabazos I of Phrygia as a mediator) to Xerxes I saying he wished to help Xerxes and bring Sparta with the rest of Greece under Persian control. In return, Pausanias wished to marry Xerxes's daughter. After Xerxes replied agreeing to his plans, Pausanias started to adopt Persian customs and dress like a Persian aristocrat. Due to lack of evidence, Pausanias was acquitted and left Sparta on his own accord, taking a trireme from the town of Hermione.[13]\n\nAccording to Thucydides and Plutarch,[14] Athenians and many Hellenic League allies were displeased with Pausanias because of Pausanias' arrogance and high-handedness.\n\nIn 477 BC, the Spartans recalled Pausanias once again. Pausanias went to Kolonai in the Troad before returning to Sparta. Upon his arrival in Sparta, the ephors imprisoned Pausanias, but he was later released due to lack of sufficient evidence to convict Pausanias of disloyalty, even though some helots reported that Pausanias offered freedom if the helots joined in revolt. Later, one of the messengers Pausanias used to communicate with the Persians provided written evidence (a letter stating Pausanias' intentions) to the Spartan ephors.[15]\n\nDiodorus adds further detail to Thucydides' account. After the ephors were loath to believe the letter provided by the messenger, the messenger offered to produce Pausanias' acknowledgement in person. In the letter Pausanias asked the Persians to kill the messenger. The messenger and the ephors went to the Temple of Poseidon (Tainaron). The ephors concealed themselves in a tent at the shrine and the messenger waited for Pausanias. When Pausanias arrived, the messenger confronted Pausanias asking why did the letter say to kill whoever delivered the letter. Pausanias said that he was sorry and asked the messenger to forgive the mistake. Pausanias offered gifts to the messenger. The ephors heard the conversation from the tent.[16]\n\nHerodotus notes that the Athenians were hostile to Pausanias and wished Pausanias removed from Greek command,[17] with his Athenian counterpart Themistocles publicly ostracising him as a threat to democracy. The historian A. R. Burn speculates that the Spartans became concerned about Pausanias' progressive views about freeing the Helots.[18]\n\nAccording to Thucydides, Diodorus and Polyaenus, Pausanias, pursued by the ephors, took refuge in the temple of  Athena \"of the Brazen House\" (Χαλκίοικος, Chalkioikos) (located in the acropolis of Sparta). Pausanias' mother Theano (Ancient Greek: Θεανώ) immediately went to the temple, and laid a brick at the door saying: \"Unworthy to be a Spartan, you are not my son\" (according to Diodorus). Following the mother's example, the Spartans blocked the doorway with bricks and forced Pausanias to die of starvation. After Pausanias' body was turned over to relatives for burial, the divinity through the Oracle of Delphi showed displeasure at the violation of the sanctity of supplicants. The oracle said that Athena demanded the return of the supplicant. Unable to carry out the injunction of the goddess, the Spartans set up two bronze statues of Pausanias at the temple of Athena. [19][20][21]\n\nPausanias is a central figure in the \"Pausanias, the betrayer of his country a tragedy, acted at the Theatre Royal by His Majesties servants\" by Richard Norton and Thomas Southerne.[22]\n\n Media related to Pausanias (general) at Wikimedia Commons\n",
  "concepts": [
    "Pausanias the Regent"
  ],
  "findings": [
    "Early life",
    "Spartan lineage",
    "War service",
    "Suspected pact with Persia",
    "Death",
    "Legacy",
    "See also",
    "Notes",
    "Further reading",
    "External links"
  ],
  "timestamp": "2025-04-11T10:08:03.674802"
}