{
  "title": "Bedabrata Pain",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Bedabrata_Pain",
  "content": "Bedabrata Pain (Bengali: বেদব্রত পাইন; born 27 March 1963) is an Indian scientist turned film director,[2][3] producer and screenwriter.[4] Bedabrata Pain was also a member of the team that invented the CMOS image sensor.[5] Bedabrata Pain has also won National Film Award for Best Debut Film of a Director for Chittagong.[6][7]\n\nBedabrata's father was born in Dhaka and his mother came from Faridpur. Bedabrata Pain did his schooling in St. Lawrence High School in Calcutta & South Point High School and ranked 3rd in Madhyamik Exam (West Bengal State Board - 10th Standard Exam) and 5th in Higher Secondary Exam (West Bengal State Board - 12th Standard Exam). He then studied Electronics & Electrical Comm. Engg. (ECE) in IIT Kharagpur (1982–1986),[8][9][10] He got an Ivy League scholarship.[11] Later he went to Columbia University, New York and received his M.S and PhD in Applied physics in 1992. His future wife Shonali Bose also did her master's degree in Political Science from Columbia University.\n\nIn 1993, Bedabrata Pain joined the NASA Jet Propulsion Laboratory, California Institute of Technology and later managed JPL's image sensor and focal-plane technology research and advanced development. Since 1993, he was associated with NASA. Concurrent with his NASA work, he taught courses on CMOS imaging at UCLA, chaired international conferences, and was the invited speaker at several conferences. He has published over 150 technical papers, and won several awards, including the Lew-Allen Award for Excellence.[12]\n\nIn 1990s, Bedabrata Pain was part of a team that invented the active pixel sensor technology that produced the world's smallest camera and has been inducted to the US Space Technology Hall of Fame.[13][14][15] Now it is used from cell-phone cameras to movie cameras (such as those used by Red) to those in space telescopes.[16][17]\n\nBedabrata Pain had worked for NASA for 15 years as senior research scientist before quitting NASA in December 2008.[18][19][20] Pain has 87 invention patents to his credit.[21][22]\n\nBedabrata Pain was married to Shonali Bose.[23] Now he is based in Los Angeles.[24] Bedabrata and Shonali had two sons - Ishan and Vivan. They lost their son Ishan, who died at a young age in an accident on 3 September 2010.[25][26][27][28][29][30]\n\nBedabrata was the executive producer of the award-winning film Amu in 2005.[31] He was the principal researcher for the documentary called Lifting the Veil on the impact of globalisation in India, and the writer of the book titled 'Behind the events in Kashmir'. He directed critically acclaimed film Chittagong starring Manoj Bajpai,[32] Vega Tamotia,[33] Nawazuddin Siddiqui, Barry John and Dibyendu Bhattacharya.[34] Bedabrata, shot the film Chittagong with the same digital imaging technology that he with other NASA scientists had invented.[35]\n\nBedabrata undertook a 10,000 km journey, alongside young physicists Rajashik Tarafder and Sristy Agrawal,  to Mid-West USA to document the lives of farmers for his upcoming film Déjà vu[36].\n",
  "concepts": [
    "Bedabrata Pain"
  ],
  "findings": [
    "Biography",
    "Early life and education",
    "Academic career",
    "Invention",
    "Achievements and awards",
    "Personal life",
    "Film career",
    "Filmography",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:06:56.278913"
}