{
  "title": "Multiverse (Marvel Comics)",
  "source": "Wikipedia",
  "source_url": "https://en.wikipedia.org/wiki/Multiverse_(Marvel_Comics)",
  "content": "\n\nWithin Marvel Comics, most stories take place within the fictional Marvel Universe, which in turn is part of a larger multiverse. Starting with the Captain Britain story in The Daredevils #7, the main continuity in which most Marvel storylines take place was designated Earth-616, and the Multiverse was established as being protected by Merlyn. Each universe has a Captain Britain designated to protect its version of the British Isles. These protectors are collectively known as the Captain Britain Corps. This numerical notation was continued in the series Excalibur and other titles. Each universe of the Multiverse in Marvel also appears to be defended by a Sorcerer Supreme at nearly all times, appointed by the mystic trinity of Vishanti to defend the world against threats primarily magical in nature from within and beyond and bearing the Eye of Agamotto.\n\nLater on, many writers would use and reshape the Multiverse in titles such as Exiles, X-Men, and Ultimate Fantastic Four. New universes would also spin out of storylines involving time-traveling characters such as Rachel Summers, Cable, and Bishop, as their actions rendered their home times alternate timelines.\n\nThe multiverse also plays a role in the Marvel Cinematic Universe (MCU), with the central and main universe having originally been known as Earth-199999 in external media and Earth-616 in internal media. The concept was first introduced in Doctor Strange (2016) before becoming the focal point of the franchise in \"The Multiverse Saga\" (2021–present). Additionally, the Multiverse has also been explored in the X-Men film series, Sony's Spider-Man Universe (SSU), and the Spider-Verse franchise, with an emphasis on the latter regarding multiple versions of Spider-Man across different universes, and connecting the former two with the MCU.\n\nThe Multiverse is the collection of alternate universes that share a universal hierarchy. A large variety of these universes were originated from another due to a major decision on the part of a character. Some can seem to be taking place in the past or future due to differences in how time passes in each universe. Often, new universes are born due to time traveling; another name for these new universes is an \"alternate timeline\".\nEarth-616 is the established main universe where the majority of Marvel books take place.\n\nThe Marvel multiverse is protected from imbalance by the Living Tribunal, a vastly powerful humanoid cosmic entity, who is one for the entire multiverse. It may act to prevent one universe from amassing more power than any of the others or from upsetting the cosmic balance in some way. It is only overseen by the One-Above-All, an omnipotent entity said to have created the entire Marvel Multiverse.\n\nAccording to the origin mythology, at the beginning there was only one universe, The First Firmament, but due to actions of Celestials existing there, it diverged.[1] Then, the Multiverse went through several incarnations and eventually the Big Bang caused the existence of the Seventh Cosmos, where most well-known heroes originated. The seventh iteration of the Multiverse was destroyed as a consequence of the phenomena known as incursions and was eventually reborn as the eighth thanks to Reed Richards.[2] According to him the ultimate fate of the Multiverse is to perish in all-encompassing heat death.[3]\n\nAccording to Forge, mutants living on these alternate Earths have lost their powers due to M-Day, as stated in \"Endangered Species\"; however, this mass depowering has not been seen in any of Marvel's current alternate reality publications such as Exiles, the Ultimate Marvel titles, Amazing Spider-Girl, the Marvel Adventures titles or GeNext, though it is possible that the issue of time may be related to their exclusion. This was apparently retconned during the \"X-Men: Messiah Complex\" storyline, where Forge stated that all mutants in possible future timelines were depowered, not in parallel universes.[4] This, in addition to A.R.M.O.R.'s observation that Lyra arrived from an alternate reality[5] indicates that the topology of the Marvel Multiverse is based on new realities branching off from key nodes of a timeline instead of strictly parallel dimensions.\n\nNot every alternate dimension is an entire independent universe, but instead maintain a parasitic relationship to a parent reality. Others can exist outside the multiversal structure altogether.\n\nThe classification system for alternate realities was devised, in part, by Mark Gruenwald.[6]\n\nA universe is a single dimension, such as Earth-616, the mainstream Marvel Universe.\n\nA reality is the collection of a universe, where a version of the planet Earth exists, and the various other dimensions associated with it, like Asgard, the Dark Dimension, or the Negative Zone. Universes, where a planet Earth exists, are infinite, and there is (generally) one version of Asgard, one version of the Dark Dimension, one version of the Negative Zone, and so on associated with each. For example, beings like Dormammu and gods like Odin hail from separate dimensions, but they all nevertheless belong to Reality-616, and other realities like the MCU, have different variants of these characters. Note that whether any given specific use of the term \"Marvel Universe\" refers to the Marvel Multiverse (in general) or to the Reality-616 (in particular) can only be determined by the context of its use.[7]\n\nA multiverse is the collection of alternate universes, with a similar nature and a universal hierarchy. The Marvel Multiverse contains the universe that holds Reality-616, most of the What If? universes, as well as the vast number of the alternate Marvel Universe Earths.\n\nA Megaverse is a collection of alternate multiverses, which do not necessarily need to have similar natures and universal hierarchies. The term was posited in the 21st century edition of the Official Handbook of the Marvel Universe.\n\nAccording to the Official Handbook of the Marvel Universe: Alternate Universes, and building on Mark Gruenwald's original definition of the term,[8] the Omniverse consists of all of fiction and reality combined, including all the works that are outside of Marvel's copyright restrictions, and therefore also outside the Marvel Multiverse. As such, there can logically only be one Omniverse, as anything and everything that currently exists, existed in the past, can potentially exist at any time or may exist in the future is a part of it.\n\nAs stated above, nearly every imprint, timeline and appearances in other media have its own separate universe. Most of these have been cataloged by Marvel Comics in many publications, being most notable the Official Handbook of the Marvel Universe: Alternate Universes. The numerical designations for these are rarely revealed outside of reference works such as the Official Handbook of the Marvel Universe: Alternate Universes 2005. A.R.M.O.R. and Project Pegasus however seem to possess vast knowledge of other Marvel realities, using the same designations; whether this is simply narrative convenience on behalf of Marvel's authors or an unusual decision by these agencies to use an effectively alien catalog method is as yet unstated.\n\nThe numeric designations of these alternate universes have been confirmed by Marvel Comics throughout the years and compiled in 2005's Official Handbook of the Marvel Universe: Alternate Universes, and in Marvel publications since the release of the Handbook.\n\nMany official numbers are random or use other numbers as a base, the best example of this is Ultimate Marvel. 1610 is the swapped numbers of 616 with a 0 to differentiate it from the already existing 161. In addition, many universes have also been designated with numbers by fans with various methods for the numbering, such as the birth date of an important Marvel staff member (artist Nelson Ribeiro for the Transformers U.S. Universe, Earth-91274) or the spelling of a name with a touch-tone phone (Animated Silver Surfer Earth-936652, spells out Zenn-La).\n\nIn 2014, during the publication of the \"Spider-Verse\" storyline, writer Dan Slott posted on Twitter that the numbers that appear in wiki entries and handbooks do not count, only those that are published within \"actual\" stories do. This was in response to the questions that the different numbers for some Earths appearing in Spider-Verse brought up, such as the Spider-Friends being from Earth-1983 and not the believed designation of Earth-8107.[9] This has created some debate among readers, as some believe that the \"Spiders\" with numbers that do not match the \"original\" ones are alternate versions, or if the former numbers should be completely dismissed, despite being official.\n\nIn the 2015 Secret Wars series, a confrontation with the Beyonders over the fate of the various alternate versions of the Molecule Man results in the destruction of the Multiverse, triggering various 'incursions' as Earths crash together and destroy each other, the Beyonders' assault culminating in Doctor Doom stealing the power of the remaining Beyonders and bringing the last of the parallel universes together into a single 'Battleworld'. Doom rules this reality for eight years until key heroes and villains from the pre-existing Multiverse are discovered and released by Doctor Strange, who had been acting as Doom's 'sheriff' until the discovery of the survivors gave him an alternative. In the heroes' final assault on Doom's fortress, the Molecule Man, who had been the source of Doom's power, transfers Doom's power to Mister Fantastic when Doom acknowledges that Reed would have done a better job as 'God' than he did. Having restored Earth-616 as it was before the Beyonders' incursions began, Mister Fantastic departs to recreate the multiverse with the company of his restored family.\n\nBelow is a short, non-comprehensive list of some of the most noteworthy and significant universes in the Marvel Multiverse. Most of these were designated in the Official Handbook of the Marvel Universe on both physical print and the digital Appendix.[10]\n",
  "concepts": [
    "Multiverse (Marvel Comics)"
  ],
  "findings": [
    "Concept",
    "Nature of the Multiverse",
    "Other dimensions",
    "Definitions",
    "Universe",
    "Reality",
    "Multiverse",
    "Megaverse",
    "Omniverse",
    "Known alternate universes",
    "List of primary alternate Earths and universes",
    "Marvel Cinematic Universe",
    "See also",
    "References",
    "Bibliography",
    "External links"
  ],
  "timestamp": "2025-04-11T08:36:29.624371"
}