{
  "title": "John Catlin (politician)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/John_Catlin_(politician)",
  "content": "John Catlin (October 13, 1803 – August 4, 1874) was an American lawyer, politician, railroad executive, and Wisconsin pioneer.  He was the last secretary of the Wisconsin Territory and briefly served as acting governor of the territory after the creation of the state of Wisconsin but before the Minnesota Territory was formally organized from the remnant, between June 23, 1848, and March 3, 1849.  He was also a founding member of the Wisconsin Historical Society.  Earlier in his career, he was the first district attorney for Dane County, Wisconsin, and served in the legislature of the Wisconsin Territory during the 4th Wisconsin Territorial Assembly.\n\nBorn in Orwell, Vermont,[1] Catlin attended school at Shoreham, Vermont's Newton Academy, and taught school for nine years.[1] Catlin was admitted to the Vermont bar and practiced law. In 1836, he moved to Mineral Point in Wisconsin Territory, where he helped set up a bank. He became the postmaster of Madison in 1837.[1] He was president of the Milwaukee & Mississippi Railroad, which became part of the Milwaukee Road. Catlin served as a clerk of the Wisconsin Territorial Supreme Court and the Wisconsin Territorial House of Representatives.[1] He was elected to the Wisconsin Territorial Council. He also was the first district attorney of Dane County 1839–1843.[2][3][4] Catlin was a founder of the Wisconsin Historical Society. He was a member of the Democratic Party.\n\nCatlin was appointed the Secretary of Wisconsin Territory by President James Polk, and served from February 24, 1846, to March 3, 1849.\n\nCatlin was named acting Governor of the Wisconsin Territory following Henry Dodge's term as governor. Dodge ceased to be the governor of the Wisconsin Territory upon becoming a member of the United States Senate from Wisconsin.[5]\n\nWhen the state of Wisconsin was admitted to the United States on May 29, 1848, part of the Wisconsin Territory was not included. John Catlin was acting governor of this part of the Wisconsin territory until the Minnesota Territory was organized on March 3, 1849, which included that part of the Wisconsin Territory.[6] As acting governor, Catlin went to the present-day city of Stillwater, Minnesota, where he issued a proclamation for a special election for the delegate from the Wisconsin Territory. Henry Hastings Sibley was elected the Congressional Delegate from the Wisconsin Territory, as a result of the special election.[1][7][8]\n\nCatlin was the last Governor of the Wisconsin Territory.\n\nJohn Catlin was the first Master of Madison Masonic Lodge Number 5, the first lodge to be formed in the city of Madison, Wisconsin. He became the Master of Lodge 5, January 10, 1845, and was Master for two years.[9] Catlin's portrait hangs in the Mark Twain Room of the Madison Masonic Center at 301 Wisconsin Avenue in Madison. Catlin was Wisconsin's first postmaster.[10][page needed] He married Clarissa Bristol on September 19, 1843, and they had one child, Lucia.\n\nCatlin died, on August 4, 1874, in Elizabeth, New Jersey,[1] where he had retired to in 1863.[11][12]\n",
  "concepts": [
    "John Catlin (politician)",
    "wisconsin",
    "territory",
    "catlin",
    "wisconsin territory",
    "governor",
    "madison",
    "wisconsin territorial",
    "territorial",
    "served",
    "governor wisconsin"
  ],
  "findings": [
    "Early life and career",
    "Acting governor of the Territory of Wisconsin",
    "Personal life",
    "Death",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:32.841606"
}