{
  "title": "B. K. Misra",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/B._K._Misra",
  "content": "Dr. Basant Kumar Misra is a neurosurgeon specialising in treating brain, spine, cerebrovascular and peripheral nervous system disorders, injuries, pathologies and malformations.[2][3][4] He is the Vice-President of the World Federation of Neurosurgical Societies,[5][6][7] and the former President of the Asian Australasian Society of Neurological Surgeons,[8] and the Neurological Society of India.[9]  He is a recipient of Dr. B. C. Roy Award, the highest medical honour in India.[10] Dr Misra also became the first Indian to receive the International Lifetime Achievement Award from the American Association of Neurological Surgeons (AANS) at its Annual Scientific Meeting in Orlando.[11]\n\nBasant Misra was born in Bhubaneswar to eminent economist, Dr. Baidyanath Misra and Mrs. Basanti Misra, a homemaker.[12] He did his schooling from the Demonstration Multipurpose School, Bhubaneswar,[13] MBBS from the Government Medical College, Sambalpur, his MS General Surgery from Delhi University, his MCh in Neurosurgery from AIIMS, New Delhi and DNB Neurosurgery from the National Board of Examinations. He received Commonwealth Medical Scholarship to the University of Edinburgh Medical School.[14]\n\nHe started his career as a Research officer at the Indian Council of Medical Research, and is currently the Chairman & Chief of Surgery, and Head of the Neurosurgery department at Hinduja Hospitals, Mumbai.\n\nHis notable patients include Hrithik Roshan, Salman Khan, Abhijat Joshi, Anand Kumar, among others[15][16][17][18][19][20][21][22][23][24]\n\nHe is also working with Dr. B. Ravi, institute chair professor of Mechanical engineering and the founder of Biomedical Engineering and Technology (incubation) Centre (BETiC) at IIT Bombay, to co-develop biomedical devices.[29]\n\nHe has authored and co-authored more than 200 publications in peer-reviewed national and international journals.[30]\n\nHe started the 6-year DNB course in Neurosurgery for MBBS graduates (one of the only 32 NBE-accredited tertiary-care institutions in India)[31][32] and a 3-month fellowship programme (one of only 23 WFNS-accredited Class-1 postgraduate training centres in the world) at Hinduja Hospital.[33][34] He also conducts cadaveric demonstrations, hands-on dissection workshops, seminars and CME courses. He has previously taught at SCTIMST (an Institute of National Importance), Australian School of Advanced Medicine and Harvard Medical School.[35]\n\nDr. Misra was elected as the Chairman of the World Federation of Neurosurgical Societies (WFNS) Foundation, marking the first time a neurosurgeon from outside Europe or America has held this prestigious position.[36]\n\nHe is holding / has held the following positions:[37]\n\nHe runs a free weekly clinic at Hinduja Hospital, Mahim, providing free consultations to patients from the weaker sections of the society. He also waives off his surgical fees, either partially or completely.[38]\n\nAlong with Cardiac surgeon, Ramakanta Panda and former Police Commissioner of Mumbai, Arup Patnaik, he set up the Konark Cancer Foundation for patients coming to the Tata Memorial Hospital for cancer treatment, providing them with financial support of up to INR 1 lac per patient, logistical support such as finding food and shelter for their attendants, providing other voluntary support, collecting and donating blood, medications and prosthesis. Around 10,000 patients and their families have been benefited since its inception.[39][40]\n\nHe started the Baidyanath Neurosurgery Charitable Trust to fund travelling fellowships of young neurosurgeons (below 40 years) from both public and private sectors, and of senior neurosurgeons from only the public sector, seeking advanced training abroad.[41][42]\n",
  "concepts": [
    "B. K. Misra"
  ],
  "findings": [
    "Early life and education",
    "Career",
    "Posts",
    "Awards",
    "Charity",
    "References"
  ],
  "timestamp": "2025-04-11T10:16:24.096722"
}