{
  "title": "D. J. Bonebrake",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/D._J._Bonebrake",
  "content": "Donald J. Bonebrake (born December 8, 1955) is an American musician who first emerged as the drummer of the punk rock band the Eyes (also featuring Charlotte Caffey of the Go-Go's). He is best known as an original member of and drummer for punk band X, of which he is still an active member. [1]\n\nBonebrake, born in Burbank, California, and having spent his youth in the San Fernando Valley, is the only founding member of X from California (the other three are from Illinois).[2] Bonebrake also performed with two of the band's side projects: the country/folk music/punk band the Knitters (with his bandmates John Doe and Exene Cervenka), and Auntie Christ (with Cervenka).\n\nWhile a member of X, Bonebrake briefly guested as the drummer for the Germs, and during 1981, he and Doe served as members of the Flesh Eaters, performing on that band's second album, A Minute to Pray, a Second to Die.[3]\n\nIn 2010, Bonebrake joined the Rancid side project Devil's Brigade.[4]\n\nIn 2013, Bonebrake joined the World Takes, helmed by Stephen Maglio. The band released an album, Love Songs for eX's, and toured with the Meat Puppets.\n\nIn 2021, Dave Grohl revealed that he and Bonebrake are cousins through Grohl's grandmother.[5]\n\nAlthough most of his work has been within the punk genre, Bonebrake heads two jazz ensembles: the Bonebrake Syncopators, who play early jazz standards in a swing and western swing style; and Orchestra Superstring who play Afro-Cuban jazz and Latin jazz. In both jazz groups, Bonebrake plays vibraphone or marimba rather than a drum kit. Bonebrake has also performed as timpanist with the Palisades Symphony.[6] His marimba playing goes back at least as far as his first work with the Flesh Eaters.[citation needed]\n",
  "concepts": [
    "D. J. Bonebrake",
    "bonebrake",
    "band",
    "jazz",
    "punk",
    "member",
    "drummer",
    "work",
    "swing",
    "second",
    "punk band"
  ],
  "findings": [
    "Career",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:26.479674"
}