{
  "title": "Felicia filifolia",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Felicia_filifolia",
  "content": "Felicia filifolia is a Southern African member of the family Asteraceae. It is a hardy, sprawling shrub growing to about 1 metre tall. Leaves are narrow (filifolia = threadlike leaves) and clustered along the twigs. When blooming it is densely covered in flowerheads with ray florets that are pink-mauve to white and disc florets that are yellow. In the wild, flowers can be found August to December.[1]\n\nThe species is widespread over mountainous areas, commonly found growing amongst rocks. It is suspected of causing haemorrhaging when ingested by sheep.[2]\n\nFelicia filifolia is called \"fine-leaved felicia\", \"needle-leaved felicia\", or \"wild aster\" in English, draaibos in Afrikaans and sehalahala-seseholo in the Sesotho language.[3]\n\nFelicia filifolia subsp. filifolia is a mostly strongly branched and woody, largely hairless, medium-sized shrub of 60–150 cm (24–59 in) high. It has a dark blackish brown, often slightly fibrous bark. The leaves are alternately set, clustered on short shoots or uniformly arranged on long shoots, hairless or woolly only on the upper side of the leafbase. The leaves are more or less succulent, narrowly needle-shaped, 8–30 mm (0.31–1.18 in) long and approximately ½ mm (0.02 in) in diameter, usually with distinctly callous tip, more or less wrinkled, and with resin vessels on the inside.[4]\n\nThe flower heads are on the short shoots or at the tip of the long shoots, medium-sized, seated or on up to 10 cm (3.9 in) long stalks. The involucre is 6–8 mm (0.24–0.31 in) in diameter, and consists of three to four whorls of bracts. These bracts are overlapping, lance-shaped, hairless, tawny to greenish in colour with the tip often tinged red. They have a papery margin more or less set with a regular row of hairs. The outer bracts are 1½ mm (0.06 in) long and ½ mm (0.02 in) wide, those in the middle 3 mm (0.12 in) long and 1 mm (0.04 in) wide, and the inner 5 mm long and ½ mm wide. Each head has ten to fifteen female, medium or light purple, rarely white, ray florets of about 1 cm long and 1½ mm wide. These surround numerous bisexual yellow, later burgundy-washed disc florets of 4–6 mm (0.16–0.24 in) long. The two style branches each have a long triangular appendage. The pappus bristles are numerous, yellowish white in colour, and do not detach. Although they vary in length, they do not occur in two distinct rows. The longer pappus bristles have teeth along their length and are 5–7 mm (0.2–0.28 in) long, the shorter scaly and ½–1 mm (0.02–0.04 in) long. The dry, one-seeded, indehiscent fruits called cypselae are obovate to elliptic, about 4 mm (0.16 in) long and 1½ mm (0.06 in) wide, evenly silky hairy, with a brownish scaly surface when mature, and a light ochre-coloured marginal ridge.[4]\n\nFelicia filifolia subsp. bodkinii remains lower than the typical subspecies at about 90 cm (35 in). The thick, succulent leaves, do not have a narrowed base, are nearly fully round in cross-section, about 2 cm long and 1 mm across, and sit alternately at regularly distances along the long shoots. Short shoots are failing or few. The relatively large floral heads have an involucre of about 10 mm in cross section, and sit at the top of the long shoots. The outer bracts are 1½ mm (0.06 in) long and ½ mm (0.02 in) wide, and the inner 5 mm long and 1.2 mm wide. Near Graaff Reinet, the subspecies occurs without ray florets.[5]\n\nFelicia filifolia subsp. schaeferi is a low plant at a maximum of 25 cm (9.8 in). The succulent leaves are crowded along the stem and up to 15 mm long, often spread forward and narrowed at the base. The heads are up to 10 cm long stems.[6]\n\nIn Felicia filifolia subsp. schlechteri the floral heads are almost exclusively on 2–10 cm long stalks. The succulent leaves are round in cross section, and longer than in the typical subspecies at 1.8–4 cm, on average 2½ cm, and are typically oriented upwards, pressed against the stem.[7]\n\nFelicia filifolia is a diploid having nine sets of homologous chromosomes (2n=18).[4]\n\nAlthough intermediates between subsp. filifolia and each of the other three subspecies, and between subsp. schaeferi and subsp. bodkinii are known, the subspecies are distinct even when growing at the same location.\n\nThe fine-leaved felicia was first described by the French botanist Étienne Pierre Ventenat, who named it Aster filifolius in 1804, accompanied by a colour etching[8] in his book Jardin de la Malmaison, about the plants in the palace garden that had been designed by Empress Joséphine, Napoleon Bonaparte's first wife. This etching now serves as the type for the species. In 1831, Christian Friedrich Lessing described another specimen that had been collected by Hinrich Lichtenstein between Leeuwenkraal and Ongeluksfontein, that he placed in the genus Diplostephium that had been created by Carl Sigismund Kunth in 1820, calling it Diplostephium teretifolium. In 1833, Nees von Esenbeck assigned Aster filifolius to Diplostephium, creating the name Diplostephium filifolium. Three years later, Augustin Pyramus de Candolle not only placed Ventenat's species in Diplopappus, creating Diplopappus filifolius, but also recognised Lessing's specimen as distinctive, calling it Diplopappus filifolius β teretifolius. In 1912, Joseph Burtt Davy assigned the fine-leaved felicia to the genus Felicia, creating the name Felicia filifolia. When in 1973 Jürke Grau revised the genus Felicia, he distinguished four subspecies, and all names above he regarded synonymous with subsp. filifolia.[4]\n\nIn 1831, De Candolle also described Fresenia leptophylla based on a collection by Johann Franz Drège from the Cederberg. In 1920, Kurt Dinter described a specimen collected by Fritz Schaefer in Namaland, Namibia, which he called Aster schäferi. In 1973 Grau demoted this taxon to the rank of subspecies, calling it subsp. schaeferi.[4]\n\nDe Candolle further described in 1836 Diplopappus elongatus, based on a plant collected by Drège in the Zuureberge, which was demoted to Diplopappus filifolius var. elongatus by William Henry Harvey in 1865. In 1924, Robert Harold Compton described Aster schlechteri. When Grau in 1973 wanted to assign the taxon to Felicia, the oldest epithet, elongatus, was not available because Aster elongatus described by Carl Thunberg in 1800, is the basionym of Felicia elongata. He therefore made the combination Felicia filifolia subsp. schlechteri.[4][9]\n\nIn 1867 Harry Bolus described Fresenia fasciculata based on a specimen he collected in the Sneeuberge between Graaff-Reinet and Murraysburg. In 1924, Robert Harold Compton described Aster schlechteri. In 1931, Compton described both Aster bodkinii and Felicia teres. In 1973, Grau regarded these names synonyms and belonging to the fourth subspecies of Felicia filifolia, which he named subsp. bodkinii.[4]\n\nThe species is considered part of the section Lignofelicia.[4]\n\nThe subspecies fililolia has a large distribution, southeast from a line between about 25° south in the east of South Africa to about 30° in the west. Subspecies bodkinii occurs from Namaqualand in the north to Ceres and Humansdorp in the east. Subspecies schaeferi may be found from Namibia southwards to Worcester in the west and Willowmore in the east. Subspecies schlechteri grows in the Klein Karoo between Ceres in the west and Grahamstown in the east.[4]\n\nIn South Africa, the continued survival of all four subspecies of Felicia filifolia is considered to be of least concern because their populations are stable.[10][11][12][13]\n",
  "concepts": [
    "Felicia filifolia"
  ],
  "findings": [
    "Naming",
    "Description",
    "Differences between the subspecies",
    "Taxonomy",
    "Distribution",
    "Conservation",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:06:35.580831"
}