{
  "title": "The View UpStairs",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/The_View_UpStairs",
  "content": "The View UpStairs is a musical with music, lyrics and book by Max Vernon based on the real-life events of the 1973 arson attack at the UpStairs Lounge, a gay bar in New Orleans. This attack resulted in the deaths of 32 people, the deadliest attack[1] on a gay club in U.S. history before the 2016 Orlando nightclub shooting. The show is inspired by and pays tributes to many of the patrons who frequented the venue.\n\nThe single-act show runs for approximately 1 hour and 45 minutes and is set entirely within the UpStairs Lounge.[2]\n\nThe show's score was composed by Max Vernon in 2013 and was first performed on June 24 of that year in a concert setting with performers such as Michael McElroy and Nathan Lee Graham (who eventually went on to originate the role of Willie) amongst others.[3][4] The show then went into a workshop period in March 2016 under Invisible Wall Productions with Scott Ebersold as director and Matt Aument as musical director. The cast performed a benefit concert on July 11, 2016, for the victims and survivors of the Orlando nightclub shooting, with all proceeds going to the 'Equality Florida' institution.\n\nThe View UpStairs was first produced Off-Broadway by Invisible Wall Productions, and was also under the direction of Scott Ebersold. It began previews on February 15, 2017, at the Lynn Redgrave Theater in New York and officially premiered on February 26, before closing on May 21, 2017. It has since received a regional premiere in Richmond, Virginia[5] and Los Angeles.\n\nThe show had its international premiere at the Hayes Theatre in Sydney, Australia, under the direction of Shaun Rennie. The show was put on as part of the 40th anniversary celebrations of the Sydney Gay and Lesbian Mardi Gras and began previews on 8 February 2018 before opening on 11 February. The sold out season of 33 performances concluded on 11 March 2018.[6]\n\nFollowing the success of prior productions of the musical, several US regional productions were scheduled for the 2018–2019 season including: \n\nThe show had its European premiere at the Soho Theatre in London. This production was directed by Jonathan O’Boyle and ran from 18 July to 24 August 2019.[15]\n\nIn February 2022 the show had its first run in Japan. This production was translated, adapted, directed and choreographed by Yojiro Ichikawa.[16][17]\n\nThe Original Off-Broadway Cast recording was released on 11 August 2017.[23]\n\n‡ Cut song that is optional to put back in the show\n\nSource: Lortel.org[24]\n",
  "concepts": [
    "The View UpStairs"
  ],
  "findings": [
    "Background",
    "Productions",
    "Characters",
    "Casts",
    "Musical numbers",
    "Awards and nominations",
    "Original Off-Broadway production",
    "Sydney production",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:14:47.756480"
}