{
  "title": "Christmas in Tattertown",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Christmas_in_Tattertown",
  "content": "Christmas in Tattertown is a 1988 animated television Christmas special created and directed by Ralph Bakshi.[1] The special was an unsold pilot episode for a series, Tattertown, about a place where everything discarded in the world came alive.[2] \"Christmas in Tattertown\" aired on the cable television network Nickelodeon.\n\nA high-strung, self-absorbed young girl named Debbie opens a magic book, sucking her, a stuffed dog, and her doll Miss Muffet into the realm of Tattertown, a Fleischeresque world where discarded items come to life. Miss Muffet rejoices at her newfound sentience and freedom until Debbie attempts to reassert her dominance. Muffet runs off and transforms herself into Muffet the Merciless, set on conquering Tattertown. Sidney the Spider, a villain who had previously made failed attempts at conquering Tattertown, takes Muffet to the \"Deadster Zone\", the home of \"unsavory characters\" such as war toys and weapons, to recruit the denizens into her army.\n\nA homesick Debbie decides to introduce the concept of Christmas to Tattertown, where no one has ever heard of the holiday. She recruits Mr. Tannenbaum, a stereotypically Jewish evergreen merchant, to serve as the Christmas tree. When Muffet learns of Debbie's plans, she flashes back to past trauma of rough handling during the Christmas season and vows to stop Debbie's efforts. She decides to launch an airstrike on Tattertown disguised as Santa Claus, with Sidney as all eight reindeer, but when the real Santa flies over Tattertown, the air fleet crashes into itself, creating a fireworks display that impresses Santa and the town. Frustrated that the Tattertown residents' idea of Christmas doesn't match her view of it, Debbie plays the original recording of Bing Crosby's \"White Christmas\" as a last resort. Tattertown is overcome by love and compassion, all except an enraged Muffet, who lands in jail.\n\nWhile the residents did consider \"White Christmas\" to be a beautiful song, it is never resolved whether anyone ever grasped the true meaning of Christmas.\n\nBakshi originated the idea for Tattertown in high school, where it was originally a comic strip called Junk Town. The strip made light of the human condition by showing the value of things we throw away.[3]\n\nBakshi worked with Nickelodeon to bring his strip to life as a regular television series, which would have served as Nickelodeon's first original animated series. In 1988, they commissioned him to create a pilot for the series. It aired on December 21, 1988, during the network's Nick at Nite block of programming.\n\nOriginally the series was to be picked up in 1989 for 39 episodes, but after a controversy involving an episode from Bakshi's other series Mighty Mouse: The New Adventures, the project was abandoned.[4] Nickelodeon renamed the pilot Christmas in Tattertown and aired it annually as a special until 1992. Bakshi has retained rights to the pilot and in an interview on his official website conducted on August 2, 2007, he confirmed a DVD release, however, no such release has happened.[citation needed]\n\nIn 1995, the special aired in syndication under the title A Tattertown Christmas alongside the Rocko's Modern Life Christmas special \"Rocko's Modern Christmas!\".[5]\n",
  "concepts": [
    "Christmas in Tattertown",
    "tattertown",
    "christmas",
    "muffet",
    "series",
    "debbie",
    "special",
    "bakshi",
    "pilot",
    "nickelodeon",
    "christmas tattertown"
  ],
  "findings": [
    "Synopsis",
    "History",
    "Cast",
    "Music Dept",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [
    {
      "subject": "Christmas in Tattertown",
      "relationship": "is a",
      "object": "1988 animated television christmas special created and directed by ralph bakshi",
      "sentence": "Christmas in Tattertown is a 1988 animated television Christmas special created and directed by Ralph Bakshi."
    }
  ],
  "timestamp": "2025-04-11T13:27:28.996865"
}