{
  "title": "CFIX-FM",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/CFIX-FM",
  "content": "CFIX-FM is a French-language Canadian radio station located in Saguenay, Quebec. Its studios are located at Rue Racine Est (co-located with sister stations CJAB-FM and Noovo owned-and-operated station CFRS-DT) in the former city of Chicoutimi.\n\nOwned and operated by Bell Media, it broadcasts on 96.9 MHz using a directional antenna with a maximum effective radiated power of 100,000 watts (class C). The station's transmitter is located at Mount Valin.\n\nThe station has an adult contemporary format and is part of the \"Rouge FM\" network which operates across Quebec and Eastern Ontario.\n\nThe station received CRTC approval in 1986.[1] CFIX started operations on July 31, 1987 as a sister station to the now-defunct CJMT 1420 with a beautiful music format. The latter closed on September 30, 1994 when the Télémédia network and the Radiomutuel network merged to form the Radiomédia (now Corus Québec) network.\n\nUp until 1992, CFIX had a beautiful music format. The station switched to adult contemporary and became part of the \"RockDétente\" network as the station was renamed CFIX Rock-Détente.\n\nIn 2004, Astral Media revamped the Rock Détente network with a new logo. This resulted in CFIX Rock-Détente being renamed to simply 96,9 Rock Détente. As such, the station no longer publicly uses its callsign (although the callsign was resurrected on the station ID in 2011).\n\nOn August 18, 2011, at 4:00 p.m. EDT, all \"RockDétente\" stations, including CFIX, rebranded as Rouge FM.\n\nCFIX was formerly the callsign of a now-defunct AM radio station at 1170 kHz out of Cornwall, Ontario until 1983 when the station went dark due to technical and financial problems.\n\n48°36′04″N 70°49′44″W﻿ / ﻿48.60111°N 70.82889°W﻿ / 48.60111; -70.82889\n\nThis article about a radio station in Quebec is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "CFIX-FM"
  ],
  "findings": [
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:10:22.732142"
}