{
  "title": "Pam Galloway",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Pam_Galloway",
  "content": "Pam Galloway (born September 11, 1955) is an American physician and surgeon and a former Republican member of the Wisconsin Senate, representing the 29th District from 2011 through her resignation on March 16, 2012.\n\nGalloway graduated with a BA from the University of Chicago in 1976, and earned her MD from the University of Virginia in 1980. Galloway is a member of a number of medical committees, and was the past Chairperson of the Marathon Republican Party.\n\nShe was elected to the Wisconsin Senate in 2010, defeating incumbent Democrat Russ Decker.[1][2][3]\n\nShe had been facing an effort to recall her from office.[4] However, on March 16, 2012, Galloway announced her resignation from office due to health issues in her family,[5] leaving the Senate evenly split between Democrats and Republicans. Galloway's seat was filled in the recall election, which had already been scheduled.[6] She was succeeded by fellow Republican Jerry Petrowski.\n\nFollowing her resignation Galloway relocated to Warsaw, Indiana as to be closer to members of her extended family. In 2014 she chaired the campaign committee for Republican Curt Nisly, who was elected to the Indiana House of Representatives in 2014.[7][8] In May 2015 Galloway announced she would run to succeed Marlin Stutzman in the United States House of Representatives for Indiana's 3rd congressional district.[9] Soon after she was joined by Indiana state senator Jim Banks and later by state senator Liz Brown.[10][11] During the campaign, Galloway largely self-funded her efforts, mustering up $388,095 by the end of the primary campaign.[12][13] In the primary election, Galloway came in fourth place with 7.03% of the vote.[14]\n",
  "concepts": [
    "Pam Galloway",
    "galloway",
    "republican",
    "indiana",
    "senate",
    "resignation",
    "campaign",
    "wisconsin senate",
    "wisconsin",
    "university",
    "state senator"
  ],
  "findings": [
    "Early life and career",
    "Political career",
    "Wisconsin Senate",
    "Indiana politics",
    "Electoral history",
    "Wisconsin Senate (2010)",
    "U.S. House, Indiana's 3rd district (2016)",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:30:59.873907"
}