{
  "title": "Srđa Popović (lawyer)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Srđa_Popović_(lawyer)",
  "content": "Srđa M. Popović (pronounced [sr̩̂d͜ʑa pǒpoʋit͜ɕ]; 24 February 1937 – 29 October 2013) was a Yugoslav lawyer and political activist.\n\nSrđa Popović was born on 24 February 1937 in Belgrade to his mother Dana and father Miodrag (1907-1987), a lawyer who represented repressed communists in the Kingdom of Yugoslavia during the interwar period[1] and later continued his practice in the communist Yugoslavia. Popović has an older sister Gordana who also became a lawyer.\n\nPopović self-identified as a Yugoslav from an early age: \"During World War II, my parents sent me away to a village near Mladenovac to stay with their friends because there was no electricity and running water in Belgrade. One night we huddled around a burning stove when a group of Chetniks barged in. One of them I guess had kids of his own so he sat me down on his lap and asked me if I'm a Serb. I answered 'no, I'm a Yugoslav'. I've always been a Yugoslav. First things I learned in life were my own name, the name of the street I live in, and that I'm a Yugoslav\".[2]\n\nIn 1961, following in his father's footsteps, Popović got his law degree from the University of Belgrade's Faculty of Law and immediately began working in his father's law office that had been in operation since 1933.[3] The Belgrade-based law office eventually got renamed Popović, Popović, Samardžija & Popović once Srđa and his sister Gordana joined their father as partners;[4] the fourth partner was Petar Samardžija.\n\nSrđa Popović began his career representing commercial clients and later writers, artists and politicians that criticized the government of the Socialist Federal Republic of Yugoslavia.[1] One of the first political clients he defended was Predrag Ristić a.k.a. Peđa Isus who together with painter Leonid Šejka started a magazine and then attempted to establish a political party under Mihajlo Mihajlov's guidance. Though such course of action wasn't explicitly prohibited in the recently promulgated 1963 Yugoslav Constitution, any such attempts were swiftly cut down in the rigid one-party system of SFR Yugoslavia under the Communist League (SKJ) rule. Furthermore, the individuals behind such attempts at challenging the SKJ monopoly on political activity were immediately taken to court on trumped up charges. On this particular occasion, Ristić, Šejka, and Mihajlov were fortunate since not long after their sentencing the so-called Ranković affair exploded, and after Ranković got cleared of all charges against him, the prison term for the three of them was also abolished by president Tito.[5] In Popović's own words: \"Tito very much tried to keep up appearances to the West that his Yugoslavia was not like those people's democracy countries so the act of founding a political party was not constitutionally forbidden nor was it punishable by the criminal code. Of course, anyone who actually dared to do that, and there were some over the years, was quickly silenced through repression and the political activity for their newly established party was rendered impossible. It wasn't until the 1974 Constitution that founding a political party was made explicitly forbidden\".[5]\n\nIn March 1976, Popović was sentenced to a year in prison for \"maliciously spreading false information and causing public disorder\" by introducing evidence in support of client Dragoljub S. Ignjatović's claim that Yugoslav economic policies were unsuccessful. The case was publicized by legal and human rights groups and 106 leading American lawyers petitioned Yugoslav President Josip Broz Tito requesting that Ignjatović be freed. Signatories included Ramsey Clark, Telford Taylor, and Cyrus Vance amongst others. In May, his sentence was suspended by an appeals court though he was restricted from practicing law for one year.[6]\n\nIn 1981 Popović defended future Croatian President Franjo Tuđman and in 1982 a future top aide to Bosnian President Alija Izetbegović.[7]\n\nIn 1984, he was poised to defend a number of the Belgrade Six, a group charged with arranging meetings for \"abolishing the existing government.\" The case drew international attention given the meetings were held publicly and for numerous years and due to Yugoslavia's actions toward Popović. Amid preparing his case, he was designated as a potential witness by prosecutors and as a result was ineligible to represent them under Yugoslav law.[6]\n\nPopović later became a part of numerous petitions amongst which urged to abolish verbal offence, to remove the death penalty, to adopt an amnesty law, and to create a multiparty system.[8] At various points in his career he defended:[9][8]\n\nIn 1990, alarmed by what he considered to be SR Serbia's president Slobodan Milošević's extreme nationalism as well as the level of popular support he enjoyed, Popović created Vreme, a weekly magazine that became one of the prominent independent publications.[1] Vreme's first issue came out on Monday, 29 October, featuring, among the political and social topics, Popović's speech from the meeting of the Serb and Croat intellectuals that took place several days earlier at the University Professors' Club (Klub sveučilišnih nastavnika) in Zagreb. Prefacing his presentation by relaying a personal observation that since he didn't feel he possessed the intellectual authority of a man of science only meant he's addressing the gathering as a 'Serb', making his stance just one of 8 million possible views, Popović opined that the meeting came too early since, according to him, \"Serbs and Croats hadn't yet gone through enough soul-searching that would make them into political peoples, a mandatory prerequisite for a dialogue between nations\". He continued that this was due to the circumstance that \"just like the hundreds of millions of Europeans, Serbs and Croats went through the trauma of World War II, but then continued straight into another trauma — communism — a bloody experiment of social-political engineering that forcibly stopped their natural and organic development\". He continued: \"Both as individuals and peoples, we went through extended violence and humiliation. We experienced physical eradication, slave-like exploitation, breaking of our spine, and washing of our brain. Kočevski Rog, Bleiburg, Goli Otok, collectivization and buyout, summary executions of political opponents after gaining power, the terror of UDBA and SDB — all of them crimes, and the corpses are rising to the surface almost daily. Instead of collectively cancelling our membership in communism, we must, each nation respectively within itself, face one another. I'm not advocating anti-communist retribution, but until Serbs and Croats face their own selves, until they experience their own historical catharsis some of which predates 1945, they won't return to history, to regular time, and to the international community. The system was not only based on repression, but also, especially in its latter stages, on collaboration, corruption, intellectual capitulation, stupidity, and conformism\".[10]\n\nIn the same year Popović led the Independent Commission for Investigating the Exodus of Serbs from Kosovo[8] and published a report that argued there was little to support claims that mass physical abuse and rape against Kosovo Serbs were to blame for their emigration which had at the time been a part of public discourse in Kosovo. It argued that rather a \"model of domination\" set up by the League of Communists of Yugoslavia was the primary cause.[11]\n\nAlso, in the second part of 1990, the Federal Executive Council president (Yugoslav prime minister) Ante Marković offered Popović to lead his newly established Reform party's (SRSJ) branch for SR Serbia, a political post that would entail facing off against Slobodan Milošević and his Socialist party at the upcoming 1990 Serbian general election. Popović turned down the offer of direct political engagement,[12] instead taking the lobbying position as head of the European Movement's Yugoslav branch[8] he helped create in order to promote European integration and the idea of Federal Europe.\n\nIn 1991, Popović observed that the human rights of Kosovo Albanians are \"systematically and brutally violated\" and that \"apart from that they are subjected to racist propaganda of a kind that is inconceivable in a state that claims to protect minorities.\"[13]\n\nIn late June 1991, he left Serbia citing that \"manhood there is increasingly based on how willing you are to kill another\"[7] and pursued legal work in New York City.[6] The day he left the country coincided with the beginning of the Ten-Day War in Slovenia, itself coming two days after Slovenia declared independence from SFR Yugoslavia. In New York, Popović mostly dealt with intellectual property cases involving patents, trademarks, and authors' rights in American law firms that he previously consulted for while practicing law in Yugoslavia. For a while he entertained the idea of studying and taking exams that would eventually allow him to practice law in the United States, but eventually decided not to.\n\nIn 1993 and 1994, he served as a member of the Advisory Board of the Helsinki Committee for Human Rights in New York. In 1993, the American Bar Association awarded him the Rule of Law award.[8]\n\nDiscussing his life in New York, Popović said: \"I never stopped keeping tabs on things back home. Personally, I felt like my life ended. War, the country disintegrated, I lost the job that I worked for so many years, the only thing I had left was raising my children. There was a newsstand on the 42nd Street that sold Večernje novosti and Vreme and I'd go there every day to get the paper and read it cover to cover. I was well informed. I also had contacts with numerous human rights organizations such as the Human Rights Watch and UN Human Rights Committee that asked for my input on the situation once they found out I'm in New York. In the beginning, the information coming out of the Balkans was unclear, incomplete, and misinterpreted. Yugoslavia was low on their list of priorities. Germany was uniting, USSR was disintegrating, we were the last item on the priority list. I never turned down invitations to speak at meetings and lectures that were being held everywhere from schools, churches and city chambers. People from all over the former Yugoslavia would come and I always used my participation to insist on the establishment of the international war crimes tribunal\".[14]\n\nIn September 1993, upon Russian poet Joseph Brodsky's invitation, Popović joined about 100 other figures in petitioning American President Bill Clinton to utilize air strikes against the Serb positions in Bosnia or even Serbia in order to diminish their efforts in Bosnia and Herzegovina.[1][15] He stressed they should be warned that \"forced changes of the borders or ethnic cleansing, whether organized by Serbia in Croatia or Bosnia and Herzegovina, or by Croatia in Bosnia, will not be tolerated, let alone recognised\".[16] Following this he was criticized for \"national treason\".[1]\n\nResponding to such criticism Popović said in early 1994: \"Well, I'm a lawyer, so technically yes, I am committing an act of treason under Serbian laws. But I distinguish between the interests of the Serbian state and the Serbian people and I think these interests are opposed at this moment. The military defeat of the Milošević government is in the best interest of the Serbian people. It is something that every good Serbian patriot should wish for. I don't think I betrayed my people\".[15] Pressed further to clarify his position on the ramifications of such an act such as an implication that a violent foreign intervention can solve certain political problems, like the problem of an armed Serb secession from Bosnia-Herzegovina, or from Croatia, as well as his position on the inevitable civilian death toll if such an action is to occur, Popović said: \"I think that's an unfair question. If I see somebody trying to murder somebody else, of course my duty is to try to stop him. I'm not saying that by doing so and applying violence to the situation, I'm actually trying to help those people lead a good life. I don't know what they will do once they leave the scene. What I see Serbs doing in Bosnia is committing an act of aggression against a state that has been recognized by United Nations, and I see them committing genocide. I think that both of these things should be stopped. Of course, stopping it would not solve the problem of how these people will live next to each other in the future, but first you have to stop the crimes. The international community has an obligation to do so, under the Genocide Convention and the United Nations Charter. They have an obligation to use force to stop aggression, and to stop genocide. In any armed conflict there will be civilian casualties. Unfortunately, that's something that can't be avoided. But I don't think that this fact should prevent the international community from doing what they are obliged to do under the international law: stopping the aggression, stopping the genocide. It sounds nice to advocate peaceful means, but it is not realistic. I return to this parallel: If you see some big guy beating a kid in the street, it would be very good if you could go to him and say 'Please stop this, you shouldn't be doing this, it is uncivilized. This poor guy cannot defend himself.' No, if that doesn't work, you call the police, who have to use violence. At this point in history you have to revert to violence to stop crime.\"[15] Asked whether he signed the particular petition because of the circumstances rather than principally thinking that such measures solve problems, Popović said: \"I'll go even further. I signed this document knowing perfectly well that this will never happen. I did it as a gesture to show that I realized who's the main culprit in the Yugoslav conflict. And I wanted to express my opinion that this government would deserve it, even though it will never happen\".[15]\n\nSpeaking in 2013 about the 1993 petition, shortly before his death, Popović said: \"I signed a letter that was sent to Clinton asking for some sort of limited intervention against the official Belgrade like bombing the airports from which the planes are taking off for Bosnia. I didn't entirely agree with the letter as a whole, but I thought that some form of intervention had to happen in accordance with the convention on the genocide prevention\".[14]\n\nPopović believed that Serbia was primarily responsible for the violent dissolution of Yugoslavia: \"The disaster was started by Milošević with the help of the Yugoslav People's Army (JNA). I don't think that all three sides are equally responsible for the beginning or that all three sides are equally guilty of war crimes. I think Milošević and the JNA (which was a formidable force) started the war. And the worst and most numerous war crimes were committed by the Serbian side\".[15] He further argued it was not a civil war, but rather \"from the start an int",
  "concepts": [
    "Srđa Popović (lawyer)"
  ],
  "findings": [
    "Early life",
    "Law career and political activism",
    "Post-Tito years in SFR Yugoslavia",
    "Starting a news magazine and EU lobbying",
    "Relocation to New York at the start of the Yugoslav Wars",
    "Signing a petition asking Bill Clinton to bomb Serb positions",
    "Return to Serbia",
    "Legal involvement in the Đinđić assassination case",
    "Personal",
    "Notes",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:08:22.435878"
}