{
  "title": "Herluin of Bec",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Herluin_of_Bec",
  "content": "Herluin otherwise Hellouin (995/997 – 26 August 1078) was a knight at the court of Gilbert of Brionne and subsequently a Benedictine monk. He founded the Abbey of Our Lady of Bec, Normandy.[1]\n\nHerluin was born around 995/997 in Bonneville-Aptot, according to Mabillon, of Norman nobility.\n\nHis father was Ansgot. According to the Vita Herluini, (Gilbert Crispin, c. 1055–1117), Ansgot was descended from a Danish Viking follower of Rollo, while his mother, Heloise, was related to the counts of Flanders.\n\nIn his youth, he was a brave soldier to whom the Duke Robert gave more than one mark of esteem. Later, he was poorly paid for his services by Gislbert and began to look on the profession of arms with disgust. One day in 1034, amid a frightful melée where he had little hope of survival, he vowed to \"drop the sword\" and become a monk.\n\nHe survived and retired as a hermit to one of his fields,[2] in about 1041.[3] With several companions, he laid the foundation of a monastery at Bonneville, or Burneville, where, in 1034/1035, the Duke granted land to the abbey. Herluin built the cloister and the monastic buildings and adopted the Rule of St. Benedict.[2] On 25 March 1034 the chapel built by Herluin was dedicated by Herbert, Bishop of Lisieux. In 1037, Herluin was consecrated abbot.[4]\n\nBonneville, however, was difficult to access and lacked water. Herluin and the brothers resolved to leave, and in about 1039 settled about two miles away, by the banks of the Bec, from which the abbey gets its name.[4]\n\nGilbert of Brionne was a generous benefactor to Bec Abbey. The monastery experienced significant growth and founded a second church at Le Bec-Hellouin. William the Conqueror endowed the abbey, as did his sons.[2]\n\nLanfranc and Saint Anselm, future archbishops of Canterbury were Herluin's students. Other students of Herluin at Bec included Pope Alexander II; Theobald of Bec, Archbishop of Canterbury; William Bona Anima, Archbishop of Rouen; Guitmund, Bishop of Aversa; Arnost, Bishop of Rochester; Turold of Brémoy, Bishop of Bayeux; Yves, the Bishop of Chartres; Fulk of Dammartin, the Bishop of Beauvais; Gilbert Crispin and the Abbot of Westminster.\n\nHerluin died on 26 August 1078; at his side was Roger, abbot of Lessay.[2] His funeral was presided over by Gilbert Fitz Osbern, Bishop of Évreux.[5][2]\n\nThe remains of Herluin can be seen in the abbey church, with some of his documents. He is considered Blessed and his feast day is 26 August. He is often referred to as Saint Herluin but was not canonised.\n",
  "concepts": [
    "Herluin of Bec",
    "herluin",
    "bishop",
    "bec",
    "abbey",
    "gilbert",
    "bonneville",
    "august",
    "abbot",
    "26 august",
    "26"
  ],
  "findings": [
    "Early life",
    "Monastic career",
    "Death",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:26:38.839007"
}