{
  "title": "County of Regenstein",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/County_of_Regenstein",
  "content": "The County of Regenstein was a mediaeval statelet of the Holy Roman Empire. It was ruled by the Saxon comital House of Regenstein, named after their residence at Regenstein Castle near Blankenburg north of the Harz mountain range.\n\nThe progenitor of the family, Count Poppo I of Blankenburg (c. 1095 – 1161 or 1164) probably was related to the Rhenish Reginbodonid[1] dynasty of Archbishop Siegfried of Mainz (d. 1084), a cadet branch of the Franconian Conradines. His uncle Reinhard of Blankenburg was Bishop of Halberstadt from 1107 onwards and provided him with large estates in the Eastphalian Harzgau region between the Ilse and Bode rivers. Poppo was first documented as comes in an 1128 deed, serving the Saxon duke Lothair of Supplinburg and his Welf successors. His son Conrad was the first descendant to call himself Comes de Regenstein in 1162, while his brother Siegfried continued to rule as Count of Blankenburg.\n\nAfter the deposition of the Saxon duke Henry the Lion in 1180, the Regenstein counts were temporarily arrested by the forces of Emperor Frederick Barbarossa, but were reconciled with the Hohenstaufen monarch soon after. After a lengthy feud Heimburg Castle, built about 1170 by King Henry IV and soon after devastated during the Saxon Rebellion, was acquired by the Regenstein counts in the early 14th century. The Regenstein-Heimburg branch re-united the Regenstein and Blankenburg estates in 1343, under the rule of the most renowned Count Albert II [de] (1310–49), who since the 1330s was frequently in dispute with the leaders of the surrounding estates like the Halberstadt bishops and the Abbesses of Quedlinburg; he was finally assassinated by the henchmen of Bishop Albert II of Halberstadt. These tales were romanticised in the ballad The Robber Count (German: Der Raubgraf) by Gottfried August Bürger, melodized by Johann Philipp Kirnberger and the novel of the same name by Julius Wolff.[2]\n\nIn the 15th century the comital family finally relocated its seat to Blankenburg Castle; the Regenstein fortress lapsed and was left to ruin. In order to gain greater independence from the Halberstadt bishops, the counts turned Protestant in 1539. The last scion of the comital family, Count John Ernest, died in 1599. With Blankenburg, the County of Regenstein fell back to the Prince-Bishopric of Halberstadt. Shortly thereafter Blankenburg and Regenstein were separated: Regenstein remained with the secularised Principality of Halberstadt, while the remaining County of Blankenburg was annexed and held by the Dukes of Brunswick-Wolfenbüttel.\n\nThe following articles do not yet exist on the English Wikipedia, but do exist on the German Wikipedia:\n\nCircles est. 1500: Bavarian, Swabian, Upper Rhenish, Lower Rhenish–Westphalian, Franconian, (Lower) Saxon\n\n51°48′54″N 10°57′36″E﻿ / ﻿51.815°N 10.960°E﻿ / 51.815; 10.960\n",
  "concepts": [
    "County of Regenstein"
  ],
  "findings": [
    "History",
    "Counts of Regenstein",
    "Notes",
    "References"
  ],
  "timestamp": "2025-04-11T10:20:34.139099"
}