{
  "title": "Cecilie Broch Knudsen",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Cecilie_Broch_Knudsen",
  "content": "Cecilie Broch Knudsen (born 3 January 1950) is a Norwegian artist who was rector of the Oslo National Academy of the Arts from August 2007 to August 2015.\n\nShe was born in New York City as a daughter of diplomat Ditlef Knudsen (1911–1981) and Anna Sophie Broch (1918–2000), and grew up in several countries where her father was stationed; Canada, Turkey, Thailand and Chile.[1][2] She is a graduate of the National Academy of Craft and Art Industry, the National Academy of Fine Arts and the teachers' college Statens yrkespedagogiske høyskole. She started her career as a painter, illustrator and graphic designer.[3]\n\nFrom 1996 to 2007 she was the rector of Einar Granum Kunstfagskole, a preparatory art school.[3] In 2007 she edged out Anders Eiebakke to become the new rector of the Oslo National Academy of the Arts, a merger between two of the academies where she studied as well as three others.[2][4][5][6] During her tenure as rector, the institution became fully co-located in the former Christiania Seildugsfabrikk.[7]\n\nKnudsen has chaired the board of Trafo Art Hall in Asker[8] and has been a board member of the Jewish Museum in Oslo,[3] and Talent Norway.[9]\n\nKnudsen resides at Uranienborg, Oslo.[3] She was in a relationship to painter Odd Nerdrum from 1977 to 1991.[1] Together, they had three daughters. Quarrels between Knudsen and Nerdrum have surfaced and reached national media on several occasions. In 2011, Nerdrum was on trial for tax fraud, and publicly accused Knudsen of tipping off the tax authorities. In 2014, she sued Nerdrum over the inheritance of Nerdrum's deceased mother's house.[10][11]\n\nThis biographical article about a Norwegian academic is a stub. You can help Wikipedia by expanding it.\nThis article about a Norwegian artist is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Cecilie Broch Knudsen"
  ],
  "findings": [
    "References"
  ],
  "timestamp": "2025-04-11T10:13:22.267491"
}