{
  "title": "Norse, Texas",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Norse,_Texas",
  "content": "Norse is an unincorporated community in Bosque County, Texas, United States.[1] According to the Handbook of Texas,[citation needed] the community had a population of 110 in 2000.\n\nNorse started as a Norwegian settlement, arriving in 1845 and being swept away by the malaria epidemic in nearby Kaufman and Henderson counties in 1853. It is thought to be named for either Cleng Peerson, who started Norwegian immigration to America and suggested this area to other people, or Nicholas Hanson, a Fort Graham soldier who directed a Norwegian reconnaissance to this area. They identified the landscape as being similar to that of eastern Norway. The first settlers included families surnamed Questad, Ringness, and Grimland, settling in the area that next year. More Norwegian settlers homesteaded along the Meridian, Gray, and Turkey Creek areas. Norse was then born with the establishment of a few shops and other scattered buildings for social life. A Lutheran church named Our Savior's Lutheran Church was established in 1878. A post office was established at Norse in 1880 and remained in operation until 1929. The Norse Mutual Fire Insurance Company was established in the mid-1880s. It was a nonprofit, shared-risk organization that was so successful that its directors were forced to limit membership to families living within 20 miles of the community. It continued operation until 1984. Norse's decline began when paved roads were built in the community, causing economic growth in other cities nearby. The descendants of the first settlers continued to gather at the church in the mid-1980s, making it the only public building in the community. Smörgåsbords would be held in Norse every November since 1949. King Olav V visited the church to honor Peerson's success in bringing people to the area in 1982; Peerson is buried in the community's cemetery. Its population was 100 in 1980 and gained ten more residents at the end of the decade into 2000.[2] Its population remained at 110 in 2010 and was the largest and most successful Norwegian community in Texas. The cemetery has a notable marker with pictures of the first settlers.[3]\n\nOne of the stores in the community was owned and operated by Thomas Theodore Colwick, who sold perfume, toiletries, and medicines.[4]\n\nNorwegian settler Berger Rogstad is also buried in the community's cemetery.[5]\n\nNorse is located on Texas Farm to Market Road 182, 40 mi (64 km) west of Waco,[2] 10 miles (16 km) west of Clifton, and 15 mi (24 km) east of Cranfills Gap in southwestern Bosque County.[3]\n\nA school made of rock was used for religious services until the Lutheran church was established in 1878. It closed sometime after 1929.[2] Norse is served by the Clifton Independent School District.\n\n Media related to Norse, Texas at Wikimedia Commons\n",
  "concepts": [
    "Norse, Texas"
  ],
  "findings": [
    "History",
    "Geography",
    "Education",
    "Notable Person",
    "See also",
    "References",
    "Further reading",
    "External links"
  ],
  "timestamp": "2025-04-11T10:10:34.445406"
}