{
  "title": "Russ Lorenson",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Russ_Lorenson",
  "content": "Russ Lorenson (born July 5, 1963, birth name Russ Gangloff) is an American singer and actor, often called \"San Francisco's Favorite Crooner\".[1] Though a stage actor since childhood, Lorenson established a reputation in the mid-2000s as an interpreter of jazz standards. With a retro crooner style, his sound and approach have been described as an amalgam of Broadway, jazz, and pop.[2][3] His recordings include the albums A Little Travelin' Music, What I Want for Christmas, In The Holiday Spirit, and Standard Time: Live In New York.[4][1][5][6] He has performed alongside artists such as Eartha Kitt, Karen Mason, Andrea Marcovicci, Teri Ralston, Dale Kristien, and Wesla Whitfield.[7][8] Lorenson's work has received praise from publications such as DownBeat* magazine, TalkinBroadway.com, and the Los Angeles Times.[5][9]\n\nLorenson was born in Upland, Pennsylvania, and began performing at the age of seven.[10] His family relocated to San Diego when he was nine, where he continued to be active in musical theater and vocal performance throughout his school years. While attending Patrick Henry High School, he sang and toured with a classical vocal ensemble and was recognized for his early compositions, winning a young artists’ competition.[11]\n\nAt age 18, he adopted the stage name \"Lorenson\" in honor of his teacher and mentor Loren Salter, under whom he studied voice and conducting. Lorenson later served as Associate Conductor of the California Youth Chorale, an ensemble founded by Salter.[12] During this time, he also began appearing with regional theaters in San Diego, including Starlight Musical Theatre, Lyric Opera San Diego, and Diversionary Theatre.[13]\n\nIn the early 2000s, Lorenson began transitioning back into performance while still working in the technology sector. His involvement with San Francisco's 42nd Street Moon theater company marked a turning point, where he appeared in several productions reviving rarely performed Broadway musicals, such as Finian’s Rainbow, Minnie’s Boys, Red, Hot & Blue!, and The Golden Apple.[14][15] He also performed with the Willows Theatre Company in productions including 1776, The Secret Garden, and two sequels to Nunsense.[16]\n\nIn 2005, Lorenson left his corporate career to pursue music full time. Under the musical direction of jazz pianist Kelly Park, he began performing regularly in San Francisco venues like the Empire Plush Room and Feinstein’s at the Nikko.[17] His debut nightclub act, A Little Travelin’ Music, inspired by his global travels in tech, was followed by a recording of the same name.[4] Subsequent themed shows included tributes to Tony Bennett, Bobby Darin, and Barry Manilow.[7]\n\nFor over a decade, Lorenson’s annual holiday show, Christmas in San Francisco with Russ Lorenson & Friends, became a seasonal staple in the Bay Area. He has shared the stage with notable performers such as Eartha Kitt, Karen Mason, Andrea Marcovicci, and Teri Ralston.[7][8] His albums have received critical acclaim, including a four-star review and “Best Albums of 2015” listing from DownBeat for In The Holiday Spirit.[5]\n\nIn 2021, Lorenson was diagnosed with HPV-positive tonsil cancer after experiencing severe throat symptoms. He underwent seven weeks of radiation and chemotherapy, which successfully eradicated the cancer but left lasting effects on his vocal ability. As a result, Lorenson retired from live performance. He has spoken openly about the impact of the diagnosis and his decision to focus on preserving his legacy through recordings and new creative ventures.\n\nIn 2023, Lorenson released Standard Time: Live In New York, an album culled from 2008 recordings at New York's Metropolitan Room nightclub.[4] The project was co-produced with Dutch music producer René Wieland and received coverage in outlets such as Cabaret Scenes, Modern Mystery Blog, and Indie Music Discovery.[1][6] Following the release, Lorenson announced future projects including a series of children's books, beginning with a Christmas-themed story based on the song \"Jingles, The Christmas Cat.\"\n\n[18]\n\nLorenson was nominated for a 2007 MAC Award by the Manhattan Association of Cabarets and Clubs for his show *Benedetto/Blessed: A Tribute to the Life and Music of Tony Bennett*. In 2024, he received two additional MAC Award nominations: one in the Recording category (The LaMott Friedman Award) for *Standard Time: Live In New York*, and another in the Song category for \"It's Raining Memories,\" with music by Kelly Park and lyrics by Lorenson. \n\nHis album *In The Holiday Spirit* was awarded four stars by *DownBeat* and named one of the magazine’s Best Albums of 2015.[5] He has also been featured in coverage by *TalkinBroadway.com*, *The Los Angeles Times*, and other notable publications.[9]\n",
  "concepts": [
    "Russ Lorenson",
    "lorenson",
    "san",
    "music",
    "time",
    "new",
    "york",
    "san francisco",
    "received",
    "new york",
    "live"
  ],
  "findings": [
    "Early Life and Training",
    "Career",
    "Loss of Singing Voice and Recent Projects",
    "Discography",
    "Selected Theatrical Productions",
    "Awards and Achievements",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:19.790275"
}