{
  "title": "City College stampede",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/City_College_stampede",
  "content": "The City College stampede was a crowd crush event on December 28, 1991, in the City College of New York gymnasium during a charity basketball game organized and promoted by hip hop celebrities P. Diddy and Heavy D. Nearly 5,000 people tried to pack into the gymnasium, which could fit 2,730 people.[1] Outside, people broke through at least one glass door leading to the gymnasium lobby. The crowd rushed the lobby and down a short staircase that led to the gymnasium. \n\nHowever, doors at the bottom of the stairs opened inward into the lobby, not outward into the gymnasium.[2] The doors were left closed for up to 15 minutes as the crush worsened.[1] Nine people were crushed to death at the bottom of the staircase, while 29 others were injured.[2]\n\nThe nine people killed were from various parts of New York City and surrounding areas.  Jabaal Rainey was 15 and from Harlem, not far from the event. The other victims were Leonard Nelson Jr., 17, from The Bronx; Laytesha Heard, 19, from The Bronx; Sonya Williams, 20, from New Rochelle; Dawn McCaine, 20, from Brooklyn; Yul Dargan, 24, from The Bronx; Charise Ann Noel, 26, from Brooklyn; Darren Brown, 28, from The Bronx; and Dirk Swain, 20, from The Bronx.[3]  No criminal charges were filed following the incident, although multiple wrongful death and personal injury lawsuits were filed.[4]\n\nAccording to The New York Times, \"Dirk Swain had cheated death once this year, surviving a gunshot wound to the head\" when a fraternity party in Virginia turned violent last September.  \n\nAccording to the New York Post, a documentary titled \"No Way Out\" was produced by Dirk Swain's younger brother, Jason Swain, that details the event and the attendees.[3][5]\n",
  "concepts": [
    "City College stampede"
  ],
  "findings": [
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:08:40.118977"
}