{
  "title": "Exton, Pennsylvania",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Exton,_Pennsylvania",
  "content": "Exton is a census-designated place (CDP) in West Whiteland Township in Chester County, Pennsylvania, United States. Its population was 5,622 at the 2020 census. The Exton Square Mall and Main Street at Exton are both located within Exton along with several other shopping centers, making Exton the major shopping district in Chester County.\n\nExton lies at the intersection of U.S. Route 30 (formerly the Lancaster Road, and later the Lincoln Highway) and Pennsylvania Route 100 (Pottstown Pike). Beginning in the late 18th century, the Lancaster Road became a major transportation route between Philadelphia and the west, while what is now Route 100 was a regional north–south route to Pottstown. A theory exists that Exton was named as the \"X\" on the map, denoting this intersection, though more likely the village was named after one of the several Extons in the United Kingdom.\n\nIn the late 1940s, Exton became home to the Newcomen Society of the United States. The campus of the learned society was built overlooking farmland on Newcomen Road, and featured offices, a printing shop, library and museum, guest houses, a chapel and a belltower with a carillon. The Newcomen Society (since dissolved) sold the property in the late 1990s, but its campus remains an Exton landmark serving as the headquarters of another business.\n\nAccording to the U.S. Census Bureau, the CDP has a total area of 3.2 square miles (8.3 km2), all  land.\n\nAccording to the Köppen Climate Classification system, Exton has a hot-summer humid continental climate, abbreviated \"Dfa\" on climate maps.[3]\n\nAs of the 2020 U.S. census, the racial makeup of the CDP was 62.5% White non-Hispanic, 3.8% Black of African American, 31.5% Asian, 0.9% two or more races, and 1.3% were Hispanic or Latino.[6]\n\nAs of the census[7] of 2000, there were 4,267 people, 2,053 households, and 1,096 families residing in the CDP. The population density was 1,341.6 inhabitants per square mile (518.0/km2). There were 2,128 housing units at an average density of 669.1 per square mile (258.3/km2). The racial makeup of the CDP was 88.07% White, 4.05% African American, 0.14% Native American, 6.05% Asian, 0.02% Pacific Islander, 0.54% from other races, and 1.12% from two or more races. Hispanic or Latino of any race were 1.87% of the population.\n\nThere were 2,053 households, out of which 20.9% had children under the age of 18 living with them, 45.4% were married couples living together, 5.8% had a female householder with no husband present, and 46.6% were non-families. Of all households 37.5% were made up of individuals, and 7.9% had someone living alone who was 65 years of age or older. The average household size was 2.05 and the average family size was 2.75.\n\nIn the CDP, the age distribution was: 17.9% under the age of 18, 5.9% from 18 to 24, 43.3% from 25 to 44, 20.6% from 45 to 64, and 12.3% who were 65 years of age or older. The median age was 35 years. For every 100 females, there were 92.6 males. For every 100 females age 18 and over, there were 90.8 males.\n\nThe median income for a household in the CDP was $68,240, and the median income for a family was $81,499. Males had a median income of $65,789 versus $42,778 for females. The per capita income for the CDP was $38,589. About 1.5% of families and 2.9% of the population were below the poverty line, including 1.1% of those under age 18 and 10.1% of those age 65 or over.\n\nExton currently has an unemployment rate of 3.80% with a job growth rate of 1.44%. The future job growth is predicted to be 39.10% over the next ten years.[8] The opening of the Exton Square Mall led to rapid growth in West Whiteland Township, with the population increasing from 7,900 in 1973 to over 16,000 by 2000. Since the opening, many shopping centers and office parks have been built in the township. Following the opening of the mall, the West Whiteland Township Police Department was created to patrol the township as the demand from the mall would be too much for the Pennsylvania State Police to handle.[9] When the Exton Square Mall first opened, several stores in downtown West Chester closed.[10] In 2011, the Exton Square Mall saw sales per square foot of $332.[11]\n\nWest Pharmaceutical Services, a designer and manufacturer of injectable pharmaceutical packaging and delivery systems is based in Exton.\n\nThe main location of the Chester County Library System is accessible from the mall. The building was dedicated to honor Congressman Paul B. Dague in 1971.[12] In 1982, the library in Exton received a National Association of Counties Award for its Library Literacy Program, the first in Pennsylvania to handle 30,000 illiterate and 15,000 non-English speaking residents.[13]\n\nAll residents of the Exton census-designated place, entirely in West Whiteland Township, reside in the West Chester Area School District.[14]\n\nHalf of Exton is zoned to Exton Elementary, located in Exton, while the other half is zoned to Mary C. Howse Elementary School.[15] Half of the CDP is zoned to Fugett Middle School and West Chester East High School, while the other half is zoned to Peirce Middle School and West Chester Henderson High School.[16]\n\nDowningtown Area School District serves some areas with Exton postal addresses, and Downingtown High School East Campus and Lionville Middle School have Exton addresses.[17]\n\nOther schools in the Exton area are the Catholic parish school Saints Philip and James of the Roman Catholic Archdiocese of Philadelphia,[18] and the Church Farm School, which are near but not in the CDP.\n\nTroy University has a learning site in Exton. Exton is home to the offices of 21st Century Cyber Charter School, a statewide cyber school that is known for being the only cyber school to make Pennsylvania's AYP (Adequate Yearly Progress) benchmark 5 years in a row.[19]\n\nBoth Widener University and the Delaware County Community College operate in Exton in the Whiteland Business Park.\n\nChester County Library and District Center, the main library of the Chester County Library System, is in Exton.[20]\n\nExton is generally served by a network of highways, including U.S. Route 202, U.S. Route 30, and PA 100, which connect with Philadelphia, Lancaster, and Wilmington.\n\nExton is served by the SEPTA Regional Rail at the Whitford and Exton train stations and the Exton Transportation Center located inside the Exton Square Mall complex.\n\nThe Exton Transportation Center is a SEPTA bus terminal located on the eastern side of the Exton Square Mall. The station serves as a hub for transfers between SEPTA Routes 135 and 204 with service to West Chester, Coatesville, Paoli and Eagleview.[21]\n\nRail service at Exton station is provided by Amtrak's Keystone Service and Pennsylvanian lines, as well as SEPTA's Paoli/Thorndale Line. The station is located close to the former Whiteland station served by the former Pennsylvania Railroad.\n",
  "concepts": [
    "Exton, Pennsylvania"
  ],
  "findings": [
    "History",
    "Geography",
    "Climate",
    "Demographics",
    "Economy",
    "Arts and culture",
    "Education",
    "Primary and secondary schools",
    "Colleges and universities",
    "Public libraries",
    "Infrastructure",
    "Transportation",
    "Transit",
    "Notable people",
    "Gallery",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:07:52.132965"
}