{
  "title": "Matt Freese",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Matt_Freese",
  "content": "Matthew Andrew Geary Freese (born September 2, 1998) is an American professional soccer player who plays as a goalkeeper for Major League Soccer club New York City FC.\n\nBorn in Wayne, Pennsylvania, Freese went through the Philadelphia Union youth academy before appearing on the bench with Union reserve side, Bethlehem Steel, during the 2017 season. Not long after, Freese enrolled at Harvard and played college soccer for the Harvard Crimson, where his older brother Jack rowed heavyweight crew.[2][3][4]\n\nOn December 21, 2018, it was announced that Freese would leave Harvard early and join Major League Soccer club Philadelphia Union at the beginning of their 2019 season.[5]\n\nFreese made his professional debut on April 19, 2019, coming on as a 54th-minute substitute for Andre Blake in a 3–0 home win against the Montreal Impact.\n\nOn November 8, 2020, Freese made his lone start of the 2020 season against the New England Revolution on MLS Decision Day. He made one save and kept a clean sheet as the Union clinched their first trophy in club history, the Supporters' Shield.[6]\n\nOn January 27, 2023, Freese was traded to New York City FC in exchange for a guaranteed $350,000 of General Allocation Money, with a possibility of an additional $400,000, as well as a percentage of a future transfer fee.[7] On December 27, 2024, Freese was named New York City FC's MVP (Most Valuable Player) for the 2024 season after finishing third in the MLS in saves and fourth in save percentage.[8] This marked the first time since 2021 that New York City FC gave out the award.[8]\n\nFreese has represented the United States at the U-19 and U-23 levels. Freese was named to the final 20-player United States under-23 roster for the 2020 CONCACAF Men's Olympic Qualifying Championship in March 2021.[9] On January 6, 2024, Freese was called up to the US Men's National Team by head coach Mauricio Pochettino ahead of the January camp in Florida, with friendlies against Venezuela and Costa Rica. Freese did not play in either game.[10]\n\nPhiladelphia Union\n",
  "concepts": [
    "Matt Freese"
  ],
  "findings": [
    "Club career",
    "Professional career",
    "Philadelphia Union",
    "New York City FC",
    "International career",
    "Career statistics",
    "Club",
    "Honors",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:09:14.032042"
}