{
  "title": "2019 Pro Bowl",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/2019_Pro_Bowl",
  "content": "The 2019 Pro Bowl was the National Football League's all-star game for the 2018 NFL season, played on January 27, 2019, at Camping World Stadium in Orlando, Florida. It was televised nationally by ESPN and its sister networks.\n\nThe 2019 game featured the same format as the previous five editions. For the sixth straight year, the Pro Bowl differed from standard NFL game rules and format in that there were no kickoffs and every quarter had a two-minute warning.[1] Also, the play clock was only 35 seconds, and the game clock ran after pass incompletions, except with less than two minutes left in either half (or overtime, had it been necessary).[2]\n\nAs with the previous Pro Bowl, a modified limited-contact form was used, and play was called dead as soon as a player was surrounded and likely to be tackled.[3]\n\nat Camping World Stadium in Orlando, Florida\n\nSource:[4]\n\nThe following players were selected to represent the AFC:\n\nNotes:\nPlayers must have accepted their invitations as alternates to be listed; those who declined are not considered Pro Bowlers.\n\nThe following players were selected to represent the NFC:\n\nNotes:\nPlayers must have accepted their invitations as alternates to be listed; those who declined are not considered Pro Bowlers.\n\nThis was the last year of a three-year deal that began in 2017 that the Pro Bowl will be held at Camping World Stadium in Orlando, Florida.[33]\n\nThe game was televised nationally by ESPN, and simulcasted by ABC and Disney XD,[34] and broadcast via radio by Westwood One. The game was carried in Spanish by ESPN Deportes. In contrast to the network's \"megacast\" approach to other multi-network games, all three English-language TV channels carried the same feed. It was the first time the NFL Pro Bowl was aired on a cable network that targets children: Disney XD.\n",
  "concepts": [
    "2019 Pro Bowl"
  ],
  "findings": [
    "Game format",
    "Summary",
    "Box score",
    "Scoring summary",
    "Game statistics",
    "AFC Rosters",
    "Offense",
    "Defense",
    "Special teams",
    "NFC rosters",
    "Offense",
    "Defense",
    "Special teams",
    "Number of selections per team",
    "Background",
    "Host selection process",
    "Broadcasting",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:23:18.494065"
}