{
  "title": "Dutch Malacca",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Dutch_Malacca",
  "content": "Dutch Malacca (1641–1825) was the longest period that Malacca was under foreign control. The Dutch ruled for almost 183 years with intermittent British occupation during the French Revolutionary and later the Napoleonic Wars (1795–1815). This era saw relative peace with little serious interruption from the Malay sultanates due to the understanding forged between the Dutch and the Sultanate of Johor in 1606. This period also marked the decline of Malacca's importance. The Dutch preferred Batavia (present-day Jakarta) as their economic and administrative centre in the region and their hold in Malacca was to prevent the loss of the city to other European powers and, subsequently, the competition that would come with it. Thus, in the 17th century, with Malacca ceasing to be an important port, the Johor Sultanate became the dominant local power in the region due to the opening of its ports and the alliance with the Dutch.\n\nIn the early 17th century, the Dutch East India Company (Dutch: Verenigde Oostindische Compagnie, VOC) began a campaign to usurp Portuguese power in the East. At that time, the Portuguese had transformed Malacca into an impregnable fortress (the Fortaleza de Malaca), controlling access to the sea lanes of the Strait of Malacca and the spice trade there. The Dutch started by launching small incursions and skirmishes against the Portuguese. The first serious attempt was the siege of Malacca in 1606 by the third VOC fleet from the Dutch Republic with eleven ships, under Admiral Cornelis Matelief de Jonge that led to the naval battle of Cape Rachado. Although the Dutch were routed, the Portuguese fleet of Martim Afonso de Castro, the Viceroy of Goa, suffered heavier casualties and the battle rallied the forces of the Sultanate of Johor in an alliance with the Dutch and later on with the Acehnese.\n\nThe Dutch along with their local Javanese allies numbered around 700 men, assaulted and wrested Malacca from the Portuguese in January 1641. Assistance was also provided to the Dutch from the Johor Sultanate who provided around 500–600 additional men. The Dutch also received supplies and rations from nearby and their recently-captured base of Batavia.[1] The campaign effectively destroyed the last bastion of Portuguese power, removing their influence in the Malay Archipelago. As per the agreement with Johor in 1606, the Dutch took control of Malacca and agreed not to seek territories or wage war with the Malay kingdoms.\n\nAfter the conquest of Malacca, the town yielded great profits in the 17th century, mostly due to the tin trade coming from Perak.[2]: 104  But by 1700, the Dutch struggled to revive trade in Malacca. In that year, the town was rarely able to meet its tin quotas sent to Batavia. There were several attempts to revive trade by the governor, but VOC officials in Batavia was unwilling to improve tin trading prospects there and instead made policies to divert trade to Batavia. An Englishman described the town in 1711 \"a healthful place, but of no great trade\". The start of Bugis rule under the Johor Sultanate encouraged trade to Riau and served to reduce trade activity in Malacca.[2]: 102–105 \n\nRoger de Laver, the governor of Malacca in 1743, commented that despite his efforts to encourage the tin trade, it still did not see any improvement and attributed it from intense competition as Indian traders mainly traded in Aceh, Kedah and Perak.[2]: 107 \n\nIn January 1795, Dutch stadtholder William V, Prince of Orange, seeking refuge in Great Britain, issued the Kew Letters, directing Dutch governors in the colonies to temporarily transfer authority to the United Kingdom and to cooperate with the British in the war against the French, so long as the \"mother country\" was under threat of invasion. Malacca was thus surrendered to British control, and would be under British occupation until the end of the Napoleonic Wars. Malacca remained under nominal Dutch sovereignty throughout the nearly two decades of British governance.\n\nUnder British administration, the Portuguese-era fortress of Malacca was demolished in stages beginning in 1807, as the British feared that the Dutch would use it against them in any future regional conflict. Only the Porta de Santiago (A Famosa) was spared destruction after the belated intervention of Sir Stamford Raffles.\n\nThe Anglo-Dutch Treaty of 1814 restored Malacca to Dutch rule; however, the Dutch did not regain full control until 1818. Sovereignty over Malacca was permanently ceded to the British under the Anglo-Dutch Treaty of 1824.\n\nMalacca was controlled as a colony of the VOC. All the chief administrators of Malacca were Dutch governors except for the brief period that the city was under British Residents during the Napoleonic Wars. However, focus on the administration of Malacca eventually waned by the Dutch as they preferred to focus on Batavia.[3]\n\n\nThe Dutch improved and expanded the Portuguese fortress as well as renovating the fortress' gate in 1670, they further built walls to protect the harbour and expanded city.[citation needed] During the mid-17th century the city hall or Stadthuys was constructed and served as the administrative center of the Dutch colony, which still stands today.[4]\n2°11′20″N 102°23′4″E﻿ / ﻿2.18889°N 102.38444°E﻿ / 2.18889; 102.38444\n",
  "concepts": [
    "Dutch Malacca"
  ],
  "findings": [
    "History",
    "Dutch conquest of Portuguese Malacca",
    "Decline in trade",
    "Transfer of control to the British",
    "Administration of Malacca",
    "Governors of Malacca",
    "The town and fortress of Malacca",
    "See also",
    "References",
    "Further reading"
  ],
  "timestamp": "2025-04-11T10:18:58.842529"
}