{
  "title": "Old Pyrmont Cottages",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Old_Pyrmont_Cottages",
  "content": "Old Pyrmont Cottages is a heritage-listed cottage at 1, 3, 5 Cross Street in the inner city Sydney suburb of Pyrmont in the City of Sydney local government area of New South Wales, Australia. It was built from 1879 to 1895. It is also known as Cross & Scott Street Terraces. The property is owned by the Sydney Harbour Foreshore Authority (SHFA). It was added to the New South Wales State Heritage Register on 25 August 2017.[1]\n\nUntil recently it has been assumed that the original indigenous peoples who inhabited the Pyrmont Peninsula were the Gadigal clan group of the Eora Nation. There are about 29 clan groups of the Sydney metropolitan area, referred to collectively as the Eora Nation groups in the Sydney area. With the invasion of the Sydney region, the Gadigal people were decimated but there are descendants of the Eora still living in Sydney today. The surrounding bush land contains remnants of traditional plant, bird and animal life with fish and rock oysters available from Blackwattle Bay.[2] Eora being a European nomenclature for the original \"nation\" that inhabited the land However, recent research suggests that the Gadigal habitually used the land east of the ridge that runs down the spine of central Sydney, separating Tallawolodah (The Rocks) and Tar-ra (Dawes Point) from what became known as Millers Point, while those who lived around Go-mo-ra (known to Europeans as Darling Harbour) may have formed a separate clan from the generally recognised Gadigal. Tentatively named the Gommerigal, this group has yet to be officially recognised but early settler documents point to its existence. The first governor, Arthur Phillip, listed the Gomerrigal [sic] in 1790 as among \"other Tribes that live near us\". Early records locate these people at Long Cove, the place that eventually became known as Darling Harbour, and as late as 1830 Absalom West recognised a 'Darling Harbour \"tribe'\". The probable territory of the Gommerigal included land around Darling Harbour from Millers Point on the east, and Pyrmont on the west, at least back to Blackwattle Bay.[1]\n\nDisease and dislocation altered the clan and nation affiliation of the Indigenous people who frequented Pyrmont, probably known to them as Pirrama, but sparse European settlement and the presence of a good natural spring of fresh water, rock shelters, sandy beaches and good fishing grounds ensured that they continued to visit the place until well into the 19th Century.[1]\n\nSprings, where freshwater continually seeped out of cracks in outcrops of sandstone, were particularly valuable to Aboriginal people and then the European colonists on rocky peninsulas like Pyrmont, because freshwater creeks lay some distance away. One of these springs was located at Pyrmont and became known as Tinker's Well. This spring was located in a large sandstone overhang, and water collected into a natural dish in the sandstone floor of the shelter. In the early 20th century, an old Pyrmont resident recalled that \"through the mosses and ferns\" of the overhang \"trickled musically a small stream of pure, cold water\". Other Pyrmont residents recalled evidence of the Aboriginal use of Tinker's Well, describing \"numerous mussel shells\" and other shellfish that were still visible near the spring in the early 20th century. These were almost certainly signs of an Aboriginal campsite, or midden. Residents also recalled that the natural bowl under the spring had been \"roughly carved out\" long before it was enlarged by European quarrymen, and it seems likely that this was done by Aboriginal people using the spring.[1]\n\nAboriginal people continued to live in the Pyrmont area into the 19th century, but quarrying and intense industrial and urban development in the area has destroyed most traces of their presence both before and after the arrival of Europeans. The shelter containing Tinker's Well was destroyed in the early 20th century, but water continues to flow down sandstone outcrops behind a modern apartment building nearby in the vicinity of the original spring. (Irish and Goward)[1]\n\nEarly settlers, without regard to Indigenous ownership of the land, received land grants from the Crown in the late 18th century. The majority of the Pyrmont peninsula was granted or acquired in the early years of the colony by Surgeon John Harris, with the exception of 22 hectares (55 acres) of the point facing Darling Harbour, which was granted to Thomas Jones, a private in the NSW Corps in 1795. The Old Pyrmont Cottages are located within Jones' 55 hectares (140 acres). The land was not developed for many years. It was acquired by Sergeant Obadiah Ikin before being sold in 1799 to the prominent colonial businessman, John Macarthur. Macarthur is said to have named the area \"Pyrmont\" in 1806 after a spa town in Germany because of the freshwater spring known as Tinker's Well. Macarthur briefly manufactured salt at Pyrmont and constructed a windmill there. After Macarthur's death, his son Edward began clearing the land for subdivision, the windmill was demolished and Harris Street was extended to the estate in 1836. The initial subdivision was placed on the market in 1839-40 and sold well, however when the next lots were released an economic depression had begun and most of these blocks, including the site of the Old Pyrmont Cottages, did not sell. In the nineteenth century Pyrmont proved more attractive to quarrying, waterfront industry and commercial property speculators than those wanting to build large residences.[1]\n\nThe main development that took place after the 1840s depression was based around the maritime industry and related industrial activities. Pyrmont remained isolated. The continuing rural nature of the adjoining, undeveloped Ultimo Estate retarded easy access, although there was a ferry. The first Pyrmont Bridge opened in 1858, providing better access to the city and encouraging the council to improve the streets and water supply but this did not result in the expected growth and development at the northern end of the peninsula. Stone quarrying in Pyrmont had been primarily for local purposes until the 1850s when the superior quality of its sandstone was recognised. Orders for the construction of Sydney University marked the first move towards large scale quarrying operations. Growth in the residential population of Pyrmont remained slow and despite shipping activity in Pyrmont Bay and the development of the Darling Harbour goods yards in the 1870s, much of Pyrmont remained underdeveloped until the Colonial Sugar Refinery (CSR) began operations there in 1879. The population of the whole Pyrmont peninsula grew and peaked somewhere between the 1891 and 1901 censuses at around 20,000 people. Thereafter the population fell as the refinery, wool stores, flourmills and other industrial operations expanded, reaching a low of around 1,600 people in the 1981 census, when Pyrmont was being deindustrialised and urban renewal had not yet begun.[1]\n\nThe land on which the Old Pyrmont Cottages are sited was leased by Edward Macarthur to George Wigram Allen in 1854, but initially he did little with it. Then in the late 1870s Allen began sub-leasing the lots to various people who built cottages there in response to the stimulus provided by the establishment of CSR and the Saunders Quarries. Cross and Young (later Scott) Streets were laid out, named and numbered. By 1879 some of the Old Pyrmont Cottages were in existence and being taxed by council. The last of the five cottages to be built was No 8 Scott St, constructed in 1895. The timing and diversity of the cottages' construction suggests that sub-leaseholders were developing the properties individually. It is likely that the cottages were not built by landlords then rented to tenants. Instead tenants rented the land and built a modest cottage in \"vernacular\" styles with whatever materials and construction techniques were readily available and without council supervision. These tenants were followed by other tenants who lived in and continually adapted the buildings to suit their residential needs. This was a common practice in the inner city and elsewhere during the 19th century.[1]\n\nIn 1911 ownership of the block on which the Old Pyrmont Cottages are located was transferred to the Camden Park Estate, as part of the Allen family company holdings, where it remained until c. 1940. The houses remained tenanted but resumptions for railway extensions in 1914 lead to the demolition of houses around the site. By the 1950s most of the housing and commercial buildings in the block were considered decrepit, and the conditions that tenants endured attracted media attention.[3] The oldest cottages on the same block, in Bowman Street, were demolished and there was increasing pressure to demolish the rest, including the Old Pyrmont Cottages, initially to make the land available for industrial uses and later for residential use. City Council, which had owned the block bounded by Bowman, Cross, Scott and Harris streets since 1952, and Landcom made an agreement in 1981 to clear the old housing stock for a new housing development - even the roadways were closed in preparation.[1]\n\nIn the 1970s, extensive areas occupied by inner city housing were designated by the NSW Department of Main Roads (DMR) as being required for a complicated system of freeways and roads planned to connect the western suburbs to the city. These would have obliterated parts of the residential stock of Pyrmont in the process. Hundreds of houses became \"DMR affected\" and residents all over the inner city became politically active in a campaign to stop these freeway developments. By the mid-1970s many of the plans had been shelved, but not before houses had become run down and in some cases tenants had been evicted. These places soon became occupied by squatters - people who moved into unoccupied premises and lived there without formal tenancy or paying rent. The idea of using surplus inner urban properties to house the unemployed and the poor had evolved into a movement and squatting was elevated to a social right. Even some elected members of the City Council supported the rights of squatters, especially in places such as Pyrmont where the community was under stress as industry left and places stood empty.[1]\n\nIn 1978 all tenants on the block occupied by the Old Pyrmont Cottages had been evicted in anticipation of a proposed residential project but when the re-development work paused, squatters quickly moved in. Squatters remained there until 1994 despite a NSW Supreme Court ruling in favour of their eviction in 1984.[1]\n\nThe Supreme Court judge remarked that he found it distasteful to find against the squatters as the current level of social security benefits were \"inadequate for people to live at a level which is above the poverty line,\" but it was not his role to require council to provide emergency accommodation. At various times Sydney city aldermen and even the State Minister for Housing supported the squatters' tenure, using arguments that ranged from heritage issues to concern for housing the city's poor and unemployed in the context of housing shortages.[1]\n\nSquatting occurred in many different parts of Sydney at this time of housing shortages, but the \"Pyrmont Squat\" including the Old Pyrmont Cottages and also houses and commercial buildings in adjoining blocks was possibly the most tenacious and long lasting. Although the practice of squatting was widespread in the 1980s, it was also, by its very nature, undocumented and largely unrecorded. The Pyrmont Squat is unusual for being subject to several legal cases, including Supreme Court rulings that document the practices of squatting.[1]\n\nThe squatters kept up a level of maintenance and weatherproofing which ensured the survival of the cottages. The recollections and private collections of squatters interviewed for the 2005 and 2011 CMPs also illustrate how they decorated and modified the Old Pyrmont Cottages and other nearby buildings, with internal and external murals and painted floors, holes in adjoining walls to facilitate light, access and escape, and the construction of shared bathroom facilities. The ways in which the squatters regulated their own communities, came together for music and other creative ventures, furnished their living spaces, and raised money for court cases with a speak-easy on the corner of Harris and Scott Streets is also documented. The squatters were involved in community based organisations such as the Pyrmont Self-Help Housing Co-operative, and the tongue in cheek Republic of Pyrmont, which argued for secession on the grounds that local taxes were contributing to local destruction. These and other resident action groups were active in gaining support from the churches and trade unions in opposing the redevelopment of Pyrmont.[1]\n\nFollowing extensive demolition of nineteenth century streetscapes throughout Sydney in the post-World War II period, the general public was beginning to appreciate the historic value, charm and increasing rarity of nineteenth century vernacular buildings and streetscapes. The \"Cross St Group,\" including the Old Pyrmont Cottages,' consisting of 109-19 Bowman St, 1-5 Cross St, 42-52 Harris St and 2-8 Scott St, were recorded by the NSW chapter of the National Trust and included on their heritage register in 1982. Then the National Trust, the RAIA (the architects' association) and RAPI (the planner's association) all supported nomination of the block for listing on the statutory heritage list of the Australian Government, the Register of the National Estate, which finally took place in 1998. Several studies of the Old Pyrmont Cottages were commissioned in the early 1990s. The heritage consultants Godden Mackay prepared a conservation plan in 1993 for City West but this remained a policy document rather than being endorsed as a conservation plan because entry to the buildings could not be obtained with the squatters still in residence. Another conservation plan was prepared by Schwager Brooks in 1994, which drew heavily on the Godden Mackay report. In the face of calls for demolition because of the dilapidated state of the buildings, all the reports argued for retention of what was by then considered to be a culturally significant remnant of nineteenth century housing stock. They also noted the significance of the cottages housing people employed in local industries and those associated with creative endeavours.[1]\n\nThe terraces on Scott Street were depicted in 1949 by the well-known artist, Sali Herman (1898-1993) in his painting \"Near the Docks.\" Artist John Santry (1910-1990), who grew up at No 8 Scott Street, illustrated a comic strip written by Betty Rowland for The Sydney Morning Herald in the 1940s and 50s, \"The Conways.\" His \"Point Street, Pyrmont\" painting of c. 1965 depicts the area in decay. Some of the squatters themselves were also artistic. Toby Zoates (William Arthur Tobin 1946- ) lived",
  "concepts": [
    "Old Pyrmont Cottages",
    "pyrmont",
    "cottages",
    "street",
    "old",
    "old pyrmont",
    "pyrmont cottages",
    "sydney",
    "cross",
    "housing",
    "city"
  ],
  "findings": [
    "History",
    "Colonial history",
    "Twentieth-century developments",
    "Description",
    "Condition",
    "Heritage listing",
    "References",
    "Bibliography",
    "Attribution",
    "External links"
  ],
  "relationships": [
    {
      "subject": "Old Pyrmont Cottages",
      "relationship": "is a",
      "object": "heritage",
      "sentence": "Old Pyrmont Cottages is a heritage-listed cottage at 1, 3, 5 Cross Street in the inner city Sydney suburb of Pyrmont in the City of Sydney local government area of New South Wales, Australia."
    },
    {
      "subject": "Old Pyrmont Cottages",
      "relationship": "are",
      "object": "located within jones",
      "sentence": "The Old Pyrmont Cottages are located within Jones' 55 hectares (140 acres)."
    },
    {
      "subject": "Old Pyrmont Cottages",
      "relationship": "are",
      "object": "sited was leased by edward macarthur to george wigram allen in 1854",
      "sentence": "[1]\n\nThe land on which the Old Pyrmont Cottages are sited was leased by Edward Macarthur to George Wigram Allen in 1854, but initially he did little with it."
    },
    {
      "subject": "Old Pyrmont Cottages",
      "relationship": "are",
      "object": "located was transferred to the camden park estate",
      "sentence": "[1]\n\nIn 1911 ownership of the block on which the Old Pyrmont Cottages are located was transferred to the Camden Park Estate, as part of the Allen family company holdings, where it remained until c. 1940."
    },
    {
      "subject": "Old Pyrmont Cottages",
      "relationship": "are",
      "object": "of state heritage significance for their association with a variety of artistic endeavours by people who lived there or who depicted them",
      "sentence": "The Old Pyrmont Cottages are of state heritage significance for their association with a variety of artistic endeavours by people who lived there or who depicted them, including the Swiss-born artist Sali Herman's 1949 painting, \"Near the Dock\", which depicts one of its street facades."
    },
    {
      "subject": "Old Pyrmont Cottages",
      "relationship": "are",
      "object": "of state historical significance as a surviving example of inner city rental properties built in vernacular style using materials to hand",
      "sentence": "The Old Pyrmont Cottages are of state historical significance as a surviving example of inner city rental properties built in vernacular style using materials to hand."
    },
    {
      "subject": "Old Pyrmont Cottages",
      "relationship": "are",
      "object": "significant to the state of nsw for their contribution to the history of the urban conservation movement",
      "sentence": "Thus, the Old Pyrmont Cottages are significant to the state of NSW for their contribution to the history of the urban conservation movement."
    },
    {
      "subject": "Old Pyrmont Cottages",
      "relationship": "are",
      "object": "of state heritage significance for their association with a succession of artists who created works while residing in the cottages and",
      "sentence": "The Old Pyrmont Cottages are of state heritage significance for their association with a succession of artists who created works while residing in the cottages and/or included images of the cottages in their works."
    },
    {
      "subject": "Old Pyrmont Cottages",
      "relationship": "are",
      "object": "john santry",
      "sentence": "Other artists associated with the Old Pyrmont Cottages are John Santry, who grew up there, and Toby Zoates who squatted there for many years."
    },
    {
      "subject": "Old Pyrmont Cottages",
      "relationship": "are",
      "object": "of state heritage significance as one of the few sydney squats for which a significant documentary record survives",
      "sentence": "The Old Pyrmont Cottages are of state heritage significance as one of the few Sydney squats for which a significant documentary record survives."
    }
  ],
  "timestamp": "2025-04-11T13:26:34.016127"
}