{
  "title": "List of Hill Street Blues episodes",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/List_of_Hill_Street_Blues_episodes",
  "content": "Hill Street Blues is an American serial police drama that aired on NBC in primetime from 1981 to 1987 for a total of 146 episodes. The show chronicled the lives of the staff of a single police station located on the fictional Hill Street, in an unnamed large city, with \"blues\" being a slang term for police officers for their blue uniforms. The show received critical acclaim, and its production innovations influenced many subsequent dramatic television series produced in the United States and Canada. Its debut season was rewarded with eight Emmy Awards, a debut season record surpassed only by The West Wing.  The show received a total of 98 Emmy nominations during its run. The series ran for 146 episodes over seven seasons.\n\nA hostage situation arises in Captain Furillo's precinct. Public defender Joyce Davenport is looking for her client, lost due to bureaucratic mismanagement. Officers Hill and Renko are shot in the line of duty. The audience is introduced to Belker's growling, and his mother.\nThis episode was awarded an Edgar for Best Teleplay from a Series.\n\nGoldblume goes undercover to solve a purse snatching and gets badly beaten, yet successfully apprehends the purse snatcher. Furillo testifies again before the Sullivan Commission and offers his resignation to Chief Daniels, who has clearly set him up. Daniels refuses the resignation and agrees to restore Delgado to 30 years service for pension purposes. Still successfully entrapping corrupt officers in South Ferry, the fake saloon is raided by armed robbers - but in the ensuing shoot-out, \"Captain Freedom\" is fatally wounded and dies in Belker's arms. After 30 hours of successful gambling, Bates loses out in the final game of the Tenth Annual Inter-Precinct Poker tournament.\n\nChief Daniels praises Mizell[2] at his funeral, for the sake of his family, while preparing to act on the evidence of Mizell's widespread corruption. Councilman Detweiler threatens to expose Mizell's corruption - and corruption in the police force in general - but before he can act, he kills an old lady while driving drunk. Hill is naked on the doctor's table when his fellow officers burst in to arrest the doctor for fraud - much to their amusement. LaRue abandons his attorney, Wachtel, moments before Wachtel too is arrested on the same charge. Hunter proposes to his nurse girlfriend, but she (a Jewish woman) turns him down on grounds of religion. Fay Furillo's home is burgled. Bates and Coffey deal with a baby abandoned in the back of their patrol car.\n\nDetective Arthur \"Art\" Bradley, who is homosexual, but married with children, is the only surviving witness to a mass-murder in a gay bar; much of the episode revolves around attempts by Washington and LaRue to cover for him, and his eventual decision to come forward formally as a witness. Goldblume becomes Fay's partner in natural childbirth classes, a horse-riding eccentric, the \"Cisco Kid\" (Martin Ferrero) causes problems, and Calletano finally passes a kidney stone (with a loud scream) during very hot weather, and a series of city-wide power cuts.\n\nIt is election day. Randolph Scripps, a late candidate, is creating more trouble than interest; Goldblume takes an interest. Daniels, expecting to win, offers to put Furillo forward as the next Chief. Deputy Chief Mahoney, overhearing, goes public with Daniels' and Furillo's roles in the failed Robson prosecution. Wachtel continues his comeback - still in women's clothes. Jimmy Robson's funeral takes place. Furillo spends time with Mike Perez Junior, the teenage son of Officer Mike Perez. Mike Junior has been bullied following Jimmy Robson's killing; Mike Senior remains in a psychiatric ward, traumatized by Jimmy Robson's death.\n\n\"Buck Naked\" has his feature role as a witness against corrupt taxi operators. The judge unexpectedly overturns the decision of the jury, and Davenport implies to Furillo that she suspects the judge of corruption. An investigation into police corruption turns up evidence that, fourteen years prior, rookie patrolman Howard Hunter was coerced into being the \"bagman\" for two corrupt Midtown detectives. Furillo informs Hunter, who sinks immediately into depression, believing that he has disgraced himself and the police force. Also in this episode, Fay and Henry have a sexual encounter, Hill is victorious in a police boxing match, and Michael Conrad makes a short and shaky appearance at roll call, looking very drawn and unwell.\n\nHonk, the \"guard goose on the loose\", is caught by Bates and Coffey, but executed in the station by its owner; Calletano and Schnitz make arrangements to salvage the \"dark meat\". Hunter appears at the stationhouse with powder burns, having survived a suicide attempt (LaRue, seeing his depression, had put blanks in Hunter's revolver); Furillo uses a favor from Daniels to avoid an Internal Affairs investigation of Hunter, then confronts Hunter about his state of mind. Belker is devastated and blames himself when a man who uses a wheelchair that he had arrested previously dies after helping him to go undercover as a disabled person and make an arrest. In the middleweight boxing finals, Hill falls prey to a rope-a-dope and is felled with one punch. Judge Cole is arrested for corruption as it becomes clear that the corruption runs deep, possibly including the entire vice squad of Midtown Precinct. Belker and Tataglia's relationship continues to get more serious. Michael Conrad again appears only at roll call with slurred speech due to his worsening cancer.\n\nThree \"Russian\" journalists from the Soviet Republic of Georgia (now the independent Republic of Georgia) visit the Hill, where one attempts to defect. It transpires that he and the female delegate are in a relationship which has been complicated by the advances of the third delegate, a KGB officer. The matter is resolved without international incident. Belker goes undercover with an ambulance crew, and strikes up an unlikely relationship with the ambulance driver (Bruno Kirby) arising at first out of a shared diet. A temporary freeze on promotions upsets Bates, who is still awaiting a vacant sergeant's post. A young man with mental instability who is shot by police leaves a dependent dog whom Bates adopts, ironically naming him \"Sarge\". Furillo spots Goldblume kissing Fay.\n\nSergeant Phil Esterhaus dies while making love with Grace Gardner, and Captain Furillo announces the death at Roll Call, shocking the officers. In a double blow for Leo, he discovers his wife to be having an affair. Belker is let down by his backup (Hill and Renko) on an undercover operation, and the city suffers multiple lawsuits in consequence. Coffey's girlfriend Sandy (Linda Hamilton) is raped by a man recently released from prison as a non-violent offender. Jesus Martinez trades information for the release of two juvenile Diablos. Fay Furillo is arrested for prostitution by Officer Pfiezer, much to his embarrassment. Lucille Bates is offered promotion to sergeant, and the opportunity to take Esterhaus' job as Desk Sergeant - a thought which scares her.\n\nFor the first time, Michael Conrad (Phil Esterhaus) does not appear in the opening credits.\n\nA high class call girl (Kay Lenz) dominates the episode - particularly her relationship with Goldblume. Chief Daniels steals two videotapes of Goldblume's call girl having sex with prominent clients; he admits to Furillo that he (Daniels) appears on these two tapes. Furillo reads a last letter from Esterhaus to the officers at Roll Call, and then tries to find a legal way to scatter Esterhaus' ashes on the Hill. Bates tells Coffey that her promotion to Roll-Call Sergeant is to be announced the next day; still in mental turmoil from the rape of his girlfriend, Coffey is less than supportive, and his lack of support also ruins his relationship with Sandy. Former Captain Fuchs arrives to advertise his new private security consultancy and meets with disdain from Furillo and harsh words from Belker, who, because of his close relationship with Esterhaus, is taking his death particularly hard. The juvenile Diablos Jesus Martinez had released commit murder and then hold Leo Schnitz at knife-point; Jesus convinces them to surrender, but they are killed at Juvenile Hall later that night. Mr. Le Jardin from Divisional Accountancy arrives undercover to identify a petty thief, and discovers that Leo has been taking stationery home for personal use. At the end of the episode, the call girl - who was selling her story to the media - is found murdered.\n\nThe previous episode's murdered call girl may yet be avenged thanks to the evidence of her \"manager\", until he too is executed in the station, by an assassin dressed as a police officer. The police chaplain leads a memorial service for Phil Esterhaus. Bates' promotion is announced, but her first roll call goes badly, particularly as she reacts to the stealing of the podium; nonetheless, she gains respect during the episode. Renko develops what may have been a hernia, lifting a heavy woman stuck in a bath. The overcrowding of cells continues. Esterhaus' ashes are scattered on the road, at the very center of the Hill, as he requested, by a nocturnal gathering of officers; a street sweeper then sweeps them away. Natalie DeRoy arrives - a new khaki officer to assist Leo Schnitz.\n\nThis episode marks the last appearance of Michael Conrad in the opening credits.\n\nBelker's recurring pickpocket is shot and killed - his real name finally emerging as James Logan; Belker reacts badly and breaks up with Robin, but she refuses to accept it. Fay and Goldblume also break up, but agree to remain friends. Deputy Chief Briscoe proves an annoyance to Furillo and Mayor Cleveland an even greater one, especially after Furillo is misquoted in the press over \"Operation Stop and Cop\", an operation Cleveland personally backed. The Mullins brothers appear - William is arrested and brother Timothy murders the key witness (Scatman Crothers). Joyce Davenport witnesses this murder but refuses to identify Mullins, fearing for her own life. Alan Wachtel becomes a judge, much to everyone's surprise. Cleveland refuses to believe Furillo was misquoted and threatens to make the captain pay for it. Bates misses the streets and the camaraderie with other street cops but Furillo encourages her and tells her it is time she put on her sergeant's stripes.\n\nA genial census worker (Barry Corbin) is taken hostage and murdered, much to the dismay of his bodyguards, Hill and Renko, who were called away to back up other officers on the order of Deputy Chief Briscoe. Joyce Davenport agrees to testify against Timothy Mullins, but both brothers issue death threats against her. Furillo, most in need of his command to defend her, is relieved of duties by Chief Daniels on the orders of Mayor Cleveland. Cleveland is unhappy with Furillo's apology concerning his comments about \"Operation Stop and Cop\" and reassigns Furillo to command a task force at Division. Joyce accuses Furillo of failing to protect her, resulting in recovering alcoholic Furillo purchasing a fifth of Scotch. In the personal storylines, Renko's girlfriend Daryl Ann is pregnant, and Hunter dates both Bates and Fay Furillo, while looking for a partner - both turn him down (The lunch-date with Bates actually takes place in the previous episode)\n\nIn a packed episode, \"Operation Stop and Cop\" continues to claim victims as Pilsky is shot and killed by a fleeing suspect; her delay in returning fire was caused by her \"officer-involved\" shooting the previous day. Bates and Briscoe argue publicly when the Deputy Chief denies that he ordered Pilsky's deployment; her death also affects Hunter, who had planned a date with her. Washington surrenders a video tape to Calletano showing Chief Daniels having sex with a prostitute (see Episode 72 above); Calletano uses the tape as leverage to facilitate Furillo's return to command Hill Street. Washington, Garibaldi and Belker, with Goldblume's approval, follow William Mullins all day cutting off his access to drugs until he slips up: when he refuses to surrender after committing an armed robbery, he is shot dead by the detectives after firing at them. Renko proposes nervously to Daryl Ann. Jesus Martinez marries his pregnant girlfriend (avoiding a conviction for her, as she had threatened him with a gun). Furillo, narrowly avoiding drinking the alcohol he has bought, seeks out his AA sponsor - only to discover that the sponsor has returned to hard drink himself and is in denial about the consequences. The episode title comes from a minor storyline about a legal battle between a man whose genitals became caught in a whirlpool drain and the distraught therapist who didn't release the power switch until he was punched.\n\nThe title comes from Judge Wachtel's wig as he wears a wire to help the DA's office convict a group of Mafia-connected loan sharks. The Hill Street precinct is also targeting them (with Belker, Renko, and Hill undercover), as is the State Liquor Authority, leading to considerable confusion and a SLA bust that nearly collapses the entire operation. Garibaldi does some unofficial investigation to avoid being sued after he crashed without insurance - Washington assists him, successfully. Marcus Peabody, a former gang member, is accused of corruption and embarrasses his new employer, Mayor Cleveland, who fires him. Natalie continues to admire Leo and discourages his attempts to regain the affections of his wife. Hunter's proposed \"Equine Rapid Development Force\" is rejected under budget cuts, even though he had bought his own horse (Apollo) to save the city money. Exhausted over their jobs leaking into their private life, Joyce and Frank separate at her suggestion. \n\nLieutenant Calletano appears on the TV game show Lucky Ducks and does very well until he freezes on the question that would have guaranteed his winnings, losing everything. Peabody, back in charge of the Blood and seeking quick money to finance a gang war, approaches the group of Mafia-connected loan sharks which Belker has infiltrated. Peabody becomes too aggressive with the loan sharks, and they arrange to have him killed, leading to their arrests. Davenport's current client seems in a huge hurry to get through arraignment, which may mean he has an out-of-state record. Renko tries to marshal his wedding attendants - Hill (Best Man), Washington, Coffey, and Davis. At the rehearsal dinner, Darryl Ann's father is belittling of his daughter, the police, and especially Hill, whom he addresses by the epithet \"boy\". Lieutenant Hunter is increasingly worried about Apollo, his horse, who is seriously ill; the episode ends with Hunter settling down to a night in the stable with Apollo.\n\nIn a busy pre-titles opening sequence, the viewer is introduced to Sergeant Stan Jablonski (Robert Prosky), a 22-year veteran from the Polk Avenue Precinct; he has transferred after an altercation with female Lieutenant Vera Horvath (Sharon Barr), in whic",
  "concepts": [
    "List of Hill Street Blues episodes"
  ],
  "findings": [
    "Series overview",
    "Episodes",
    "Season 1 (1981)",
    "Season 2 (1981–82)",
    "Season 3 (1982–83)",
    "Season 4 (1983–84)",
    "Season 5 (1984–85)",
    "Season 6 (1985–86)",
    "Season 7 (1986–87)",
    "References",
    "Sources"
  ],
  "timestamp": "2025-04-11T10:20:03.466960"
}