{
  "title": "Jean-Pierre Delville",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jean-Pierre_Delville",
  "content": "Jean-Pierre Delville (born 29 April 1951) is a Belgian prelate of the Catholic Church who has been the Bishop of Liège since 2013. His earlier career was devoted to church history and teaching, which he always combined with pastoral activity. He has been associated with the Community of Sant'Egidio since 1978.\n\nJean-Pierre Delville was born in Liège on 29 April 1951.[a] He was one of four siblings born to an architect and an accountant.[2] He was baptized by Louis-Joseph Kerkhofs, Bishop of Liège.[3] He was raised in the village of Awans and attended the Collège Saint-Servais in Liège.[2]\n\nHe earned a licentiate in history at the University of Liège and studied at the Conservatoire de Liège, earning a prize in organ performance.[3][b] Entering the seminary in 1973,[3] he graduated from the Catholic University of Louvain-la-Neuve with a degree in philosophy. He earned his bachelor's degree in theology from the Pontifical Gregorian University and then a licentiate in biblical sciences from the Pontifical Biblical Institute.[5] Years later, in 1996, he received a doctorate in biblical philology and a doctorate in philosophy and literature from the Catholic University of Louvain-la-Neuve.[2] While studying in Rome, he looked for pastoral engagement and was drawn to the combination of contemplation and social action of the work of the Community of Saint Egidio in the slums of Rome.[1] He has been associated with that Community since 1978.[3]\n\nHe was ordained a priest of the Diocese of Liège on 6 September 1980. He was vicar of the parish of Saint-Foy from 1980 to 1981, of Saint-Martin from 1981 to 1987, and of Saint-Jacques from 1987 to 1993.[2] He was professor at the Seminary of Liège from 1982 to 1995 and taught at the Institut Supérieur de Catéchèse et Pastorale de Liège from 1982 to 2002. He became first professor and then president of the Saint-Paul Seminary in Louvain. From 2002 to 2013 he taught courses in the history of Christianity at the Faculty of Theology of the Catholic University of Louvain-la-Neuve, where he became a professor in 2005 and full professor in 2010.[5]\n\nHe was first editor and then director of the Revue d'histoire ecclésiastique at the Catholic University of Louvain-la-Neuve and authored numerous articles for that journal. He was also Head of the São Paulo Foundation in Louvain-la-Neuve, president of the Institut de recherche Religions, Spiritualités, Cultures, Sociétés at the University of Louvain-la-Neuve and president of the library of the Seminary of Liège.[5]\n\nFrom 1995 to 2013 he was animator of the Community of St. Egiidio in the diocese of Liège. He was also vicar for of the parish of Saint-Lambert.[5]\n\nFrom 1996 to 2002 he was spokesperson for the Episcopal Conference of Belgium.[5] He became a member of its commission for evangelization in 1999.[3]\n\nIn 2010, assessing the response to the clerical sex abuse crisis, he said that in Belgium a widely publicized unrelated case of sexual abuse and murder[c] was \"an enormous catalyst\" that \"had immediate repercussions within the Catholic Church\" resulting in several prosecutions. He thought the scandals could produce a revitalized Church: \"I think a new moral conscience is emerging and that it can allow a real purification.\"[6]\n\nOn 31 May 2013, Pope Francis appointed him bishop of Liège.[5] His appointment was a surprise in that his name was not among those mentioned as likely candidates. He had maintained a low profile even while serving as spokesperson for the national bishops conference.[4] He said the appointment was a surprise and he had taken several days before giving his consent.[3] He received his episcopal consecration on 14 July from André-Joseph Léonard, Archbishop of Mechlin-Brussels.[7] Attendees included Andrea Riccardi, founder of the Sant'Egidio movement.[8]\n\nSince 2015, he has been president of the Belgian bishops commission on the Church and the world.[2]\n\nAs a priest he was hesitant to reproduce the Saint Egidio model in Liège, but then as a priest and later as bishop he has supported similar activities to engage the poor, the elderly, and minority communities. Following the 29 May 2018 murder of three people by a teenager apparently inspired by radical Islamic ideology, he called for reconciliation[9] and organized a fast-breaking meal (Iftar) with local imams and representatives of mosques and Islamic cultural centers. He has formed other alliances with Muslim leaders, for example to lobby against the abolition of religious education in schools.[1]\n\nIn August 2018, after being robbed in his residence, he said his feelings were more those of understanding than forgiveness in that he had been confronting people whose \"background is problematic\".[10]\n",
  "concepts": [
    "Jean-Pierre Delville",
    "liège",
    "saint",
    "university",
    "louvain",
    "neuve",
    "louvain la",
    "la neuve",
    "la",
    "catholic",
    "university louvain"
  ],
  "findings": [
    "Biography",
    "Early years and career",
    "Bishop of Liège",
    "Select publications",
    "Notes",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:26:46.254404"
}