{
  "title": "Odessa, Missouri",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Odessa,_Missouri",
  "content": "Odessa is the largest city in Lafayette County, Missouri, and part of the Kansas City metropolitan area within the Midwestern United States. The population was 5,593[4] at the 2020 census. Located along Interstate 70 Odessa's historic downtown is home to a range of boutique shops and restaurants. The city is host to the annual Puddle Jumper Days town fair,[5] the Odessa Rodeo,[6] a Christmas lighting ceremony[7] and various other community events held throughout the year.\n\nOdessa was platted in 1878, and named after Odesa, Ukraine.[8] A post office called Odessa has been in operation since 1879.[9]\n\nThe Odessa Ice Cream Company Building was listed on the National Register of Historic Places in 1996.[10]\n\nAccording to the United States Census Bureau, the city has a total area of 4.13 square miles (10.70 km2), of which 4.10 square miles (10.62 km2) is land and 0.03 square miles (0.08 km2) is water.[11]\n\nOdessa is located roughly 45 minutes from downtown Kansas City and approximately three hours from St. Louis.\n\nAs of the census[13] of 2010, there were 5,300 people, 2,077 households, and 1,427 families living in the city. The population density was 1,292.7 inhabitants per square mile (499.1/km2). There were 2,280 housing units at an average density of 556.1 units per square mile (214.7 units/km2). The racial makeup of the city was 94.8% White, 1.4% African American, 0.4% Native American, 0.4% Asian, 0.3% from other races, and 2.6% from two or more races. Hispanic or Latino of any race were 2.2% of the population.\n\nThere were 2,077 households, of which 37.1% had children under the age of 18 living with them, 49.1% were married couples living together, 14.3% had a female householder with no husband present, 5.3% had a male householder with no wife present, and 31.3% were non-families. 26.1% of all households were made up of individuals, and 11.2% had someone living alone who was 65 years of age or older. The average household size was 2.52 and the average family size was 3.00.\n\nThe median age in the city was 35.2 years. 27% of residents were under the age of 18; 8.8% were between the ages of 18 and 24; 26.6% were from 25 to 44; 22.8% were from 45 to 64; and 14.8% were 65 years of age or older. The gender makeup of the city was 48.2% male and 51.8% female.\n\nAs of the census[3] of 2000, there were 4,818 people, 1,887 households, and 1,290 families living in the city. The population density was 1,381.7 inhabitants per square mile (533.5/km2). There were 2,011 housing units at an average density of 576.7 units per square mile (222.7 units/km2). The racial makeup of the city was 97.09% White, 1.18% African American, 0.27% Native American, 0.10% Asian, 0.04% Pacific Islander, 0.33% from other races, and 0.98% from two or more races. Hispanic or Latino of any race were 0.73% of the population.\n\nThere were 1,887 households, out of which 36.5% had children under the age of 18 living with them, 53.8% were married couples living together, 10.9% had a female householder with no husband present, and 31.6% were non-families. 26.7% of all households were made up of individuals, and 11.7% had someone living alone who was 65 years of age or older. The average household size was 2.52 and the average family size was 3.07.\n\nIn the city the population was spread out, with 28.2% under the age of 18, 9.0% from 18 to 24, 30.9% from 25 to 44, 17.4% from 45 to 64, and 14.4% who were 65 years of age or older. The median age was 34 years. For every 100 females, there were 93.8 males. For every 100 females age 18 and over, there were 89.4 males.\n\nThe median income for a household in the city was $34,007, and the median income for a family was $40,000. Males had a median income of $35,476 versus $23,047 for females. The per capita income for the city was $17,455. About 8.4% of families and 9.9% of the population were below the poverty line, including 10.0% of those under age 18 and 14.9% of those age 65 or over.\n\nOdessa R-7 School District operates two elementary schools, one middle school and Odessa High School.[14]\n\nOdessa has a public library, a branch of the Trails Regional Library.[15]\n\nI-70 Motorsports Park is a motorsports venue that opened in 1969 with a half-mile paved oval. It was shut down in 2008, then reopened in 2021 with a 3/8 dirt oval and a quarter-mile dragstrip.[citation needed]\n\nThe Odessa R-VII Bulldog Football Team was the 1994 and 2019 Missouri State High School Athletic Association Class 3 State Champions.[citation needed]\n\nDyer Park is one of the oldest parks in Odessa and is the most developed and heavily used parks in the city. Facilities include a community building, swimming pool, pavilion, picnic shelter, outdoor basketball and tennis courts, baseball and softball fields, a rodeo arena, and two playground areas.[16]\n\nLake Venita, located in Dyer Park, offers outstanding fishing, dock and a half mile paved walking trail.[17]\n\nThe 90 acre Odessa City Lake southwest of Odessa offers fishing and waterfowl hunting. It is managed under a cooperative agreement between the Missouri Department of Conservation and the City of Odessa. The site includes a privy, boat ramp and dock, a pavilion and picnic areas.[18]\n\nThe City of Odessa is governed by a mayor and six-member board of aldermen. The current mayor is Bryan Barner.\n\nThe city is divided into three wards. Two aldermen are elected in each ward, with terms alternating so that one alderman in each ward is elected each year in April. The mayor is elected in even years and serves a 2-year term.[19] Odessa is incorporated as a fourth-class municipality.[20]\n\nOdessa has been served by a newspaper since 1880. In 1942 the Odessa Democrat[21] merged with The Ledger[22] creating The Odessan.[23]\n\nAs Lafayette County's largest newspaper The Odessan[24] is published weekly providing local coverage of news and sports in the communities of Odessa, Bates City, Mayview, Wellington, Napoleon and Lafayette County.  The newspaper is an independent, fourth-generation, family-owned publication.\n",
  "concepts": [
    "Odessa, Missouri"
  ],
  "findings": [
    "History",
    "Geography",
    "Demographics",
    "2010 census",
    "2000 census",
    "Education",
    "Sports",
    "Parks and recreation",
    "Government",
    "Media",
    "Notable people",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:08:01.568659"
}