{
  "title": "Drank (soft drink)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Drank_(soft_drink)",
  "content": "\nDrank is a soft drink sold in the United States and Canada.[1] It is marketed as an \"Anti-Energy\" drink that causes relaxation as opposed to a sugar or caffeine jolt.[2]\n\nDrank contains three active ingredients: melatonin, rose hip, and valerian root.[2]\n\nDrank's slogan is \"Slow Your Roll\".[2]\n\nDrank was introduced and manufactured by Innovative Beverage Group of Houston, Texas, in January 2008. It was widely available in many convenience stores and saw brisk sales. In 2012, a new flavor, \"Island Time\", was introduced, but to a lukewarm response. Poor sales of both flavors saw the product disappear off store shelves in 2013. In 2014, Drank was sold to Source Financial Group LLC, which reintroduced the brand but greatly reduced its availability. Currently, it is only sold online or in very select convenience stores in the areas of Houston, TX, and Saginaw, MI.[citation needed]\n\nDrank and similar commercial products have been criticized for their potential to serve as gateways to the dangerous illegal concoctions of cough syrup colloquially known as purple drank.[3][4][2] At a mental health conference in February 2010, Ronald Peters of the University of Texas Health Science Center said of Drank: \"They're taking the name, and they're trying to market it to young people.\" He described the beverage as \"the worst thing I've ever seen on the street since the making of candy cigarettes\".[2]\n\nHealth experts have warned that the herbal ingredients in Drank and similar beverages induce drowsiness and sedation, which can be dangerous when combined with medications or products that do similar things, such as alcohol or anti-depressants.[5] Gregory Carter, a neurologist on the clinical staff of the University of Texas Southwestern Medical Center, told the Dallas Morning News that there is enough melatonin in Drank to induce sleepiness, and that this effect could occur quickly because the melatonin is in dissolved form. Regarding valerian, Carter found that the content was probably \"not enough to have a strong effect\".[2]\n\nIt has also been suggested that valerian may be hepatotoxic, i.e. it could cause liver damage.[6]\n",
  "concepts": [
    "Drank (soft drink)"
  ],
  "findings": [
    "Introduction and availability",
    "Controversy",
    "Effects on health",
    "References"
  ],
  "timestamp": "2025-04-11T10:07:30.626729"
}