{
  "title": "Catholic Church in Jersey",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Catholic_Church_in_Jersey",
  "content": "The Catholic Church in Jersey is part of the worldwide Catholic Church, under the spiritual leadership of the Pope in Rome.\n\nSometime between 535 and 545 Helier, who was to become Jersey's patron saint, went to the island and brought the gospel.[1]\n\nThe island of Jersey remained part of the Duchy of Normandy until 1204 when King Philip II Augustus of France conquered the duchy from King John of England. The islands remained in the personal possession of the king and were described as being a Peculiar of the Crown. However, throughout the Middle Ages, the Catholic Church did not concern itself with overly political changes and the island continued to be part of the Norman diocese of Coutances. It was reluctant to come under the wing of the English church because it had many ties with Normandy: its language, which was much like that of the Normans; trade links; Norman customary law; and kinship to families in Normandy.\n\n\nThe island embraced the French Calvinist form of Protestantism during the Reformation and the orders were received to remove all signs of Catholicism in 1547 with the Act of Dissolution of the Colleges and Chantries, which had been applied to Jersey in the Act of Uniformity 1549:[2] numerous wayside crosses were destroyed, along with religious statues and other symbols. In 1550 a Royal Commission visited the island to sell church property for the benefit of the crown; in 1551 Sir Hugh Paulet, a member of this Royal Commission, was made Governor of the island and so he returned with a Royal Commission addressed to himself to continue the task.[3] The island remained under the diocese of Coutances until 1569.\nIn the 1790s, during the French Revolution, French Catholics took refuge in Jersey, allowed to hold services but not to proselytize.\n\nIn the 1830s and 1840s the island's Catholic community knew growth with the influx of Irish labourers coming to work on major building projects such as the new harbour.\n\nTowards the end of the 19th century Catholic teaching and nursing orders — the De La Salle brothers, Jesuits and Little Sisters of the Poor — settled in Jersey. In 1894, the Jesuits bought a property called Highlands, which later became Highlands College. In 1917, the De La Salle Brothers founded De La Salle College, Jersey.\n\nDuring the German occupation of the Channel Islands, the Germans imported a priest from Normandy who was alleged to have sympathies with the Vichy regime.[4]\n\nToday, Jersey is under the diocese of Portsmouth.\n\nThere are eight Catholic churches on the island.[5] However, there is a shortage of priests and workers and the Catholic Church there has therefore had to close two chapels[6] and sell some of its churches.[7][8]\n\nMinorities of the Catholic faith in Jersey are not negligible, as Mass in certain churches (such as Saint Thomas's, pictured right) is regularly held in Portuguese and Polish and only occasionally today in French. Indeed, 6% of Jersey's population is Portuguese (especially Madeiran, having come to the island to work in the hotel and catering industry)[9] and among the 6% of other Europeans there is a large Irish community and a considerable Polish community.[10]\n",
  "concepts": [
    "Catholic Church in Jersey",
    "jersey",
    "island",
    "catholic",
    "church",
    "normandy",
    "french",
    "catholic church",
    "salle",
    "royal commission",
    "royal"
  ],
  "findings": [
    "History of the Catholic Church in Jersey",
    "Conversion in the 6th century",
    "From Catholicism to Protestantism in the Middle Ages",
    "Waves of Catholic immigration in the 19th century",
    "Occupation of Jersey",
    "The Catholic Church in Jersey today",
    "See also",
    "References",
    "Online",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:38:18.961792"
}