{
  "title": "Jeffrey Prescott",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jeffrey_Prescott",
  "content": "Jeffrey Prescott is an American attorney who had served the U.S. ambassador to the United Nations Agencies for Food and Agriculture.[3] He previously served as the deputy to the United States ambassador to the United Nations[†] in the Biden administration.[4][5]\n\nPrescott holds a BA degree from Boston University and a JD from Yale Law School.[6]\n\nAfter completing law school, Prescott clerked for Judge Walter King Stapleton of the United States Court of Appeals for the Third Circuit. He was also a staff attorney at the Lawyer's Committee for Human Rights. Prescott then relocated to Beijing, where he was a visiting professor at Peking University School of Transnational Law and became the founding director of the China Law Center's branch office.[6]\n\nPrescott previously served as an advisor to the United States National Security Council on policy related to Iran, Iraq, Syria, and the Persian Gulf. He was also deputy national security advisor and senior Asia advisor for then Vice President Joe Biden.[7] Since leaving the Obama administration, Prescott became the executive director of National Security Action and a senior fellow at the Penn Biden Center for Diplomacy and Global Engagement.[8]\n\nOn June 2, 2023, Biden nominated Prescott to be the U.S. ambassador to the UN Agency for Food and Agriculture.[3] On February 8, 2024, the United States Senate confirmed his nomination by voice vote.[9] He presented his credentials to FAO Director General Qu Dongyu on April 3, 2024.[10]\n\nPrescott is married to Susan Jakes. They have two daughters, Amalia and Phoebe.[14]\n\n†  N.b. the appointed role of Deputy to the Ambassador to the UN is a separate position from the Senate-confirmed role of Deputy Ambassador to the United Nations. The deputy to the ambassador assists the U.S. ambassador to the UN by acting as a liaison in Washington, D.C., managing their Washington office, interacting with Congress and acting as a stand-in for the UN ambassador. The two roles co-exist, as in 2019 when Taryn Frideres was Deputy to the Ambassador at the same time that Jonathan Cohen was Deputy Ambassador to the UN.\n\nThis biography of a person who has held a non-elected position in the federal government of the United States is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Jeffrey Prescott"
  ],
  "findings": [
    "Education",
    "Career",
    "FAO Nomination",
    "Publications",
    "Articles",
    "Personal life",
    "Footnotes",
    "References"
  ],
  "timestamp": "2025-04-11T10:47:50.112456"
}