{
  "title": "Ydre Municipality",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Ydre_Municipality",
  "content": "Ydre Municipality (Ydre kommun) is a municipality in Östergötland County, southeast Sweden. The municipal seat is located in the town of Österbymo.\n\nThe municipality was created through the local government reform of 1952, when six former entities were united. The name was taken from the old Ydre Hundred. Its area remained unchanged by the reform of 1971.\n\nThe name Ydre, which was formerly applied to most of the area around Sommen, is interpreted to mean \"place of yews\".[3] Two localities in particular appear to be further associated with yews these are Idhult and Idebo.[3]\n\nThere are 3 urban areas (also called a tätort or locality) in Ydre Municipality.\n\nIn the table the localities are listed according to the size of the population as of December 31, 2005. The municipal seat is in bold characters.\n\nOther localities include Sund, Torpa, Norra Vi, Asby, Rönnäs, Svinhult and Ydrefors.\n\nThis is a demographic table based on Ydre Municipality's electoral districts in the 2022 Swedish general election sourced from SVT's election platform, in turn taken from SCB official statistics.[4]\n\nIn total there were 3,686 residents, including 2,903 Swedish citizens of voting age.[4] 44.1% voted for the left coalition and 54.7% for the right coalition. Indicators are in percentage points except population totals and income.\n\nRelative to other areas of southern Sweden Ydre stands out for its low precipitation and low humidity.[5] The rainiest months of the years are September followed by July and August. Each of these months had a precipitation of c. 70 mm. The driest months are February and March, with 35 mm each.[A] The hottest months are July, Juni and August averaging 14–15 °C. The coldest months are January and February with about -4 °C.[6][B] The climate is expected to become warmer and drier in future.[6]\n\nThe growing season around Sommen is of about 216 days with 2614 degree days.[7] The vegetation in Ydre is mostly dominated by pine and spruce forest. Broad-leaf forest and open agricultural fields can also be found at some locations.[8] In particular the southern shores of lake Sommen contain more lush vegetation and broad-leaf forest than the northern side, which has more cliffs and contiguous pine forests.[9] The rare and endangered flower Anthericum liliago can be found along the lake's rocky shores.[10][11] This is one of the northernmost locales where it grows.[11]\n\nIn Torpön island grows Sweden's largest wych elm and at Asby, a few kilometers from the southern shores grows Sweden's thickest spruce.[12] The name Ydre, which was formerly applied to most of the area around Sommen, is interpreted to mean \"place of yews\".[3] One locality in particular appears to be further associated with yews. This is Idebo along Norra Vifjärden.[3][C]\n\nSome plants usually associated to carbonate rock areas appears as rarities near Sommen, since there are no known carbonate rock outcrops in the area. The plants are Vicia pisiformis and the orchids Ophrys myoides, Malaxis monophyllos,  Herminium monorchis.[9][D]\n\nThere are various tales of jättar and trolls opposing the spread of Christianity in Ydre.[13] Likely church building followed a tradition that \"the king\" should begin the building, and then the local populace finish it. This was later codified in Östgötalagen.[13] It is not known when the first churches around the lake were built. For comparison, the church in nearby Tidersrum was built in 1300, and Leonhard Fredrik Rääf asserts that the church in Sund was built in the 12th century.[13][E]\n\nAs Nils Dacke's and his army advanced north through Ydre in 1542, local priests from Sund and Asby, and the populace in general, welcomed the rebellion as they were rejected church reforms imposed on them by Gustav Vasa.[14] In particular, the priest of Sund and Norra Vi preached uprising.[14] However local aristocrat Måns Johansson Natt och Dag who owned the manor of Ringshult[F] sided with the king despite having a troublesome relation to him. He was put in charge of an army to suppress the rebellion.[15] As Dacke's troops continued their advance north reaching as far as Mjölby the area around lake Sommen was spared from war. Skirmishes did occur near Kisa, tens of kilometers northeast of Sommen.[14] Unrest in Ydre continued well after the death of Dacke and ended only after Gustav Vasa sent a force of 400 men to pacify the hundred.[14]\n\nDespite earlier defense of Catholicism at the Uppsala Synod in 1593 church representatives from Ydre voted to adopt the Lutheran creed.[16]\n\nAt least two churches have medieval foundation: The Church of Asby in Asby, and the Church of Torpa on the countryside. There is also an attractive church from the 18th century, Church of Norra Vi, located just by the lake Sommen.\n\nAnother tourist attraction is Naturum Sommen in Torpön Island, a visitor center and natural history museum.[17][18]\n",
  "concepts": [
    "Ydre Municipality",
    "ydre",
    "sommen",
    "church",
    "municipality",
    "months",
    "lake",
    "asby",
    "area",
    "14",
    "yews"
  ],
  "findings": [
    "Localities",
    "Demographics",
    "Climate and vegetation",
    "History",
    "Trolls, jättar and Christianization",
    "Reformation and wars",
    "Sights",
    "See also",
    "Notes",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:43.100833"
}