{
  "title": "Staub v. Proctor Hospital",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Staub_v._Proctor_Hospital",
  "content": "Staub v. Proctor Hospital, 562 U.S. 411 (2011), is a United States Supreme Court case in which the Court held that an employer may be held liable for employment discrimination under the Uniformed Services Employment and Reemployment Rights Act (USERRA) if a biased supervisor's actions are a proximate cause of an adverse employment action, even if the ultimate decision-maker was not personally biased.[1] This case affirmed the 'Cat's Paw' theory of liability.\n\n\nThe Uniformed Services Employment and Reemployment Rights Act (USERRA) was passed by Congress in 1994 to guarantee to military reservists a return to their civilian jobs after their deployments. The law also offers protection against termination or other retaliation against current and former military members because of their military obligations.[2] USERRA says, in part, that:\nA person who is a member of, applies to be a member of, performs, has performed, applies to perform, or has an obligation to perform service in a uniformed service shall not be denied initial employment, reemployment, retention in employment, promotion, or any benefit of employment by an employer on the basis of that membership, application for membership, performance of service, application for service, or obligation.[3]\nThe 'Cat's Paw' theory originates from a fable attributed to Jean de La Fontaine, in which a monkey dupes a cat into retrieving chestnuts from a fire. The cat risks its paw, pulling out the chestnuts, which the monkey then greedily consumes, leaving the cat with nothing but a burnt paw. In employment law, this analogy refers to situations where a biased subordinate uses the decision-maker as a pawn to achieve a discriminatory objective, leading to an employment decision that the employer can be held liable for.[4]\n\nThe case stemmed from the 2004 termination of Vincent Staub from his radiology technician position at Proctor Hospital in Illinois. Staub was a member of the Army Reserve and was periodically required to take time off of work for training. According to Staub, Janice Mulally and Michael Korenchuk, two of Staub's supervisors, were openly hostile towards him and belittled his military obligations.[4] In 2004, Korenchuk advised the hospital's vice-president of human resources, Linda Buck, that Staub had broken a rule about remaining in the hospital while not seeing patients, despite the fact that Staub had merely visited the hospital's cafeteria and Staub had left a note for his supervisors explaining his absence after he could not contact them directly.[1]\n\nStaub was fired from his job for the alleged breach of the minor infraction. He sued the hospital, claiming that the complaint against him was a sham, and  that the real reason he had been fired was due to the hatred of military members demonstrated by his supervisors. The jury sided with Staub and awarded him damages, but the hospital appealed the judgement. The Seventh Circuit reversed the jury's decision, and found in favor of the hospital. Staub appealed, and was granted certiorari by the Supreme Court.\n\nThe Supreme Court reversed the decision made by the Seventh Circuit in a unanimous 8-0 vote on 1 March 2011, with Justice Elena Kagan recusing herself. In the Court's opinion, written by Justice Antonin Scalia, the Court opined that \"since a supervisor is an agent of the employer, when he causes an adverse employment action the employer causes it; and when discrimination is a motivating factor in his doing so, it is a 'motivating factor in the employer's action.'”[5] Therefore, if a biased supervisor tries to get an employee fired, and that employee is in fact fired as a result, then the fired employee can sue the employer for employment discrimination, \"even if the biased supervisor is not the final decision maker and even if the final decision maker is unbiased.\"[6]\n",
  "concepts": [
    "Staub v. Proctor Hospital",
    "staub",
    "employment",
    "hospital",
    "employer",
    "decision",
    "court",
    "military",
    "fired",
    "cat",
    "biased"
  ],
  "findings": [
    "Background",
    "Statutory provisions and the Cat's Paw Theory",
    "Lower court proceedings",
    "The Supreme Court's decision",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:08.695564"
}