{
  "title": "Pak Nai",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Pak_Nai",
  "content": "Pak Nai (Chinese: 白泥) is a wetland area, partly mud-bank, surrounded by mountain ranges, in the Yuen Long District of Hong Kong facing Deep Bay (aka. Shenzhen Bay). Pak Nai makes up the coastline as Sheung Pak Nai (上白泥) and Ha Pak Nai (下白泥) geographically.\n\nPak Nai is famous for its ecosystem which comes with rich biodiversity, with rare species found offshore. In recent years, the public has paid concern to a controversial development proposal, which eventually was dropped under objections.\n\nBesides its rich ecosystem, Pak Nai is known for its sunset views and historically-significant sites dating back to a couple thousand years ago.\n\nFor electoral purposes, Ha Pak Nai and Sheung Pak Nai are part of the Ha Tsuen constituency.\n\nHa Pak Nai's 6-kilometer-long (3.7 mi) shoreline is where mangroves, wetlands and mud banks are found. The mangroves in Ha Pak Nai harbour various species and are highly conserved by environmentalists. The rich biodiversity of this area has prompted the government to designate it a Site of Special Scientific Interest (SSSI).[1][2] Ha Pak Nai used to be an oyster bed, thus, There are still remains of oyster shells all over the mudflat.[3]\n\nSome species of crabs such as Perisesarma bidens, Ilyoplax tansuiensis, Uca arcuata and Sesarma sinensis are commonly found in the offshore mud flat.[4]\n\nAmong all the crabs found in the Ha Pak Nai area, the horseshoe crab is one of the most highly conserved species.[citation needed] Horseshoe crabs originate from 450 million years ago and are called \"living fossils\". Because of the copper in their blood, which can be extracted to be applied in detecting bacteria, horseshoe crabs are highly valued in medicine.[5]\n\nThere are two major relics and one historical site found around the Pak Nai area, which are the sand dunes of the Chen's homeland, Wu's homeland and a fortified structure. The Antiquities and Monuments Office found the Chen's relic in May, 1997, featuring a one-meter-high (3.3 ft) sand dune containing two culture levels.[6][7] The excavation team found 4 postholes, 9 stone stoves, 3 kilns and 1 grave which it was the first time for Hong Kong excavating sun and moon utensils.[6] The Wu's relic was found in September, 1997 by the same excavation team. They found culture levels in three time periods, having rammed earth foundations, stone artifacts and more.[8]\n\nA fortified structure at No.55 Ha Pak Nai, which is a declared monument owing to its connection to the revolutionary movement of modern China under the leadership of Dr. Sun Yat-sen. Hsing Chung Hui (Revive China Society) members, who were KMT, stationed at Lower Pak Nai for preparation of overturning the ruling of Qing authority and conducted bomb tests.[9] (Luo 1971:37) The structure was built by a core member of Hsing Chung Hui named Tang Yam-nam around 1910. It was the only solid evidence correlating the 1911 revolution and its movement leader Sun Yat-sen and his comrades. The structure served for the surveillance across the Deep Bay coast under the Qing authority.[10]\n\nHa Pak Nai (\"Ha\" means \"lower\") is known as one of the best places for viewing sunset in Hong Kong,[11] making it a beloved place of many photographers, tourists and dating couples.[12] The best sunset-viewing spots are the shores along Ha Pak Nai and the junction of Deep Bay Road and Nim Wan Road.[13] Nim Wan Road is a popular 5 km cycling route for locals.[4]\n\nFormer Heung Yee Kuk chairman Lau Wong-fat applied for the development of Ha Pak Nai in 2007, but vigorous opposition led to withdrawal of the application.[14] In 2010, Lau hope to pass the assessment of the Town Planning Board by sharply reducing the scale of development and gave up building a golf course, as well as adding in more conservation features, in which the butterfly-protection area was on the government's land instead of his, showing little commitment to conservation.[15] The Ha Pak Nai village representative complained that poor transportation arrangements ought to be fatal to the plan.[16] The government has already built facilities to introduce the fortified structure's information.[17]\n\nIn 2009 a Shenzhen official noted that the construction of the Western Express Line, a proposed railway linking the Hong Kong and Shenzhen airports, might stop in Sheung Pak Nai.[18] However, the proposal has been shelved as a consultant hired by the Transport and Housing Bureau found that the line would cost \"well in excess\" of HK$110 billion and had poor financial viability and poor market demand.[19]\n\nLocated in the very west of New Territories, Pak Nai can be reached by minibus or taxi. Minibus number 33, from Tai Fung Street in the center of Yuen Long, drops off at Pak Nai, beside the mud-bank.[20][21]\n\n22°26′14″N 113°56′54″E﻿ / ﻿22.4371°N 113.9483°E﻿ / 22.4371; 113.9483\n",
  "concepts": [
    "Pak Nai"
  ],
  "findings": [
    "Administration",
    "Ecology",
    "Archaeology and monument",
    "Sunset",
    "Withdrawn development plans",
    "Transportation",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:07:23.130525"
}