{
  "title": "The Goblin Mirror",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/The_Goblin_Mirror",
  "content": "The Goblin Mirror is a 1992 fantasy novel by science fiction and fantasy author C. J. Cherryh.  It was first published in a hardcover edition by Ballantine Books under its Del Rey Books imprint, and featured cover art by Cherryh's brother, David A. Cherry.\n\nThe goblins, who once had access to human lands, were banished to their own realm because of their misdeeds. But before they departed they left signs and clues as to how they could be contacted. They could not return unless they were summoned.\n\nHundreds of years later, Mirela, a witch and queen of Hasel, read these signs and asked the goblins for help. Her daughter and heir, Ylena was vain and ungrateful and Mirela did not want her to become queen when she died. The goblin queen gave Mirela a potion of youth and beauty in exchange for access to the world of man for one night a year. Mirela's eternal youth infuriated Ylena and she struck a bargain with the goblin queen: advice on how to depose Mirela in exchange for access to human lands for a year. One night Mirela died mysteriously and Ylena became queen. Even though Ylena did not want an heir, she still had a daughter, Ytresse, and suspected goblin treachery because Ytresse's magic was too strong for her. On the last day of the goblins' time on earth, the goblin queen offered Ylena another deal: Ylena would live for as long as the goblins possessed a small lake nearby. Ylena assented and the goblins gained unfettered access to human lands with the lake the goblin queen's center of power. Ylena, trapped by her bargains with the goblins, wanted no more to do with them. But Azdra'ik, a goblin lord and leader of a goblin rebellion against their queen, offered Ylena a secret in exchange for three wishes. The secret was that the goblin queen's power lay in a magic mirror. Azdra'ik got his wishes and Ylena set about constructing her own mirror into which she put every spell she knew. When the goblin queen found out about Ylena's mirror, she sent a goblin army to find and destroy it. Ylena was defeated, her mirror reduced to dust, and Hasel left in ruins. But the price the goblin queen paid for this victory was that her mirror cracked in two and a shard fell off. Azdra'ik stole the shard and gave it to Ytresse. Ytresse did not trust the goblin queen and arranged her own heir, Ylysse without the goblins' interference. Ytresse in turn passed power, and the shard, onto her heir, Ysabel. Ysabel and her twin brother, Karoly were apprenticed to Ytresse's daughter, Urzula.\n\nSeeking to escape Ytresse's sphere of influence, Urzula took Karoly over the mountain where she married lord Ladislaw of Maggiar and gave birth to Stani, who later became the new lord. Karoly became Stani's wizard but Urzula never practised her magic in Maggiar. When Urzula (lady Gran) died she left the Stani household with tales of witches and magic from \"over-mountain\".\n\nAn ill-wind disturbs the peaceful land of Maggiar and the wizard, Karoly requests leave to consult with his sister, Ysabel over the mountain. Lord Stani instructs his two eldest sons, Bogdan and Tamas, and his master huntsman, Nikolai to accompany Karoly. After a difficult trip over the mountain, they approach a tower, Krukczy Straz where they hope to find shelter, but are ambushed by goblins. The goblins have overrun the tower, killing all inside. Tamas is separated from the others but is rescued by Ela, a witchling who takes him to her mistress, Ysabel in a neighboring tower, Tajny Straz. But this tower has also been raided by goblins and all are killed, including Ysabel. Ela goes into the tower and retrieves Ysabel's shard from the goblin mirror. Then Azdra'ik, the goblin lord appears, but does not threaten them. He tells Tamas he must take the mirror fragment from Ela because it is too powerful for her to use. Ela takes Tamas to the next tower at the ruins of what was Hasel. Here Ela looks into the mirror but is overwhelmed by the goblin queen staring back at her. Tamas is startled when the queen looks at him and calls him a wizard, which, he assures Ela he is not. Ela is drawn to the goblin queen at the lake and Tamas tries to follow her, but gets lost. Azdra'ik finds him and together they search for Ela.\n\nBack in Maggiar, Yuri, Tamas's younger brother has been left behind to look after Tamas's dog, Zadny. But Zadny, pining for his master, escapes his pen and tracks Tamas's scent over the mountain with Yuri in pursuit. Near Krukczy Straz, Yuri finds an injured Nikolai, and together they follow Zadny, still on Tamas's trail, to Tajny Straz. But by the time they get there, Tamas has already left. Then Karoly arrives and reveals to Nikolai the story of the succession of witches, their bargains with the goblin queen, and the mirror fragment. Karoly realizes that Ela must have the shard and says he must take it from her before she misuses it. The three then head for Hasel to find Ela. At Hasel, Zadny continues his pursuit of Tamas, and realising that Ela and Tamas must be together, they all follow Zadny.\n\nAzdra'ik and Tamas find Ela near the goblin lake. Much of the surrounding landscape has been devastated by marauding goblin armies and a darkness spreads from the lake. The goblin queen is expanding her sphere of influence. Ela is tempted to try the mirror again, but Tamas, slowly becoming aware of the wizard in him, convinces her otherwise.\n\nYuri, running ahead in pursuit of Zadny, stumbles into the goblin queen's hall. There he finds the goblin mirror and sees Bogdan in it. Bogdan, under the queen's spell, pulls Yuri into the mirror. Tamas arrives and tries to persuade Bogdan to free Yuri, but Bogdan challenges Tamas and in his rage is accidentally killed. Tamas and Ela confront the goblin queen. The shard returns to the mirror but with their combined magic they seize control of it and banish the goblin queen and her armies. Karoly and Nikolai arrive but the darkness is already receding. Karoly reveals that Azdra'ik used goblin magic to \"father\" Ytresse with Ylena and that Ela is Azdra'ik's great grand-daughter and Karoly's niece. Tamas, now in control of Azdra'ik, elects to let the goblin lords remain on earth.\n",
  "concepts": [
    "The Goblin Mirror"
  ],
  "findings": [
    "Backstory",
    "Plot summary",
    "Main characters",
    "References",
    "Further reading",
    "External links"
  ],
  "timestamp": "2025-04-11T10:24:37.714415"
}