{
  "title": "Gia Long",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Gia_Long",
  "content": "Gia Long (Chữ hán: 嘉隆) (Vietnamese: [zaː lawŋ] (North), [jaː lawŋ] (South); 8 February 1762 – 3 February 1820), born Nguyễn Phúc Ánh (阮福暎) or Nguyễn Ánh (阮暎), was the founding emperor of the Nguyễn dynasty, the last dynasty of Vietnam. His dynasty would rule the unified territories that constitute modern-day Vietnam until 1945.\n\nA nephew of the last Nguyễn lord who ruled over south Vietnam, Nguyễn Ánh was forced into hiding in 1777 as a 15-year-old when his family was slain in the Tây Sơn revolt. After several changes of fortune in which his loyalists regained and again lost Saigon, he befriended the French Catholic Bishop Pierre Pigneau de Behaine. Pigneau championed Nguyễn Ánh's cause to regain the throne to the French government and managed to recruit volunteer; however, that soon fell through. From 1789, Nguyễn Ánh was once again in the ascendancy and began his northward march to defeat the Tây Sơn, reaching the border with the Qing dynasty by 1802, which had previously been under the control of the Trịnh lords. Following their defeat, he succeeded in reuniting Vietnam after centuries of internecine feudal warfare, with a greater landmass than ever before, stretching from the Qing's borders down to the Gulf of Siam.\n\nGia Long's rule was noted for its Confucian orthodoxy. He defeated the Tây Sơn rebellion and reinstated the classical Confucian education and civil service system. He moved the capital from Hanoi south to Huế as the country's populace had also shifted south over the preceding centuries, and built up several fortresses and a palace in his new capital. Using French expertise, he modernized Vietnam's defensive capabilities. In deference to the assistance of his French friends, he tolerated the activities of Roman Catholic missionaries, something that became increasingly restricted under his successors. Under his rule, Vietnam strengthened its military dominance in Indochina, expelling Siamese forces from Cambodia and turning it into a vassal state.\n\nBorn in Phú Xuân (modern-day Huế, central Vietnam) on 8 February 1762,[3] he also had two other names in his childhood: Nguyễn Phúc Chủng (阮福種) and Nguyễn Phúc Noãn (阮福暖).[4] Nguyễn Ánh was the third son of Nguyễn Phúc Luân and Nguyễn Thị Hoàn. Luan was the second son of Lord Nguyễn Phúc Khoát of southern Vietnam; the first son had already predeceased the incumbent Lord. There are differing accounts on which son was the designated successor. According to one theory, Luân was the designated heir, but a high-ranking mandarin named Trương Phúc Loan changed Khoat's will of succession on his deathbed, and installed Luan's younger brother Nguyễn Phúc Thuần, the sixteenth son, on the throne in 1765. Luan was jailed and died in the 1765, the same year as Thuan's installation.[5][6][7][8] However, the historian Choi Byung Wook claims that the notion that Luân was the designated heir was based on fact but was propagated by 19th century Nguyễn dynasty historians after Nguyễn Ánh had taken the throne as Gia Long to establish the emperor's legitimacy.[8] According to Choi, Lord Khoát had originally chosen the ninth son, who then died, leaving Loan to install Lord Thuần.[9] At the time, the alternative was the eldest son of the ninth son, Nguyễn Phúc Dương, whom opposition groups later tried unsuccessfully to convince to join them as a figurehead to lend legitimacy.[9] In 1775, Thuan was forced to share power with Dương by military leaders who supported the Nguyêns. At this time, Nguyễn Ánh was a minor member of the family and did not have any political support among court powerbrokers.[10]\n\nHowever, Thuan lost his position as lord of southern Vietnam and was killed, along with Duong, during the Tây Sơn rebellion led by the brothers Nguyễn Nhạc, Nguyễn Huệ and Nguyễn Lữ in 1777.[11] Nguyễn Ánh was the most senior member of the ruling family to have survived the Tây Sơn victory, which pushed the Nguyễn from their heartland in central Vietnam, southwards towards Saigon and into the Mekong Delta region in the far south.[12][13][14] This turn of events changed the nature of the Nguyễn power hierarchy; the family and the first leader Nguyễn Hoàng had originally come from Thanh Hoa Province in northern Vietnam, and this is where most of their senior military and civil leadership's heritage derived from, but as a result of the Tây Sơn's initial successes, much of this old power base was destroyed and Nguyễn Ánh had to rebuild his support network among southerners, who later became the core of the regime when the Nguyễn dynasty was established.[15]\n\nNguyễn Ánh was sheltered by a Catholic priest Paul Nghi (Phaolô Hồ Văn Nghị) in Rạch Giá.[16] Later, he fled to Hà Tiên on the southern coastal tip of Vietnam, where he met Pigneau de Behaine,[17][18][19] a French priest who became his advisor and played a major part in his rise to power.[19] Receiving information from Paul Nghi, Pigneau avoided the Tay Son army in Cambodia, and came back to assist Nguyễn Ánh. They hid in the forest to avoid the pursuit of Tay Son army.[16][20][21][22][23] Together, they escaped to the island of Pulo Panjang in the Gulf of Siam.[12][24] Pigneau hoped that by playing a substantial role in a Nguyễn Ánh victory, he would be in position to lever important concessions for the Catholic Church in Vietnam, helping its expansion in Southeast Asia.[25]\n\nIn late 1777, the main part of the Tây Sơn army left Saigon to go north and attack the Trịnh lords, who ruled the other half of Vietnam. Nguyễn Ánh stealthily returned to the mainland, rejoining his supporters and reclaimed the city of Saigon.[26] He was crucially aided by the efforts of Do Thanh Nhon, a senior Nguyễn Lord commander who had organized an army for him,[27][8] which was supplemented by Cambodian mercenaries and Chinese pirates.[28] The following year, Nhon expelled additional Tây Sơn troops from the surrounding province of Gia Dinh and inflicted heavy losses on the Tây Sơn naval fleet. Taking advantage of the more favorable situation, Nguyễn Ánh sent a diplomatic mission to Siam to propose a treaty of friendship. This potential pact, however, was derailed in 1779 when the Cambodians rose up against their pro-Siamese leader Ang Non II. Nguyễn Ánh sent Nhon to assist the revolt, which eventually saw Ang Non II defeated decisively and executed.[27]\n\nNhon returned to Saigon with high honor and concentrated his efforts on improving the Nguyễn navy. In 1780, in an attempt to strengthen his political status, Nguyễn Ánh proclaimed himself Nguyễn vương (Nguyễn king or Nguyễn ruler in Vietnamese)[29][30] with the support of Nhon's Dông Sơn Army. In 1781, Nguyễn Ánh sent further forces to prop up the Cambodian regime against Siamese armies who wanted to reassert their control.[13][27] Shortly thereafter, Nguyễn Ánh had Nhon brutally murdered. The reason remains unclear, but it was postulated that he did so because Nhon's fame and military success was overshadowing him.[13][27] At the time, Nhon had much, if not dominant power, behind the scenes. According to later Nguyễn dynasty chronicles, Nhon's powers included that of deciding who would receive the death penalty, and allocating budget expenditures. Nhon also refused to allocate money for royal spending. Nhon and his men were also reported to have acted in an abrasive and disrespectful manner to Nguyễn Ánh.[8]\n\nThe Tây Sơn brothers reportedly broke out in celebration upon hearing of Nhon's execution, as Nhon was the Nguyễn officer whom they feared the most. Large parts of Nhon's supporters rebelled, weakening the Nguyễn army, and within a few months, the Tây Sơn had recaptured Saigon mainly on the back of naval barrages.[27][28] Nguyễn Ánh was forced to flee to Ha Tien, and then onto the island of Phu Quoc. Meanwhile, some of his forces continued to resist in his absence.[31] While the murder of Nhon weakened Nguyễn Ánh in the short term, as many southerners who were personally loyal to Nhon broke away and counter-attacked, it also allowed Nguyễn Ánh to gain autonomy and then take steps towards exerting direct control over the remaining local forces of the Dong Son who were willing to work with him.[8] Nguyễn Ánh also benefited from the support of Chau Van Tiep, who had a power base in the central highlands between the strongholds of the Nguyễn and the Tây Sơn.[32]\n\nIn October 1782, the tide shifted again, when forces led by Nguyễn Phúc Mân, Nguyễn Ánh's younger brother, and Chau Van Tiep drove the Tây Sơn out of Saigon.[31][33] Nguyễn Ánh returned to Saigon, as did Pigneau[31] The hold was tenuous, and a counterattack by the Tây Sơn in early 1783 saw a heavy defeat to the Nguyễn, with Nguyen Man killed in battle.[13][31] Nguyễn Ánh again fled to Phu Quoc, but this time his hiding place was discovered.[31] He managed to escape the pursuing Tây Sơn fleet to Koh-rong island in the Bay of Kompongsom. Again, his hideout was discovered and encircled by the rebel fleet. However, a typhoon hit the area, and he managed to break the naval siege and escape to another island amid the confusion.[28][31] In early-1784, Nguyễn Ánh went to seek Siamese aid, which was forthcoming, but the extra 20,000 men failed to weaken the Tây Sơn's hold on power.[28] This forced Nguyễn Ánh to become a refugee in Siam in 1785.[b][31][38] To make matters worse, the Tây Sơn regularly raided the rice-growing areas of the south during the harvesting season, depriving the Nguyễn of their food supply.[17] Nguyễn Ánh eventually came to the conclusion that using Siamese military aid would generate a backlash among the populace, due to prevailing Vietnamese hostility towards Siam.[18]\n\nDeflated by his situation, Nguyễn Ánh asked Pigneau to appeal for French aid, and allowed Pigneau to take his son Nguyễn Phúc Cảnh with him as a sign of good faith.[25][31][39] This came about after Nguyễn Ánh had considered enlisting English, Dutch, Portuguese and Spanish assistance.[40] Pigneau advised against Nguyễn Ánh's original plan to seek Dutch aid from Batavia, fearing that the support of the Protestant Dutch would hinder the advancement of Catholicism.[25] Pigneau left Vietnam in December,[31] arriving in Pondicherry, India in February 1785 with Nguyễn Ánh's royal seal. Nguyễn Ánh had authorized him to make concessions to France in return for military assistance.[41] The French administration in Pondicherry, led by acting governor Coutenceau des Algrains, was conservative in outlook and resolutely opposed intervention in southern Vietnam.[41][42] To compound the already complex situation, Pigneau was denounced by Spanish Franciscans in the Vatican, and he sought to transfer his political mandate to Portuguese forces. The Portuguese had earlier offered Nguyễn Ánh 56 ships to use against the Tây Sơn.[43]\n\nIn July 1786, after more than 12 months of fruitless lobbying in Pondicherry, Governor de Cossigny allowed Pigneau to travel back to France to directly ask the royal court for assistance.[39][42][44] Arriving at the court of Louis XVI in Versailles in February 1787, Pigneau had difficulty in gathering support for a French expedition in support of Nguyễn Ánh.[42] This was due to the parlous financial state of the country prior to the French Revolution. Pigneau was helped by Pierre Poivre, who had previously been involved in seeking French commercial interests in Vietnam.[42][45] Pigneau told the court that if France invested in Nguyễn Ánh and acquired a few fortified positions on the Vietnamese coast in return, then they would have the capability to \"dominate the seas of China and of the archipelago\", and with it, control of Asian commerce.[45] In November 1787, a treaty of alliance was concluded between France and Cochinchina, the European term for southern Vietnam, in Nguyễn Ánh's name. Pigneau signed the treaty as the \"Royal Commissioner of France for Cochinchina\".[39][45] France promised four frigates, 1,650 fully equipped French soldiers and 250 Indian sepoys in return for the cession of Poulo-Condore (Côn Đảo) and Tourane (Da Nang),[39][42] as well as tree trade to the exclusion of all other countries.[13][39][44] However, the freedom to spread Christianity was not included.[39][45] However, Pigneau found that Governor Thomas Conway of Pondicherry was unwilling to fulfill the agreement;[44][46] Conway had been instructed by Paris to determine when to organize the aid, if at all.[39][46] Pigneau was thus forced to use funds raised in France to enlist French volunteers and mercenaries.[38][42][46][47] He also managed to procure several shipments of arms and munitions from Mauritius and Pondicherry.[17]\n\nMeanwhile, the Royal Court of Siam in Bangkok,[c] under King Rama I,[d] warmly welcomed Nguyễn Ánh. The Vietnamese refugees were allowed to build a small village between Samsen and Bangpho, and named it Long-kỳ (Thai: Lat Tonpho).[34] Ánh had stayed in Siam with a contingent of troops until August 1787. His soldiers served in Siam's war against Bodawpaya of Burma (1785–86).[13][49] On 18 December 1786, Nguyễn Ánh signed a treaty of alliance with the Portuguese in Bangkok. In the next year, António (An Tôn Lỗi), a Portuguese from Goa, came to Bangkok, brought Western soldiers and warships to Ánh.[50][51][52] This disgusted the Siamese and Ánh had to refuse the aid from Portuguese. After this incident, Ánh was no longer trusted by the Siamese.[37]\n\nHaving consolidated their hold on southern Vietnam, the Tây Sơn decided to move north to unify the country. However, the withdrawal of troops from the Gia Dinh garrison weakened their hold on the south.[43][49] This was compounded by reports that Nguyễn Nhạc was being attacked near Qui Nhơn by his own brother Nguyễn Huệ,[53] and that more Tây Sơn troops were being evacuated from Gia Dinh by their commander Dang Van Tran in order to aid Nguyễn Nhạc. Sensing Tây Sơn vulnerability in the south, Nguyễn Ánh assembled his forces at home and abroad in preparation for an immediate offensive.[18]\nÁnh secretly left Siam in the night, leaving a letter in his house, he decided to head for southern Vietnam by boat.[52] As the Vietnamese refugees were preparing to leave, people nearby heard about it and reported it to Phraya Phrakhlang. Phraya Phrakhlang reported it to King Rama I and the Front Palace Maha Sura Singhanat.[e] Sura Singhanat was extremely angry, he chased them personally. At dawn, Sura Singhanat saw Ánh's boat at the mouth of the bay. Finally, the Vietnamese escaped successfully.[54][37] Ánh arrived at Hà Tiên then to Long Xuyên (Cà Mau),[52] but he failed in his first attempt to recapture Gia Dinh,[49] having failed to convince the local warlord in the Mekong Delta, Vo Tanh to join his assault.[55] The following year, Nguyễn Ánh finally managed to persuade the warlord to join him but after having given his sister to the warlord as a concubine.[55] He eventually succeeded in taking Mỹ Tho, made it the main staging point for his operations, and rebuilt his army. After a hard-fought battle, his soldiers ca",
  "concepts": [
    "Gia Long"
  ],
  "findings": [
    "Early years",
    "Pigneau and French assistance",
    "Consolidation of Southern Annam",
    "Fortifications",
    "Agricultural reform and economic growth",
    "Naval buildup",
    "Unification of Vietnam",
    "Rule",
    "Renaming Vietnam",
    "Administrative structure",
    "Foreign military relations",
    "Trade relations",
    "Domestic policies and capital works",
    "Social policy",
    "Family and succession",
    "See also",
    "Notes",
    "Citations",
    "References"
  ],
  "timestamp": "2025-04-11T10:19:51.756959"
}