{
  "title": "Children of Mary of the Sacred Heart",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Children_of_Mary_of_the_Sacred_Heart",
  "content": "The Children of Mary of the Sacred Heart (French: Enfants de Marie du Sacré-Coeur) is a Catholic sodality founded by Saint Madeleine Sophie Barat in Lyons, France in 1823 (some older sources say 1818, but their archivist says 1823).[1] It has also been referred to as the \"Association of the Children of Mary,\" the \"Congregation of the Children of Mary,\" the \"Children of Mary Sodality,\" and by their French name, Enfants de Marie, often abbreviated E. de M.[2][3] Although groups run currently in the United States and Canada, this page refers primarily to the history before 1900.\n\nMadeleine Sophie Barat (12 December 1779 – 25 May 1865) established this lay women's group eighteen years after the original Society of the Sacred Heart, the congregation of nuns that she founded in 1800.[4] It is a sodality, from the Latin sodalis, meaning member or companion.[5] She used the term to describe an association of lay people who met for a religious purpose, similar to a confraternity, in this case to join themselves to her and her sisters, and \"act in the world in our stead.\"[6]\n\n\nLadies, it belongs to you to accomplish what we in our houses cannot do. We have enrolled you in a holy phalanx with the hope that you will act in the world in our stead, and by your example become apostles and win souls to our Lord.[6]\nSt. Madeleine Sophie Barat to the first group in Lyons, 1823.\n\nJesuit Father Joseph Varin, SJ, who had helped her write the Constitution of the RSCJ in 1815, also drew up the rules for the Children of Mary.[7] Barat and Varin mostly enrolled students from the schools. Mother Alice Power referred to them in her history of the sodality as \"the most fervent of the elder girls,\" but other women could also join by invitation.[8] Their emblem was a lily, and their motto was \"Semper Fidelis.\" They designed their medal using a line from written by a member, Rose de Joigny: Cor meum jungatur vobis (my heart is united to you). The flip side (with Mary on it) said \"Marie a été conçue sans péché\" (Mary was conceived without sin). An alternate version had Latin on the side with Mary, \"Maria sine labe originali concepta,\" and the same meaning.\n\n\nMother Barat founded a second group in 1832, known as the \"Congregation of the Children of Mary.\"[9] This time she worked with Father Julian Druilhet, SJ, Provincial of the French Jesuits, who drew up rules.[10] Barat and Druilhet chose the original members, as in the first group, from seniors in the schools who wanted to continue their association after graduation, and other interested women. Mother Barat placed this new association under the patronage of the current archbishop, because it had not yet been authorized by Rome. However, she soon received that authorization, and she established its constitutions so that they would be consistent throughout the Society for religious and lay women alike. She wrote to these women, \nYour mission is a very high one, and I do not fear to call it an apostolate, for you are to act as apostles in the midst of a perverse world. You must lead into the right path those who are wandering from it, encourage those kept back by human respect, and stop the downward course of those in danger.[11]\n\nThese sodalities grew, and soon most major cities in continental Europe had one, each connected to its respective convent of the Sacred Heart. They also expanded throughout the Americas, and, in the words of Mother Power, \nFrom New York to San Francisco, Halifax to Buenos Ayres, they exist in both Americas. Algiers and Cairo in Africa, Melbourne, Sydney and Wellington in Australasia have theirs, active and flourishing. Bishops and pastors find them efficient helpers, and the sovereign pontiffs have appealed to them, never in vain.[12]\nShe wrote that it was their mission to lead lives of \"eminent usefulness.\"\n\nActivities. Members sewed vestments and altar cloths for poor churches in their regions, and also for use in the foreign missions. They additionally took part in specific activities such as ministering to orphaned children, visiting hospitals, going to the homes of the poor and bringing necessities, running reading circles for younger women, and encouraging young men for the priesthood.[9]\n\nSpiritual Exercises. For their religious formation they relied on the Spiritual Exercises of Ignatius of Loyola, which featured specific adaptations for lay people to use in daily life under the guidance of a Jesuit or Jesuit-trained spiritual director. We know this because Louis Baunard, rector of the Catholic church of Lille and a historian, wrote that they were \"A vast secular association of Christian perseverance, ... [with] spiritual exercises for means, charity and mutual support for resource, and sanctification of self and others for aim, the glory of the adorable Heart of Jesus for final end.\"[13] He also published his own biography of Mother Barat.[14]\n\nRetreats. Mother Barat made a rule for all of her RSCJ that once each year a priest would offer a retreat that the sisters would host, and to which lay people, especially the various groups of the Children of Mary, would be welcome. Turin led the way, then Chambéry, Lyons, Grenoble, Paris, Amiens, Poitiers, and Niort, before the practice spread globally.[15]\n\nCharism. Lady Georgiana Fullerton, the English novelist, philanthropist, and third-order Franciscan who wrote the biography of Mother Barat that is cited here, became president of one of these sodalities. Lady Fullerton wrote, \nWhat struck us as eminently, if not peculiarly, distinctive of this institute, is the intense desire, and we might almost say the special gift, of imparting to those they educate, and those they influence, the spirit of active apostleship in the world, which is limited to no particular sphere of action, but spreads itself in every place and throughout every social circle, where those inspired with it and trained to it may be thrown.[12]\n She emphasized that they should \"never to lose sight of the children educated in their schools,\" which may have been why they kept Children in their name.\n\nThere are still some Children of Mary groups, and a further expansion of this page will offer details.\n",
  "concepts": [
    "Children of Mary of the Sacred Heart",
    "mary",
    "children",
    "barat",
    "children mary",
    "mother",
    "women",
    "wrote",
    "mother barat",
    "lay",
    "heart"
  ],
  "findings": [
    "Origins",
    "Constitution",
    "Growth",
    "Spirituality and practice",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:57.952414"
}