{
  "title": "Jericho Rosales",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jericho_Rosales",
  "content": "Jericho Vibar Rosales (Tagalog: [ˌd͡ʒɛː.ɾɪˈxo ɾoˈsaː.lɛs]; born September 22, 1979),[1] also known as Echo, is a Filipino actor, singer, songwriter and film producer. Known primarily for his leading man roles in romantic drama, he has starred in some of the most distributed Philippine series around the world. His accolades include a Guam International Film Festival Award, two Newport Beach Film Festival Award, a Gawad Urian Award, two Metro Manila Film Festival Awards and four Star Awards for Movies, including nominations for an ASEAN International Film Festival and Awards, six FAMAS Awards and four Luna Awards.\n\nAt age 17, Rosales began his career after winning the pageant \"Mr. Pogi\" in 1996, a segment in the noontime variety show Eat Bulaga!. He was launched the following year as one of Star Circle's fourth batch members by talent agency Star Magic. He rose to stardom after playing Angelo Buenavista in the romantic drama Pangako Sa 'Yo (2000), and has since starred in International Emmy-nominated series such as Kahit Isang Saglit (2008), Dahil May Isang Ikaw (2010), The Legal Wife (2014) and Bridges of Love (2016). His other starring roles in Sana'y Wala Nang Wakas (2003), Panday (2005), Green Rose (2011) and Halik (2018) established him as a leading actor in soap operas.\n\nDubbed as the \"Asian Drama King\", Rosales is one of the most successful Filipino actors in Asia. In 2012, he received an Achievement in Acting award at the Guam International Film Festival and won Best Actor at the Newport Beach Film Festival in 2013. He received his first Gawad Urian for Best Actor for his role in the film Alagwa (2012). For his portrayal in the romantic comedy Walang Forever (2015), he won the Metro Manila Film Festival Award for Best Actor. His portrayals in the biographical film Pacquiao: The Movie (2006) and romantic war drama Baler (2008) earned him the Star Award for Movie Actor of the Year.[2]\n\nRosales gained international stardom in several countries (Malaysia, China, Ghana,[3] Cambodia,[2] Peru, Colombia, and many others) for his primetime soaps such as Pangako Sa 'Yo (2000–2002), Sana'y Wala Nang Wakas (2003–2004) and Dahil May Isang Ikaw (2009–2010), all co-starring Kristine Hermosa. Since its original release, Pangako Sa 'Yo has aired in over 20 foreign territories, with the Cambodian Television Network ordering a local remake in 2013.[4] In Peru, Rosales is known for his role in the series Bridges of Love (\"Puentes de Amor\"), the first Filipino drama to air in the country and the Latin American market.[2] Similarly, The Legal Wife (2014), which also stars Maja Salvador and Angel Locsin, have gained much popularity in the African and Balkan regions.[2] In 2006 he portrayed Filipino boxing champion Manny Pacquiao in Pacquiao: The Movie, and bagged two Best Actor trophies for his work. He repeated this in 2008, when he won two more Best Actor awards for his role in the film Baler, opposite Anne Curtis.\n\nIn February 2011, Rosales starred in the remake of the Korean drama, Green Rose. The same year, he appeared in two productions. He starred in his first international film, Subject: I Love You.[5] He then starred in the family drama Yesterday, Today, Tomorrow which premiered at the 37th Metro Manila Film Festival. While it became the festival's least performing film at the box office with earnings of ₱10.6 million, his performance was met with critical praise.[6] In March 2012, he starred with in the political drama Dahil sa Pag-ibig. The finale episode drew 33.9 percent national ratings.[7] In 2013, Rosales starred as Jesse Robredo in the anthology Maalaala Mo Kaya. According to Kantar Media, the episode received 31.9 percent household ratings.[8] In January 2014, he starred with Angel Locsin and Maja Salvador in the romantic drama The Legal Wife. His portrayal received praises from critics and was one of the most watched television shows of 2014.[9][10] The following month, he starred in the adaptation of Bob Ong's fictional memoir ABNKKBSNPLAko?!. Abigail Mendoza of Philippine Entertainment Portal commended his \"natural\" approach to his character in the film.[11] He later played a supporting role in the historical drama Bonifacio: Ang Unang Pangulo as Dr. Jose Rizal.[12]\n\nRosales appeared in two major projects in 2015. He starred with Maja Salvador and Paulo Avelino in the romantic drama Bridges of Love. The series was a success, receiving a national rating of 28.3% at peak and earned a nomination at the International Emmy Award for Best Telenovela.[13] In December 2015, Walang Forever premiered at the 41st Metro Manila Film Festival. The film was a box-office success, grossing ₱100 million throughout its run.[14] In September 2016, Rosales starred with Arci Muñoz and John Estrada in the revenge drama Magpahanggang Wakas.[15] The series received its highest national rating of 29% in one of its episodes.[16] He then played a fictionalized version of himself in the comedy film Ang Babae Sa Septic Tank 2: #ForeverIsNotEnough. The following year, he played Diego in the romantic drama Siargao, directed by Paul Soriano. In August 2018, Rosales starred in the drama Halik.[17] According to Kantar Media, the series achieved its highest national television rating of 30.3% in its finale episode and was ranked among the most watched television shows of 2018 in the Philippines.[18][19] In December 2018, The Girl in the Orange Dress was released as one of the entries of the 44th Metro Manila Film Festival where he starred opposite Jessy Mendiola.[20] In 2019, he starred in a short film by Eileen Cabiling called Basurero.\n\nAfter a four-year hiatus, Rosales made his acting comeback in May 2023 through his theatrical debut as Tony Javier in Ryan Cayabyab's Ang Larawan: The Concert.[21] Recent highlights include his performance in the TV series Lavender Fields which aired in 2024, and the highly anticipated action series Sellblock, for which principal photography wrapped in April 2024.He is also set to star as President Manuel L. Quezon in the 2025 biopic Quezon, directed by Jerrold Tarog and produced by TBA Studios. \n\nRosales is often dubbed as the \"Asian Drama King\" by various sources.[22][23][24] He is regarded as one of the most sought after leading men and has been cited as the greatest movie leading actor from 2000 to 2020 by PEP.ph.[25][26] He has gained massive following and popularity in Asian and African countries for the widespread success of his soap operas.[27][28] Writing for Esquire magazine, Paul John Caña stated that Rosales is \"a superstar of the highest order, not just in the Philippines but in many other places around the world\".[29] In a 2018 review, Ferdinand Topacio of The Philippine Star stated that Rosales is a combination of Piolo Pascual, John Lloyd Cruz and Alden Richards.[30] Oggs Cruz of Rappler stated that Rosales is mainly known for \"playing characters whose struggles in either love or life are laced with all manners of desperation.\"[31] A critic from The Hollywood Reporter also praised his portrayal in the horror drama Alagwa, stating that he conveyed his role expertly and emphasized his natural chemistry and spontaneity with co-actor Bugoy Cariño.[32]\n\nRosales has earned international acclaim for his film work.[33] He starred alongside Briana Evigan and Dean Cain in the film Subject: I Love You. It became the first Filipino film to be shown in a festival where over 400 American and international films are screened.[34] His role in Alagwa (2012), earned him a Best Actor win at the Guam International Film Festival and a nomination at the ASEAN International Film Festival and Awards in the same category. He also won Best Actor twice at the Newport Beach Film Festival for his roles in Subject: I Love You (2011) and Alagwa (2012). His film Basurero (2010) had its world premiere at the Busan International Film Festival and later competed at the Tampere Film Festival.[35] The film earned him a Best Actor nomination at the New Filmmaker Los Angeles Awards.[36] He also starred in the Malaysian television series Kusinero Cinta with Aaron Aziz and Tiz Zaqyah and starred opposite Carmen Soo in the series Kahit Isang Saglit, which was aired in Malaysia and Singapore.[37] In 2011, Yes! magazine ranked among the biggest celebrity endorsers in the Philippines.[38] In 2023, Tatler magazine named him one of the most stylish personalities in Asia.[39]\n\nIn February 2014, Rosales was involved in a campaign \"Free Mali\", the lonely elephant who has been living in a small, concrete enclosure at the Manila Zoo for 35 years.[40] The campaign is led by animal rights group PETA. In February 2020, Rosales launched an eco-friendly tote bags named \"Echo Bags\". Portions of the proceeds went to \"Waves 4 Water\", a non-profit organization which helps people around the world get access to clean water.[41] In April 2020, Rosales auctioned some of his items in an online bidding for the benefit of \"Lockdown Cinema Club\", which supports 1,500 film workers displaced by the ongoing Luzon lockdown due to the COVID-19 pandemic.[42] In November 2020, Rosales donated 400 food packs in Marikina for the victims of Typhoon Ulysses through the organization \"I Am Hope\" headed by Bea Alonzo.[43] In October 2021, Rosales spearheaded a 20-unit housing project in Baggao, Cagayan, with ex-wife Kim Jones and manager Marinez Elizalde for the victims of Typhoon Ulysses.[44]\n\nRosales was born in Quezon City, but was raised in Bula, Camarines Sur[45] where he learned to speak Rinconada Bikol.\n\nSantino Rosales (born 2000), Jericho's son with ex-partner Kai Palomares, is a model and football player currently with Maharlika Taguig.[46]\n\nRosales and Kristine Hermosa were in a relationship from 2000 to 2004.[47]\n\nHe married Kim Jones in a beach wedding ceremony in Boracay on May 1, 2014.[48] On January 29, 2024, Rosales and Jones announced their separation after being married for 10 years. Their godfather, Ricco Ocampo, stated that they had been separated since 2019.[49]\n\nIn August 2024, Rosales announced he is dating actress Janine Gutierrez.[50]\n",
  "concepts": [
    "Jericho Rosales"
  ],
  "findings": [
    "Career",
    "1996-2009: Early roles and breakthrough",
    "2010s: Career expansion",
    "2020s: Established actor",
    "Reception",
    "Philanthropy and activism",
    "Personal life",
    "Acting credits",
    "Television",
    "Film",
    "Awards and nominations",
    "Major associations",
    "Other accolades",
    "Discography",
    "Studio album",
    "See also",
    "Notes",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:13:08.141399"
}