{
  "title": "Gaby Espino",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Gaby_Espino",
  "content": "María Gabriela Espino Rugero (born November 15, 1977),[1][2][3][4] better known as Gaby Espino, is a Venezuelan actress, model and presenter. She is best known for her main roles in telenovelas in Venezuela, Colombia and Mexico.[5]\n\nBorn in Caracas, Venezuela, Gaby Espino is the daughter of a chemical engineer and a publicist.[6] She is of Spanish, Native Venezuelan and Lebanese descent.[7][8] Her parents divorced when she was young. She is the oldest of five children, she has a sister, Andreina, two paternal half-brothers, Gustavo and Mariano and a maternal half-sister, Nelly.[9]\n\nDue to her fascination with animals, she originally planned to become a veterinarian. She later decided to study dentistry, but changed her mind and began studying public relations, before deciding to become an actress.[10]\n\nGaby Espino married Venezuelan actor Cristobal Lander on June 14, 2007. On July 9, 2008, they welcomed a daughter named Oriana Lander.[11]\n\nDuring the filming of Mas Sabe el Diablo in 2009, Espino was linked to her co-star, Jencarlos Canela. In early 2010, Espino and Lander separated and it was rumored that it was because Canela was dating Espino on the side. Canela and Espino denied this and stated they were just friends.[12]\n\nEspino reconciled with Lander in November 2010, but they later divorced in March 2011 and once again rumors suggested that Canela and Espino were dating.[13][14]\n\nIn September 2011, Canela and Espino did a live chat over social networking site Twitter, where they confirmed they were in relationship and announced that they were expecting their first child together. The godparents are Cristina Saralegui and Pitbull. Espino gave birth to their son, Nickolas Canela Espino, on February 12, 2012. On August 26, 2014 both Canela and Espino confirmed on their official Facebook page that they have decided to put an end to their relationship.[15]\n\n2024\n\n| AHORA QUE NO ESTAS\n|PALOMA\n|MAIN ROLE; 7 EPISODES PRIME VIDEO\n",
  "concepts": [
    "Gaby Espino",
    "espino",
    "canela",
    "canela espino",
    "lander",
    "venezuelan",
    "gaby espino",
    "gaby",
    "venezuela",
    "sister",
    "relationship"
  ],
  "findings": [
    "Early life and career",
    "Personal life",
    "Filmography",
    "Films",
    "Television",
    "Awards and nominations",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:26:11.176604"
}