{
  "title": "The Power of One (film)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/The_Power_of_One_(film)",
  "content": "The Power of One is a 1992 drama film directed and edited by John G. Avildsen, loosely based on Bryce Courtenay's 1989 novel of the same title. The film stars Stephen Dorff, John Gielgud, Morgan Freeman, Armin Mueller-Stahl, and Daniel Craig in his feature film debut.\n\nSet in South Africa during World War II and the years immediately afterwards, the film centers on the life of Peter \"PK\" Keith, an English South African boy raised under apartheid, and his conflicted relationships with a German pianist, a Coloured boxing coach and an Afrikaner romantic interest.\n\nBorn in 1930 to a recently widowed Englishwoman on a homestead in South Africa, young Peter Philip Kennith Keith (nicknamed \"PK\") is schooled in the ways of England by his mother and the ways of Africa by a Zulu nanny, whose son Tonderai is also his best friend. However, their peaceful life is soon shattered when the farm's cattle are claimed by rinderpest. PK's mother succumbs to a nervous breakdown, and he is sent away to a conservative Afrikaans boarding school while she recovers.\n\nBeing the only English student at the boarding school, PK earns universal contempt from his Afrikaner fellows—particularly from Jaapie Botha, the oldest student. Their extreme bullying, which includes spitting in PK's face and urinating on him, strikes PK with a severe case of bed wetting, a habit which he eventually overcomes with local sangoma Dabula Manzi. In conquering his nightmares, PK is given a chicken, whom he names Mother Courage, and which becomes his closest companion.\n\nWhen war suddenly breaks out in Europe, the Afrikaner students kidnap PK and Mother Courage and has them tried before a mock Nazi court where Botha elaborates on the depth of his hatred for the British—a people he holds responsible for atrocities committed during the Second Boer War. The Afrikaner boys hang Mother Courage and Jaapie kills her with a slingshot. When PK physically retaliates against Botha, they attempt to execute him in a similar manner, but are interrupted by a teacher who later oversees Botha's expulsion.\n\nWith his mother dead, PK finds himself living with his grandfather in Barberton. He eventually finds a mentor in Karl \"Doc\" von Vollensteen, a lonely German musician whose family was executed by the Nazis. Doc warms to PK and under his guidance PK soon becomes an excellent pianist. He is soon interned as an enemy alien for the rest of the war, but PK continues to visit him regularly in prison. Doc introduces the boy to Geel Piet, a Cape Coloured inmate who trains him to be an excellent boxer. Piet also impresses on PK his mantra: \"first with the head, then with the heart\".\n\nA maturing PK begins to express sympathy towards black prisoners, who are detained under appalling conditions and frequently beaten and bullied by the English South African and Afrikaner guards, one of whom, Sgt. Bormann forces Piet to eat manure off his foot. PK works with Doc to distribute contraband among the Africans, writes their letters to home, and shares their many sufferings. World War II does not end happily for PK, as Doc is repatriated and returns to Germany, and Piet is bludgeoned to death by Bormann, in retaliation for initiating a concert, led by PK and Doc, with the black prisoners singing a song denouncing the guards as cowards.\nAs a result of the murder of Piet by Bormann during the concert. Bormann is later found hung years later (by person/s unknown).\n\nIn 1948, when the apartheid is established by the newly elected Afrikaans National Party, PK goes to study at the prestigious Prince of Wales School in Johannesburg. While attending a boxing championship, he is enamoured by Maria Marais, the daughter of a leading National Party official. Since her strict father will not permit them to see each other, they begin dating in secret. On one such outing they are introduced to Gideon Duma, a prominent boxer in Alexandra, a black township. Duma's passion for resisting apartheid inspires PK, and he opens an English school for Africans.\n\nMaria's father, incensed by the couple's ongoing relationship and PK's ties to a multiracial gym, leads him to request a formal investigation by one of his South African Police contacts, Colonel Breyten. Breyten and his sergeant, an embittered Jaapie Botha, place PK under surveillance for subversion. His clashes with the police (which result in detainment of numerous people he knows) come to a head when Duma is severely injured and Maria is killed during a raid on their school in a church along with numerous other innocent people. Maddened by grief, PK considers going to study at Oxford in England, but is consoled by a recovering Duma who shows him that all his teachings have finally shown progress and reminds him of all the good he can still do in Africa.\n\nBotha leads a violent raid on Alexandra the following night which results in Breyten's death at the hands of an enraged villager. Botha threatens to shoot Elias Mlungisi, the local boxing promoter, only to be confronted by PK. They fight, and PK finally defeats his childhood enemy. Despite the loss, a bloodied and vindictive Botha is still bent on killing him with a hidden pistol, but an arriving Gideon Duma brutally kills Botha with a cricket bat to the head. Now wanted fugitives from the apartheid government, PK and Duma together vow to continue a campaign against racial injustice with the aid of the other survivors. PK's closing narration identifies meaningful voices during his life from his nanny to Doc, Geel Piet, Dabula Manzi, and finally Maria.\n\nThe film received mixed reviews. Review aggregate Rotten Tomatoes currently ranks the film at a 39% 'rotten' rating based on 18 reviews, with an average score of 5/10.[2] Roger Ebert of the Chicago Sun-Times gave it two and a half stars out of four, stating that the troubles of South Africa \"are too complex to be reduced to a formula in which everything depends on who shoots who\", but did add \"there are some nice touches,\" such as the locations and Gielgud's performance.[3]\n\nMorgan Freeman later said in an interview that the film \"wasn't as good as I had hoped it would be.\"[4]\n\nThe soundtrack to the film was composed by Hans Zimmer.[5]\n",
  "concepts": [
    "The Power of One (film)"
  ],
  "findings": [
    "Plot",
    "Cast",
    "Critical reception",
    "Soundtrack",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T12:40:49.497626"
}