{
  "title": "Teancum",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Teancum",
  "content": "According to the Book of Mormon, Teancum (/tiˈænkəm/)[1] was a Nephite military leader.[2] He is described in the Book of Alma between Alma 50:35 and Alma 62:40 (inclusive). According to LDS teachings, he is known for the assassinations of King Amalickiah and the subsequent assassination of Amalickiah's brother, Ammoron, seven years later. The Book of Mormon states that in time he proved to be a great chief captain in the Nephite army.[3]\n\nTeancum first appears as one of Captain Moroni's subordinates.[4] When Morianton's maidservant informs Moroni about the plans of Morianton and his separatist army,[5] Teancum leads an army to intercept Morianton. Teancum successfully kills Morianton, halting their attempt to colonize the region to the north. Teancum then pacifies the people of Morianton before returning to Moroni.[4] His next action in the text is to engage Amalickiah's coastal campaign. After fighting the Lamanite army to a standstill, Teancum and an unnamed servant enter the camp and kill Amalickiah with a javelin just before the New Year.[6]\n\nFollowing the death of Amalickiah and the subsequent Lamanite retrenchment, Teancum is assigned to assault the city of Mulek. Upon arrival, he concludes that it is too well fortified to attack without reinforcements.[7] Upon the arrival of Moroni and fellow Nephite commander Lehi, Teancum participates in a meeting to devise an appropriate plan of attack. After Jacob the Zoramite, the commander of the Mulek occupation force, refuses an invitation to open battle, Moroni devises a \"decoy and ambush\" strategem.[8] Teancum sets out to bait the Mulekites, successfully drawing them into a chase north, with Lehi waiting at the city of Bountiful. With the bulk of Lamanite forces pursuing Teancum,  Moroni darts in, seizes the city, and then pursues the Lamanites. When Teancum and Lehi join forces, the Lamanites retreat, pursued by Teancum and Lehi. Eventually, Moroni's pincer movement envelopes the Lamanites, leading Jacob to attempt to cut his way through Moroni's army to escape. In the ensuing battle, Jacob is killed, Moroni is wounded, and there are heavy casualties on both sides.[9] Teancum then coordinates the use of Lamanite prisoners of war to construct fortifications for the city of Bountiful.[10]\n\nTeancum reappears as one of the co-commanders of the eastern theatre during Moroni's absence to reinstate Pahoran as chief judge.[11] Upon Moroni's return to the front, Teancum coordinates with him and Lehi to drive Lamanite forces to the city of Moroni. The city of Moroni hosted the bulk of the Lamanite military, as well as Ammoron, the king of the Lamanites and brother of the deceased Amalickiah. During the siege, Teancum angrily decides to kill Ammoron, just like he had killed Amalickiah. Teancum infiltrates the city of Moroni, finding Ammoron sleeping. He then throws a javelin at Ammoron, inflicting a mortal wound but allowing him to alert his Lamanite guards. The guards overtake and kill Teancum. In the morning, upon hearing of the death of Teancum, Moroni orders an attack on the city of Moroni. The Nephites defeat the Lamanite occupiers, ending the war.[12]\n",
  "concepts": [
    "Teancum"
  ],
  "findings": [
    "Narrative",
    "Operations against Morianton and Amalickiah",
    "Siege and Capture of Mulek",
    "Final Campaign",
    "See also",
    "Notes",
    "Works cited",
    "External links"
  ],
  "timestamp": "2025-04-11T10:07:16.040377"
}