{
  "title": "Clio Barnard",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Clio_Barnard",
  "content": "Clio Barnard (born 1 January 1965) is a British director of documentary and feature films. She won widespread critical acclaim and multiple awards for her debut, The Arbor, an experimental documentary about Bradford playwright Andrea Dunbar. In 2013 she was hailed[1] as a significant new voice in British cinema for her film The Selfish Giant, which premiered in the Director's Fortnight section of the Cannes Film Festival.[2]\n\nBarnard grew up in the town of Otley in Yorkshire. Her father was a university lecturer and her mother was an artist who later became a jazz singer.[3] She graduated from Newcastle Polytechnic[4] (now Northumbria University), with a First Class B.A. (Hons) with distinction in fine art and received a Post-Graduate Diploma in Electronic Imaging at Duncan of Jordanstone College of Art and Design. In 1988, her post grad video work Dirt and Science featured Jane and Louise Wilson and toured internationally as part of the ICA Biennial of Independent Film & Video, curated by Tilda Swinton.[5]\n\nCritics have likened Barnard's realist yet lyrical work to that of Ken Loach. Time Out said of The Selfish Giant, \"this is Kes revisited in a post-Thatcher northern England.\"[6]\n\nHer debut feature The Arbor (2010) produced by Artangel,[7] won several awards, including Best New Documentary Filmmaker at Tribeca Film Festival New York, Best Newcomer and Sutherland Awards at The London Film Festival, Douglas Hickox Award at British Independent Film Awards, The Guardian First Film Award, Best Screenplay at the London Evening Standard Film Awards, the Sheffield Documentary Film Festival Innovation Award and the Jean Vigo Award for Best Direction at Punto de Vista International Documentary Film Festival. She was nominated for the BAFTA Outstanding Debut Award in February 2011.\n\nAn Acre of Land is a collaboration between British composer Harry Escott and PJ Harvey and is the theme to Dark River, a film by Director Clio Barnard. Escott says: ‘recording PJ Harvey’s vocal on “An Acre of Land”, a song we arranged together for Dark River, was a spine-tingling experience.’ The film premiered at the 2017 London Film Festival and was released in 2018.[8]\n\nBarnard participated in the 2022 edition of the Sight & Sound film polls, which are held every ten years to commemorate the greatest films of all time and rank them in order. Directors and critics both give their ten favourite films of all time for the poll; Barnard picked The Gospel According to St. Matthew (1964),  Rashomon  (1950), Fear Eats the Soul (1974), Andrei Rublev (1966), L'Atalante (1934),  Road (1987), Chronicle of a Summer (1961), Vagabond (1985), Hunger (2008) and La strada (1954).[9]\n",
  "concepts": [
    "Clio Barnard",
    "film",
    "film festival",
    "festival",
    "barnard",
    "documentary",
    "awards",
    "award",
    "british",
    "best",
    "time"
  ],
  "findings": [
    "Early life and education",
    "Reception and awards",
    "Musical Collaborations",
    "Influences",
    "Filmography",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:16.222699"
}