{
  "title": "Alec Mapa",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Alec_Mapa",
  "content": "Alejandro \"Alec\" Mapa (/ˈmɑːpə/; born July 10, 1965) is an American[1] actor, comedian and writer.[2] He got his first professional break when he was cast to replace B. D. Wong for the role of Song Liling in the Broadway production of M. Butterfly. He gained recognition for roles such as Adam Benet on Half & Half, Suzuki St. Pierre on Ugly Betty and Vern on Desperate Housewives. Mapa recurred as Renzo on Switched at Birth.\n\nMapa co-hosted the Logo network reality dating game show Transamerican Love Story with Calpernia Addams in 2008. In 2013, he debuted in his own one-man show, Alec Mapa: Baby Daddy, which was made into a concert film and premiered on Showtime in 2015.\n\nMapa was born in San Francisco and attended George Washington High School.[2]\nWhile in high school, he played Randolph McAfee in the production of Bye Bye Birdie.\n\nMapa's senior year productions were Cabaret and Harvey, both in which he had the lead roles. Mapa was also a champion orator in the Humorous and Dramatic Interpretation categories of Speech.\n\nMapa got his professional break when he was cast to understudy, and then replace B. D. Wong in the Broadway production of M. Butterfly. Mapa later played the role on the national tour. Mapa would return to Broadway in an adaptation of L'Hôtel du libre échange by Georges Feydeau and Maurice Desvallières, re-titled, \"A Little Hotel on the Side\" in 1992. The next year, Mapa was back on Broadway in a Stratford Festival inspired production of Timon of Athens. Off-Broadway, Mapa earned a nomination at the 2001 Lucille Lortel Awards for his performance in the Jessica Hagedorn play Dogeaters, and was featured in every play in the \"Whitelands\" trilogy, a series of plays about gay Asian men written by Chay Yew; \"Porcelain\" (1992), \"A Language of Their Own\" (1995), and \"Wonderland\" (1999).\n\nOn television, he has made guest appearances on a wide variety of programs, including The Jamie Foxx Show, Roseanne, Seinfeld, NYPD Blue, Friends, Murder One and Dharma & Greg. He had a supporting role in the short-lived 2001 comedy Some of My Best Friends. He played Adam Benet in the UPN comedy Half & Half.\n\nHe wrote and performed in a one-man play titled \"I Remember Mapa\", about his experiences growing up gay in San Francisco.\n\nMapa was a featured performer on the Logo original stand-up comedy series Wisecrack. In 2006 appeared as Vern, Gabrielle's personal shopper, on the TV series Desperate Housewives. He had a recurring role on the 2006–2010 series Ugly Betty, as Suzuki St. Pierre, the flamboyant host of a fictional gossip and news show (who, it is revealed, is actually a straight—and married—journalist named Byron Wu). He performed the voice of Rick's flamboyantly gay uncle Bakla on the 2007-2009 animated series Rick & Steve: The Happiest Gay Couple in All the World.\n\nMapa's film credits include parts in Bright Lights, Big City, Playing by Heart, Connie and Carla and Marley & Me, among others. He was featured in the movies Super Sweet 16: The Movie and Tru Loved. He also played as a stylist in the movie You Don't Mess with the Zohan.\n\nIn 2008, Mapa hosted Logo's Transamerican Love Story, a reality dating program starring transgender woman Calpernia Addams selecting from among eight potential suitors. In the same year, he also hosted Dancing With Dogs on Animal Planet.\n\nMapa also performed on the 2009 Atlantis Freedom Caribbean Cruise headlining in the Arcadia Theater.\n\nIn 2010, Mapa became one of the co-hosts of Logo's The Gossip Queens, a daily series where he helps present celebrity gossip.\n\nIn his act, he jokes that he is sometimes confused with Rex Lee, another flamboyant Asian gay man who plays Lloyd on the HBO dramedy Entourage.\n\nIn 2015, Mapa appeared on Candidly Nicole with Nicole Richie.[3]\n\nMapa has appeared in various iterations of the reality competition series RuPaul's Drag Race and its spin-off shows. He first appeared in 2010 as a guest judge on the second season for the first ever Snatch Game challenge. In 2011 he appeared as a guest judge on the second season of the spin-off series RuPaul's Drag U for the Suddenly Single challenge. In 2013 he performed in drag as a warm-up act for the live finale of the show's fifth season.[4] He returned in 2021 as a special guest for the Charisma, Uniqueness, Nerve and Talent Monologues challenge on the sixth season of RuPaul's Drag Race All Stars.[5] His next appearance was in 2022 as a guest judge for the \"60s Girl Groups\" episode on the fourteenth season of RuPaul's Drag Race.[6] The same year Mapa began hosting, alongside comedian Loni Love, the official RuPaul's Drag Race podcast, Squirrel Friends, in collaboration with iHeartRadio.[7] For a brief period in 2021 he had previously hosted a previous iteration of the podcast, simply entitled The Official RuPaul's Drag Race Podcast, alongside Canada's Drag Race season 1 winner Priyanka.[8] His most recent appearance was in 2023 as a special guest for the Carson Kressley, This is Your Gay Life challenge on the eighth season of RuPaul's Drag Race All Stars.[9]\n\nIn 2023, Mapa appeared in the Lifetime original film, Ladies of the '80s: A Divas Christmas, starring Loni Anderson, Morgan Fairchild, Linda Gray, Donna Mills, and Nicollette Sheridan.\n\nMapa is gay[1] and lends his support to various projects supporting the gay, lesbian, and Asian American communities. In 2008, Mapa legally married Jamison \"Jamie\" Hebert, after dating since 2002.[10] On the TV series The Gossip Queens, Mapa stated in the opening episode that he and his husband had adopted a 5-year-old boy in 2010.[11]  Mapa is of Filipino descent.\n",
  "concepts": [
    "Alec Mapa"
  ],
  "findings": [
    "Early life",
    "Career",
    "Personal life",
    "Credits",
    "Writer",
    "Filmography",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:50:00.373771"
}