{
  "title": "Yetzer hara",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Yetzer_hara",
  "content": "In Judaism, yetzer hara (Hebrew: יֵצֶר הַרַע‎, romanized: yēṣer haraʿ‍) is a term for humankind's congenital inclination to do evil. The term is drawn from the phrase \"the inclination of the heart of man is evil\" (Biblical Hebrew: יֵצֶר לֵב הָאָדָם רַע, romanized: yêṣer lêḇ hā-ʾāḏām raʿ), which occurs twice at the beginning of the Torah (Genesis 6:5 and Genesis 8:21).\n\nThe Hebrew word yetzer having appeared twice in Genesis occurs again at the end of the Torah: \"I knew their devisings that they do\".[1] Thus from beginning to end the heart's yetzer (plan) is continually bent on evil. However, the Torah which began with blessing[2] anticipates future blessing[3] which will come as a result of God circumcising the heart in the latter days.[4]\n\nIn traditional Judaism, yetzer hara is not a demonic force; despite this, Samael is considered the source of the yetzer hara, through man's misuse of things the physical body needs to survive. Thus, the need for food becomes gluttony due to the yetzer hara. The need for procreation becomes promiscuity, and so on.\n\nThe Jewish concept of the yetzer hara is similar to the Christian notion of \"fallenness\" or a corrupted human nature, known in the Augustinian tradition as concupiscence, humanity's alienation from God and the image of God in oneself and others, resulting in spiritual ignorance and rebellion, the progressive loss of divine likeness, and a tendency to entertain evil thoughts and commit evil acts. However, the genesis of concupiscence is original or ancestral sin, whereas the yetzer hara is a natural aspect of God's creation. Also, in Judaism each person is said to also possess a yetzer hatov (good inclination) which balances the evil inclination.\n\nAccording to the Talmudic tractate Avot de-Rabbi Natan, a boy's evil inclination is greater than his good inclination until he turns 13 (bar mitzvah), at which point the good inclination is \"born\" and able to control his behavior.[5] Moreover, the rabbis have stated: \"The greater the man, the greater his [evil] inclination.\"[6]\n\nThe underlying principle in Jewish thought states that each person—Jew and gentile alike—is born with both a good and an evil inclination.[7] Possessing an evil inclination is considered neither bad nor abnormal. The problem, however, arises when one makes a willful choice to \"cross over the line,\" and seeks to gratify their evil inclination, based on the prototypical models of right and wrong in the Hebrew Bible.[8] This notion is succinctly worded in the Babylonian Talmud: \"Everything is determined by heaven, except one's fear of heaven,\"[9] meaning, everything in a person's life is predetermined by God—except that person's choice to be either righteous or wicked, which is left to their free will.\n\nThe Bible states that every person on some occasion succumbs to their evil inclination: \"For there is not a righteous man upon earth, that doeth good, and sinneth not.\"[10] The Talmud speaks of the difficulty in overcoming the evil inclination: \"To what is it like, the evil inclination in man? It is like a father who takes his small son, bathes him, douses him with perfume, combs his hair, dresses him up in his finest accoutrements, feeds him, gives him drink, places a bag of money around his neck, and then goes off and puts his son at the front door of a brothel. What can the boy do that he not sin?\"[11] In recognition of this difficulty, repentance (and in some cases, affliction) is said to atone for most sins, while the preponderance of good works keeps one within the general class of good people.[12]\n\nMaimonides gave instructions for how to view the evil inclination and ensuing hardships on that account:\n\n...Therefore, let a man prepare his own mind and request from God that anything that should ever happen to him in this world, whether of the things that are by God's providence good, or of the things that are by Him evil, that the reason [for their occurrence] is so that he might attain true happiness. Now this was stated with regard to the Good Inclination [in man] and with regard to [his] Evil Inclination, that is to say, that he might lay to his heart the love of God and his [continued] faith in Him, even at an hour of rebellion or of wrath or of displeasure, seeing that all of this revolves around [man's] evil inclination, just as they have said: 'In all your ways acknowledge Him',[13] [meaning], even in a matter involving transgression.[14]\nMoshe Chaim Luzzatto wrote in Derech Hashem that \"Man is the creature created for the purpose of being drawn close to God. He is placed between perfection and deficiency, with the power to earn perfection. Man must earn this perfection, however, through his own free will... Man's inclinations are therefore balanced between good (Yetzer HaTov) and evil (Yetzer HaRa), and he is not compelled toward either of them. He has the power of choice and is able to choose either side knowingly and willingly\".[15]\n\nWhile God has created mankind with both good and evil inclinations, the two powers or tendencies that pull one in opposite directions, God commands each person to choose the good and right path over the evil. In the narrative of Cain and Abel, God tells Cain: \"Isn't it true that if you do good, you shall be forgiven? However, if you will not do good, it is because sin crouches at the entrance [of your heart], and to you shall be its longing, although you have the ability to subdue it.\"[16] Medieval commentator Rashi explains: \"and to you shall be its longing,\" meaning, the longing of sin—i.e., the evil inclination—which constantly longs and lusts to cause one to stumble, \"although you have the ability to subdue it,\" meaning, if a person wishes, they will overpower it.[17]\n\nThe implication is that each person is capable of overcoming sin if they really wish to do so. This may or may not be difficult, and may require some reconditioning, but it is still possible.\n\nAlthough there are many vices, the Sages of Israel have said that most people are drawn to \"stealing\" what does not belong to them (גזל), while fewer people are inclined to \"uncover the nakedness\" of others (גלוי עריות), a euphemism for lechery.[18] On lust, Shalom Shabazi (1619 – c. 1720) calls it \"a phenomenon of the soul,\" and lays out ways in which a person tempted by lust can overcome the urge, without being swept into its clutches.[19][a]\n\nIn rabbinic literature, the yetzer hara is seen as a fundamental force driving humans toward sin, particularly idolatry. This inclination is viewed as an inherent aspect of human nature, leading people away from divine worship and towards the veneration of false gods. \n\nAccording to a well-known legend from the Talmud, the rabbis at the beginning of the Second Temple period recognized the destructive power of the yetzer hara for idolatry and decided to eliminate it. They engaged in intense prayer and fasting, asking God to remove this inclination from the world. In response, God granted their request, and the rabbis were able to capture the evil inclination for idolatry. \n\nHowever, the aftermath of this act showed the complexity of their decision; the absence of the yetzer hara also diminished the human drive for other essential aspects of life, such as procreation (see below). How exactly this reality shift played out and continues to be manifest, has been discussed by many scholars including such thinkers as Rabbi Avraham Yitzchak Kook, Rabbi Zadok HaKohen of Lublin, and others.[21]\n\nRabbinic sources also describe the yetzer hara (when properly channeled) as necessary for the continuation of society, as sexual lust motivates the formation of families, and greed motivates work:\n\nRabbi Nahman bar Samuel bar Nachman said in the name of Rabbi Samuel bar Nachman: [...] \"And behold it was very good\" (Genesis 1:31)—this refers to the yetzer hara. But is the yetzer hara indeed very good?!—Were it not for the yetzer hara, a man would not build a home, or marry a woman, or have children, or engage in business.[22]\nThe Mishnah interprets the Biblical command to love God \"with all your heart\"[23] to mean \"with your two inclinations—good inclination and evil inclination\".[24] The latter half of this interpretation has been interpreted in various ways. According to some, it indicates that physical pleasures such as eating and drinking can be a form of service to God, if one's intention is to thereby strengthen the body in order to better serve God.[25]\n\nThe yetzer hara is also seen positively in that its existence allows for free will, which in turn allows for reward for those who choose good deeds.[26]\n\nAlthough certain ancient groups of Jews appear to have believed in the existence of supernatural evil, in particular fallen angels (as in the Dead Sea scrolls),[27][28][29] the yetzer hara in non-apocryphal sources is presented as a personification of evil distinct from the supernatural Devil of traditional Christianity and Islam. This tendency to demythologize Satan is found in the Babylonian Talmud[30] and other rabbinical works, e.g.: \"Resh Laqish said: Satan, the evil inclination, and the Angel of Death are all one.\"[31] Notably, however, this and other passages of the Talmud do not deny the external existence of Satan, but create a synthesis between external and internal forces of evil.[32][33][34] Similar tendencies can also be found in some Enlightenment Christian writers, such as in the religious writings of Isaac Newton.[35][clarification needed]\n\nMany of the enactments made by the rabbis throughout the centuries are actual \"safeguards\" to distance a person from their natural inclination and make it harder for them to sin. David's prohibition against yichud (the decree which forbids a man to be secluded in a room with a woman unrelated to him),[36] and the rules outlining the conduct of Jews when entering a public bath house, are a just a few examples. Still, in the case of a beautiful captive woman during the time of war, the Torah allows a Jewish soldier to rape her (Deuteronomy 21:10–14). The rabbis call it a concession to man's evil inclination.[37] Rabbi Abraham Isaac Kook explains that the allowance of a 'beautiful captive woman' makes use of the psychological principle of \"one that has bread in his basket,\" (a euphemism for one who is married and is able to engage in sexual relations with his wife at his own discretion) according to which the mere knowledge that something is permitted enables the soldier to exercise restraint and to overcome his inclination.[38]\n",
  "concepts": [
    "Yetzer hara",
    "evil",
    "inclination",
    "yetzer",
    "good",
    "god",
    "evil inclination",
    "yetzer hara",
    "hara",
    "man",
    "person"
  ],
  "findings": [
    "Free will, and the choice between evil and good inclinations",
    "The power within man to overcome sin",
    "Idolatry",
    "Positive role of the evil inclination",
    "Personification of evil",
    "Countering the effects of yetzer hara",
    "See also",
    "References",
    "Notes",
    "Further reading",
    "External links"
  ],
  "relationships": [
    {
      "subject": "Yetzer hara",
      "relationship": "is a",
      "object": "natural aspect of god",
      "sentence": "However, the genesis of concupiscence is original or ancestral sin, whereas the yetzer hara is a natural aspect of God's creation."
    }
  ],
  "timestamp": "2025-04-11T13:35:58.972326"
}