{
  "title": "Eurocurrency",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Eurocurrency",
  "content": "Eurocurrency is currency held on deposit outside its home market, i.e., held in banks located outside of the country which issues the currency.[1] For example, a deposit of US dollars held in a bank in London, would be considered eurocurrency, as the US dollar is deposited outside of its home market.\n\nThe Euro- prefix does not refer exclusively to the \"euro\" currency or the \"eurozone\", as the term predates the creation of the euro. Instead, it can be applied to any combination of deposits in a foreign bank outside of its home market e.g.  a deposit denominated in Japanese yen held in a Swiss bank is a Euroyen deposit.\n\nEurocurrency is used for short-to-medium term financing by banks, multinational corporations, mutual funds, and hedge funds. Eurocurrency is generally seen as an attractive source of global funding due to its ease of convertibility between currencies as well as typically lower regulatory measures compared to sources of funding in domestic markets. Eurocurrency and eurobond markets avoid domestic interest rate regulations, reserve requirements and other barriers to the free flow of capital.[citation needed]\n\nThe relevance of eurocurrency deposits has been disputed ever since its inception in the 1950s by notable economists including Ronald McKinnon,[2] yet it remains a prevalent aspect of the global financial system.\n\nThe emergence of Eurocurrency is closely tied to the origins of the Eurodollar as it was the first type of Eurocurrency. Eurodollars began from large quantities of US dollar-denominated deposits being held in European, namely London, banks during the 1950s.[2][3][4] Over several decades, economists have produced several explanations of how eurocurrency came about, why it occurred in London, and how London managed to maintain a competitive advantage in the market as eurocurrency expanded globally.[3] Environmental and political factors commonly underpin most theories, influencing the decisions of nations during this period known as the Bretton Woods Era.[2][5]\n\nThe Bretton Woods Era spanned from 1944 to 1973 and saw national policymakers, notably those of Britain and the US, agree to a fixed or pegged exchange rate system.[6] Under this system, national currencies were \"pegged\" against the US dollar which itself was now convertible into gold.[6] This was done to promote freer world trade in response to a sharp decline in imports and exports after the 1930s financial crises and World War 2 (WW2). As a result, national governments had raised their barriers to trade in an attempt to boost their domestic performance, causing major declines in world trade.[7]\n\nBy mid-1955, US and foreign businesses and nations were regularly using Eurodollars to hold US-dollar balances or obtain US-dollar denominated loans outside of the US.[2] The eurocurrency market was birthed organically from the rise of the Eurodollar.[2][3] Ultimately, there was multiple causes for the rise of the Eurodollar which lead to the creation of Eurocurrency.\n\nFirstly, large holdings of US dollars entered Europe shortly after WW2. This was a result of the fixed exchange rate system that lead to more countries using US dollars for trade, as well as increased imports into the US itself from Europe. Moreover, the US provided economic aid to European nations after WW2 in the form of damage assistance under the US governments' Marshall Plan. Secondly, after WW2 communist governments including the Soviet Union and China transferred their holdings held in the US over to European banks.[3] This is believed to have been done for two primary reasons; (1) over fears that US authorities will seize their assets, and (2) to accumulated goodwill with Eurobanks as a strategy to nurture a future source of loans and funding. Thirdly, the 1957 sterling crises forced the UK's strongest movement toward alignment with the Bretton Woods plan.[3] Here, the Bank of England banned sterling-financed trade for non-sterling countries as a result of a sharp increase in the bank rate to 7%, compelling London-based banks to join the rest of the world and use dollars for trade.[2][3] This alongside the demand for other types of eurocurrencies outside of their home markets lead to the innovation of the eurocurrency market.\n\nThe inception of eurocurrency occurred in London with the introduction of the Eurodollar in 1955.[3] Even after eurocurrency had expanded globally however, London maintained its position as the centre of the Eurodollar market which is still true of today.[3]\n\nEconomists provide disputed explanations for why London was able to gain and maintain this competitive advantage. Ronald McKinnon theorised that it was attributed to London's pre-existing foreign financing expertise retained from Britain's dominant trade history in the 19th Century and servings as the centre of the sterling when it was a major international currency.[2][3] However, criticisms of this theory deemed it \"rather static and deterministic\" and lacking any archival evidence.[3] McKinnon also emphasised the regulatory freedom provided to commercial banks in London by the Bank of England, aligning with recounts of the Treasury questioning whether financial institutions in London had excessive influence on decisions made by the Bank of England.[2][3] Nonetheless, both the Treasury and Bank of England agreed that London should remain an important financial centre even after the sterling was no longer a major international currency.[3] Therefore, imposing restrictive regulations would have been counterintuitive, leading to London's permissive environment.[3] In reality, eurocurrency market centres in general enjoyed freedom from supply side restrictions such as reserve requirements and interest rate ceilings which allowed them, in particular London, to gain a competitive advantage by providing high and low rates of interest according to the class of the borrower and lender. Additionally, London's competitive advantage was enhanced by tight restrictions throughout the rest of Europe due to possible risks of \"hot money\", increased bank liquidity, and potential reliance on reserves in the case of bank runs.[3]\n\nThe four main Eurocurrencies are the US dollar, the Euro, the sterling and the Japanese yen; the currencies of the major economies of the world.[citation needed]\n\nA eurocurrency market is the money market for any currency deposited outside of its home market.[8] The key participants in these markets includes banks, multinational corporations, mutual funds, and hedge funds. Eurocurrency markets are generally chosen as a source of finance over domestic banks for their ability to offer lower interest rates of borrowers and higher interest rates for lenders situationally. This because eurocurrency market have less regulatory requirements, tax laws, and typically no interest caps. Nonetheless, there are higher risks, particularly when banks experience periods of poor solvency which can lead to a run on the banks.\n\nThere are several eurocurrency markets, with the two most widely used being the Eurodollar market and the Euroyen market. There are also various smaller eurocurrency markets including the Euroeuro market and the Europound market.[9][10]\n\nThe Eurodollar market involves holdings of US dollars outside of the jurisdiction of the Federal Reserve System, the US central bank.[11] These holdings may arise via two primary ways.[12] Firstly, from purchases of goods and services made in US dollars to suppliers who maintain European bank accounts - these suppliers may be European or non-European.[12] Secondly, Eurodollar deposits arise from investments of US dollars in European banks, generally for more favourable returns on interest.[12]\n\nToday, the Eurodollar market is the largest source of global funding for businesses and nations, estimated to be financing over 90% of international trade deals.[5] It is the most widely used eurocurrency. Accounting for approximately 75% of all eurocurrency accounts held worldwide.[5] This prevalence is often attributed to economic and political factors. Firstly, the economic power of the US, particularly its influential position in the world economy and steady deterioration of the other currencies during the inception of Eurocurrency in the 1950s.[5] Secondly, the lack of interest caps and limited regulation in the Eurodollar market enables favourable rates of interest for both lenders and borrowers.[3][5]\n\nThe Euroyen market involves deposits of yen in banks outside the jurisdiction of the Bank of Japan, the Japanese central bank.[13] The market emerged in 1984, at the beginning of the Japanese asset price bubble that saw Japan pursue financial liberalisation and internalisation. During the 1990s, interest rates in Japan experienced substantial declines, making the relatively high rates of interest paid by Euroyen accounts attractive investments. Today Euroyen deposits are used by non-Japanese companies to efficiently obtain investments from Japanese investors. Euroyen bonds allow foreign companies to avoid the regulations enforced by the Bank of Japan (BoJ) and in bond registration with the Tokyo Stock Exchange (TSE).\n\nThe Euroeuro market involves deposits of euros outside of the jurisdiction of the European Central Bank.[9]\n\nThe Europound market involves sterling deposits outside of the jurisdiction of the Bank of England.[10]\n\nThe concept of eurocurrency can have two implications.[14]\n\nFirstly, it can be the accumulation of all the currencies and banking facilities worldwide that are participating of the offshore banking network.[14] This is not limited to the four eurocurrencies (US dollar, euro, yen, sterling) or the home markets of those eurocurrencies. For example, a bank in Denmark that chooses to keep holdings of Swiss franc in London would also be considered a part of the eurocurrency network.\n\nSecondly, it can refer to the sum of all the technologies i.e. data processing and communication lines,[14] used to enable stakeholders around the world to interact and participate in the eurocurrency market.[15] Eurocurrency marks function within the global financial system with market centres spread across the global. Therefore, powerful financial technologies and information systems are required to connect market centres to enable communications and transactions to occur.[15] For example, technologies such as high-speed communication lines link market centres enabling fast eurobanking transactions, and also giving rise to the overnight market.[2][15]\n\nIn the 1970s, regulating the eurocurrency market became a key priority for policymakers globally. This was because the growth of Eurodollars forced domestic banks to participate in offshore banking in order to stay competitive against rapidly growing foreign banks.[15] Offshore banking allowed domestic banks to avoid the rising costs and restrictions resulting from national banking regulations.[15] National governments struggled to monitor money supply and accurately predict economic outcomes in the global financial system due to unregulated and regulated financial markets existing in parallel.[15] Since this realisation, governments have attempted various regulatory measures such as imposing reserve requirements, ceilings on interest rates and extending supervisory authority into the unregulated eurocurrency market.[3] Overall, critics today maintain that regulation in offshore banking as a whole remains largely insufficient.[14][16]\n\nReserve requirements refer to a particular predetermined amount of cash which banks must have on-hand for the purpose of meeting liabilities in the case of sudden withdrawals. In the case of eurocurrency, this is a crucial regulatory measure with the high risk of bank runs. Typically, the central banks of individual nations enforce reserve requirements for its commercial banks. For example, the US central bank - The Federal Reserve, requires commercial banks to retain money in reserves against their commitments to depositors under the Monetary Control Act 1980.[15] However, little progress has been made in imposing reserve requirements on eurocurrency deposits as nations continually fail to reach consensus over eurocurrency reserve amounts.[15] Thus, it is the extension of national reserve requirements to the eurocurrency markets that has some level of mitigation between eurocurrency deposits and domestic bank balances.[15]\n\nA key attraction for eurocurrency deposits are favourable interest rates for both lenders and borrowers relative to domestic interest rates.[15] However, studies including the Granger causality test show that the “stickiness” of eurocurrency interest rates only exists with respect to the Eurodollar market.[1][17] Interest rates for other eurocurrencies often move in parallel with corresponding domestic interest rates, seen as a control used by national governments to limit international capital flows.[17]\n\nA eurobank is a financial institution anywhere in the world which accepts deposits or makes loans in any foreign currency.\n\nEurocredit is a loan whose denominated currency is not the lending bank's national currency. A eurocredit loan would be made by a U.S. bank to a lender requiring a denominated currency which differs from the bank's local currency (USD) for specific reasons, most likely some sort of business operations or trade requirements. Despite the inclusion of the word \"euro,\" a eurocredit is not immediately derived from the euro.\n\nEurocredits are short- to medium-term loans of Eurocurrency extended by Eurobanks to corporations, sovereign governments, nonprime banks, or international organizations. The loans are denominated in currencies other than the home currency of the Eurobank. Because these loans are frequently too large for a single bank to handle, Eurobanks will band together to form a bank lending syndicate to share the risk.\nThe credit risk on these loans is greater than on loans to other banks in the interbank market. Thus, the interest rate on Eurocredits must compensate the bank, or banking syndicate, for the added credit risk. On Eurocredits originating in London the base lending rate is LIBOR. The lending rate on these credits is stated as LIBOR +X percent, where X is the lending margin charged depending upon the creditworthiness of the borrower. Additionally, rollover pricing was created on Eurocredits so that Eurobanks do not end up paying more on Eurocurrency time deposits than they earn from the loans. Thus, a Eurocredit may be viewed as a series of short-term loans, where at the end of each time period (generally three or six months), the loan is rolled over and the base lending rate is repriced to current LIBOR over the next time interval of the loan.\n",
  "concepts": [
    "Eurocurrency",
    "eurocurrency",
    "market",
    "bank",
    "banks",
    "london",
    "deposits",
    "rates",
    "currency",
    "outside",
    "eurodollar"
  ],
  "findings": [
    "History",
    "Background Information",
    "Drivers of Eurocurrency in the 1950s",
    "Competitive Advantage of London",
    "Currencies",
    "Eurocurrency Markets",
    "Eurocurrency Network",
    "Regulations and Domestic Policy",
    "Regulatory History",
    "Eurocurrency and Interest Rates",
    "Eurobanks",
    "Eurocredits",
    "See also",
    "References",
    "Further reading"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T15:48:23.019926"
}