{
  "title": "Beaupre (surname)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Beaupre_(surname)",
  "content": "Beaupre (originally Beaupré) (/boʊˈpreɪ/ boh-PRAY) is a surname found mostly in Canada, the United States and parts of England.\n\nBeaupré was a prominent family in Norfolk, who built Beaupré Hall, Outwell. Christian, daughter and coheir of Thomas de St Omer, married John, the great-great-grandson of one Synulph, who lived during the reign of King Henry II, and had issue: John dicte quoque Beaupré,[1] who lived during the reign of King Edward II, and married Katherine, daughter of Osbert Mountfort. Their son Thomas Beaupré would be raised by his grandmother Christian (last St Omer in this line) after the death of both of his parents. Thomas was knighted by King Edward III, and married Joan Holbeache, and died during the reign of King Richard II.[2]\n\nNicholas Beaupré married Margaret Fotheringhay,[3] one of the three daughters and heiresses of Thomas Fotheringhay (son of Gerrard Fotheringhay) by his wife Elizabeth Doreward, sister and heiress of John Doreward and daughter of William Doreward of Bocking, Essex. One of Margaret's sisters was Christiana Fotheringhay, wife of John de Vere, 15th Earl of Oxford (1482–1540), KG, Lord Great Chamberlain.[4] The other was Helen or Ellen Fotheringhay, who married Henry Thursby[5] of Ashwicken and Burg's Hall in Hillington (1476–1506), the nephew of Thomas Thursby (d.1510), merchant, thrice Mayor of King's Lynn and the founder and benefactor of Thoresby College.[6]\n\nThe son of Nicholas Beaupré and Margaret Fotheringhay, Edmund Beaupré,[7] married Margaret, the daughter of Sir John Wiseman, servant to the 15th Earl of Oxford. His second wife, Katherine Wynter (widow of John Wynter of Great Yarmouth)[8] was the daughter of Phillip Bedingfeld[7] of Ditchingham Hall. After Edmund Beaupré's death in 1567 leaving no male heirs, the hall succeeded to Sir Robert Bell, by virtue of marriage to Edmund's daughter Dorothy in 1559; whereby his Beaupré line became extinct.[9] In 1529, together with his cousin Thomas Thursby of Hillington, Norfolk, as heirs of John Doreward, of Great Yeldham, Essex, Edmund Beaupré released the manor of Coggeshall to Richard Sowthwell, esquire.[10] This was the same manor that the same Richard Southwell would later give King Henry VIII as part of his fine for the murder of Sir William Pennington .[11] In 1541 Edmund Beaupré got the wardship and marriage of his relative Edward Thursby of Doreward's Hall in Bocking, Essex.[12] He married him to the sister of his second wife, Mary Bedingfeild.[13]\n",
  "concepts": [
    "Beaupre (surname)",
    "beaupré",
    "married",
    "john",
    "thomas",
    "king",
    "fotheringhay",
    "daughter",
    "hall",
    "great",
    "edmund"
  ],
  "findings": [
    "In England and Wales",
    "Notable people",
    "References",
    "Sources"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:26:23.806892"
}