{
  "title": "Fraser Heights Secondary School",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Fraser_Heights_Secondary_School",
  "content": "Fraser Heights Secondary is a public high school in the Fraser Heights neighbourhood situated in Surrey, British Columbia and is part of School District 36 Surrey.\n\nThe school is known for its excellence in provincial badminton and volleyball; academics, particularly in the sciences; and extracurricular opportunities.\n\nFraser Heights has an average class size of 28 students.\n\nA $14 million expansion wing with sixteen new classrooms and an open area for community use opened in the spring of 2014.[1]\n\nFraser Heights Secondary offers a wide variety of academic, athletic, and fine arts programs that have gained high acclaim across the Lower Mainland.\n\nFraser Heights is a branch school to the late French immersion programs offered at Fraser Wood Elementary and Erma Stephenson Elementary.\n\nThe Fraser Heights senior badminton team captured the school’s first provincial AAA title by winning the 2012 provincial championships in competition with private school powerhouses Vancouver College and Little Flower Academy. The senior badminton team won the provincial championships again in 2015, 2016, 2017, 2018, 2019, and 2020. The volleyball program has also grown to acclaim in past years, with a combined fourteen Surrey championships and three Fraser Valley championships. It is consistently ranked in the top 3 Senior Boys' AAA provincial rankings.\n\nOne of Fraser Heights's academic programs is a joint venture with Simon Fraser University called Science Academy. This is an all-year course extending over a period of two years, from grade 11 to grade 12. The course combines Pre-Calc 12, AP Calculus BC, Chemistry 11 and 12, Physics 11 and 12, AP Physics I and II, and a choice between Chemistry and Computer Science at Simon Fraser University. Many of the Science Academy students go on to study at top post secondary schools internationally including Harvard, Yale, Cornell, UC Berkeley, Penn State, Duke, Johns Hopkins, U of California, U of Washington, Carnegie Mellon, UofT, UBC, Waterloo, KAIST and the University of Taiwan. Fraser Heights also offers a variety of advanced placement courses, including honours courses in math, science, and liberal arts.  \n\nFraser Heights also offers many highly acclaimed clubs, like the debate team. Members of the debate team at Fraser Heights Secondary are heading to the Senior Nationals Tournament in 2022, following an impressive fourth-place showing in the senior category at the provincial debates.[2] While debate tournaments are predominantly made up of teams from private schools, Fraser Heights Secondary has a long history with debate and tries to offer opportunities for students who can't afford private training.    \n\n49°11′52″N 122°46′38″W﻿ / ﻿49.1979°N 122.7772°W﻿ / 49.1979; -122.7772\n",
  "concepts": [
    "Fraser Heights Secondary School",
    "fraser",
    "heights",
    "fraser heights",
    "school",
    "provincial",
    "senior",
    "secondary",
    "team",
    "science",
    "heights secondary"
  ],
  "findings": [
    "Programs",
    "Notable alumni",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:09:29.314579"
}