{
  "title": "Park Place Historic District (Brooklyn)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Park_Place_Historic_District_(Brooklyn)",
  "content": "40°40′27″N 73°57′21″W﻿ / ﻿40.674119°N 73.955789°W﻿ / 40.674119; -73.955789\n\nThe Park Place Historic District is a small historic district located on Park Place between Bedford and Franklin Avenues in the Crown Heights neighborhood of Brooklyn, New York City.  It consists of 13 row houses from #651 to the east to #675 to the west, which were built in 1899-90 and designed by J. Mason Kirby in a combination of the Queen Anne and Romanesque Revival styles.\n\nKirby, a former Philadelphian who had previous designed Lucy the Elephant in Margate, New Jersey and a 122-foot-high elephant in Coney Island, which was destroyed by fire in 1896, designed the row houses on Park Place for Frederick W. and Walter S. Hammett, two brothers from Philadelphia; the land had previously been partially owned by their father, Barnabas Hammett, a Pennsylvania coal industry pioneer.[1]\n\nAlthough all the houses were originally single-family residences, during the Depression many owners took in boarders, and by the beginning of the 1960s some of the houses had been converted into multiple-family dwellings.[1]\n\nThe New York City Landmarks Preservation Commission designated the row a historic district on June 26, 2012.  According to the designation report,\n\nThe houses are of three types, arranged in a symmetrical configuration, and feature brick facades with rough-faced brownstone trim. Six of the houses have flat roofs with elaborate cornices, while the others have pitched roofs pierced by triangular and round, Jacobean style gables. Imbuing the row with a picturesque, varying roofline, Kirby united the houses with corbelled brick colonettes decorated with sunflower plaques. The houses feature large round-arch-headed openings that are characteristic of the Romanesque Revival style, as well as richly decorated and textured facades featuring terra-cotta sills decorated with rosettes, corbelled brick sills with sawtooth and beaded moldings and scalloped edges, triangular panels filled with terra-cotta strapwork, and patterned bricks ornamented with projecting knobs that give the row a romantic quality typical of the Queen Anne style.[1]\nNotes\n\nThis article about a location in Brooklyn, New York is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Park Place Historic District (Brooklyn)",
    "houses",
    "row",
    "new",
    "40",
    "york",
    "style",
    "place",
    "park place",
    "park",
    "new york"
  ],
  "findings": [
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:55:20.330868"
}