{
  "title": "Tímea Papp",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Tímea_Papp",
  "content": "Tímea Papp (born in Kaposvár) is a Hungarian dancer and choreographer who can be recognized for her work in the Hungarian Film and Television Industry. Apart from graduating from both the Rotterdam Dance Academy and the Hungarian Dance Academy she participated in dance courses all around the world. Thanks to her knowledge and experience in many genres of dance from ballet through broadway and jazz all the way to contemporary dance she contributed to the success of award-winning feature films, theatrical productions like Chicago (musical), television shows such as Britain's Got Talent, America's Got Talent, Eurovision (Moscow, 2009 and Düsseldorf, 2011)  and Fake Off in addition to advertisements and other creative projects worldwide. Since 2004 she has been working on developing a special technique where she combines dancing with videomapping projections to create an interactive choreography supplemented by visual elements. From 2009 using videomapping technique has been a kind of \"trademark\" in her work.  She is currently the artistic director and choreographer of the dance team called Freelusion.[1]\n\nTímea Papp was born in Kaposvár, Hungary. She was raised in a family with three children, she has an older and a younger brother. Both her brothers grew up to be entrepreneurs; her younger brother became the co-founder of Freelusion. Her dad was a drummer who gave up being a professional musician for his family. Nevertheless, he never gave up creating rhythm with any object he could find around himself. Tímea's mother was an amateur dancer and a huge dance enthusiast her whole life. Tímea was infected with rhythm, music, and dancing from a very early age thanks to her parents. This impact was so great that she moved to Pécs in her teenage years so she could start her professional dancing training in the High School of Arts.\n\nAs mentioned earlier, Tímea Papp growing up has been surrounded by inspiration which drew her towards dancing. Learning Latin dances and ballet in her childhood, she was fascinated by street dances in the early 80's.  Beside the dancing she spent 4 years studying  kung fu.  Her body awareness in space became very important to her. Rudolf von Laban movement theoretic's space harmony theory has been a great influence on her work. All her research in movement, space and body awareness and her education and experience as a dancer lead to creating her own project: \"Spacerider\", which can be interpreted as her own avatar in her high-tech interactive choreographies.\n\n[2]\n\n[2]\n\n[2][1][3][4]\n\n[2]\n",
  "concepts": [
    "Tímea Papp"
  ],
  "findings": [
    "Early life",
    "Field of Scientific Research, Mission",
    "Education and training",
    "Work experience as a dance teacher",
    "Choreographer",
    "Dancer / performer",
    "Awards",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:23:20.936451"
}