{
  "title": "Jody Thompson",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jody_Thompson",
  "content": "Jody Rae Thompson is a Canadian actress, screenwriter and filmmaker working in film and television.\n\nShe is widely known for her regularly recurring character Devon Moore on the USA network's television series The 4400, but is also recognized as the warrior queen Azura in the television series Flash Gordon and in other recurring television roles including Blade: The Series, Terminal City, and Cold Squad[1] and television appearances, including roles on Freedom, Fringe, Andromeda, Stargate, Smallville and Supernatural.\n\nShe has acted in leading and starring roles in feature films and MOW's like Perfect Little Angels, Fear of Flying, also Mission to Mars, Shanghai Noon, 2012 among others. She has co-starred with Eric McCormack in X-Files producer Bob Goodwin's independent film Alien Trespass and played David Arquette's wife in the made-for-television movie, Happy Face Killer.\n\nGreat Bear (doc 22 min) A Coastal First Nations led collaboration with researchers from leading academic universities provides insights into the importance of bears and other keystone species to the ecosystems of the Great Bear Rainforest. The documentary was coproduced with the Heiltsuk and Kitasoo/Xai'xais Nations.\n\nSpirit Bear (doc 20 min) Discover how the Spirit Bear Lodge - operated by the Kitasoo/Xai'Xai Nation - is revitalizing their community and demonstrating how sustainable practices can succeed economically, environmentally and culturally.\n\nHaida Gwaii: Restoring the Balance (doc 20 min) Building a model for a sustainable, conservation-based economy. In partnership with Haida Nation.\n\nMontaña de Luz, (doc 45 min), Noonday Films. It is an uplifting story about a Honduran orphanage that cares for children living with HIV. The film premiered at the Rhode Island International Film Festival and was Winner of the Heartland Film Festival's Crystal Heart Award (an award which \"honors filmmakers whose work explores the human journey by artistically expressing hope and respect for the positive values of life\").[8]\nMy Dear Children (doc 3 min) A dying woman's final letter to her children. Platinum Winner AVA International Digital Communication Awards.\n\nWill of the Wisp, (experimental 8 min) underscoring a young woman's struggle with her history of sexual abuse in a society that places high value on sexual attractiveness. Received a special screening at the US Women in Psychology Conference, a Leo Award, Special Jury Prize at the Portland International Short-Short Film Festival and the Legacy Award, Women in Film Festival Vancouver. Funded by The Canada Council for the Arts. Thompson describes it as, \"a silent film that speaks through a series of post-structuralist and surrealist signifiers in conversation.\"\n\nAlyssa (doc series 3 x 5 min) In partnership with Dalhousie University. A young woman coming to terms with her diagnosis and undergoing chemo, thereby forfeiting her ability to have children. Acknowledged as an outstanding initiative by the Canadian Association of Psychosocial Oncology. It stars Rhonda Dent and Gabrielle Rose of The Sweet Hereafter.\n\nJody has written multiple feature and television scripts. She is an Academy Nicholl Fellowship Semifinalist and a Page Award winner. \n\nThompson was born in Vancouver, British Columbia, to mother Grace Diane, and father, Ray Thompson, the lead singer of Canadian garage rock band The Wiggy Symphony. She has been married to Bruce Marchfelder since 2001. The couple regularly works together writing and producing feature films and broadcast documentaries.[2]\n",
  "concepts": [
    "Jody Thompson",
    "film",
    "television",
    "min",
    "doc",
    "series",
    "award",
    "thompson",
    "film festival",
    "festival",
    "children"
  ],
  "findings": [
    "Acting career",
    "Television",
    "Film",
    "Producing career",
    "Screenwriting career",
    "Personal life",
    "Filmography",
    "Film",
    "Television",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T15:40:25.929979"
}