{
  "title": "Smith-Clayton Forge Ltd.",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Smith-Clayton_Forge_Ltd.",
  "content": "Smith-Clayton Forge Ltd were a company specialising in drop forgings that was established in Lincoln. In 1966 Smith-Clayton Forge became a subsidiary of GKN and later was absorbed into British Steel. It then became part of  United Engineering Forgings (UEF) which in 2000 and 2001 was sold on to Wyman Gordon and Bifrangi, who now operate on the Smith-Clayton Forge site.\n\nIn 1929 Smith's Stamping Works of Coventry had purchased the Clayton Forge which was adjacent to the Abbey Works of Clayton & Shuttleworth on Spa Road in Lincoln. The previously very successful engineering firm of Clayton & Shuttleworth had become insolvent. A new company, Smith-Clayton Forge Ltd., was incorporated on 18 December 1929.  The forge specialised in Drop forging with drop hammers.[1]   \nIn 1935 the Abbey Works was also purchased and the forge underwent extensive modernisation. About this time the name of works was changed from Abbey Works to Tower Works. The name was possibly taken from the Tower House, which stood at the junction of Monk's Road with Greetwell Road. Amongst the products manufactured were the crankshafts of the Rolls-Royce. Kestrel and Merlin engines. The Kestrel engines were used in the Hawker Fury and Hawker Hart and the Merlin in the Hawker Hurricane and the Supermarine Spitfire.\n\nLeading up to the Second World War and during the war the factory was further modernised. In 1938 an Erie 8,000-lb steam hammer was installed which made it possible to produce motor car crankshafts more rapidly and also aircraft components including the crankshafts for the Armstrong Siddeley Cheetah engines which were used extensively in British training aircraft. Airscrews and crankshafts continued to be made for Hurricanes and Spitfires and also for the Rolls-Royce Vulture engines, and also many of the parts of the Napier Sabre engines.[2] As the Abbey Works was unaffected by Luftwaffe bombing during the war, it was able to keep up a very high level of aircraft engine and other aircraft casting production during the war.\n\nAfter the war profits, largely resulting export, from motor vehicle and aircraft parts, enabled the company to purchase the extensive  equipment that the UK Government had installed for wartime defence production and a healthy profit in the company's trading accounts was reported in 1948.[3] In 1950 Mr H M H Fox, the works superintendent spent six weeks in the USA studying forging techniques and this resulted in an immediate increase in productivity. He reported that mechanical handling of materials; improved \"housekeeping” and smoothing out the flow materials in the factory; and improvements to furnace equipment and that the Forge  have already increased their output 10 per cent by introducing some of the improvements suggested in the report on the American drop forging industry published by the Anglo-American Council on Productivity. We have reorganised our transport system throughout the works and the method of feeding machines with billets (short bars) and also the method of conveying finished work away from the forging units.  One of the changes is the introduction of power-driven conveyors to carry materials directly from one forging unit to another and the first one has now been  installed and working at the Smith-Clayton forge. [4]\n\nIn 1966  Smith-Clayton Forge became a subsidiary of GKN who then claimed to be  the Largest Manufacturers of forged and Cast Components for the Motor Industry[5] Following the creation of British Steel in 1967 and it became part of the British Steel Special Steels Division, and in 1995 GKN Holdings was sold entirely to British Steel and the Company became part of the British Steels Forgings Group. In  May 2000 United Engineering Forgings (UEF)aerospace, which occupied the site, was purchased by Wyman Gordon, an American company. Wyman Gordon was a subsidiary of the Precision Castparts of Portland Oregon and the Lincoln operation became known as \"Wyman Gordon Lincoln\". At the time the UEF division was manufacturing forged engine discs, engine shafts, and airframe and landing-gear components, primarily for Rolls-Royce.[6]\n\nIn November 2001 the Lincoln site, along with UEF Automotive – Sheffield, were purchased by an Italian Company, who formed Bifrangi UK Ltd.[7] Bifrangi then sub-let part of the site to Wyman Gordon. In 2012 Bifrangi embarked on a major £60 million redevelopment of the Tower works site. The firm has built a new 7,000 square metres press house to accommodate a 32,000 tonne percussion screw press, which is the biggest forging press in the world, unique in its type, that allows closed die forging up to 1000-kilogram and 3-metre pieces. This facilitates the forging of large micro alloy steel-based parts in addition to opening up new markets forging Aluminium, super alloys and more exotic materials. This includes forging crankshafts, shaped shafts and wheel parts efficiently, reducing time and materials.[8]\n\nWyman Gordon manufactures  products for  the aerospace and energy markets. It has two counterblow hammers.  The  largest counterblow hammer (900kJ) in Europe, is at the heart of the operation,  capable of manufacturing hot die forging of Aerospace, Powergen, Oil & Gas and Nuclear components (asymmetric forgings, discs, shafts and valve bodies), forging at temperatures of up to 1340 °C. Smaller components are manufactured on a DG40 counterblow hammer, originally installed by Smith-Clayton Forge in 1964. The counterblow hammers are fully computer controlled to ensure repeatability of the process. The hammers are supported by a Zdas 630 controlled pull down press which is utilised in the manufacture of pre-forms for asymmetric structural parts and long aero engine shafts.[9] The Lincoln plant is linked to other Wymen-Gordon plants at Livinston in Scotland and Plzeň in the Czech Republic. Wyman-Gordon is a leading  forging company for the world aerospace and energy markets from high grade titanium and nickel based alloys. These  are used for jet engines, including fan discs, compressor disks, turbine discs, shafts and also titanium and steel forgings for airframes.\n\nMuir A (1958) 75 Years: A Record of Progress, Smiths Stamping Works, Coventry and Smith Clayton Forge, Lincoln. Ribble Works, Coventry.\n",
  "concepts": [
    "Smith-Clayton Forge Ltd."
  ],
  "findings": [
    "Development of the Company",
    "Wartime Production",
    "Post War Years",
    "Later History",
    "Bifrangi",
    "Wyman Gordon",
    "References",
    "External links",
    "Literature"
  ],
  "timestamp": "2025-04-11T10:08:32.133057"
}