{
  "title": "Manuel Rivas Pastor",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Manuel_Rivas_Pastor",
  "content": "Manuel Rivas Pastor (born 13 July 1960) is a Spanish chess Grandmaster (1987), four times Spanish Chess Championship winner (1978, 1979, 1981, 1991).\n\nFrom the late 1970s to the early 1990s, Manuel Rivas Pastor was one of Spain's leading chess players. He has competed many times in the finals of Spanish Chess Championships, where winning four gold medals ([1978, 1979, 1981, 1991). His first international success was in 1977, when he sharing the 7th place in the U20 World Junior Chess Championships in Innsbruck. Manuel Rivas Pastor achieved another significant result at the turn of 1979 and 1980 in Groningen, where he shared the 4th place (with Zurab Azmaiparashvili and James Plaskett) in the European Junior Chess Championship in the same age category.\n\nManuel Rivas Pastor has achieved several successes in international chess tournaments, including in Medina del Campo (1980, 2nd place), Torremolinos (1983, 1st place), Isla de Santa Catalina (1987, shared 1st place), Salamanca (1989, shared 1st place), Albacete (1989, shared 1st place), Lorca (2005, 1st place), Malaga Open (2006, 2nd place), Almería (2006, 2nd place; 2007, 1st place), Ourense (2008, shared 2nd place), San Cristóbal de La Laguna (2008, shared 2nd place), Seville (2009, 1st place) and in Paul Keres Memorial Tournament (Vancouver, 2010, shared 1st place).\n\nManuel Rivas Pastor played for Spain in the Chess Olympiads:[1]\n\nManuel Rivas Pastor played for Spain in the European Team Chess Championships:[2]\n\nIn 1980, he was awarded the FIDE International Master (IM) title and received the FIDE Grandmaster (GM) title seven years later.\n\nThis biographical article relating to a Spanish chess figure is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Manuel Rivas Pastor"
  ],
  "findings": [
    "Biography",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:48:55.780142"
}