{
  "title": "1832 Naval Air Squadron",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/1832_Naval_Air_Squadron",
  "content": "1832 Naval Air Squadron (1832 NAS) was a Fleet Air Arm (FAA) naval air squadron of the United Kingdom’s Royal Navy (RN). Established in August 1943, at HMS Gannet, RNAS Eglinton, Northern Ireland, with a complement of ten Grumman Wildcat Mk V fighter aircraft, the squadron initially relocated to RAF Speke, near Liverpool, in September. Its primary mission was to develop four fighter flights that could be integrated into TBR squadrons operating from escort carriers. The squadron subsequently moved to HMS Blackcap, RNAS Stretton, in Cheshire, in December and returned to RNAS Eglinton in February 1944, where it integrated the remaining aircraft and personnel from 878 Naval Air Squadron before officially disbanding in June 1944.\n\nIt was re-established as a fighter squadron within the Royal Naval Volunteer Reserve Air Branch, subsequently becoming part of the Southern Air Division, from 1947 until its disbandment in 1957. In 1980, it was reconstituted as a Royal Naval Reserve squadron; however, the initial concept quickly became obsolete due to its incompatibility with the requirements of the contemporary Fleet Air Arm.\n\n1832 Naval Air Squadron was established at HMS Gannet, the Royal Naval Air Station at Eglinton, County Londonderry in Northern Ireland, on 15 August 1943. It was organised as a single-seat fighter squadron, led by Lieutenant Commander(A) T. W. Harrington, of the Royal Navy. The squadron's initial fleet consisted of ten Grumman Martlet Mk V fighter aircraft.[2] Beginning in January 1944, the designation was altered to Wildcat to align with the naming conventions of the US Navy. The Mk V served as the Fleet Air Arm's counterpart to the US Navy's FM-1, manufactured by the Eastern Aircraft Division of General Motors Corporation and equipped with a Pratt & Whitney R-1830 Twin Wasp engine.[3]\n\nThe squadron was assigned the responsibility of organising fighter flights, each consisting of four aircraft, to be attached to Torpedo Bomber Reconnaissance (TBR) squadrons operating from escort carriers.[4] Ultimately, ten flights were established. On 20 September, it relocated to RAF Speke, Liverpool, to commence training and the formation of these flights.[2] 'A' Flight was established at RNAS Maydown, County Londonderry, on 6 November 1943. On the 20 of the same month, it boarded the Attacker-class, escort carrier, HMS Fencer, to serve as the fighter component of 842 Naval Air Squadron. Subsequently, on 17 March 1945, they were joined by 'E' Flight.[5] The fighter flights were later integrated into 842 Naval Air Squadron. A trend became apparent as the flights were integrated into the TBR squadrons to which they were affiliated.[6]\n\nOn 9 December 1943, the squadron moved to RNAS Stretton (HMS Blackap), Cheshire, where 'C' Flight was established and subsequently joined 832 Naval Air Squadron. Additionally, 'B' Flight was created on 20 December 1943, and was assigned to 846 Naval Air Squadron to serve aboard the Attacker-class escort carrier, HMS Tracker.[7] On 2 February 1944, 1832 Naval Air Squadron re-established its presence at RNAS Eglinton (HMS Gannet), where it integrated elements of 878 Naval Air Squadron,[6] which was a Grumman Wildcat unit that had been disbanded at that location in late January.[8]\n\nOn the 3 February, the formations of flights ‘D’, ‘E’, ‘F’, and ‘G’ took place. 'D' Flight was designated to join 845 Naval Air Squadron, while 'E' Flight integrated with ‘A’ flight in HMS Fencer on 17 March. 'F' Flight was assigned to 813 Naval Air Squadron, which was operating from the Nairana-class escort carrier, HMS Campania starting 5 April and 'G' flight was attached to 852 Naval Air Squadron for service in the Ruler-class escort carrier, HMS Nabob. 'H', 'I' and 'J' Flights were established on 26 March but remained stationed at RNAS Eglinton. The last flight to be created was ‘L’, which was formed on 13 May 1944 to join ‘B’ Flight associated with 846 Naval Air Squadron in preparation for re-joining HMS Tracker on 3  June.[5]\n\nThe squadron was officially disbanded at RNAS Eglinton on 1 June 1944, with all remaining detached sub-flights integrated into their respective squadrons.[6] In November 1945, there were proposals to re-equip 1832 Naval Air Squadron with fifteen Vought Corsair aircraft as part of the 5th Carrier Air Group, which was to have included 1832 and 1838 Naval Air Squadrons, also with Vought Corsair, along with 852 Naval Air Squadron with Grumman Avenger, utilising a spare Illustrious-class aircraft carrier. However, these plans were ultimately abandoned following V-J Day.[9]\n\n1832 Naval Air Squadron was officially re-established at RNAS Culham (HMS Hornbill), Oxfordshire, on 1 July 1947, functioning as a Royal Naval Volunteer Reserve (RNVR) Fighter squadron, under the command of Lieutenant Commander(A) P. Godfrey, OBE, RNVR.[10]\n\nInitially, the unit was equipped by with four Supermarine Seafire F Mk.III fighter aircraft, which were subsequently replaced by six Supermarine Seafire F Mk.46s and FR Mk.46, along with several F Mk.17, starting in June 1948. By April 1949, Supermarine Seafire F Mk.15 began to take the place of the F Mk.46, and by January 1950, the unit's composition included fourteen Supermarine Seafire F Mk.15 and F Mk.17s. In August 1951, 1832 Naval Air Squadron commenced re-equipping with nine Hawker Sea Fury FB.11 fighter-bomber aircraft.[4]\n\nFlight operations were conducted at RNAS Culham on weekends. Pilots and Observers were mandated to complete fourteen days of continuous training annually, alongside one-hundred hours of non-continuous training (drills), and to serve on squadron duty for twelve weekends. Throughout this period, they were anticipated to accumulate a minimum of seventy-five flying hours and a maximum of one-hundred and twenty-five flying hours.[10]\n\nOn 1 June 1952, the Southern Air Division was established to oversee 1832 Naval Air Squadron along with its two subsidiary’s, 1832A and 1832B Naval Air Squadrons, which were created on 1 October 1952. In April 1953, these squadrons were re-designated as 1836 and 1835 Naval Air Squadrons, respectively.[4]\n\nThe three squadrons utilised their aircraft collectively.[10] In August 1955, 1832 Naval Air Squadron transitioned to eight Supermarine Attacker FB.2 jet aircraft, while the other two squadrons continued to operate the Hawker Sea Fury aircraft. By April 1956, the squadrons returned to a pooled operation, now comprising eight Supermarine Attackers, two de Havilland Sea Vampire T.22 jet trainer aircraft, two Hawker Sea Hawk F.1 jet fighter aircraft, and two Hawker Sea Fury T.20 two-seat trainer aircraft. By the end of that year, the Supermarine Attacker had been phased out, leaving the squadrons with two de Havilland Sea Vampire and thirteen Hawker Sea Hawk jet aircraft.[4]\n\nAs a result of reductions in defense spending, the Royal Naval Volunteer Reserve Air Branch was disbanded in 1957, leading to the dissolution of the organisation and its squadrons on 10 March 1957.[10]\n\nOn 3 April 1980, 1832 Naval Air Squadron was re-established at RNAS Yeovilton (HMS Heron), Somerset, as a Royal Naval Reserve (RNR) unit.[11] It was tasked with providing annual training for former helicopter aircrew officers who had retired from the Royal Navy within the last three years prior to their enlistment in the RNR Air Branch.[4]\n\nNo commanding officers or engineering officers were designated; instead, these were essentially 'virtual' squadrons established to oversee the training of Royal Naval Reserve Air Branch officer aircrew. The training obligations were to be fulfilled using aircraft from the current Royal Navy air squadrons.[11] However, this approach was soon abandoned, and members of the RNR Air Branch began to be assigned to any squadron that operated the aircraft type for which they were certified during their two weeks of annual training.[4]\n\n1832 Naval Air Squadron flew different variants of only one aircraft type during the Second World War, but many different types as a RNVR squadron:[5]\n\nThe battle honours awarded to 1832 Naval Air Squadron are:\n\n1832 Naval Air Squadron operated mostly from a number of naval air stations of the Royal Navy and a Royal Air Force Station in the UK and operated flights from a number of Royal Navy escort carriers:[5]\n\n1943 - 1944\n\nA total of eleven flights were formed, with each flight comprising four aircraft designated for Torpedo Bomber Reconnaissance (TBR) squadrons that operated from escort carriers. The sub-flights that were detached were incorporated into their corresponding squadrons.[6]\n\n'A' Flight:\n\n'B' Flight:\n\n'C' Flight:\n\n'D' Flight:\n\n'E' Flight:\n\n'F' Flight:\n\n'G' Flight:\n\n'H' Flight:\n\n'I' Flight:\n\n'J' Flight:\n\n'L' Flight:\n\n1947 - 1957\n\n1980 - 1982\n\nList of commanding officers of 1832 Naval Air Squadron with date of appointment:[6][10]\n\nNote: Abbreviation (A) signifies Air Branch of the RN or RNVR.[15]\n\n1942 - 1944\n\n1947 - 1957\n",
  "concepts": [
    "1832 Naval Air Squadron",
    "air",
    "squadron",
    "naval",
    "naval air",
    "air squadron",
    "flight",
    "aircraft",
    "squadrons",
    "1832",
    "royal"
  ],
  "findings": [
    "History",
    "Single-seat fighter squadron (1943-1944)",
    "Royal Naval Volunteer Reserve Air Squadron",
    "Fighter squadron (1947-1957)",
    "Royal Naval Reserve Air Squadron",
    "Aircraft flown",
    "Battle honours",
    "Naval air stations",
    "1832A Naval Air Squadron",
    "1832B Naval Air Squadron",
    "Commanding officers",
    "1832A Naval Air Squadron",
    "1832B Naval Air Squadron",
    "References",
    "Citations",
    "Bibliography"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:19.118229"
}