{
  "title": "African literature",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/African_literature",
  "content": "\nAfrican literature  is literature from Africa, either oral (\"orature\") or written in African and Afro-Asiatic languages. Examples of pre-colonial African literature can be traced back to at least the fourth century AD. The best-known is the Kebra Negast, or \"Book of Kings\" from the 14th century AD.[1] Another well-known book is the Garima Gospels, one of the oldest known surviving bibles in the world, written in Ge'ez around 500 AD.[2]\n\nA common theme during the colonial period is the slave narrative, often written in English or French for western audiences. Among the first pieces of African literature to receive significant worldwide critical acclaim was Things Fall Apart, by Chinua Achebe, published in 1958. African literature in the late colonial period increasingly feature themes of liberation and independence.\n\nPost-colonial literature has become increasingly diverse, with some writers returning to their native languages. Common themes include the clash between past and present, tradition and modernity, self and community, as well as politics and development. On the whole, female writers are today far better represented in African literature than they were prior to independence. The internet has also changed the landscape of African literature, leading to the rise of digital reading and publishing platforms such as OkadaBooks.\n\nAs George Joseph notes in his chapter on African Literature[3] in Understanding Contemporary Africa, whereas European views of literature stressed a separation of art and content, African awareness is inclusive and \"literature\" can also simply mean an artistic use of words for the sake of art alone. Traditionally, Africans do not radically separate art from teaching. Rather than write or sing for beauty in itself, African writers, taking their cue from oral literature, use beauty to help communicate important truths and information to society. An object is considered beautiful because of the truths it reveals and the communities it helps to build.[4]\n\nOral literature (or orature, the term coined by Ugandan scholar Pio Zirimu[5]) may be in prose or verse. The prose is often mythological or historical and often includes tales of the trickster character. Storytellers in Africa sometimes use call-and-response techniques to tell their stories. Poetry describes a narrative poem based upon a short and a ribald anecdote and is often sung, through: narrative epic, occupational verse, ritual verse, praise poems of rulers and other prominent people. Praise singers, bards sometimes known as \"griots\", tell their stories with music.[6] Also recited, often sung, are love songs, work songs, children's songs, along with epigrams, proverbs and riddles. These oral traditions exist in many languages including Fula, Swahili, Hausa, and Wolof.[7]\n\nIn Algeria, oral poetry was an important part of Berber traditions when the majority of the population was illiterate. These poems, called Isefra, were used for aspects of both religious and secular life. The religious poems included devotions, prophetic stories, and poems honoring saints. The secular poetry could be about celebrations like births and weddings, or accounts of heroic warriors.[8] As another example, in Mali, oral literature or folktales continue to be broadcast on the radio in the native language Booma.[9]\n\nExamples of pre-colonial African literature are numerous. In Ethiopia, there is a substantial literature written in Ge'ez going back at least to the fourth century AD; the best-known work in this tradition is the Kebra Negast, or \"Book of Kings.\" One popular form of traditional African folktale is the \"trickster\" story, in which a small animal uses its wits to survive encounters with larger creatures. Examples of animal tricksters include Anansi, a spider in the folklore of the Ashanti people of Ghana; Ijàpá, a tortoise in Yoruba folklore of Nigeria; and Sungura, a hare found in central and East African folklore.[10] Other works in written form are abundant, namely in North Africa, the Sahel regions of west Africa and on the Swahili coast. From Timbuktu alone, there are an estimated 300,000 or more manuscripts tucked away in various libraries and private collections,[11] mostly written in Arabic but some in the native languages (namely Fula and Songhai).[12] Many were written at the famous University of Timbuktu. The material covers a wide array of topics, including astronomy, poetry, law, history, faith, politics, and philosophy.[13] Swahili literature, similarly, draws inspiration from Islamic teachings but developed under indigenous circumstances, one of the most renowned and earliest pieces of Swahili literature being Utendi wa Tambuka or \"The Story of Tambuka\" (dated 1728).\n\nAs for the Maghreb, North Africans such as Ibn Khaldun attained great distinction within Arabic literature. Medieval North Africa boasted universities such as those of Fes and Cairo, with copious amounts of literature to supplement them.\n\nThe African works best known in the West from the periods of colonization and the slave trade are primarily slave narratives, such as Olaudah Equiano's The Interesting Narrative of the Life of Olaudah Equiano (1789).\n\nIn the colonial period, Africans exposed to Western languages began to write in those tongues. In 1911, Joseph Ephraim Casely Hayford (also known as Ekra-Agiman) of the Gold Coast (now Ghana) published what is probably the first African novel written in English, Ethiopia Unbound: Studies in Race Emancipation.[14] Although the work moves between fiction and political advocacy, its publication and positive reviews in the Western press mark a watershed moment in African literature.\n\nDuring this period, African plays written in English began to emerge. Herbert Isaac Ernest Dhlomo of South Africa published the first English-language African play, The Girl Who Killed to Save: Nongqawuse the Liberator[15] in 1935. In 1962, Ngũgĩ wa Thiong'o of Kenya wrote the first East African drama, The Black Hermit, a cautionary tale about \"tribalism\" (discrimination between African tribes).\n\nAmong the first pieces of African literature to receive significant worldwide critical acclaim was the novel Things Fall Apart, by Chinua Achebe. Published in 1958, late in the colonial era, Things Fall Apart analysed the effect of colonialism on traditional African society.[16]\n\nAfrican literature in the late colonial period (between the end of World War I and independence) increasingly showed themes of liberation, independence, and (among Africans in francophone territories) négritude. One of the leaders of the négritude movement, the poet and eventual president of Senegal, Léopold Sédar Senghor, published in 1948 the first anthology of French-language poetry written by Africans, Anthologie de la nouvelle poésie nègre et malgache de langue française (Anthology of the New Black and Malagasy Poetry in the French Language), featuring a preface by the French existentialist writer Jean-Paul Sartre.[17]\n\nFor many writers this emphasis was not restricted to their publishing. Many, indeed, suffered deeply and directly: censured for casting aside their artistic responsibilities in order to participate actively in warfare, Christopher Okigbo was killed in battle for Biafra against the Nigerian movement of the 1960s' civil war; Mongane Wally Serote was detained under South Africa's Terrorism Act No 83 of 1967 between 1969 and 1970, and subsequently released without ever having stood trial; in London in 1970, his countryman Arthur Norje committed suicide; Malawi's Jack Mapanje was incarcerated with neither charge nor trial because of an off-hand remark at a university pub; and, in 1995, Ken Saro-Wiwa was hanged by the Nigerian junta.\n\nWith liberation and increased literacy since most African nations gained their independence in the 1950s and 1960s, African literature has grown dramatically in quantity and in recognition, with numerous African works appearing in Western academic curricula and on \"best of\" lists compiled since the end of the 20th century. African writers in this period wrote both in Western languages (notably English, French, and Portuguese) and in traditional African languages such as Hausa.\n\nAli A. Mazrui and others mention seven conflicts as themes: the clash between Africa's past and present, between tradition and modernity, between indigenous and foreign, between individualism and community, between socialism and capitalism, between development and self-reliance and between Africanity and humanity.[18] Other themes in this period include social problems such as corruption, the economic disparities in newly independent countries, and the rights and roles of women. Female writers are today far better represented in published African literature than they were prior to independence (see Daughters of Africa, edited by Margaret Busby, 1992).\n\nIn 1986, Nigeria's Wole Soyinka became the first post-independence African writer to win the Nobel Prize in literature. Previously, Algerian-born Albert Camus had been awarded the prize in 1957. Other African Nobel laureates in literature are Naguib Mahfouz (Egypt) in 1988, Nadine Gordimer (South Africa) in 1991, J. M. Coetzee (South Africa) in 2003, Doris Lessing (UK/Zimbabwe) in 2007, and Abdulrazak Gurnah (Tanzania) in 2021.\n\nIn 1991, Ben Okri's novel The Famished Road won the Booker Prize. The Caine Prize for African Writing, an award for short stories, was established in 2000.[19]\n\nThere have been many literary productions in Africa since the beginning of the current decade (2010), even though readers do not always follow in large numbers.[20] One can also notice the appearance of certain writings that break with the academic style.[21] In addition, the shortage of literary critics can be deplored on the continent nowadays.[22] Literary events seem to be very fashionable, including literary awards, some of which can be distinguished by their original concepts. The case of the Grand Prix of Literary Associations is quite illustrative.[23] Brittle Paper, an online platform founded by Ainehi Edoro, has been described as \"Africa's leading literary journal\".[24] Bhakti Shringarpure notes that \"the dynamic digital impulses of African creativity have not only changed African literature but have also fundamentally altered literary culture as we know it.\"[25]\n\nThe increasing use of the internet has also changed the way readers of African literature access content, which has led to the rise of digital reading and publishing platforms like OkadaBooks.[26]\n\nInaugurated in 1980 and operating until 2009, the Noma Award for Publishing in Africa was presented for outstanding African writers and scholars published in Africa.[27]\n",
  "concepts": [
    "African literature"
  ],
  "findings": [
    "Overview",
    "Oral literature",
    "Precolonial literature",
    "Colonial African literature",
    "Postcolonial African literature",
    "Contemporary developments",
    "Literature published in Africa",
    "Notable novels by African writers",
    "Notable African poets",
    "See also",
    "References",
    "Bibliography",
    "External links"
  ],
  "timestamp": "2025-04-11T10:47:19.358241"
}