{
  "title": "A Treatise of Human Nature",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/A_Treatise_of_Human_Nature",
  "content": " A Treatise of Human Nature: Being an Attempt to Introduce the Experimental Method of Reasoning into Moral Subjects (1739–40) is a book by Scottish philosopher David Hume, considered by many to be Hume's most important work and one of the most influential works in the history of philosophy.[1] The Treatise is a classic statement of philosophical empiricism, scepticism, and naturalism. In the introduction Hume presents the idea of placing all science and philosophy on a novel foundation: namely, an empirical investigation into human nature. Impressed by Isaac Newton's achievements in the physical sciences, Hume sought to introduce the same experimental method of reasoning into the study of human psychology, with the aim of discovering the \"extent and force of human understanding\". Against the philosophical rationalists, Hume argues that the passions, rather than reason, cause human behaviour. He introduces the famous problem of induction, arguing that inductive reasoning and our beliefs regarding cause and effect cannot be justified by reason; instead, our faith in induction and causation is caused by mental habit and custom. Hume defends a sentimentalist account of morality, arguing that ethics is based on sentiment and the passions rather than reason, and famously declaring that \"reason is, and ought only to be the slave to the passions.\" Hume also offers a sceptical theory of personal identity and a compatibilist account of free will.\n\nIsaiah Berlin wrote of Hume that \"no man has influenced the history of philosophy to a deeper or more disturbing degree.\"[2] Jerry Fodor wrote of Hume's Treatise that it is \"the foundational document of cognitive science\".[3] However, the public in Britain at the time did not agree, nor in the end did Hume himself agree, reworking the material in both An Enquiry Concerning Human Understanding (1748) and An Enquiry Concerning the Principles of Morals (1751). In the Author's introduction to the former, Hume wrote:\n\nMost of the principles, and reasonings, contained in this volume, were published in a work in three volumes, called A Treatise of Human Nature: a work which the Author had projected before he left College, and which he wrote and published not long after. But not finding it successful, he was sensible of his error in going to the press too early, and he cast the whole anew in the following pieces, where some negligences in his former reasoning and more in the expression, are, he hopes, corrected. Yet several writers who have honoured the Author's Philosophy with answers, have taken care to direct all their batteries against that juvenile work, which the author never acknowledged, and have affected to triumph in any advantages, which, they imagined, they had obtained over it: A practice very contrary to all rules of candour and fair-dealing, and a strong instance of those polemical artifices which a bigotted zeal thinks itself authorized to employ. Henceforth, the Author desires, that the following Pieces may alone be regarded as containing his philosophical sentiments and principles.\nRegarding An Enquiry Concerning the Principles of Morals, Hume said: \"of all my writings, historical, philosophical, or literary, incomparably the best\".[4]\n\nHume's introduction presents the idea of placing all science and philosophy on a novel foundation: namely, an empirical investigation into human psychology. He begins by acknowledging \"that common prejudice against metaphysical reasonings [i.e., any complicated and difficult argumentation]\", a prejudice formed in reaction to \"the present imperfect condition of the sciences\" (including the endless scholarly disputes and the inordinate influence of \"eloquence\" over reason). But since the truth \"must lie very deep and abstruse\" where \"the greatest geniuses\" have not found it, careful reasoning is still needed. All sciences, Hume continues, ultimately depend on \"the science of man\": knowledge of \"the extent and force of human understanding,... the nature of the ideas we employ, and... the operations we perform in our reasonings\" is needed to make real intellectual progress. So Hume hopes \"to explain the principles of human nature\", thereby \"propos[ing] a compleat system of the sciences, built on a foundation almost entirely new, and the only one upon which they can stand with any security\". But an a priori psychology would be hopeless: the science of man must be pursued by the experimental methods of the natural sciences. This means we must rest content with well-confirmed empirical generalisations, forever ignorant of \"the ultimate original qualities of human nature\". And in the absence of controlled experiments, we are left to \"glean up our experiments in this science from a cautious observation of human life, and take them as they appear in the common course of the world, by men's behaviour in company, in affairs, and in their pleasures\".\n\nHume begins by arguing that each simple idea is derived from a simple impression so that all our ideas are ultimately derived from experience: thus Hume accepts concept empiricism and rejects the purely intellectual and innate ideas found in rationalist philosophy. Hume's doctrine draws on two important distinctions: between impressions (the forceful perceptions found in experience, \"all our sensations, passions and emotions\") and ideas (the faint perceptions found in \"thinking and reasoning\"), and between complex perceptions (which can be distinguished into simpler parts) and simple perceptions (which cannot). Our complex ideas, he acknowledges, may not directly correspond to anything in experience (e.g., we can form the complex idea of a heavenly city). But each simple idea (e.g., of the colour red) directly corresponds to a simple impression resembling it—and this regular correspondence suggests that the two are causally connected. Since the simple impressions come before the simple ideas, and since those without functioning senses (e.g., blindness) end up lacking the corresponding ideas, Hume concludes that simple ideas must be derived from simple impressions. Notoriously, Hume considers and dismisses the 'missing shade of blue' counterexample.\n\nImpressions of sensation\n\nImpressions of  reflection\n\nIdeas of the memory\n\nIdeas of the imagination\n\nBriefly examining impressions, Hume then distinguishes between impressions of sensation (found in sense experience) and impressions of reflection (found mainly in emotional experience), only to set aside any further discussion for Book 2's treatment of the passions. Returning to ideas, Hume finds two key differences between ideas of the memory and ideas of the imagination: the former are more forceful than the latter, and whereas the memory preserves the \"order and position\" of the original impressions, the imagination is free to separate and rearrange all simple ideas into new complex ideas. But despite this freedom, the imagination still tends to follow general psychological principles as it moves from one idea to another: this is the \"association of ideas\". Here Hume finds three \"natural relations\" guiding the imagination: resemblance, contiguity, and causation. But the imagination remains free to compare ideas along any of seven \"philosophical relations\": resemblance, identity, space/time, quantity/number, quality/degree, contrariety, and causation. Hume finishes this discussion of complex ideas with a sceptical account of our ideas of substances and modes: though both are nothing more than collections of simple ideas associated together by the imagination, the idea of a substance also involves attributing either a fabricated \"unknown something, in which [the particular qualities] are supposed to inhere\" or else some relations of contiguity or causation binding the qualities together and fitting them to receive new qualities should any be discovered.\n\nHume finishes Part 1 by arguing (following Berkeley) that so-called \"abstract ideas\" are in fact only particular ideas used in a general way. First, he makes a three-point case against indeterminate ideas of quantity or quality, insisting on the impossibility of differentiating or distinguishing a line's length from the line itself, the ultimate derivation of all ideas from fully determinate impressions, and the impossibility of indeterminate objects in reality and hence in idea as well. Second, he gives a positive account of how abstract thought actually works: once we are accustomed to use the same term for a number of resembling items, hearing this general term will call up some particular idea and activate the associated custom, which disposes the imagination to call up any resembling particular ideas as needed. Thus the general term \"triangle\" both calls up an idea of some particular triangle and activates the custom disposing the imagination to call up any other ideas of particular triangles. Finally, Hume uses this account to explain so-called \"distinctions of reason\" (e.g., distinguishing the motion of a body from the body itself). Though such distinctions are strictly impossible, Hume argues, we achieve the same effect by noting the various points of resemblance between different objects.\n\nHume's \"system concerning space and time\" features two main doctrines: the finitist doctrine that space and time are not infinitely divisible, and the relationist doctrine that space and time cannot be conceived apart from objects. Hume begins by arguing that, since \"the capacity of the mind is limited\", our imagination and senses must eventually reach a minimum: ideas and impressions so minute as to be indivisible. And since nothing can be more minute, our indivisible ideas are \"adequate representations of the most minute parts of [spatial] extension\". Upon consideration of these \"clear ideas\", Hume presents a few arguments to demonstrate that space and time are not infinitely divisible, but are instead composed of indivisible points. On his account, the idea of space is abstracted from our sense experience (arrangements of coloured or tangible points), and the idea of time from the changing succession of our own perceptions. And this means that space and time cannot be conceived on their own, apart from objects arranged in space or changing across time. Thus we have no idea of absolute space and time, so that vacuums and time without change are ruled out.\n\nHume then defends his two doctrines against objections. In defending his finitism against mathematical objections, he argues that the definitions of geometry support his account. He then argues that since important geometric ideas (equality, straightness, flatness) do not have any precise and workable standard beyond common observation, corrective measurements, and the \"imaginary\" standards we are naturally prone to fabricate, it follows that the extremely subtle geometric demonstrations of infinite divisibility cannot be trusted. Next, Hume defends his relationist doctrine, critically examining the alleged idea of a vacuum. No such idea can be derived from our experience of darkness or motion (alone or accompanied by visible or tangible objects), but it is indeed this experience that explains why we mistakenly think we have the idea: according to Hume, we confuse the idea of two distant objects separated by other visible or tangible objects with the very similar idea of two objects separated by an invisible and intangible distance. With this diagnosis in hand, he replies to three objections from the vacuist camp—adding on a sceptical note that his \"intention never was to penetrate into the nature of bodies, or explain the secret causes of their operations\", but only \"to explain the nature and causes of our perceptions, or impressions and ideas\".\n\nIn the final section, Hume accounts for our ideas of existence and of external existence. First, he argues that there is no distinct impression from which to derive the idea of existence. Instead, this idea is nothing more than the idea of any object, so that thinking of something and thinking of it as existent is the very same thing. Next, he argues that we cannot conceive of anything beyond our own perceptions; thus our conception of the existence of external objects is at most a \"relative idea\".\n\nHume recalls the seven philosophical relations, and divides them into two classes: four which can give us \"knowledge and certainty\", and three which cannot. (This division reappears in Hume's first Enquiry as \"relations of ideas\" and \"matters of fact\", respectively.) As for the four relations, he notes, all can yield knowledge by way of intuition: immediate recognition of a relation (e.g., one idea as brighter in colour than another). But with one of the four, \"proportions in quantity or number\", we commonly achieve knowledge by way of demonstration: step-by-step inferential reasoning (e.g., proofs in geometry). Hume makes two remarks on demonstrative reasoning in mathematics: that geometry is not as precise as algebra (though still generally reliable), and that mathematical ideas are not \"spiritual and refin'd perceptions\", but instead copied from impressions.\n\nAs for the other three relations, two of them (identity and space/time) are simply a matter of immediate sensory perception (e.g., one object next to another). But with the last relation, causation, we can go beyond the senses, by way of a form of inferential reasoning he calls probable reasoning. Here Hume embarks on his celebrated examination of causation, beginning with the question From what impression do we derive our idea of causation? All that can be observed in a single instance of cause and effect are two relations: contiguity in space, and priority in time. But Hume insists that our idea of causation also includes a mysterious necessary connection linking cause to effect. \"[S]topt short\" by this problem, Hume puts the idea of necessary connection on hold and examines two related questions: Why do we accept the maxim 'whatever begins to exist must have a cause'?, and How does the psychological process of probable reasoning work? Addressing the first question, Hume argues that the maxim is not founded on intuition or demonstration (contending that we can at least conceive of objects beginning to exist without a cause), and then rebuts four alleged demonstrations of the maxim. He concludes that our acceptance of this maxim must be somehow drawn \"from observation and experience\", and thus turns to the second question.\n\nHume develops a detailed three-stage psychological account of how probable reasoning works (i.e., how \"the judgement\" operates). First, our senses or memory must present us with some object: our confidence in this perception (our \"assent\") is simply a matter of its force and vivacity. Second, we must make an inference, moving from our perception of this object to an idea of another object: since the two objects are perfectly distinct from each other, this inference must draw on past experience of the two objects being observed together again",
  "concepts": [
    "A Treatise of Human Nature"
  ],
  "findings": [
    "Content",
    "Introduction",
    "Book 1: Of the Understanding",
    "Book 2: Of the Passions",
    "Book 3: Of Morals",
    "Influence and legacy",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:14:45.238568"
}