{
  "title": "John Duns (minister)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/John_Duns_(minister)",
  "content": "John Duns FRSE (1820–1909) was Professor of Natural Science at New College, Edinburgh. He was a prolific author on scientific and religious topics.\n\nJohn Duns was born on 11 July 1820 in Duns, Berwickshire a descendant of John Duns. He was the son of Sarah Allen and her husband William Duns. He was educated in Duns then studied medicine at the University of Edinburgh.[1] He received the degree of Doctor of Divinity (DD).\n\nAt some point around 1840, he changed to study divinity. In the Disruption of 1843 he sided strongly with the Free Church of Scotland, and was ordained by that Church in 1844 to preach at Torphichen west of Edinburgh.[2]\n\nIn 1859, he was elected a Fellow of the Royal Society of Edinburgh. His proposer was James Young Simpson. He served as Vice president of the Society from 1899 to 1904.[3]\n\nFrom 1864 to 1903 he was Professor of Natural Science at the Free Church of Scotland's New College in central Edinburgh.\n\nIn 1875, he was elected a member of the Society of Antiquaries.[4] He was then living at 4 North Mansionhouse Road in the Grange district.[5] By 1885 he had moved to 14 Greenhill Place in south-west Edinburgh and remained on this street moving to 5 Greenhill Place by 1905.[6]\n\nFrom its creation in 1891, he was Curator of the National Museum of Antiquities housed in the Scottish National Portrait Gallery on Queen Street.[7]\n\nIn 1900, he was part of the Free Church of Scotland which became the United Free Church of Scotland.\n\nHe died on 1 February 1909 at Hilderley in North Berwick.[8]\n\nIn 1844, he married Margaret Monteith.[9]\n\nHe was a strong anti-Darwinist in his writing:\n\nHis portrait by Hill & Adamson is held by the Scottish National Portrait Gallery.[10] His portrait in stained glass by William Graham Boss forms one of the multiple portraits of committee members of the same gallery on the main stair.[11]\n",
  "concepts": [
    "John Duns (minister)",
    "edinburgh",
    "duns",
    "church",
    "scotland",
    "portrait",
    "free church",
    "free",
    "church scotland",
    "society",
    "national"
  ],
  "findings": [
    "Life",
    "Family",
    "Selected publications",
    "Artistic recognition",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:26:56.554115"
}