{
  "title": "Nick Andersen",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Nick_Andersen",
  "content": "Nicholas (Nick) Andersen is a cybersecurity professional with extensive experience in both government and private sectors. He served as the Principal Deputy Assistant Secretary and performed the duties of the Assistant Secretary for the Office of Cybersecurity, Energy Security, and Emergency Response (CESER) at the U.S. Department of Energy where he led national efforts to secure U.S. energy infrastructure against various hazards.[1][2][3][4]\n\nAndersen earned a Bachelor of Science degree from American Military University, a Master of Science degree from Western Governors University, a Master of Science degree from Brown University, and an Executive Certificate in Public Policy from the Harvard Kennedy School.[5]\n\nPrior to his role at the Department of Energy, Andersen was the Federal Cybersecurity Lead and Senior Cybersecurity Advisor to the Federal Chief Information Officer at the White House Office of Management and Budget (OMB). In this capacity, he led the OMB Cyber Team and was responsible for government-wide cybersecurity policy development and compliance of shared federal security services.[6]\n\nAndersen also served as the Chief Information Security Officer (CISO) for the State of Vermont,[7][8] overseeing the state’s data security and compliance initiatives.[9] His earlier career includes significant roles in military and intelligence sectors, such as Chief Information Officer for Navy Intelligence and Head of the Office of Intelligence, Surveillance, and Reconnaissance Systems and Technologies at the U.S. Coast Guard. He served on active duty with the U.S. Marine Corps, managing intelligence mission systems in Iraq, Europe, and Africa. He is a veteran of Operation Iraqi Freedom.\n\nIn the private sector, Andersen has held leadership positions including Chief Information Security Officer for Public Sector at Lumen Technologies[10][11][12][13] and President/Chief Operating Officer at Invictus International Consulting, LLC.[14] He has also been associated with the Atlantic Council as a nonresident senior fellow with the Cyber Statecraft Initiative.[15]\n\nAndersen was cited as a contributor to A Budget for America's Future - President's Budget FY 2021,[16] an Institute for Critical Infrastructure Technology (ICIT) task force report on mitigating the growing risks associated with IT and cybersecurity consolidation,[17] and the CSIS Commission on Federal Cloud Policy report.[18]\n\nAndersen is a member of the Republican Party and serves on the Republican Party of Virginia's State Central Committee as an elected member from the 11th Congressional District and is appointed by the State Chairman to serve as the State Party's Budget Director.[19]\n\nAs of January 2025, Andersen is considered a potential candidate for key cybersecurity roles in the administration of President Donald Trump.[20][21][22]\n",
  "concepts": [
    "Nick Andersen",
    "andersen",
    "cybersecurity",
    "state",
    "security",
    "officer",
    "chief",
    "intelligence",
    "information",
    "federal",
    "energy"
  ],
  "findings": [
    "Education",
    "Career",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T17:32:49.554886"
}