{
  "title": "Werner Reichardt Centre for Integrative Neuroscience",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Werner_Reichardt_Centre_for_Integrative_Neuroscience",
  "content": "The Werner Reichardt Centre for Integrative Neuroscience (CIN) is the common platform for systems neuroscience at the University of Tübingen in Germany. It was installed as a cluster of excellence within the framework of the Excellence Initiative in 2007/2008. About 90 scientists with their research groups – 21 of which are supported with excellence initiative funds – form the CIN's membership. The focus of their work is on basic research in systems neurobiology. Based on an interdisciplinary and integrative approach, it encompasses projects rooted in biology, medicine, physics, computer science and engineering, as well as cognition and neurophilosophy.[1]\n\nThe namesake Werner Reichardt pioneered research into the fundamental principles of vision and information processing.\n\nThe CIN was applied for as a cluster of excellence starting during the second part of the Excellence Initiative's first round (application: 2006/2007; projects commencing 1 November 2007). It was officially inaugurated on 8 December 2008.[2] At the cluster's foundation, 25 principal investigators (PIs) were joined by another 23 founding members.[3] The CIN is intended as a common platform for exchange, coordination and cooperation within the Tübingen neuroscience community. It has dynamically developed its membership, which now encompasses about 90 Tübingen-based neuroscientists chosen based on scientific criteria.\n\nWhen the Excellence Initiative entered its second round (application: 2010/2011; projects commencing 1 November 2012), the CIN applied for and received a five-year extension of funding and support. In that year, the University of Tübingen also successfully applied for Excellence Initiative support with its institutional strategy and research school.[4]\n\nEver since it moved in in early 2012 (official opening ceremony: 14 May 2012), the CIN has been at home in a building of its own on the Tübingen University Hospital's Schnarrenberg campus. It is situated next to institutions that are neighbours topologically as well as scientifically, nestled in between the Hertie Institute for Clinical Brain Research (HIH) on one side and the German Center for Neurodegenerative Diseases (DZNE) on the other.[5]  Before it moved into its current building, the CIN was installed in a building of the Tübingen-Reutlingen Technology Park, in close proximity to the Tübingen Max Planck campus.\n\nSince its inception, the CIN has been headed by its spokesman, the neurobiologist Prof Dr Peter Thier, who is also director of the Department of Cognitive Neurology at the Center for Neurology/Hertie Institute for Clinical Brain Research at Tübingen University Hospital.[6]\n\nResearch at the CIN focuses on the twofold question how the brain generates its functions (such as perception, memory, emotion, communication, motor skills), and how diseases (such as Alzheimer's, Parkinson's, ALS etc.) impair these functions.[7]\n\nResearchers at the CIN seek to answer these questions using an integrative approach encompassing multiple levels of observation. These levels range from the lowest level of the genetic, cellular and molecular basis of brain functions through intermediate levels of larger neuronal network structures enabling information processing all the way up to high-level observation of the principles governing cognition and behaviour.\n\nThese different levels of observation require different scientific methods, resulting in different manners in which research results can be translated into medicine and engineering.\n\nResearch at the CIN is roughly divided into five research areas.[8] Three research areas are defined by the shared level of observation of research groups engaged in them: the cellular level („The sensory and neuronal basis of integrative brain function (Cellular Level)“), the network level („The sensory and neuronal basis of integrative brain function (Network Level)“) and the cognitive-behavioural level („Cognition and behaviour originating from integrative brain functions (Cognitive Level)“. All of these areas employ computational neuroscience methods complementing biological and cognition research approaches.\n\nTo these three are added two research areas of a more overarching character which emphasise the development of methods and translation into applications. The research area “Designing the tools to probe integrative brain functions (Advanced Tools)“ focuses on imaging techniques, while the research area “Brain-related technical applications and neuroprosthetics (Neurotechnology)“ aims to promote innovative rehabilitation methods and prosthetics and develop neurotechnology based on neurobiological basic research.\n\nDue to their multiple levels of observation, the CIN's researchers employ a wide range of methods.[9] Where investigation into the human brain is concerned, non-invasive imaging techniques such as electroencephalography (EEG) and magnetoencephalography (MEG) are very important. Measurements taken with these methods boast very high temporal resolution, but comparatively low spatial resolution.[10] Fortunately, it is possible to establish anatomical reference points for these electrophysiological methods when they are combined with functional magnetic resonance imaging (fMRI), as fMRI reaches spatial resolutions about two orders of magnitude greater. To further improve spatial resolution of MRI, research groups at the CIN investigate the potential of high field technology, e.g. an experimental 9.4 Tesla MRI scanner for scanning the brains of human test subjects, and a 14.1 Tesla scanner for small animals, both in use at the Max Planck Institute for Biological Cybernetics under the aegis of CIN professor Klaus Scheffler.[11] For non-invasive molecular imaging, CIN research groups also combine MRI with positron emission tomography (PET).\n\nHigher spatio-temporal resolutions are currently only available in invasive experiments, which usually require animal research. In these experiments, membrane potentials including action potentials of neurons are measured with extra- or intracellular electrodes in single-unit recording, with multielectrode arrays, or by employing the patch clamp technique, which enables measurements of membrane potentials in different parts of a given nerve cell.\n\nBesides these electrophysiological methods, which are constantly undergoing refinement, numerous optical methods are employed at the CIN to make individual cells or cell clusters visible in vitro or in vivo, and to observe their behaviour in real time: fluorescence microscopy, most importantly making use of confocal or 2-photon microscopes. The most recent innovation in optical methods is the localisation of protein molecules in neuronal compartments by combining super-resolution microscopy with a molecule-specific marking technique. Super resolution microscopy can reach resolutions below the Abbe limit of conventional light microscopy. This combined method is used by a CIN junior research group to analyse the consequences of axonal damage incurred in the course of inflammatory or neurodegenerative diseases such as multiple sclerosis.[12]\n\nClassical methods such as analysing brain lesions are in use in order to understand the role of certain neural circuits. Furthermore, the CIN makes use of a large number of experimental methods such as non-invasive transcranial magnetic stimulation (TMS), or invasive electrical micro stimulation or local pharmacological manipulation. These methods are more and more complemented by invasive optogenetics, allowing activation and deactivation of individual genetically modified neurons using light of a defined wavelength.[13]\n\nBiological data are analysed and processed using modern statistical methods, theoretical neuroscience approaches to simulate neuronal networks and generate hypotheses testable in further experiments.\n\nSeveral research groups at the CIN work hand-in-hand with the humanities, most importantly philosophy, a direction which has resulted in the creation of a professorship in neurophilosophy based on a former junior research group on this topic.[14]\n\nThe CIN is an interfaculty institution connecting three faculties of the University of Tübingen: the Faculty of Science, the Faculty of Medicine, and the Faculty of Humanities. The CIN is involved in close cooperation with several local partners: the Max Planck Institute for Biological Cybernetics, with whom the CIN has established a joint professorship and research group in high field magnetic resonance tomography; the Max Planck Institute for Intelligent Systems; and the HIH and DZNE, with whom the CIN forms the neurocampus Schnarrenberg enabling efficient sharing of resources and facilities as well as constant scientific discourse.[5]  Common colloquia, many informal meetings, and an annual get-together are intended to foster that discourse further. The close cooperation among these institutions is evidenced by several joint research groups in sensomotoric research[15] and learning and memory.[16]\n\nThe CIN further engages in close collaboration with the Natural and Medical Sciences Institute at the University of Tübingen (NMI), with the Tübingen branch of the German Center for Diabetes Research (DZD), and with the Stuttgart-based Fraunhofer Institute for Manufacturing Engineering and Automation (Fraunhofer IPA).[17] In 2010, many CIN members took part in the successful application for the establishment of the Tübingen Bernstein Center for Computational Neuroscience (BCCN), which was coordinated by CIN professor Matthias Bethge and supported (2010–2015) by the German Federal Ministry of Education and Research in the framework of its Bernstein initiative.[18]\n\nThe CIN supports young people going into research at multiple levels of their career. Education and training of master and doctoral students are handled by the international Graduate Training Centre of Neuroscience (GTC). The GTC encompasses three graduate schools with different focus fields.[19] Built upon the International Max Planck Research School (IMPRS) of Neural and Behavioural Sciences founded in 1999, the institute was expanded to three graduate schools concurrently with the CIN's foundation. The resulting GTC ensures a common structural basis and coordination of studies in neuroscience at the University of Tübingen. The added two graduate schools are the school of Cellular and Molecular Neuroscience and the school of Neural Information Processing. These schools differ from the behaviour- and systems-oriented first graduate school by focusing on the cell and molecular level and on theoretical neuroscience, respectively.\n\nAll three graduate schools teach in English. More than 50% of their students come from abroad. Candidates are chosen based on a multi-stage selection procedure. Currently, ca. 85 students aim for a Master of Science degree, while ca. 250 aim to become Doctors of Science.[19]\n\nLaboratory rotations ensure GTC students are introduced to self-organised scientific project work early on. Students at the GTC have many options to take responsibility; for instance, they can invite guest speakers, and they organise an annual conference aimed at junior neuroscientists (“NeNa-Konferenz”).[20]\n\nFor scientists further along their career paths, the CIN has established a tenure track concept. This allows promising junior researchers to head a research group after a postdoctoral phase, and to responsibly direct all of its activities. Junior research group leaders are supported and mentored by the CIN's advisory board. After four years, junior research group leaders undergo competitive evaluation based on numerous indicators of scientific accomplishment (publication record, third-party funding won etc.). External reviews mark the success level of the evaluation and are the factor determining whether the candidate receives tenure in the form of a professorship.[21]\n\nWhen the CIN was founded, the High School Lab in Neuroscience was also established.[22] The High School Lab is a place for learning outside school, but aimed at high school students to interest them in work as a researcher and neuroscientific research questions. Students addressed are most often in their final years of high school (10th-13th grade), but often come from middle or even elementary schools. The High School Lab has very stable numbers of visitors (about 2,000 annually). It offers day-long practical laboratory courses with diverse experimental tasks.[23] It also hosts a week-long summer academy for ca. 20 students every year, in the course of which participants work on projects, visit local research institutes and listen to scientific talks. Further training for teachers is also on offer, which annually draw a crowd of up to 200 participants. The High School Lab has been headed by Prof Uwe Ilg since its inception.\n\nBeside the CIN, several foundations such as the Hertie foundation, the Robert Bosch foundation, and the Klaus Tschira foundation, have supported the High School Lab for Neuroscience. 2014, a friends’ association was founded. The High School Lab has repeatedly garnered attention in the local media. 2010 it was commended as a “Ausgewählter Ort” (chosen location) in the framework of the initiative “Deutschland – Land der Ideen” (“Germany –  Land of Ideas”).[23]\n\nThe CIN's statutes require an external scientific advisory board to oversee and advise work at the CIN.[24]  Board members are internationally renowned researchers whose area of interest lies in one or more CIN research areas. Board members are called by the president of the University of Tübingen. The scientific advisory board visits Tübingen at least annually to receive a report on scientific and structural developments at the CIN, to evaluate the work and role of junior research group leaders, and to advise. The board then deliberates on the developments of the past year and prepare a report to the president of the university.\n\n48°31′30″N 09°03′32″E﻿ / ﻿48.52500°N 9.05889°E﻿ / 48.52500; 9.05889\n",
  "concepts": [
    "Werner Reichardt Centre for Integrative Neuroscience"
  ],
  "findings": [
    "History",
    "Scientific approach and research questions",
    "Methods",
    "Local relations and partnerships",
    "Support for early career researchers",
    "Scientific advisory board",
    "External links",
    "References"
  ],
  "timestamp": "2025-04-11T10:19:42.202522"
}