{
  "title": "Niki Sanders",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Niki_Sanders",
  "content": "Nicole Sanders is a fictional character portrayed by Ali Larter in the television series Heroes. Niki is married to D. L. Hawkins (Leonard Roberts) and mother of Micah Sanders (Noah Gray-Cabey). Niki, a sufferer of dissociative identity disorder, displays superhuman strength. Initially, she is able to access this power only when her alter ego \"Jessica\" is in control.\n\nTim Kring, the creator of the show, stated that he created Niki with the power to be in two places at once, which stems from her life as a single mother.[2]  Niki was also written to be a showgirl. However, Ali Larter did not fit their original vision of a showgirl, so the character's profession was changed to internet stripper.[3] According to writers Joe Pokaski and Aron Coleite, Niki was written out of the series and replaced with Tracy Strauss so that Larter could play a different role, as they realised that they could not go further with the character. The change also allowed them to tell an origin story, where the character discovers that she has powers.[4]\n\nThe character of Niki is one of three identical triplets, injected with Arthur Petrelli's formula as babies. In the story, Niki was adopted by a wealthy father named Hal Sanders, an abusive alcoholic. Hal would often beat Niki and her sister, Jessica, during his drunken rages. Eventually, Hal strangled Jessica to death and abandoned his remaining daughter. The abuse makes Niki develop an alternate persona. Both Niki and Niki's persona of Jessica resent him for the years of abuse.\n\nAs an adult, Niki had no memory of her father's actions and simply believed he ran out on her. At some point in her life, Niki herself became an alcoholic and a problem gambler, but she managed to overcome her problems. On her first anniversary of sobriety, Niki attended an Alcoholics Anonymous meeting. There, she was reunited with her father, Hal, who wanted to make amends. Niki introduced Hal to her husband, D. L., and her son, Micah. Hal gave the boy a computer, but when he became angry at his grandson for taking the expensive gift apart, Niki demanded that he leave. After her father's departure, Niki went to confront him as Jessica, claiming to remember everything he did to her, including his responsibility in her death (a memory Niki had apparently been suppressing). After assaulting him, she forced the check Hal gave Niki into his mouth and ordered him never to contact her again.[5]\n\nAs of October 2006, Niki resides in Las Vegas and struggles to raise her ten-year-old son, Micah. She has been working as an internet stripper to pay the bills. Her husband, D. L. Hawkins, is in prison, accused of stealing two million dollars from a sports booker and murdering his own gang.\n\nTo help pay for Micah's tuition at a very expensive school that Niki believed would encourage his gifts, Niki borrowed money from Mr. Linderman (Malcolm McDowell), a mobster who once employed her husband.\n\nNot having enough money to continue paying tuition or repay the loan, she withdraws Micah from the school.[6] The two go on the run, as they attempt to elude thugs and police that Linderman sends after her.\n\nDuring times of stress, Niki begins seeing her reflection in mirrors and other reflective surfaces moving differently from herself, leading her to be concerned about her sanity. After Linderman sends two thugs to her house to collect the money she owed him, an altercation occurs, with Niki apparently blacking out after being hit by one of the thugs. When Niki recovers consciousness some time later, she is shocked to find the two thugs dead and horribly mutilated.[7] Niki has other blackout spells over the following days, one time losing four hours, always with no recollection of what has transpired. Niki eventually realizes that she possesses another personality named Jessica, the other being far more sinister and amoral than her usual self, and which possesses superhuman strength.\n\nNiki is reunited with her husband D. L. after he escaped from jail in order to clear his name. Later, Jessica reveals that she was the one who stole the money, killed D. L.'s crew, and framed him, planning to use the money to give her son a better life and keep him away from D. L.'s influence. After a short but violent fight, in which D. L. reveals the phasing powers that he had used to escape from jail, Niki is defeated and lies unmoving on the floor while D. L. takes Micah away.[8]\n\nThe next day, Niki recovers from her injuries and confides in her friend Tina about her dreams and her alternate personality. Jessica then resurfaces and tells Tina that Niki will no longer need Tina's help. That night Jessica answers a telephone call from Micah. She persuades Micah, who knows that she is not his mother, to tell her where he and D. L. are staying.[9] Soon after that, Jessica purchases a sniper rifle, and goes in search of D. L. and Micah. When she finally finds them, she takes aim at D. L. from a hidden location across the street and attempts to kill him.[10] Her first shot hits D. L. in the shoulder, but Jessica is unsuccessful at killing him. After a short chase through the woods, during which Niki fights Jessica for dominance, Jessica attempts to kill D. L. again. She inadvertently throws Micah against some rocks when he tries to restrain her. Horrified, Niki regains control. She apologizes to D. L. and Micah and explains to them her problem. Niki reveals that Jessica is stronger than she is, and that as a result, she can't be trusted. Concerned that Jessica will eventually take over and put her family in danger, Niki turns herself in to the police and confesses to murder.\n\nTwo weeks later, Niki is in prison, awaiting trial. She is returned to her cell after being in solitary confinement. The prison staff is very cautious, as Jessica has emerged previously and injured one of the guards during an attempted escape. During a meeting with the public defender assigned to her case, Niki is informed that the prosecution seeks the death penalty. Her lawyer asks Niki about the two million dollars, but she feigns ignorance. A rowdy Jessica then emerges to state that Niki is lying. Soon, Jessica recommends the lawyer bring in a \"shrink\" to analyse her apparent multiple personality disorder; Niki insists she's not crazy. Later, a meeting with D. L. and Micah indicates that D. L. gave Linderman back the two million dollars. D. L. regrets the whole situation, but Niki believes that it's for the best. She states that she still thinks of Jessica as a completely separate person and not an alter ego. Micah is very distressed by the whole situation and Niki asks the guard for permission to hug him. The guard denies her request, but Niki asks persistently, advancing on the guard as she does so. When the guard attempts to strike her with his nightstick, Niki grabs it and breaks it in half with her bare hands. She appears to be surprised after she does so, as there was no clear indication that the superhuman strength came from Jessica. A now straitjacketed Niki is sedated and placed in a room with padded walls.\n\nIn \"The Fix,\" Niki awakes to find the straitjacket removed, the drugs wearing off, and a psychologist, Dr. Witherson, looking at her. Niki insists that while the straitjacket is useless, the drugs make Jessica weak. The psychologist isn't interested in sedating Niki further, and believes she can help Niki. Niki is visited by D. L., who used his powers to enter her room and proposes breaking her out. D. L. states that he is having trouble raising Micah alone, but Niki is still resigned to her fate.\n\nAfter Niki gives him a bit of advice, D. L. leaves. Later, the psychologist comes back, and Niki agrees to talk to her. The psychologist insists on talking to Jessica. Niki is opposed at first, but the thought of being able to see Micah and D. L. again eventually leads her to give it a chance.  Niki reminisces about her sister Jessica's piano playing abilities due to the metronome that the psychologist is using to bring Jessica out.  Jessica eventually comes out and attacks the psychologist repeatedly with the Taser that the other woman brought for protection. Later, while in her padded cell, a man walks into her cell and tells her to get dressed.  When asked for an explanation, he tells Niki that a death row inmate has admitted to the killings for which she was being held and that DNA evidence verifies the inmate's story. Once home, Micah is clearly ecstatic to have his mother home and asks her to play a game with him.  Appearing to be his mother, Jessica replies that she would enjoy that, and Niki is shown to be hitting a mirror, begging for release.  Jessica merely looks at Niki and replies, \"You were the one who wanted to be locked up, Niki.\"\n\nJessica becomes Linderman's new assassin, and it is revealed that Linderman arranged to have Niki/Jessica released from prison. On Linderman's orders, Jessica kills a man by tearing him in two, throwing Matt Parkman (Greg Grunberg) out of the window in the process. (When Niki and Jessica are fighting for dominance when Jessica is about to kill the target, Matt Parkman who possesses the power of telepathy, is able to hear them both in his mind, a fact which surprises Jessica. \"You heard Niki?\".)\n\nNiki manages to gain control a few times. She puts the photo of Nathan Petrelli, Jessica's next target, on D. L.'s pillow, which causes D. L. to question Jessica, who is still pretending to be Niki. Jessica lies and tells him that Linderman called to ask her to be a \"dealer\" at the casino. Jessica kisses D. L. and assures him that it is nothing more. He leaves the room but is still suspicious.\n\nJessica murders the two FBI agents, who are working with Nathan to take down Linderman. Later, Niki, who has managed to gain control once again, confronts Nathan in his room and confesses everything to him. She then advises Nathan to either take his family and run or to accept Linderman's offer. Nathan refuses, so Niki suggests that he kill Linderman instead. She gives Nathan a gun, which Jessica had intended to use on him. She tells Nathan that she does not have much time and begs him to knock her out so that Jessica can see that she is not in control anymore. Nathan complies.\n\nIn \".07%\", Jessica returns home from her failed assignment only to be confronted by D. L who questions her about which personality is dominant. However, Jessica is unsure. Linderman asks if he can borrow Micah for a few hours, given that he let the debt slide and he saved her from the gas chamber. Jessica coldly informs him that Micah stays out of all their affairs, and leaves. Linderman, however, sends Candice Wilmer to impersonate Jessica and give Micah permission to go with Linderman.\n\nIn \"The Hard Part\", Jessica and D. L. argue about their son Micah's whereabouts, and D. L. blames Jessica for his disappearance. He leaves, intending to rescue Micah without help. Niki pleads with Jessica to assist him, saying that he will die without her help.\n\nD. L. and Jessica phase through walls and into Linderman's office. They find detailed files on their whole family, including Micah. D. L. is angered to find that they had been used. The pair attempts to determine Micah's whereabouts, and find a painting of Micah in what appears to be a burning New York City.\n\nD. L. and Jessica make it to New York, where they work with Matt Parkman and Mr. Bennet to find Linderman. When D. L. and Jessica corner him, Linderman offers Jessica $20 million to kill D. L. Jessica seriously considers the offer, turning to D.L. and saying that she would kill him for that amount of money... but then she states, \"Niki wouldn't\" and lets Niki take control once more. Niki hugs D. L. and apologizes. Linderman shoots at her but D. L. anticipates him and steps in front of Niki to protect her, taking the bullet. D. L. phases Niki out of the room after he kills Linderman.  Niki then confronts Candice Wilmer, who impersonates Jessica. However, the real Jessica appears in a mirror shard to tell Niki she is not fighting her. Rather than take control, Jessica encourages Niki to fight herself and she is able to finally access her super strength as Niki and defeat Candice. Jessica then disappears from the mirror for good. As Niki later leaves the building with D. L., Molly, Mohinder, and Micah, she discovers Sylar and Peter in a showdown. When Sylar summons a parking meter with his telekinesis and strikes Peter down, Niki disarms him and slams his torso with the weapon. Peter, now capable of using Niki's super-strength, tells her to go back to her family. She does so, and then watches with D. L., Micah, and Molly Walker as Nathan flies Peter into the stratosphere to safely explode.\n\nAfter the events in the season finale, Bob from The Company approaches Niki in fear other personalities may emerge. She refuses his treatment so that she can be with Micah and D. L., who survived a gunshot wound to the chest. She begins taking medication, but stops when she experiences unpleasant side effects. On what is meant to be her first day of work at a new job, Gina, a new personality, appears, sealing Niki away. When D. L. tracks down Gina in L.A., whom he believes to be Jessica, she is dancing with another man. Upon seeing D. L., Niki returns. The two begin to leave, exchanging declarations of love for each other, when the same man dancing with Gina shows up and suddenly shoots D. L., killing him.\n\nNiki and Micah then leave Las Vegas. Niki leaves Micah with Nana Dawson, a relative of D. L.'s, and travels to The Company to seek a cure for her condition.  A promise of service is extracted as payment. In \"Fight or Flight\", she attacks a company worker and Bob, forcing Mohinder to shoot her with a Taser.  When Mohinder offers to help her escape, she stops him, explaining that she came to the Company voluntarily and they are trying to help her (\"I gave up my son to be here\"). Later, in the episode \"The Line\", she joins Mohinder as his partner, claiming to be cured. When Maury Parkman mounts an assault on the Company, he manages to corrupt her by using her nightmares against her. To stop herself, she injects herself with a modified form of the Shanti virus, which is soon discovered to be immune to the antibodies in Mohinder's blood. In the present at the end of \"Four Months Ago...\" she is released into the general population.\n\nIn \"Truth & Consequences\", Niki returns to Nana Dawson's house to be with Micah. One night, she gets a call from Mohinder saying he has found a cure and that he is coming to give it to her. She goes to tell Micah who is supposed to be sleeping, but finds an empty bed. In \"Powerless\", Micah convinces her to help save Monica from the gang that kidnapped her. Niki succeeds in rescuing Monica, but is unable to escape herself as the building explodes.\n\nIn \"One of Us, One of Them\", Niki is revealed to have died. In \"I Am Become Death\", it is revealed that Niki, Tracy Strauss, and Barbara are identical triplets that were sepa",
  "concepts": [
    "Niki Sanders"
  ],
  "findings": [
    "Background",
    "Plot",
    "Genesis",
    "Generations",
    "Villains",
    "Alternate future",
    "Powers and abilities",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:15:40.694242"
}