{
  "title": "Neutron star",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Neutron_star",
  "content": "A neutron star is the collapsed core of a massive supergiant star. It results from the supernova explosion of a massive star—combined with gravitational collapse—that compresses the core past white dwarf star density to that of atomic nuclei. Surpassed only by black holes, neutron stars are the second smallest and densest known class of stellar objects.[1] Neutron stars have a radius on the order of 10 kilometers (6 mi) and a mass of about 1.4 M☉.[2] Stars that collapse into neutron stars have a total mass of between 10 and 25 solar masses (M☉), or possibly more for those that are especially rich in elements heavier than hydrogen and helium.[3]\n\nOnce formed, neutron stars no longer actively generate heat and cool over time, but they may still evolve further through collisions or accretion. Most of the basic models for these objects imply that they are composed almost entirely of neutrons, as the extreme pressure causes the electrons and protons present in normal matter to combine into additional neutrons. These stars are partially supported against further collapse by neutron degeneracy pressure, just as white dwarfs are supported against collapse by electron degeneracy pressure. However, this is not by itself sufficient to hold up an object beyond 0.7 M☉[4][5] and repulsive nuclear forces increasingly contribute to supporting more massive neutron stars.[6][7] If the remnant star has a mass exceeding the Tolman–Oppenheimer–Volkoff limit, which ranges from 2.2–2.9 M☉, the combination of degeneracy pressure and nuclear forces is insufficient to support the neutron star, causing it to collapse and form a black hole. The most massive neutron star detected so far, PSR J0952–0607, is estimated to be 2.35±0.17 M☉.[8]\n\nNewly formed neutron stars may have surface temperatures of ten million K or more. However, since neutron stars generate no new heat through fusion, they inexorably cool down after their formation. Consequently, a given neutron star reaches a surface temperature of one million K when it is between one thousand and one million years old.[9] Older and even-cooler neutron stars are still easy to discover. For example, the well-studied neutron star, RX J1856.5−3754, has an average surface temperature of about 434,000 K.[10] For comparison, the Sun has an effective surface temperature of 5,780 K.[11]\n\nNeutron star material is remarkably dense: a normal-sized matchbox containing neutron-star material would have a weight of approximately 3 billion tonnes, the same weight as a 0.5-cubic-kilometer chunk of the Earth (a cube with edges of about 800 meters) from Earth's surface.[12][13]\n\nAs a star's core collapses, its rotation rate increases due to conservation of angular momentum, so newly formed neutron stars typically rotate at up to several hundred times per second. Some neutron stars emit beams of electromagnetic radiation that make them detectable as pulsars, and the discovery of pulsars by Jocelyn Bell Burnell and Antony Hewish in 1967 was the first observational suggestion that neutron stars exist. The fastest-spinning neutron star known is PSR J1748−2446ad, rotating at a rate of 716 times per second[14][15] or 43,000 revolutions per minute, giving a linear (tangential) speed at the surface on the order of 0.24c (i.e., nearly a quarter the speed of light).\n\nThere are thought to be around one billion neutron stars in the Milky Way,[16] and at a minimum several hundred million, a figure obtained by estimating the number of stars that have undergone supernova explosions.[17] However, many of them have existed for a long period of time and have cooled down considerably. These stars radiate very little electromagnetic radiation; most neutron stars that have been detected occur only in certain situations in which they do radiate, such as if they are a pulsar or a part of a binary system. Slow-rotating and non-accreting neutron stars are difficult to detect, due to the absence of electromagnetic radiation; however, since the Hubble Space Telescope's detection of RX J1856.5−3754 in the 1990s, a few nearby neutron stars that appear to emit only thermal radiation have been detected.\n\nNeutron stars in binary systems can undergo accretion, in which case they emit large amounts of X-rays. During this process, matter is deposited on the surface of the stars, forming \"hotspots\" that can be sporadically identified as X-ray pulsar systems. Additionally, such accretions are able to \"recycle\" old pulsars, causing them to gain mass and rotate extremely quickly, forming millisecond pulsars. Furthermore, binary systems such as these continue to evolve, with many companions eventually becoming compact objects such as white dwarfs or neutron stars themselves, though other possibilities include a complete destruction of the companion through ablation or collision.\n\nThe study of neutron star systems is central to gravitational wave astronomy. The merger of binary neutron stars produces gravitational waves and may be associated with kilonovae and short-duration gamma-ray bursts. In 2017, the LIGO and Virgo interferometer sites observed GW170817, the first direct detection of gravitational waves from such an event.[18] Prior to this, indirect evidence for gravitational waves was inferred by studying the gravity radiated from the orbital decay of a different type of (unmerged) binary neutron system, the Hulse–Taylor pulsar.\n\nAny main-sequence star with an initial mass of greater than 8 M☉ (eight times the mass of the Sun) has the potential to become a neutron star. As the star evolves away from the main sequence, stellar nucleosynthesis produces an iron-rich core. When all nuclear fuel in the core has been exhausted, the core must be supported by degeneracy pressure alone. Further deposits of mass from shell burning cause the core to exceed the Chandrasekhar limit. Electron-degeneracy pressure is overcome, and the core collapses further, causing temperatures to rise to over 5×109 K (5 billion K). At these temperatures, photodisintegration (the breakdown of iron nuclei into alpha particles due to high-energy gamma rays) occurs. As the temperature of the core continues to rise, electrons and protons combine to form neutrons via electron capture, releasing a flood of neutrinos. When densities reach a nuclear density of 4×1017 kg/m3, a combination of strong force repulsion and neutron degeneracy pressure halts the contraction.[19] The contracting outer envelope of the star is halted and rapidly flung outwards by a flux of neutrinos produced in the creation of the neutrons, resulting in a supernova and leaving behind a neutron star. However, if the remnant has a mass greater than about 3 M☉, it instead becomes a black hole.[20]\n\nAs the core of a massive star is compressed during a Type II supernova or a Type Ib or Type Ic supernova, and collapses into a neutron star, it retains most of its angular momentum. Because it has only a tiny fraction of its parent's radius (sharply reducing its moment of inertia), a neutron star is formed with very high rotation speed and then, over a very long period, it slows. Neutron stars are known that have rotation periods from about 1.4 ms to 30 s. The neutron star's density also gives it very high surface gravity, with typical values ranging from 1012 to 1013 m/s2 (more than 1011 times that of Earth).[21] One measure of such immense gravity is the fact that neutron stars have an escape velocity of over half the speed of light.[22] The neutron star's gravity accelerates infalling matter to tremendous speed, and tidal forces near the surface can cause spaghettification.[22]\n\nThe equation of state of neutron stars is not currently known. This is because neutron stars are the second most dense known object in the universe, only less dense than black holes. The extreme density means there is no way to replicate the material on earth in laboratories, which is how equations of state for other things like ideal gases are tested. The closest neutron star is many parsecs away, meaning there is no feasible way to study it directly. While it is known neutron stars should be similar to a degenerate gas, it cannot be modeled strictly like one (as white dwarfs are) because of the extreme gravity. General relativity must be considered for the neutron star equation of state because Newtonian gravity is no longer sufficient in those conditions. Effects such as quantum chromodynamics (QCD), superconductivity, and superfluidity must also be considered.\n\nAt the extraordinarily high densities of neutron stars, ordinary matter is squeezed to nuclear densities. Specifically, the matter ranges from nuclei embedded in a sea of electrons at low densities in the outer crust, to increasingly neutron-rich structures in the inner crust, to the extremely neutron-rich uniform matter in the outer core, and possibly exotic states of matter at high densities in the inner core.[23]\n\nUnderstanding the nature of the matter present in the various layers of neutron stars, and the phase transitions that occur at the boundaries of the layers is a major unsolved problem in fundamental physics. The neutron star equation of state encodes information about the structure of a neutron star and thus tells us how matter behaves at the extreme densities found inside neutron stars. Constraints on the neutron star equation of state would then provide constraints on how the strong force of the standard model works, which would have profound implications for nuclear and atomic physics. This makes neutron stars natural laboratories for probing fundamental physics.\n\nFor example, the exotic states that may be found at the cores of neutron stars are types of QCD matter. At the extreme densities at the centers of neutron stars, neutrons become disrupted giving rise to a sea of quarks. This matter's equation of state is governed by the laws of quantum chromodynamics and since QCD matter cannot be produced in any laboratory on Earth, most of the current knowledge about it is only theoretical.\n\nDifferent equations of state lead to different values of observable quantities. While the equation of state is only directly relating the density and pressure, it also leads to calculating observables like the speed of sound, mass, radius, and Love numbers. Because the equation of state is unknown, there are many proposed ones, such as FPS, UU, APR, L, and SLy, and it is an active area of research. Different factors can be considered when creating the equation of state such as phase transitions.\n\nAnother aspect of the equation of state is whether it is a soft or stiff equation of state. This relates to how much pressure there is at a certain energy density, and often corresponds to phase transitions. When the material is about to go through a phase transition, the pressure will tend to increase until it shifts into a more comfortable state of matter. A soft equation of state would have a gently rising pressure versus energy density while a stiff one would have a sharper rise in pressure. In neutron stars, nuclear physicists are still testing whether the equation of state should be stiff or soft, and sometimes it changes within individual equations of state depending on the phase transitions within the model. This is referred to as the equation of state stiffening or softening, depending on the previous behavior. Since it is unknown what neutron stars are made of, there is room for different phases of matter to be explored within the equation of state.\n\nNeutron stars have overall densities of 3.7×1017 to 5.9×1017 kg/m3 (2.6×1014 to 4.1×1014 times the density of the Sun),[a] which is comparable to the approximate density of an atomic nucleus of 3×1017 kg/m3.[24] The density increases with depth, varying from about 1×109 kg/m3 at the crust to an estimated 6×1017 or 8×1017 kg/m3 deeper inside.[25] Pressure increases accordingly, from about 3.2×1031 Pa (32 QPa) at the inner crust to 1.6×1034 Pa in the center.[26]\n\nA neutron star is so dense that one teaspoon (5 milliliters) of its material would have a mass over 5.5×1012 kg, about 900 times the mass of the Great Pyramid of Giza.[b] The entire mass of the Earth at neutron star density would fit into a sphere 305 m in diameter, about the size of the Arecibo Telescope.\n\nIn popular scientific writing, neutron stars are sometimes described as macroscopic atomic nuclei. Indeed, both states are composed of nucleons, and they share a similar density to within an order of magnitude. However, in other respects, neutron stars and atomic nuclei are quite different. A nucleus is held together by the strong interaction, whereas a neutron star is held together by gravity. The density of a nucleus is uniform, while neutron stars are predicted to consist of multiple layers with varying compositions and densities.[27]\n\nBecause equations of state for neutron stars lead to different observables, such as different mass-radius relations, there are many astronomical constraints on equations of state. These come mostly from LIGO,[28] which is a gravitational wave observatory, and NICER,[29] which is an X-ray telescope.\n\nNICER's observations of pulsars in binary systems, from which the pulsar mass and radius can be estimated, can constrain the neutron star equation of state. A 2021 measurement of the pulsar PSR J0740+6620 was able to constrain the radius of a 1.4 solar mass neutron star to 12.33+0.76−0.8 km with 95% confidence.[30] These mass-radius constraints, combined with chiral effective field theory calculations, tightens constraints on the neutron star equation of state.[23]\n\nEquation of state constraints from LIGO gravitational wave detections start with nuclear and atomic physics researchers, who work to propose theoretical equations of state (such as FPS, UU, APR, L, SLy, and others). The proposed equations of state can then be passed onto astrophysics researchers who run simulations of binary neutron star mergers. From these simulations, researchers can extract gravitational waveforms, thus studying the relationship between the equation of state and gravitational waves emitted by binary neutron star mergers. Using these relations, one can constrain the neutron star equation of state when gravitational waves from binary neutron star mergers are observed. Past numerical relativity simulations of binary neutron star mergers have found relationships between the equation of state and frequency dependent peaks of the gravitational wave signal that can be applied to LIGO detections.[31] For example, the LIGO detection of the binary neutron star merger GW170817 provided limits on the tidal deformability of the two neutron stars which dramatically reduced the family of allowed equations of state.[32] Future gravitational wave signals with next generation detectors like Cosmic Explorer can impose further constraints.[33]\n\nWhen nuclear physicists are trying to understand the likelihood of their equation of state, it is good to compare with these constraints ",
  "concepts": [
    "Neutron star",
    "neutron",
    "star",
    "stars",
    "neutron stars",
    "neutron star",
    "mass",
    "state",
    "equation",
    "equation state",
    "gravitational"
  ],
  "findings": [
    "Formation",
    "Properties",
    "Equation of state",
    "Density and pressure",
    "Current constraints",
    "Tolman-Oppenheimer-Volkoff Equation",
    "Mass-Radius relation",
    "I-Love-Q Relations",
    "Temperature",
    "Magnetic field",
    "Gravity",
    "Structure",
    "Radiation",
    "Pulsars",
    "Non-pulsating neutron stars",
    "Spectra",
    "Rotation",
    "Spin down",
    "Spin up",
    "Glitches and starquakes",
    "Anti-glitches",
    "Population and distances",
    "Binary neutron star systems",
    "X-ray binaries",
    "Neutron star binary mergers and nucleosynthesis",
    "Planets",
    "History of discoveries",
    "Subtypes",
    "Examples of neutron stars",
    "Gallery",
    "See also",
    "Notes",
    "References",
    "Sources",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:31:10.297593"
}