{
  "title": "Thomas Chandler Haliburton",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Thomas_Chandler_Haliburton",
  "content": "Thomas Chandler Haliburton (17 December 1796 – 27 August 1865) was a Nova Scotian politician, judge, and author who was the first international best-selling fiction author from what is now Canada, and who served as a Conservative Member of Parliament in England. He was the father of the British civil servant Lord Haliburton and of the anthropologist Robert Grant Haliburton.\n\nThomas Chandler Haliburton was born on 17 December 1796, in Windsor, Nova Scotia, to William Hersey Otis Haliburton, a judge and politician, and Lucy Chandler Grant.[1] His mother died when he was a small child. When Thomas was seven, his father married Susanna Davis, the daughter of Michael Francklin, who had been Nova Scotia's Lieutenant Governor.[2] He attended University of King's College in Windsor, from which he graduated in 1815 to become a lawyer who practiced at Annapolis Royal. Between 1826 and 1829, Haliburton represented Annapolis County in the Nova Scotia House of Assembly.\n\nHaliburton's fame came from his writings on history, politics, farm improvement, and from his The Clockmaker serial, which first appeared in the Novascotian and was published throughout the British Empire, that described the humorous adventures of Sam Slick.\n\nThomas Chandler Haliburton resided in England from 1837,[3] where he was hosted and entertained in London by his cousins Decimus Burton, Jane Burton, James Burton, the Egyptologist, Septimus Burton, the solicitor, Octavia Burton, and Jessy Burton.[4] Thomas asked James Burton, the Egyptologist, to check the proofs of his work Letter Bag of the Great Western, with which Burton was unimpressed, in 1839, and those of the third series of The Clockmaker in 1840.[5] The pair travelled together to Scotland to investigate their common ancestry, and intended to tour Canada and the United States of America together.[5] Thomas Chandler Haliburton's daughter, Susannah, was impressed by James Burton, the Egyptologist: she wrote, in 1839, \"Mr James I admire very much. He is one of the most well-bred persons I saw &... decidedly the flower of the flock\".[4]\n\nIn 1856, Thomas Chandler Haliburton retired from law and moved to England.[1] In the same year, he married Sarah Harriet Owen Williams. In 1859, Haliburton was elected the Member of Parliament for Launceston, Cornwall as a member of the Conservative minority. He did not stand for re-election in 1865.\n\nHaliburton received an honorary degree from Oxford for his services to literature. He continued writing until his death on August 27, 1865 at his home in Isleworth,[6] where he is buried in its All Saints' Churchyard.\n\nThomas Chandler Haliburton married Louisa Neville, who was the daughter of Captain Laurence Neville of the Eighth Light Dragoons, and returned to Nova Scotia with her. Louisa's story before marriage is related in the \"Haliburton Chaplet,\" which was edited by their son, Robert Grant Haliburton (Toronto: 1899). The couple had three sons and five daughters: \n\nHaliburton promoted immigration to the colonies of British North America, and one of his first written works was an emigrant's guide to Nova Scotia that was published in 1823, A General Description of Nova Scotia; Illustrated by a New and Correct Map[10] The community of Haliburton, Nova Scotia was named after him.[11] In Ontario, Haliburton County is named after Haliburton in recognition of his work as the first chair of the Canadian Land and Emigration Company.[citation needed]\n\nIn 1884, faculty and students at his alma mater founded a literary society in honour of the College's most celebrated man of letters. The Haliburton Society, still active at the University of King's College, Halifax, is the longest-standing collegial literary society throughout the Commonwealth of Nations and North America.[citation needed]\n\nThe mention \"hurly on the long pond on the ice\", which appears in the second volume of The Attaché, or Sam Slick in England, a work of fiction published in 1844, has been interpreted by some as a reference to an ice-hockey-like game he may have played during his years at King's College. It is the basis of Windsor's disputed claim to being the town that fathered hockey.[12]\n\nIn 1902, a memorial to Haliburton and his first wife was erected in Christ Church, Windsor, Nova Scotia, by four of their children: Laura Cunard, Lord Haliburton, and two surviving sisters.[citation needed]\n\nNova Scotian artist William Valentine painted Haliburton's portrait. His former home in Windsor is preserved as a museum.[13]\n",
  "concepts": [
    "Thomas Chandler Haliburton"
  ],
  "findings": [
    "Life",
    "Relations with English Burton family",
    "Retirement and subsequent life",
    "Family",
    "Legacy",
    "Works",
    "References",
    "Further reading",
    "External links",
    "Electronic editions"
  ],
  "timestamp": "2025-04-11T10:46:59.445951"
}