{
  "title": "Margaret Conneely",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Margaret_Conneely",
  "content": "Chicago movie-maker Margaret Conneely (1915–2007) was active in amateur filmmaking both locally and internationally for nearly half a century. She is best known as a producer and director of scenario films, film competition judge and as an exhibitor.\n\nIn 1949 Conneely joined the Metro Movie Club, an amateur film club based in River Park and Chicago, Illinois. She was also a member of the Chicago Cinema Club and the Glenview Moviemakers and was an active member of the Chicago Area Camera Club Association, the Photographic Society of America (PSA) and the Amateur Cinema League. While a member of PSA, Conneely served as organizer and chairman of the PSA's first International Competition (1952-1953) as well as chairman and secretary for the PSA Motion Picture Division and chairman of the 1963 PSA National Convention Committee.\n\nIn the 1950s, Margaret's films won awards from major amateur contests in both America and Europe. In 1956, her film The Fairy Princess (1956) won the International PSA Harris Tuttle Trophy for Best Family Film. By the 1960s Conneely had become a highly regarded film competition judge, attending amateur film festivals around the world.[1][2] Conneely judged competitions for the PSA, Chicago Area Camera Club Association, Institute of Amateur Cinematographers and local film clubs.\n\nConneely also wrote articles and gave lectures in the 1950s and 1960s to further the art of motion picture making. Her articles appeared in local club newsletters, the PSA journal, Panorama Magazine, Chicago Tribune and the New York Times.[3] Conneely also presented at Chicago-area camera clubs and at national conventions for the Institute of Amateur Cinematographers and PSA.\n\nConneely later went on to become the director and chief photographer of medical photography and illustration at Loyola University Medical Center in Maywood, Illinois.[4]\n\nSince 2005, Margaret Conneely's films have been in the care of the Chicago Film Archives (CFA). CFA's Margaret Conneely Collection includes medical films she made as a cinematographer for Loyola University Chicago, scenario films she made with other hobbyists and professional filmmakers, films made by other amateur filmmakers and commercial films that she collected over the years.[5] The collection papers include correspondence between Conneely and other amateur filmmakers, documents and publications from amateur film and photography associations as well as photographs of Conneely and other filmmakers.[6] Four of Conneely's films have been preserved by the National Film Preservation Foundation and the New York Women in Film & Television sponsored Women's Film Preservation Fund.[7][8] In 2015, Conneely's short film, Mister E (1959), screened at the Museum of Modern Art.[9]\n",
  "concepts": [
    "Margaret Conneely",
    "conneely",
    "film",
    "amateur",
    "psa",
    "chicago",
    "films",
    "club",
    "margaret",
    "filmmakers",
    "national"
  ],
  "findings": [
    "Working filmography",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:40.520464"
}