{
  "title": "Centro Asturiano de Tampa",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Centro_Asturiano_de_Tampa",
  "content": "The Centro Asturiano is a historic site in Ybor City, Tampa, Florida, United States. Designed by Tampa-based architect M. Leo Elliott and located at 1913 Nebraska Avenue, the building served as a social club for immigrants and descendants of immigrants from Asturias, Spain. On July 24, 1974, it was added to the US National Register of Historic Places.\n\nThe Centro Asturiano de Tampa (Centro) is a social club for immigrants and the descendants of immigrants from Asturias, Spain. Historically, a hospital, cemetery and health insurance all came with membership, and the purpose of the club was to take care of members from before birth until after they died. Membership declined following the close of the hospital in 1990. The hospital was renovated in 2005 to provide affordable housing for seniors. All that remains of the old Centro is the social aspect and the cemetery.\n\nThe Centro is one of many Centros Asturianos that span Spain, the US, and the world.\n\nIn the late 1880s most of the traffic from Spain to the Americas consisted of bachelors going to Havana, Cuba, looking for work. Those men who were married often immigrated alone, only to send for their families once well established in their new homeland. In Havana, there were many organizations, representing various regions of Spain, whose sole mission was to provide health assistance and “a little taste of home” for their members. The Centro Asturiano de La Habana was founded on May 2, 1886, to provide medical assistance, social activities, education, and recreational opportunities.\n\nThe cigar industry soon established many factories in Tampa that brought a wave of new immigrants from Spain, but especially from Cuba.  At the time, US immigration law restricted immigration from Europe, but not from Cuba. Antonio Gonzales Prado, the first president of the Havana club, traveled to Tampa at the end of the century and was appointed chair of a committee whose purpose was to rectify the problem of no health care for the cigar workers. A social club already established in Tampa, El Centro Español de Tampa, made a brief but ultimately unsuccessful attempt at creating a health care system.  Approval from the parent club in Havana for the new branch was crucial. Cigar manufacturers, local doctors and pharmacists had formed the Latin Medical Association to prevent the new club's creation. The name of the club was official changed to The Centro Asturiano de Tampa, Inc. in 1968.\n\nLa Delegation De Centro Asturiano De La Havana en Tampa received a charter in 1907, but did not own the building or the hospital. The owner was El Centro Asturiano de la Havana, A corporation under the Laws of the Republic of Cuba.[2]\n\nAt a meeting on March 24, 1902, Dr. G.H. Altree volunteered to be medical director for the new club. He offered the use of his clinic and sanitarium to Centro members in need of medical attention. By 1903, the society had grown so large that hotel space was leased to keep up with the growing medical needs until the first Covadonga Sanitarium was opened in 1905; it boasted 54 beds. In 1927, a Second Covadonga Hospital was opened.  Keeping with the strongly Catholic membership of the club, both buildings were named after the Virgin of Covadonga, an appearance of the Virgin Mary associated with the Iberian Reconquista.\n\nIn 1956, the Centro Asturiano Hospital, Inc. was chartered and all facilities transferred to the new corporation.  This was done so the hospital could qualify for federal funds and grants from private corporations.\n\nTwo cemeteries were established for members of the Centro Asturiano and their families. The \"old\" Centro Asturiano Cemetery was established in 1904 after the cemetery land was donated for the club's use by the city of Tampa. The club had inquired about the possibility of buying the land but it remains owned and maintained by the city. It is located in the Ybor City neighborhood at 2504 E 21st Avenue (not in Tampa Heights, as was previously reported). Among the 601 interred at the Old Centro Asturiano Cemetery is club founder Antonio Gonzales Prado, who was buried there in 1904.[3]\n\nIn 1942 the much larger Centro Asturiano Memorial Park was established. It is located along Tampa's eastern border, just outside city limits and immediately north of the Grant Park neighborhood at 5400 East Dr. Martin Luther King Jr. Boulevard. Here, over 2,300[3] deceased are buried or laid to rest in the mausoleum, which was added in 1970 and subsequently enlarged in 1998. Among them is U.S. Marine Corps First Lieutenant Baldomero López, who gave his own life to save fellow soldiers during the Korean War, for which he was awarded the Medal of Honor. López's valor is remembered with several monuments, including a state nursing home, a military resupply ship, and a nearby Seffner school which are named in his honor,[4] as well as an engraved memorial erected by the Centro Asturiano near the entrance to the Memorial Park Cemetery.\n\nThe \"old\" Centro Asturiano Cemetery is located at 3698 N. Ola Avenue which is located within the Woodlawn Cemetery on the eastern side and it is maintained by the City of Tampa Parks Department. This is at the corner of Ola and Indiana Avenues in the north Tampa Heights neighborhood and it is still there today but no new burials are allowed.  Please note that the address of 2504 E 21st Avenue is the \"old\" Centro Español Cemetery[5] and not the \"old\" Centro Asturiano Cemetery. They both served Spanish immigrants along with the Centro Asturiano Memorial Park of today located at 5400 E Martin Luther King Blvd, Tampa.[tone]\n\nMembership declined following the close of the hospital in 1990.  The main focus of the club has shifted from medical care, its original purpose, to preserving the history of the club and its members and to a more social function.\n\nThe current building, which has been in use since 1914, originally boasted a recreational floor, a floor largely devoted to study, and a party floor.  The first floor hosted a gymnasium ( which is now closed but used for storage), a cantina for card, chess, and domino games, a billiard room with five tables ( which is now the Covadonga Room. It has its own bar and is a rental option), and a three lane bowling alley that has been converted into a storage area.  The second floor holds offices for the club administrators, an extensive library, several reading and educational rooms, a smoking room which is also used during the day for dominoes and card games, ladies parlor and dressing lounge and the auditorium and stage.  The third floor houses the balcony of the theatre and a large ballroom.  The ballroom was and still is, to a lesser extent, used for public dances that were a main social interaction between young club members or their children.  Many of the current club members met their spouses at a dance at the Centro.  The ballroom also houses private parties such as birthdays, wedding receptions, anniversaries, and many other celebrations.  When the building was opened in 1914, the Tampa Daily Times ran an article on the architecture and features of the new club headquarters: “It is a monument to the memory of those who have devoted their best endeavors to the welfare of the institution, and a palace to those who stand faithful to its noble ideals” (May 16, 1914).\n\nUniversity of South Florida Libraries Special Collections has a Centro Asturiano de Tampa Collection in its holdings, consisting of a large variety of primary source materials, including club and hospital records, meeting minutes, financial records, photographs, playbills, sheet music, zarzuelas, memoria, cemetery records, and ephemera. Ephemera includes trophies, flags, printing plates, and other artifacts related to the club. USF Libraries has digitized a collection of membership record portrait snapshots, totaling more than 5,000 images, available to view on the USF Libraries Digital Collections website.[6]\n",
  "concepts": [
    "Centro Asturiano de Tampa"
  ],
  "findings": [
    "History and Culture",
    "The Hospital",
    "Cemeteries",
    "The Centro Asturiano de Tampa Collection in USF Libraries Special Collections",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:12:25.243003"
}