{
  "title": "Naples Metro",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Naples_Metro",
  "content": "The Naples Metro (Italian: Metropolitana di Napoli) is a rapid transit system serving the city of Naples, Campania, Italy and some parts of the adjacent comuni of its metropolitan area through Line 11. The system comprises three underground rapid transit lines (Line 1, Line 6 and Line 11).\n\nIt is the third largest underground network in Italy, behind Milan and Rome.\n\nThe Metro comprises three lines – 1 (yellow), 6 (blue) and 11 (rainbow or orange) – which operate on 34.5 km (21.4 mi) of route, serving 30 stations.[Note 1] It has a daily ridership of approximately 115,000 passengers, and an annual traffic of approximately 45 million passengers.\n\nIn addition to the Metro, the central area of Naples and its surrounding urban region are served by eight railways forming the Naples metropolitan railway service. These include six Circumvesuviana lines, spanning 142.7 kilometres (88.7 mi) and comprising 96 stations; Line 2, extending 18.9 kilometres (11.7 mi) with 12 stations; the Cumana railway, covering 19.81 kilometres (12.31 mi) with 14 stations; and the Circumflegrea railway, which stretches for 27.04 kilometres (16.80 mi) and includes 16 stations. Together, these railway networks provide extensive connectivity across Naples and the wider Campania region.\n\nIn 1911, construction on the urban section of the Rome–Formia–Naples railway, the Villa Literno–Napoli Gianturco railway was commenced, and although it was suspended for the duration of World War I, the line was eventually opened on 28 September 1925 as an urban railway service line, the first in Italy.[1] This service is now known as Line 2.\n\nAfter World War II, the existing Circumvesuviana railway was upgraded to a modern commuter rail, and also the Cumana railway became relevant for the commuter transport. In 1962, the Circumflegrea railway was opened.[2]\n\nConstruction of the first underground metro railway (Line 1) began in 1976, and the first part opened on 28 March 1993.[3] Initially called the Metropolitana Collinare (\"Hills metro\") it ran for 4 km (2.5 mi) between Colli Aminei and Vanvitelli.[4] Two years later, in 1995, the line was extended to reach Piscinola[4] giving an overall track length of 8 kilometres (5.0 mi).[5]\n\nAlthough progress had been made from the early setbacks and problems, it was still apparent by 1997 that the network suffered badly from the lack of network integration and poor connections, as well as the fact that large areas of Naples were not close to stations. In 1997, the city government drew up a new Piano Comunale dei Trasporti di Napoli (City Transport Plan) which called for a review of the network, improved controls over maintenance expenditure and general finances, a new tariff control system and better management of the urban rail network of Naples.[6]\n\nThe transport plan called for a three phase major redevelopment. Phase 1 would involve an expansion to a total of five lines, including major redevelopment of Line 1, and take the network up to 53 km (33 mi) of track (45 km (28 mi) of existing lines), with 68 stations (23 newly built), and 12 interchange nodes, to be completed by 2001. Phase 2 was designed to increase the network to 7 lines, with 84 stations, and 16 interchange nodes, plus 10 bus interchanges, to be completed by 2007. Phase 3 would see the network expanded to 10 rail lines with 93 km (58 mi) of track, and a further 30 km (19 mi) of new light rail (tram lines) linking 114 stations, with 21 interchanges, and 24 bus interchanges to be completed by 2011. The plan called for 70% of Neapolitans to be living within 500 metres of a transport access point by 2011.[5]\n\nIn conjunction with the regional government of Campania, the comune government of Naples incorporated a new fully state-controlled joint-stock corporation called Metronapoli, which was 99% controlled by the comune and 1% controlled by ANM (Azienda Napoletana Mobilità), with a mission statement of: \"providing an  efficient public rail transport service of quality to the city\".\n\nIn 2000, a new line, Line 9, was proposed. Intended to connect the National Archaeological Museum via the Museo di Capodimonte, providing an alternative route to part of Line 1, the project was abandoned.\n\nMetronapoli took over responsibility for running the urban rail transport network of Naples as part of a planned massive re-invigoration of public transport in the Campania region, on 1 February 2001. The regional government announced a rivoluzione del ferro (rail revolution) which involved a planned expansion of the region's network at a cost of €3.8 billion, and would see the construction of 1,400 km (870 mi) of new tracks and 80 new stations for a total of 423 stations on the network within Campania.\n\nOn 14 April 2001, service on Line 1 was extended from Vanvitelli to Museum (Museo) station.[4]\n\nIn 2005, Line 11 opened between Piscinola and Mugnano stations.\n\nOn 3 December 2005, the CIPE (Interdepartmental Committee for Economic Planning) announced over €600 million worth of funding to be spent the Metropolitana di Napoli network. €323 million was allocated for Montesanto station (Cumana and Circumflegrea), €61.1 million for Quattro Giornate station (Line 1 and Circumflegrea), with both projects to be completed by 2010, as well as €119.7 million to be spent to improve the section of Line 1 between Capodichino and Centro Direzionale and €100 million for the San Pasquale–Municipio section.[7]\n\nFrom 23 December 2006 to 20 February 2007, a special exhibition of models and multimedia presentations was held at Castel dell'Ovo to showcase all of the planned improvements to the Metropolitana di Napoli network, and was extremely well received by locals.\n\nLine 6, which is categorized as a \"light metro\" line, opened in February 2007, running on 2.3 kilometres (1.4 mi) of route and serving 4 stations.[8]\n\nIn 2009, Line 11 extended to Aversa Centro station.\n\nOn 28 March 2011, Line 1 was extended from Museo station to Università. On 17 September 2012, the Toledo station between Dante and Università opened on Line 1.[4] On 31 December 2013, Line 1 was extended to Garibaldi right next to the central train station. On 2 June 2015, the station Municipio (Town Hall) was opened between Università and Toledo on Line 1. In August 2021, Duomo Station began operating, its steel and glass dome delayed by subterranean archeological discoveries and related funding and construction pressures.\n\nOn 16 July 2024, Line 6 was extended from Mergellina to Municipio.[9][10][11][12]\n\nOn 1 April 2025, Line 1 was extended from Garibaldi to Centro Direzionale.[13]\n\nAzienda Napoletana Mobilità is currently responsible for the transport services and maintenance of Line 1, Line 6, pedestrian subways, and the funicular railways (Chiaia, Mergellina and Montesanto).\n\nEnte Autonomo Volturno is currently responsible for the transport services and maintenance of Line 11 and pedestrian subways.\n\nThe Naples Metro currently operates on three lines.\n\nExtension work is underway on Line 1 between Garibaldi and Capodichino (Naples International Airport), with the extension from Garibaldi to Centro Direzionale opened on 1 April 2025. By 2027, Line 1 will become a circular line of 25 km (15.5 mi).[19]\n\nOn Line 11, extension work is underway after Aversa Centro station.\n\nIn July 2020, a new 13 km (8.1 mi), 13 station metro line was announced; Line 10, linking Naples city centre to the Napoli Afragola railway station (which opened in 2017) via the adjacent city of Afragola.[20] Construction on this line could begin as soon as 2025, and is expected to generate 150,000 daily passengers, or 43 million annually.\n\nTo use the service for a single trip, an ANM type \"B\" single journey ticket is required, priced at 1.50 euros. Valid for travel on the metro network are the daily and weekly tickets, as well as the monthly and annual passes issued by ANM (for Lines 1 and 6) and EAV (for line 11), in addition to integrated tickets and passes from the UnicoCampania system.\n\nLine 1 operates from 6:00 AM, with service ending around 1:30 AM on Fridays and Saturdays, and at 11:00 PM from Sunday to Thursday.[21] Headways on Line 1 are generally between 7–10 minutes.[22][17] Commercial speeds on Line 1 are 32 km/h (20 mph).[17]\nLine 6 begins service daily at 7:30 AM and, as of August 2024, temporarily ends around 3:00 PM, with plans to extend the service into the late evening hours once fully operational.[23]\nFinally, for Line 11, the service starts daily at 6:00 AM and concludes at 10:00 PM.[24]\n\nThese schedules are maintained consistently throughout the year without interruptions.\n\nLine 1 and 6 have been renamed \"Metrò dell'Arte\" (Art Metros) reflecting the fact that ten stations exhibit works of art. These include both permanent exhibits and the provision for temporary displays.\nWith the construction and enhancement of the various lines, the Municipality of Naples launched the Stazioni dell'arte (Piano delle 100 stazioni),[25] which involves commissioning well-known contemporary artists and architects to design the stations. Subsequently, the Campania region issued a resolution (Resolution of 19/05/2006 No. 637[26]) outlining guidelines for the design and construction of stations within the regional railway network.[27][28]\n\nThe goal pursued by the authorities is to build stations that are both functional and simultaneously serve as beautiful and comfortable community hubs; concurrently, there is an aim to urbanistically revitalize the surrounding areas.\n\nArt Stations feature numerous contemporary artworks specifically designed for the stations by internationally renowned artists as well as emerging local architects. These stations have been recognized as some of the most beautiful in Europe.\n\nMuseo station (Stazione Museo) also displays archaeological remains and exhibits that were unearthed during the construction of the station, while others have been transferred to the Naples National Archaeological Museum above the station, from which it is named.[29]\n\nAnother initiative started in 2008 was to provide free books for riders on the network.[30] On November 30, 2012, the Toledo station was elected by The Daily Telegraph as the most beautiful subway station in Europe and the world,[31][32][33][34] a recognition echoed by CNN’s rankings;[35] while the Materdei station resulted at 13th place.[36]\n\nDuring the excavation of the metro, numerous archaeological artifacts were discovered. These artifacts, dating back to prehistoric, Greek, Roman, Byzantine, Medieval, and Aragonese periods, provide excellent testimony to ancient Naples. They are currently displayed at the Neapolis Station, a small museum space that is part of the larger complex of the National Archaeological Museum of Naples.\n\nThe six stations where the most artifacts were uncovered, located on the lower section of Lines 1 and 6, are: Salvator Rosa, Toledo, Municipio Porto, Università, Duomo and Chiaia.\n\n Media related to Naples metro at Wikimedia Commons\n",
  "concepts": [
    "Naples Metro",
    "line",
    "stations",
    "station",
    "naples",
    "network",
    "mi",
    "railway",
    "lines",
    "11",
    "metro"
  ],
  "findings": [
    "History",
    "Operator",
    "Infrastructure",
    "Lines",
    "Projected line extensions",
    "Rolling stock",
    "Travelling",
    "Ticketing",
    "Operations",
    "Artwork",
    "Archaeological artifacts",
    "See also",
    "Notes",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:37.282699"
}