{
  "title": "Tetyana Hamera-Shmyrko",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Tetyana_Hamera-Shmyrko",
  "content": "Tetyana Hamera (Ukrainian: Тетяна Гамера-Шмирко; born 1 June 1983) is a Ukrainian long-distance runner. She represented her country at the 2012 Olympics in London, finishing fifth in the women's marathon.[1] This result was among her many performances from 2011 to 2015 later annulled due to her conviction for doping.[2]\n\nBorn in Ternopil, Gamera started her career in athletics as a middle-distance runner. After 2009 she began to compete over longer distances and began to have her first successes. She placed fourth over 5000 metres at the Ukrainian Championship in 2010, running a time of 16:16.55, and placed third at the Koscian half marathon.[3] She made her debut in the marathon the following year and her win at the Cracovia Marathon in a time of 2:28:14 brought her selection for the 2011 World Championships in Athletics, where she managed 15th place.[4] This result was among her many performances from 2011 to 2015 later annulled due to her conviction for doping.[2]\n\nThe 2012 season was a career breakthrough for Gamera. She broke the Ukrainian record at the Osaka Women's Marathon with a run of 2:24:46, ending the race as runner-up to Risa Shigetomo.[5] After that, she ran a series of personal bests: she ran 33:25 at the World's Best 10K, 1:12:15 at the Prague Half Marathon, and 32:50.13 for the 10,000 metres at the Prefontaine Classic.[3] Yet another followed at her first Olympics for Ukraine as she performed beyond expectations to take fifth place at the 2012 London Olympics in another national record time of 2:24:32.[6] All of these results were among her many performances from 2011 to 2015 later annulled due to her conviction for doping.[2]\n\nIn January 2013 she won the Osaka International Ladies Marathon in a personal best time of 2:23:58, although her run was not a national record as Olena Shurhno had since improved that time to 2:23:32.[7] This result was among her many performances from 2011 to 2015 later annulled due to her conviction for doping.[2]\n\nGamera claimed a second consecutive Osaka International Ladies Marathon title in January 2014, winning in a time of 2:24:37.[8] She won a third consecutive Osaka Marathon in January 2015, with a winning time of 2:22:09, a national record time.[9] This result was among her many performances from 2011 to 2015 later annulled due to her conviction for doping.[2]\n\nOn 25 November 2015, Gamera was disqualified by the Ukrainian Athletic Federation starting from 30 September 2015 until 29 September 2019 due to doping rules violations. All her results from 26 August 2011 to 30 September 2015 were annulled, including the national record of 2:22:09, set at the Osaka Marathon in January 2015.[2] Throughout this period she was represented by agent Andrey Baranov.[10]\n",
  "concepts": [
    "Tetyana Hamera-Shmyrko"
  ],
  "findings": [
    "Biography",
    "Disqualification",
    "Personal bests",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:47:43.396725"
}