{
  "title": "1982 Masters Tournament",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/1982_Masters_Tournament",
  "content": "The 1982 Masters Tournament was the 46th Masters Tournament, held April 8–11 at Augusta National Golf Club in Augusta, Georgia. Craig Stadler won his only major championship by defeating  Dan Pohl on the first hole of a sudden-death playoff.[3]\n\nChallenging weather conditions on Thursday and Friday led to the cut at 154 (+10), the highest since the cut was introduced in 1957 and still the highest through 2021, with the co-leaders, Stadler and Curtis Strange, at even par 144.[4]\n\nIn the final round, Stadler shot a 33 on the front had a six-shot lead with seven holes to play. He bogeyed four of those holes, including a three-putt from twenty feet (6.1 m) on the 72nd green to force a playoff with Pohl; the playoff began and ended at the tenth hole. Pohl carded two rounds of 67 on the weekend after two rounds of 75.[5][6] In the sudden-death playoff, Stadler made a routine par and won the Masters when Pohl missed his six-foot par attempt.\n\nThis was the final year that players were required to use Augusta National club caddies.[7][8] The practice was previously employed at the other majors and some PGA Tour events well into the 1970s;[9][10][11] the U.S. Open first allowed the players to use their own caddies in 1976.[12][13] The policy change at Augusta National was announced by chairman Hord Hardin in November 1982.[14]\n\nIt was the final Masters as a competitor for 1946 champion Herman Keiser, age 67, who withdrew in the first round.[15]\n\nTommy Aaron, George Archer (8), Seve Ballesteros (3), Gay Brewer (8), Billy Casper, Charles Coody, Raymond Floyd (8,11,12), Doug Ford, Bob Goalby, Herman Keiser, Jack Nicklaus (2,3,4,8,9,10,12), Arnold Palmer, Gary Player (8), Sam Snead, Art Wall Jr., Tom Watson (3,8,11,12), Fuzzy Zoeller (10,11)\n\nHubert Green (8,11), Hale Irwin (11,12), Andy North\n\nBill Rogers (9,11,12)\n\nJohn Mahaffey (8,11), Larry Nelson (10,12), Lanny Wadkins (8,9,11)\n\nNathaniel Crosby (6, a), Bob Lewis (7, a), Brian Lindley (a), Willie Wood (a)\n\nFrank Fuhrer III (a), Jim Holtgrieve (a), Jodie Mudd (a), Corey Pavin (a), Jay Sigel (a)\n\nJohn Cook (9), Ben Crenshaw (9,12), Bob Gilder (10), Peter Jacobsen, Tom Kite (10,11,12), Bruce Lietzke (10,11,12), Johnny Miller (11,12), Gil Morgan, Jerry Pate (11,12), Calvin Peete (9), Don Pooley, Jim Simons (11), Curtis Strange\n\nGeorge Burns, Frank Conner, Mark Hayes, Lon Hinkle, Chi-Chi Rodríguez, John Schroeder, Jim Thorpe\n\nKeith Fergus (11), Dan Pohl\n\nAndy Bean, Danny Edwards, Dave Eichelberger, Ed Fiori, Jay Haas, Morris Hatalsky, Wayne Levi, Jack Renner, J. C. Snead, Craig Stadler, Ron Streck, Lee Trevino (12), Tom Weiskopf\n\nIsao Aoki (9,10), Dave Barr (11), David Graham (2,4,8,9), Yutaka Hagawa, Bernhard Langer, Greg Norman (8,10), Peter Oosterhuis (11), Philippe Ploujoux (6, a)\n\nThursday, April 8, 1982\n\nSource:[16]\n\nFriday, April 9, 1982\n\nSource:[4][17]\n\nSaturday, April 10, 1982\n\nSource:[18]\n\nSunday, April 11, 1982\n\nSources:[19][20]\n\nCumulative tournament scores, relative to par\nSource:[5][6]\n",
  "concepts": [
    "1982 Masters Tournament"
  ],
  "findings": [
    "Course",
    "Field",
    "Round summaries",
    "First round",
    "Second round",
    "Third round",
    "Final round",
    "Playoff",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:18:46.657586"
}