{
  "title": "Mukim Sungai Kebun",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Mukim_Sungai_Kebun",
  "content": "Mukim Sungai Kebun is a mukim in Brunei–Muara district, Brunei. It is part of Kampong Ayer, the traditional stilt settlements on the Brunei River in the capital Bandar Seri Begawan. The population was 4,750 in 2016.[3]\n\nThe mukim could be named after a village that it encompasses, Kampong Sungai Kebun. Ayer Berkunci, which means literally locked water, is the name of a region near Kampong Sungai Kebun. It is reported that it was the only location with access to piped water in the late 18th or early 19th century. Ayer Berkunci, meaning locked water, is the name of the place where a tiny coal mine once existed. The piped water was controlled by a valve or tap that could be regulated or locked.[4]\n\nThe mukim borders Mukim Peramu and Mukim Saba to the north, Mukim Kota Batu to the east, Mukim Lumapas to the south and west and Mukim Burong Pingai Ayer to the west and north.\n\nAs of 2016 census,[3] the population was 4,750 with 52.2% males and 47.8% females. The mukim had 670 households occupying 656 dwellings. The entire population lived in urban areas.\n\nAs of 2021, the mukim comprised the following villages:\n\nRaja Isteri Pengiran Anak Hajah Saleha (RIPAS) Bridge project in Sungai Kebun takes into account several main criteria where the design concept should have a positive impact on traffic circulation, an iconic design that can be used as a landmark in the country due to its position located in the surroundings of Bandar Seri Begawan as well as the cost of construction reasonable. As of 2015, the village has a population of 760 people consisting of 399 men and 361 women, with 118 residential houses built. Like other villages, it has a religious school known as Sungai Kebun Religious School which was built in 1963 before it was known as Sungai Kebun Malay School.[6]\n\nFormerly known as Kampong Antarabangsa (International Village), is another village that was renamed to the less upscale Kampong Ujong Kelinik.[4] Kampong Ujung Kelinik was almost completely extinct after a fire disaster in 2002. The village was a donation of land from Kampong Sungai Siamas where there used to be a government medical clinic. The clinic was named Kelinik Sultan Omar 'Ali Saifuddien and it was built in 1953 in an area that looked like an island where at that time there were no houses built around the area. But at that time, in Ujung Kelinik, there was a place where it was used as a waiting place for rice farmers to get supplies of goods brought from various places such as Lawas, Sundar and Tarusan for their merchandise.[7]\n\nBetween the 50's and 60's a house was built, but it was located on the land side. In 1976, Kampong Ujung Kelinik began to increase the number of housing. The number of houses in the village continued to increase until it exceeded 50 houses with a population of over 500 people in the year 2000, but after the fire in 2001 and 2002, only three houses remained including his house. After the fire, most of the residents of Kampong Ujung Kelinik were temporarily accommodated in government flats at Old Berakas Airport and from that moment the residents who became victims of the fire began to migrate to various places. Currently, the number of houses left in Kampong Ujung Kelinik is three and a balai ibadat.[7]\n\nAccording to folk tale, the story starts from the event of a yellow light that came from the sea and then went to the believed land (currently Kampong Sungai Siamas). On its way to the land, this yellow light suddenly met a diamond that was adrift. In the meeting, the ketupat asked the yellow light which was believed to be a gold nugget. Said ketupat \"bahapa kamu kemari?\" (why are you here>) then the yellow light continued to answer about their desire to stay and settle there. Then the ketupat answered back saying \"inda guna-guna kamu menetap di sini, sedangkan kami ani rezeki yang memberi kenyang diorang pun mereka buang, ani kamu pula yang akan menetap di sini, jangantah kamu kemari\" (what's the use of you staying here, while we have the sustenance that fills the people, they throw it away, but you are the one who will stay here, don't you come here). Hearing the ketupat's explanation, the yellow light turned back to the sea. In connection with the event, the place was named Sungai Siamas.[7]\n\nPrior to 2017 the number of houses in the village exceeded 50 with a population of over 500 residents. However, with the current of development, some of the houses in the village had to be demolished and some of the residents were moved to government housing for the construction of the RIPAS Bridge. Until now it is clear that there are only 15 houses left in Kampong Sungai Siamas. The jobs of the residents in Kampong Ujung Kelinik and Kampong Sungai Siamas are currently mostly working in the government sector in addition to the private sector and are self-employed such as fishermen. While the types of food produced by these two villages are no different such as bahulu, kuih sapit and cacha in addition to kalupis, wajid and bingka.[7]\n\nOn 6 September 1964, the migration of the people of Kampong Rangau, Limbang to Brunei began and they settled in Kampong Setia which was later divided into two villages, namely Kampung Setia 'A' and Kampung Setia 'B' under the care of their respective village heads. According to folk tale, the existence of Kampong Setia began in Kampong Saba. At that time, many people were looking for work in Kampong Saba by traveling to Siarau and Tubu-tubu. In the early 60s there were already people from Saba catching fish and then building houses in Siarau.[7]\n\nIn 1964 Malaysia was declared independent. According to the story, there was a governor who came down to Rangau to announce that Malaysia would become independent, so he called the people in Rangau to find out their position whether they wanted to enter Malaysia or return to Brunei. A resident told that they want to return to Brunei because they are from Brunei. After reaching an agreement, in 1964 they returned to Brunei with their families and lived in Sungai Lampai. A discussion was made by Patih Dato Paduka Haji Masri bin Haji Mail to ask permission to build a house in Sungai Lampai, Pulau Ambuk, but it was not allowed because there might be a development plan. Then they looked for a place again until they found a place here on mangrove island (Kampong Setia). This place was chosen because of its good position because it faces the sun and it is believed that sustenance is cheap. If it is allowed then the area which is filled with mangrove forest is cleared and cut down by the villagers who want to build a house there. After finishing, each chooses a place to build a house made of wood. The house that was first built using bullian poles, kulimpapa and the roof using leaves.[7]\n\nKampong Setia is divided into two villages namely Kampong Setia 'A' and Kampong Setia 'B'. With a population of 944 people in Kampong Setia 'A' and a total of 1,287 people in Kampong Setia 'B'. These two villages grew rapidly with various advancements enjoyed by the residents of this village. To come to this village, people can use the land road through Kampong Kasat and Kampong Putat roads and also use the freight boat if they go by water. Kampong Setia was divided into two villages in 1976, this was due to the increasing population at that time. With the consent of the villagers divided Kampong Setia into two villages, Kampong Setia 'A' and Kampong Setia 'B'. In addition, with the division will be able to give the opportunity to other people to administer the village.[7]\n\nThe mukim is home to Awang Semaun Secondary School, the only secondary school for the residents of Kampong Ayer.\n\nThe government primary schools in the mukim include:\n\n4°52′48″N 114°56′36″E﻿ / ﻿4.88000°N 114.94333°E﻿ / 4.88000; 114.94333\n",
  "concepts": [
    "Mukim Sungai Kebun"
  ],
  "findings": [
    "Etymology",
    "Geography",
    "Demographics",
    "Administration",
    "Villages",
    "Kampong Sungai Kebun",
    "Kampong Ujung Kelinik",
    "Kampong Sungai Siamas",
    "Kampong Setia",
    "Infrastructure",
    "Education",
    "Tourist attractions",
    "Notes",
    "References"
  ],
  "timestamp": "2025-04-11T10:13:17.195493"
}