{
  "title": "Derek Blanks",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Derek_Blanks",
  "content": "Derek Blanks (born November 5, 1977) is an American photographer, illustrator, creative director, and producer.\n\nDerek Blanks was born in Jackson, Mississippi, on November 5, 1977.[1] His father was a school teacher in Pearl, Mississippi.[1] He is the middle twin of three siblings.[2] Blanks attended Murrah High School in Jackson, Mississippi, and enrolled in APAC: The Academic and Performing Arts Complex, which exposed him to art at a young age.[1]\n\nIn 2000, Blanks graduated magna cum laude from the Maryland Institute College of Art (MICA) in Baltimore, Maryland,[3] where he received a Bachelor of Fine Arts degree in Illustration. Upon graduation, he worked in commercial design, illustration and freelance photography through work with The Baltimore Sun newspaper, and illustrated the children's book Up in the Learning Tree, published by Lee & Low Books.[4]\n\nBlanks went into lifestyle and fashion photography by developing a portfolio of work published by Essence magazine, BET Networks, Sony Music Entertainment, Reach Media Inc. and Ebony.\n\nIn 2009, Blanks collaborated with NeNe Leakes by photographing the cast of Real Housewives of Atlanta for his Alter Ego portrait series.[5] Blanks photographed several more celebrities for the series including Chaka Khan, Taraji P. Henson, Blair Underwood, Snoop Dogg, Janelle Monáe, Rockmond Dunbar, Hill Harper, Faith Evans, Tisha Campbell-Martin, Brandy, Boris Kodjoe, Terrell Owens, Angela Bassett, Cover Girl, Nicole Ari Parker, Mike Epps, Eva Marcille, Akon, Cedric The Entertainer, Columbus Short, and more.[6][7]\n\nIn October 2011, Blanks became a cover and features photographer for, Essence. His covers of Essence magazine include Wendy Williams: The Girl Friends Issue, Angela Bassett: Black Women in Hollywood 2011; features include 2011 Do Right Men featuring Amare Stoudemire, A Few Good Men: The Cast of Red Tails, Don Lemon: Transparent and Black Women in Hollywood 2011 featuring Viola Davis, Loretta Devine and Amber Riley of Glee. Blanks images have also graced the covers and pages of Billboard, Maxim, People, Ebony, Life & Style, PEOPLE en Espanol, Uptown, Jet, Modern Luxury, Runway, Upscale and other publications.\n\nBlanks has photographed print and advertising campaigns for BET Networks including The Mo'Nique Show, The Game (Season 4 and 5), Let's Stay Together (Season 1 and 2), College Hill: Atlanta and Miami, Baldwin Hills, Reed Between The Lines, Toya: A Family Affair, Family Crews, Monica: Still Standing and Tiny and Toya. Additional print campaigns include WeTv's Braxton Family Values and Mary Mary.[8]\n\nIn late 2011, Blanks began transitioning into the world of video, with his directorial music video debut featuring America's Next Top Model contestant Dominique Reighard[9] and \"Charades\" by Chrisette Michele from Audrey Hepburn: An Audio Visual Presentation and \"Party or Go Home\" by Trina Braxton. In 2014, Blanks took on the role of music video directing for Faith Evans' single, \"I Deserve It\", featuring Missy Elliott and Sharaya J.[10]\n",
  "concepts": [
    "Derek Blanks"
  ],
  "findings": [
    "Early life and education",
    "Career",
    "Alter-Ego photography series",
    "Print and advertising",
    "Directing",
    "Credits",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:11:29.046700"
}