{
  "title": "2021 Conference USA Football Championship Game",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/2021_Conference_USA_Football_Championship_Game",
  "content": "The 2021 Conference USA Football Championship Game was a college football game played on December 3, 2021, at the Alamodome in San Antonio, Texas. It was the 17th edition of the Conference USA Football Championship Game and determined the champion of Conference USA (C–USA) for the 2021 season. The game began at 6:00 p.m. CST and aired on CBS Sports Network. The contest featured the hosts and West Division champion UTSA and the East Division champion Western Kentucky. Sponsored by tax services and consulting firm Ryan LLC, the game was officially known as the Ryan Conference USA Football Championship Game.\n\nThe 2021 C–USA title game matched the Western Kentucky Hilltoppers (WKU), champions of the East Division, against the UTSA Roadrunners, champions of the West Division. This was the third meeting between the teams, with the series even at one win apiece.[2] With both teams relatively new to Conference USA – UTSA having joined in 2013 and Western Kentucky in 2014 – and situated in opposite divisions, they did not meet for six years after their initial meeting (a WKU victory by 38 points) in 2014.[3] Entering the title game, the teams' second—and most recent—meeting came in the 2021 regular season, when UTSA defeated Western Kentucky by six points.[4]\n\nThis was Western Kentucky's third appearance in the Conference USA Football Championship Game, after victories in 2015 and 2016, while UTSA made their first appearance.[5]\n\nUnder the direction of third-year head coach Tyson Helton,[6] Western Kentucky began their season with a sound defeat of UT Martin, as Bailey Zappe passed for seven touchdowns in the Hilltoppers' 38-point victory.[7] WKU's success was rather short-lived, though, as a four-game losing streak followed. Losses to Army,[8] Indiana,[9] No. 17 Michigan State,[10] and UTSA[4] – three of the four by six points or fewer – put the Hilltoppers in a 1–4 hole just a few weeks into the month of October. Road wins at Old Dominion[11] and FIU[12] and a homecoming victory over Charlotte brought the Hilltoppers close to a .500 record, which they would go on to achieve the following week against Middle Tennessee.[13] Western Kentucky extended their win streak further with victories against Rice and Florida Atlantic, putting their record at 7–4.[14][15] Their final regular season game, a road contest against Marshall on November 27, would ultimately decide the C–USA East Division title, with both teams in a position to clinch a spot in the championship game with a victory.[16] Western Kentucky won 53–21[17] and clinched the division title and a championship game berth as a result.[18]\n\nThe Roadrunners, led by second-year head coach Jeff Traylor, opened their season with a week one road upset of Illinois. This marked UTSA's second win against a Power Five team[19] and their first win against a Big Ten opponent.[20] UTSA's home opener saw the Roadrunners pound Lamar 54–0, which was the first shutout in school history.[21] The Roadrunners earned their first conference victory the following week against Middle Tennessee[22] and finished their non-conference schedule with an upset victory over Memphis[23] (which included a school-record 21-point comeback[24]) and a narrow victory against a winless UNLV team.[25] After another narrow victory against Western Kentucky,[4] the Roadrunners beat Rice in a blowout on homecoming,[26] earning them their first national ranking when they entered the AP Poll at No. 24 the following day.[27] Victories against Louisiana Tech and UTEP followed;[28][29] the Roadrunners fell out of the poll following the first win but re-entered at No. 23 in time for their November 13 contest against Southern Miss, which they also won.[30] Now 10–0, UTSA clinched the West Division title and their spot in the championship game with a three-point defeat of UAB in their penultimate game.[31] In their final regular season game, a road contest against North Texas, the Roadrunners were unable to complete their undefeated regular season, as the Mean Green dominated to win 45–23 and knock UTSA's record to 11–1.[32]\n\nScheduled for a 6:00 p.m. CST start, the game began on CBS Sports Network at 6:06 p.m., with the opening kickoff from Hunter Duplessis being returned to the Western Kentucky 22-yard line. The Hilltoppers started their opening drive with a pair of incomplete passes but it took just three additional plays for quarterback Bailey Zappe to find Mitchell Tinsley for a 60-yard touchdown pass, giving the Hilltoppers an early lead. UTSA responded with a touchdown drive of their own; after taking the ball with a touchback, the Roadrunners moved the ball into WKU territory within five plays and capped the drive with a 24-yard Frank Harris touchdown run several plays later. Taking possession after the kickoff at their own 34-yard line, Western Kentucky's ensuing drive was propelled by a 45-yard connection from Zappe to Tinsley that took the ball into the red zone, though the drive stalled from there and the Hilltoppers settled for a 33-yard field goal, which put them back in front by three points. On UTSA's ensuing drive, the Roadrunner offense drove into opposing territory in three plays and ended up finding themselves facing a 4th & 1 on the Western Kentucky 22-yard line; Sincere McCormick carried the ball for two yards to convert it and later carried the ball for the same distance to score a touchdown and give UTSA their first lead. Hunter Duplessis' ensuing kickoff went through the end zone for another touchback, and Western Kentucky reached UTSA territory relatively quickly. The Hilltoppers reached the UTSA 1-yard line but failed to gain yardage on three of the next four plays and converted a 34-yard field goal on 4th down.[33]\n\nThe UTSA offense did not let up to begin the game's second quarter. Starting their possession on their own 25-yard line, it again took the Roadrunners three plays to reach midfield, and they converted a third down shortly thereafter to prolong the drive. A 24-yard pass from running back Brenden Brady to wide receiver Zakhari Franklin gave UTSA the ball inside the WKU 10-yard line, and Brady scored on a six-yard rush on the following play. Western Kentucky's ensuing drive was the first in the game to not result in points being scored, as the five-play series resulted in a 53-yard field goal missed wide left by placekicker Brayden Narveson. UTSA responded quickly; McCormick scored on a 65-yard touchdown rush on the very next play, increasing UTSA's lead to 28–13, in what would end up being the final score of the first half. The teams traded punts on each of their next drives; Western Kentucky lost a net total of one yard in the game's first three-and-out, and UTSA managed to pick up 33 yards but punted on 4th & 13 near midfield. The Hilltoppers had a chance to narrow the Roadrunners' lead at the end of the second quarter, but Narveson's 53-yard attempt, his second from that distance, was unsuccessful, leaving seven seconds on the clock. UTSA kneeled the ball and went to halftime leading 28–13.[33]\n\nUTSA received the ball to begin the second half but was unable to move the ball effectively and were forced to punt for the second time. This ended up benefitting them, however, as Western Kentucky's return man, Jerreth Sterns, muffed the punt. The ball was recovered by UTSA, who scored a touchdown two plays later. Things would worsen for Western Kentucky on their next drive; after a Noah Whittington rush went for no gain on the first play, Bailey Zappe's pass was intercepted by Antonio Parks on the second, and Sincere McCormick scored from 17 yards out on the next play, making the score 42–13. The Hilltoppers would put an end to UTSA's streak of 28 unanswered points on their next drive, as WKU drove all the way to the UTSA 12-yard line before facing a 4th & 6, which they converted to score their first touchdown since the game's opening drive. UTSA faced a fourth down on their next drive as well; however, they were unable to convert with one yard to gain, and Western Kentucky took possession at their own 47-yard line. After starting with a false start, WKU reached UTSA territory in three plays, and would go on to score a 13-yard passing touchdown. The third quarter came to an end during UTSA's following drive, after the Roadrunners had driven to the WKU 42-yard line.[33]\n\nUTSA was unable to score from this drive; it ended with a missed 46-yard field goal attempt from Duplessis. From there, Western completed a 50-yard pass to reach the UTSA 21-yard line and scored on a one-yard Kye Robichaux receiving touchdown, cutting the deficit to eight points. UTSA responded with a touchdown of their own, as Frank Harris found De'Corian Clark for a 28-yard score on the drive's tenth play. The Hilltoppers got the ball back with just over six minutes to play at their own 28-yard line; they stalled initially but were able to convert a 4th & 6 to keep the drive alive. Five plays later, Bailey Zappe completed a pass to Jerreth Sterns for a 34-yard touchdown, which narrowed UTSA's lead to eight points once again. Western Kentucky's defense was able to force a punt on UTSA's final drive of the game, which gave the Hilltoppers the ball back on their own 22-yard line with just over one minute on the clock, with a chance to tie the game with a touchdown and two-point conversion. The Hilltoppers converted another fourth down, this time at their own 24-yard line, and were able to move the ball to the UTSA 47-yard line. They had to attempt a Hail Mary, but the ball was intercepted, securing an eight-point victory for UTSA.[33]\n\nat Alamodome • San Antonio, Texas\n",
  "concepts": [
    "2021 Conference USA Football Championship Game"
  ],
  "findings": [
    "Teams",
    "Western Kentucky",
    "UTSA",
    "Game summary",
    "First half",
    "Second half",
    "Scoring summary",
    "Statistics",
    "Team statistics",
    "Individual statistics",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:19:19.920065"
}