{
  "title": "Shearon Harris Nuclear Power Plant",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Shearon_Harris_Nuclear_Power_Plant",
  "content": "The Harris Nuclear Plant is a nuclear power plant with a single Westinghouse designed pressurized-water nuclear reactor operated by Duke Energy. It was named in honor of W. Shearon Harris, former president of Carolina Power & Light (predecessor of Progress Energy Inc.).[2] Located in New Hill, North Carolina, in the United States, about 20 miles (30 km) southwest of Raleigh, it generates 900 MWe, uses a 523-foot (160 m) natural draft cooling tower for cooling, and uses Harris Lake for cooling tower makeup, shutdown and emergency cooling. The reactor achieved criticality in January 1987 and began providing power commercially on May 2 of that year.\n\nThe Shearon Harris site was originally designed for four reactors (and still has the space available for them), but only one was built. The final cost approached $3.9B, including safety upgrades mandated after the Three Mile Island accident.\n\nOn November 16, 2006, the operator applied to the Nuclear Regulatory Commission (NRC) for a renewal and extension of the plant's operating license.[3]\nThe NRC granted the renewal on December 17, 2008, extending the license from forty years to sixty.[4]\n\nOn January 22, 2010, officials at the Nuclear Regulatory Commission announced the electrical generator from the damaged Unit 2 reactor at Three Mile Island would be used at Shearon Harris.[5] The generator was refurbished and installed during a refueling outage in November, 2010.\n\nOn February 19, 2008 Progress filed an application with the Nuclear Regulatory Commission (NRC) for a Combined Construction and Operating License (COL). It seeks to build two 1,100 MWe Westinghouse AP1000 pressurized water reactors. Although the NRC had already certified the AP1000 design, the application review was expected to take about 36 months. The new reactors would not be operational before 2018.[6]\n\nExpansion of the plant would require raising the water level of Harris Lake by 20 feet,[7] decreasing the size of Wake County's largest park, with the Cape Fear River as a backup water source.\n\nOn May 2, 2013, Duke submitted a request to the NRC to suspend review of the Harris Units 2 and 3 Combined License Application (COLA), effectively halting further development of this project.[8] Duke has determined the forecast operating dates of the proposed reactors falls outside the fifteen-year planning horizon utilized by state regulators in their demonstration of need evaluation.  The COLA remains docketed, however, leaving the door open for Duke to restart activities.[9]\n\nThe Shearon Harris Nuclear Power Plant consists of one operational reactor. Three additional units were cancelled. Two additional reactors were planned and cancelled in 2013.[11]\n\nAs of September 2017, the Harris plant is one of three out of the 99 plants in the country to have no Nuclear Regulatory Commission (NRC) findings during the past 4 quarters of inspections.[15]\n\nThe NRC's risk estimate for an earthquake intense enough to cause core damage to the reactor at Shearon Harris was 1 in 434,783, according to an NRC study published in August 2010.[16][17]\n\nThe Nuclear Regulatory Commission defines two emergency planning zones around nuclear power plants: a plume exposure pathway zone with a radius of 10 miles (16 km), concerned primarily with exposure to, and inhalation of, airborne radioactive contamination, and an ingestion pathway zone of about 50 miles (80 km), concerned primarily with ingestion of food and liquid contaminated by radioactivity.[18]\n\nThe 2010 U.S. population within 10 miles (16 km) of Shearon Harris was 96,401, an increase of 62.6 percent in a decade, according to an analysis of U.S. Census data for msnbc.com. The 2010 U.S. population within 50 miles (80 km) was 2,562,573, an increase of 26.0 percent since 2000. Cities within 50 miles include Raleigh (21 miles to city center), Durham (24 miles to city center), and Fayetteville (39 miles to city center).[19]\n\nDuring FEMA's most recent evaluation of state and local government's plans and preparedness included emergency operations for the plant, no deficiencies or areas requiring corrective actions were identified.[20]\n\nThe anti-nuclear group \"N.C. Waste Awareness and Reduction Network\" (NC-WARN) questioned the facility's safety and security record calling it \"insufficient\" and claiming \"it is the most dangerous nuclear plant in the US\".[21][22]  However, the plant's technical and security systems have passed all Nuclear Regulatory Commission (NRC) standards[23] as of 2008[update], including protection and security, and no worker or area resident has been injured as a result of the plant's operation.\n\nIn 2010, Project Censored, a non-profit, investigative journalism project, ranked the safety issues at Shearon Harris the 4th most under-reported story of the year, because of the risk of fires at what are the largest spent-fuel pools in the country.[24]\n\nIn August 2007, NC WARN dropped a lawsuit against Progress Energy that was intended to delay or prevent expansion of Shearon Harris, claiming that continuing the legal battle would cost at least $200,000.[25]\n\nOn May 16, 2013, Shearon Harris Unit 1 initiated an unplanned shutdown when reviews of ultrasonic data from a refueling outage in spring 2012 determined a 1/4\" flaw was inside the 6\"-thick Reactor Pressure Vessel Head. The flaw was near the nozzle for a control rod drive mechanism and attributed to primary water stress corrosion cracking, though no actual leakage was detected. Due to high radiation levels, the repairs required robotic aid.[26] A brand new reactor vessel head was installed November 2019.\n",
  "concepts": [
    "Shearon Harris Nuclear Power Plant",
    "harris",
    "nuclear",
    "plant",
    "shearon harris",
    "shearon",
    "nrc",
    "miles",
    "reactor",
    "regulatory commission",
    "regulatory"
  ],
  "findings": [
    "Refurbished generator from Three Mile Island",
    "Units 2 & 3",
    "Electricity production",
    "Reactor data",
    "Safety",
    "Nuclear Regulatory Commission inspections",
    "Surrounding population",
    "NC-WARN concerns",
    "Spent fuel pools",
    "Shutdown",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:37:32.275664"
}