{
  "title": "Pyrrocoma liatriformis",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Pyrrocoma_liatriformis",
  "content": "Haplopappus liatriformis Greene.\n\nPyrrocoma liatriformis is a species of flowering plant in the family Asteraceae. Its common names include Palouse goldenweed and smallhead goldenweed.[1] It is native to the northwestern United States, where it is endemic to the Palouse prairie, growing in grassland dominated by blue bunchgrass.[2] It is a perennial herb growing from a taproot, producing one to three stems up to 70 centimeters (28 inches) in length. The stems are erect and hairy. Leaves near the base of the plant are larger and rounder than the leaves connected to the stem, which are lanceolate and hairy. Basal leaves measure 80–310 millimeters long and 9–30 millimeters wide, whereas cauline leaves measure 30–120 millimeters long and 5–20 millimeters wide. The inflorescence is four to five heads arranged in a raceme. Each head is composed of 17–25 yellow ray florets, each 6–14.5 millimeters in length, as well as 35–60 disc florets, each 7–11 millimeters in length.[3]\n\nOriginally known only from eastern Washington and adjacent northern Idaho, a joint survey by the United States Forest Service and the Bureau of Land Management in 2011 confirmed the presence of P. liatriformis in extreme northeastern Oregon. The same survey also found another goldenweed species not previously found in Oregon, the similar P. scaberula, which is native to Idaho grasslands in the Snake River Canyon.[2][4]\n\nThe species is classified by NatureServe as imperiled.[1] Since much of the native Palouse prairie has been converted for agriculture, habitat loss is a primary factor threatening this species, along with competition from invasive weeds. It is not listed as endangered under the Endangered Species Act.[2]\n",
  "concepts": [
    "Pyrrocoma liatriformis",
    "millimeters",
    "species",
    "leaves",
    "palouse",
    "native",
    "liatriformis",
    "length",
    "goldenweed",
    "wide",
    "united states"
  ],
  "findings": [
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:39:32.606863"
}