{
  "title": "Thurso Castle",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Thurso_Castle",
  "content": " is a ruined 19th-century castle, located in Thurso, Caithness, in the Scottish Highlands. Situated in Thurso East,east of the River Thurso, the site can be seen from across the river. The current castle ruins date to 1872; A large part was demolished in 1952, although there has been a fortress here since the 12th century. Part of the castle is still habitable and remains a home of the Viscounts Thurso.[1][2]\n\nThere was a castle at Thurso East, which served as a residence of the earls of Orkney and Caithness, and it is probably the earthwork structure which was recorded in 1157 as the Thorsa castle.[3] A fire gutted it in the early 16th century,[4] and no vestige of it remains.[3]\n\nThe Arch, also known as Thurso Castle, was built in 1665 by George Sinclair, 6th Earl of Caithness. The contract between him and the master mason, Donald Ross, records the price as 600 merks.[3]  The Thurso Lairdship was  later held by Sir John Sinclair, 1st Baronet,[5] who erected a new structure, designed as a castle or fortress.[6] It was restored and enlarged in 1806 and 1835.[7]\n\nThe current structure, a Victorian Gothic ruin, was built in 1872. During World War 2, an anti-shipping mine came ashore below the castle and exploded. This led to unstable sections of the building being demolished in 1952. [8]\n\nFormer United States President, Ulysses S. Grant visited the castle as part of his 1877 world tour.[9]\n\nThe heir apparent to The Earldom of Sutherland, Alexander, Lord Strathnaver, died in a fall at cliffs near Thurso Castle on 3 September 2022.\n\nThe previous structure, known as the Arch was described in 1802 as \"the most ornamental piece of architecture in the north\".[6] Robert Sinclair refers to the present castle as \"a gallant ruined reminder of its former Gothic glory\".[10] On the south side, a gatehouse and associated lodge are in fair condition. On the north side, adjacent to the river, are the remains of the north tower and a wing. Brick was added to the lower windows in the 20th century. The well is roughly 20 feet (6.1 m) deep.\n\nThe site,[11] is situated 0.5 miles (0.80 km) east of Thurso, close to the Pentland Firth.[3] A manse was erected at the site in 1818 using some of the stones from the castle.[4] About a mile to the northeast is Harald's Tower, built in 1780, which served as a burial place for the Sinclairs of Thurso.[8]\n\n58°35′57.46″N 3°30′29.55″W﻿ / ﻿58.5992944°N 3.5082083°W﻿ / 58.5992944; -3.5082083\n",
  "concepts": [
    "Thurso Castle"
  ],
  "findings": [
    "History",
    "Architecture",
    "Grounds",
    "References",
    "Bibliography",
    "External links"
  ],
  "timestamp": "2025-04-11T10:13:39.313787"
}