{
  "title": "Rotha Mary Clay",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Rotha_Mary_Clay",
  "content": "Rotha Mary Clay (17 September 1878 – 1 March 1961) was a British self-taught historian and social worker.\n\nClay was born in Hendon in 1878 where her father was a minister. In time the family moved to Bristol where her father led the Bristol church of St Michael on the Mount Without. Her paternal grandparents were friends with John Constable. Her parents were the diarist Jessy (born Allan) and the amateur painter John Harden Clay. [1] Clay would visit the Lake District and the River Rothay near Ambleside after which she had been named.[2]\n\nAt the end of 1895 she started the only known formal education when she began a year of study at Queen's College, London. She performed well, but she did not move on to a formal university course, but she did begin an interest in being a scholar. By the twentieth century she was exploiting Bristol University's Library to study the history of medieval hospitals in England. Her work attracted the interest of the editor of The Antiquary. John Charles Cox was a cleric and local historian and he managed The Antiquaries' Books for Methuen & Co.[2] By 1909 she had completed The Medieval Hospitals of England[3] and five years later The Hermits and Anchorites of England.[4] The latter is still considered a standard work more 100 years after it was published. It is thorough and meticulous, and it includes a table of all the known cells.[5]\n\nIn 1914 she was involved with social work, first at Barton Hill and then in 1918 in Shirehampton. Clay had \"private means\" that enabled her to fund her works. She bought Ilex Cottage in the High Street of Shirehampton where she lived with Rosa Higgs.[2]\n\nIn 1941 she published her study of the life of the Swiss landscape artist Samuel Hieronymus Grimm.[6]\n\nClay died in Shirehampton. She left her estate to be divided with a specific bequest for Rosa Higgs.[2]\n",
  "concepts": [
    "Rotha Mary Clay",
    "clay",
    "work",
    "study",
    "shirehampton",
    "john",
    "england",
    "bristol",
    "years",
    "university",
    "social"
  ],
  "findings": [
    "Life",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:29.049934"
}