{
  "title": "William Graham (American football)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/William_Graham_(American_football)",
  "content": "William Roger Graham (born September 27, 1959) is an American former football player who played safety for six seasons for the Detroit Lions in the National Football League (NFL).\n\nWilliam Graham played defensive back for the Texas Longhorns from 1979 to 1981. In 11 games in 1980, he recorded four interceptions. In 11 games in 1981, he recorded seven more, tying the school record, leading the Southwest Conference and tied for third in the nation. His 11 career interceptions were fourth all-time at Texas.[1][2]\n\nGraham was drafted in the fifth round by the Detroit Lions in the 1982 NFL draft. He played in seven games his rookie season, then fourteen (all but the first two, and all as a starter) in 1983 during which he recovered three fumbles as a free safety. In 1984, he started 13 of 14 games (missing two in late October due to an injury), recorded his first career interception in a Thanksgiving victory over Green Bay in week 13, and two more interceptions off former Lions quarterback Greg Landry in a season-finale loss to the Chicago Bears. In 1985, Graham started in all 16 games for the only time in his career. He again recorded three interceptions (including two in a week-11 victory over the Minnesota Vikings) and his only career sack. In 1987, Graham was no longer a starter, though he appeared in all 16 games and was used occasionally as a kickoff returner (three returns for 72 yards). He appeared in just two games in 1988, and was released at the end of the season.[3] He is one of 16 players in Lions history with two or more multiple-interception games.[4]\n\nThis biographical article relating to an American football defensive back born in the 1950s is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "William Graham (American football)",
    "games",
    "graham",
    "recorded",
    "lions",
    "interceptions",
    "career",
    "11",
    "season",
    "played",
    "football"
  ],
  "findings": [
    "Career",
    "Collegiate",
    "Professional",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T17:04:17.683895"
}