{
  "title": "Richmond Pharmacology",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Richmond_Pharmacology",
  "content": "Richmond Pharmacology Ltd is a UK-based contract research organization. It was founded in 2001 by Jorg Taubel, Radivoj Arezina, and Ulrike Lorch.[1]\n\nThe organization conducts early phase clinical trials on behalf of companies developing drugs, as well as carrying out clinical research of its own design and funding.[2] As of 2015, it was one of fourteen UK MHRA accredited Phase I units,[3] conducted approximately 10% of all Phase I trials conducted in the UK, and had about 100 employees.[1]  It conducts research at a single site in London Bridge formally known as Guy's Drug Research Unit.\n\nIn May 2015 it prompted a judicial review to prevent new rules from the UK Health Research Authority (HRA) from being implemented in April 2015.[4]  The new rules mandated that all drug companies and CROs in the UK register all clinical trials before the first participant is recruited, declare who sponsored the study, and publish the outcome of studies, not only for future trials, but for trials already approved and underway; these rules were supported by advocates for more transparency in clinical research, notably AllTrials.[5] After Richmond filed suit the HRA amended the rules to remove the requirement to register trials that were already underway.[6]  Richmond's suit was narrowed several times as it proceeded and eventually was focused on the question of whether the retrospective application of transparency regulations to trials registered and approved before September 2013 was based in law, as the HRA had stated in its April 2015 revision of its documentation.[6] The court ruled that while the HRA had the right to impose such rules, they were not based on law, and HRA did state that they were; the HRA paid £75,000 to cover part of Richmond's legal costs.[6]\n\nRichmond was involved in a UK employment law case that established a precedent that there are two kinds of liability under UK workplace harassment law – \"purpose\" and \"effect\".[7]   In Richmond Pharmacology v. Dhaliwal[8] Richmond appealed an employment tribunal ruling concerning remarks made by a manager to an employee in 2007; the tribunal ruled that the remarks had the effect of harassment - that the remarks were seen as derogatory and were based on the employee's ethnicity and gender - although harassment was not intended. In 2009, the appeal tribunal upheld the original tribunal decision.[7]\n",
  "concepts": [
    "Richmond Pharmacology"
  ],
  "findings": [
    "Operations",
    "Legal cases",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:20:58.248478"
}