{
  "title": "Jan C. Childress",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jan_C._Childress",
  "content": "Jan C. Childress (born July 7, 1954) is an American comic book writer,[1] martial artist, financial professional, and former Congressional speechwriter (for Fred Richmond).  As a comic book professional, he is best known for writing The Good Guys with his mentor, Jim Shooter for Defiant Comics and co-creating the mixed martial arts entertainment property JFH: Justice For Hire with his son Jan Lucanus for Creative Impulse Entertainment.\n\nAs a martial artist, he is world-ranked with several national medals and titles from the International Chinese Martial Arts Competition (ICMAC),[2] as well as twice winning the bronze medal at the Tai Chi World Cup in Taiwan (2004 & 2010).[3]\n\nMr. Childress has served as Director of Investor Relations for Consolidated Edison since 1998. He was previously Vice-President of Investor Relations for KeySpan.[4][5]\n\nJan C. Childress wrote as a contributing journalist for several \"Zines\" (fan-created magazines) including the Marvel Zombie Society comic book critics publication.[6] He later began working with publications such as The Overstreet Comic Book Monthly (an offshoot of Overstreet Comic Book Price Guide) and Comic Critics Cavalcade. Jan was part of a collective of critics whose monthly letters to Marvel and DC Comics had influence over the creative direction of the narratives under review due to their consistent volume of criticisms and commentary that regularly were printed in \"Letters\" section of the books (located at the end of many comic books, this is where mail from readers would appear). After Jan criticized ethnic diversity in a Marvel Comics title, then-Marvel Vice President Jim Shooter challenged him to write what he wished to see as one of the comic creators for Jim's offshoot company, Defiant Comics, where Jan wrote The Good Guys (comics) monthly series.[7]\n\nJan was instrumental in helping his son Jan Lucanus establish the transmedia company Creative Impulse Entertainment, and has created several comic book titles for the company, including Durga: The Geomancer, Tengu: A Ninja/Samurai Love Story, and JFH: Justice For Hire.\n",
  "concepts": [
    "Jan C. Childress",
    "comic",
    "jan",
    "comic book",
    "book",
    "comics",
    "marvel",
    "martial",
    "monthly",
    "jim",
    "entertainment"
  ],
  "findings": [
    "History in comic books",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:07.026260"
}