{
  "title": "2001 Santana High School shooting",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/2001_Santana_High_School_shooting",
  "content": "On March 5, 2001, a school shooting occurred at Santana High School in Santee, California, United States. The gunman, 15-year-old Charles Andrew Williams, opened fire with an eight-shot .22-caliber revolver, killing two students and wounding 13 others. Williams was then apprehended by responding police officers and convicted. He is currently serving 50 years to life in prison.\n\nWeeks before the shooting, Williams allegedly attempted to speak with a school counselor but was instructed to return to class because the office was full at the time. He later reportedly complained to a school counselor multiple times about being bullied and told a school security guard he was going to bring a gun to campus, but evidence has not been found for either claim.[2]\n\nAs the semester unfolded, friends came to believe that Williams had just reached a tipping point and mentioned he \"didn't want to live anymore,\" which resulted in more name-calling and threats of bullying. The Friday before the shooting, Williams and classmates reported that his drama teacher humiliated him in front of the class during an acting exercise for which he was not prepared, which he perceived as an abusive setup.[3] Williams spoke on two occasions of his plan to \"pull a Columbine\" at Santana High School, but no reports were ever made of these threats to the school. He also made plans to get on top of the school's roof so that he could hit people more easily. Many friends claimed that Williams brought up his plan repeatedly prior to the shooting but would claim to just be joking, at least two friends claimed to have been warned by Williams the day before the attack but they thought he was joking.[4][2] The first occasion was a week before the shooting, the second during the weekend prior to March 5.[5]\n\nOn March 5, 2001, at 9:20 a.m., 15-year-old Charles Andrew Williams entered a boys' bathroom at Santana High School with a loaded eight-shot .22-caliber revolver taken from his father's locked gun cabinet and fatally shot a freshman.[1] He then left the bathroom and began firing the revolver indiscriminately at other students, killing another. According to one witness, Williams repeatedly walked out of the bathroom, fired shots, then went back into the bathroom. Others recounted that Williams methodically confronted and shot other students.[2] The scene soon turned chaotic as students and teachers ducked or scrambled to safety. Minutes later, the school was on lockdown.\n\nA student teacher, Tim Estes, and Campus Security Supervisor, Peter Ruiz, walked into the bathroom to investigate what Ruiz thought may be the sound of firecrackers. Upon entering the restroom, Ruiz was shot once in the shoulder by Williams. As Estes and Ruiz turned to run, Ruiz was hit in the back by two more bullets and Estes was hit in the back by a bullet which exited through his abdomen.\n\nTwo off-duty police officers who were visiting the school were alerted to the shooting, but were at different ends of the school. One of them approached the bathroom and called for backup. More officers quickly arrived, with many witnessing a swarm of students fleeing the building as they were trying to enter making it difficult. Responding officers discovered Williams in the bathroom along with two wounded victims, with one officer recounting that Williams was found in the process of reloading, the chamber was open and he was putting bullets in the gun.[6] Williams calmly surrendered stating: \"It's just me, I'm the only one.\"[7][8]\n\nThe San Diego SWAT team was called to \"assess and clear\" the scene of the shooting.[9] Paramedics brought all of the wounded together and lined them up outside the principal's office and wrote numbers on them in order to keep track of the wounded before transporting them to a hospital.[10]\n\nWilliams shot 15 people, two of who died. The two students that were killed were 14-year-old Bryan Zuckor and 17-year-old Randy Gordon.[11] Eleven students and two school supervisors suffered gunshot wounds and were treated at either UC San Diego Medical Center or Rady Children's Hospital.[9]\n\nCharles Andrew Williams was born in Frederick, Maryland, on February 8, 1986, the firstborn child of Jeff and Linda Williams. Known by his family as \"Andrew\" or \"Andy\" for short, he had one half-brother, Michael. His parents divorced in 1990, leaving his father with custody and little contact with his mother.[12] Jeff and Andy moved to California in the fall. While attending Santana High School, Williams was bullied by fellow students because of his small size.[9] He began to spend time with a crowd of skateboarders. Williams was accepted within this peer group; however, at times these individuals also bullied him. Jeff has stated that an older man bought the boys alcohol and drugs in exchange for sexual favors and that Andy did not mention this abuse until long after his arrest.[12] In 2011, that older man, Chris Reynolds, was sentenced to 40 years in prison in Oklahoma for molesting other adolescent boys.[13]\n\nHe took his father's Arminius .22 caliber long-rifle double action revolver from the locked gun cabinet in their apartment.[14] After his arrest, he told investigators that he was \"tired of being bullied\". On the way to juvenile hall, Williams said that he did it because he was dared to by his friends.[15] He also has stated at least three different anticipated outcomes of the shooting when speaking with authorities.[2]\n\nOn June 20, 2002, Williams pleaded guilty to all charges against him in an effort to avoid trial.[16] On August 15, 2002, a California judge sentenced Williams, as an adult, to 50 years to life in prison, and ordered him to serve his time in the Youth Offender Program at CCI, Tehachapi (since closed) until his 18th birthday, at which time he would be transferred to an adult prison. Williams was given credit for the 529 days that he had served in juvenile hall, fined $10,000 and ordered to pay restitution to the Victims Restitution Fund. At his sentencing, Williams apologized and expressed remorse for his actions. On March 1, 2004, he was transferred to Calipatria State Prison where he spent much of the remainder 2000s in The Sensitive Needs Yard'. Williams is currently incarcerated at California Institution for Men in Chino, California. He will be eligible for parole in September 2024, when he will be 38 years old.[17][18]\n\nThere was a grassroots effort to have Williams' sentence reduced. His supporters argue that the judge was too harsh in sentencing Williams as an adult and did not take into consideration Williams' age at the time of his offense. They would like to see Williams get a retrial, but as a juvenile, which would have meant confinement by the California Youth Authority until age 25. The California State Attorney General's office handled a total of six appeals filed by Williams supporters, four to the Court of Appeals and two to the California State Supreme Court. The district court denied his petition in September 2010 and the case is now on appeal to the 9th Circuit, according to the California Attorney General's Office.[19][better source needed]\n\nIn 2018, Williams petitioned California governor Jerry Brown for sentence commutation after a new law was signed prohibiting defendants under 16-years of age to be tried as adults. The San Diego District Attorney's office stated they adamantly opposed the petition along with victims and their family members.[20]\n\nIn 2024, his first application for parole was denied.[21]\n\nPresident George W. Bush offered his condolences \"to the teachers and the children whose lives have been turned upside-down right now.\" Bush called the shooting \"a disgraceful act of cowardice,\" adding, \"When America teaches our children right from wrong and teaches values that respect life in our country, we'll be better off.\" But, he said, \"First things are first. And our prayers go out to the families that lost a child today.\"[22]\n\nCalifornia Governor Gray Davis also said he was \"shocked and deeply saddened\" by the shooting. Davis' wife Sharon is a Santana High School graduate.[22]\n\nThe San Diego Padres wore an \"SHS\" memorial patch on their jersey sleeves during a spring training game on March 6, 2001.[23]\n\nThe nu metal band Linkin Park, of whom Williams was a fan, were seen as influencing Williams' actions. Following the shooting, the band released a statement saying, \"Like everyone else, we are extremely saddened by these events and our hearts go out to the families and friends to the victims.\"[24] Williams had written a note to his father prior to the shooting: \"I tried so hard, and got so far, but in the end it doesn't really matter,” which was a quote taken from the chorus of the band's 2000 song \"In the End.\"\n\nThe shooting led to the development of regional active shooter response training called Immediate Action, Rapid Deployment (IARD), which has become routine for any law enforcement agency to enter a critical incident scene, and to find and stop the threat as soon as possible.[7]\n\nA twentieth anniversary candlelight vigil was hosted on March 5, 2021, by the Santana High School classes of 2001–2004 to honor the victims and families of the victims of the shooting.[25]\n\nThe shooting partly inspired the P.O.D. song \"Youth of the Nation\".[26]\n\nIn an interview with \"NOVA: Mind of a Rampage Killer\", Williams said he had been suicidal for several months before the shooting. He described his 15-year-old life as tumultuous, recounting the pain of his parents' recent divorce, his move across the country from Maryland to California, and the death of a friend. His description of his mental state was \"numb,\" adding that he didn't realize people would die, but he wanted to \"make a lot of noise and then the cops would show up.\" He admitted that his real plan was to commit suicide by cop, however he \"changed his mind at the last minute, dropped his revolver and surrendered.\"[27][28]\n\n32°51′27″N 116°58′09″W﻿ / ﻿32.8574°N 116.9692°W﻿ / 32.8574; -116.9692\n",
  "concepts": [
    "2001 Santana High School shooting",
    "williams",
    "shooting",
    "school",
    "california",
    "students",
    "bathroom",
    "victims",
    "shot",
    "santana high",
    "santana"
  ],
  "findings": [
    "Background",
    "Shooting",
    "Victims",
    "Perpetrator",
    "Legal",
    "Reactions",
    "Legacy",
    "Depiction in media",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:59:21.604873"
}