{
  "title": "Boppelsen",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Boppelsen",
  "content": "Boppelsen is a municipality in the district of Dielsdorf in the canton of Zürich in Switzerland.\n\nBoppelsen is first mentioned in 1130 as de Bobpinsolo.[3]\n\nBoppelsen has an area of 3.9 km2 (1.5 sq mi).  Of this area, 42.6% is used for agricultural purposes, while 47.4% is forested.  Of the rest of the land, 9.7% is settled (buildings or roads) and the remainder (0.3%) is non-productive (rivers, glaciers or mountains).[4]\n\nThe municipality is located in the hills above the Furttal.\n\nBoppelsen has a population (as of 31 December 2020) of 1,472.[5]  As of 2007[update], 11.2% of the population was made up of foreign nationals.  Over the last 10 years the population has grown at a rate of 41.7%.  Most of the population (as of 2000[update]) speaks German  (92.2%), with Portuguese being second most common ( 2.7%) and French being third ( 0.7%).\n\nIn the 2007 election the most popular party was the SVP which received 39.8% of the vote.  The next three most popular parties were the FDP (16.9%), the CSP (15.1%) and the SPS (10.3%).\n\nThe age distribution of the population (as of 2000[update]) is children and teenagers (0–19 years old) make up 21.6% of the population, while adults (20–64 years old) make up 68.4% and seniors (over 64 years old) make up 10%.  About 87.8% of the population (between age 25-64) have completed either non-mandatory upper secondary education or additional higher education (either university or a Fachhochschule).\n\nBoppelsen has an unemployment rate of 1.44%.  As of 2005[update], there were 112 people employed in the primary economic sector and about 17 businesses involved in this sector.  21 people are employed in the secondary sector and there are 8 businesses in this sector.  82 people are employed in the tertiary sector, with 31 businesses in this sector.[4]\nThe historical population is given in the following table:[3]\n",
  "concepts": [
    "Boppelsen"
  ],
  "findings": [
    "History",
    "Geography",
    "Demographics",
    "References",
    "External links"
  ],
  "relationships": [
    {
      "subject": "Boppelsen",
      "relationship": "is a",
      "object": "municipality in the district of dielsdorf in the canton of zürich in switzerland",
      "sentence": "Boppelsen is a municipality in the district of Dielsdorf in the canton of Zürich in Switzerland."
    }
  ],
  "timestamp": "2025-04-11T13:23:23.257786"
}