{
  "title": "Amy Díaz-Infante",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Amy_Díaz-Infante",
  "content": "Amy Díaz-Infante (born 1982) is an active Mexican American visual artist and educator, currently based in San Francisco, California, United States, with a focus on printmaking, drawing, and design.[1]\n\nAmy Díaz-Infante was born in Salinas, California.[2] Her grandparents Luis and Evelia Díaz-Infante, immigrated from Jalisco, Mexico to Salinas, California in 1961. They were employed as farmworkers in Salinas Valley until Luis was promoted to repair field equipment, given charge of maintenance and developed agriculture equipment until he retired as a welder.[3] In addition, they were dedicated active members of the Migrant Education Program.[4] Díaz-Infante’s mother raised her children while she worked full-time and part-time as a student for a decade until she received her degree at Hartnell College.[2] In 2017, her uncle Alfred Díaz-Infante established the Díaz-Infante Family Scholarship of $15,000 in honor of Luis and Evelia’s community and educational legacy that was awarded to farmworkers, children of farmworkers, or low-income students pursuing degrees in business, engineering, healthcare, communications, or education.[5]\n\nAs a result of the Díaz-Infante family's commitment to their Mexican American community, she integrated community engagement in her arts practice, position as an educator and administrator. She has been an active member in youth arts and youth leadership development throughout her career. Her source of inspiration comes from her supportive family members and her mentor Juan R. Fuentes, a fellow printmaker who taught her how to screenprint when she volunteered at the Mission Cultural Center in San Francisco.[6] Her experience in youth arts organizations allowed her to build creative collaborations and construct spaces for people to develop their artistic voices and build confidence.  \n\nDíaz-Infante was a first generation college student who received a scholarship to Yale University. They rewarded her admission after initially stating her application would be turned down without an application fee.[2] In 2003, Díaz earned a Bachelor of Art degree from Yale University with a concentration in printmaking. In 2009, she earned a Master of Fine Arts degree from Rhode Island School of Design with a concentration in printmaking and graduated with honors. During the same year, she received a Collegiate Teaching Certificate from Brown University's Harriet W. Sheridan Center for Teaching & Learning. In 2015-present, she became a contributing art editor for the Kweli Journal, an online literary journal for writers of color. In 2017-present, she became a full-time faculty member in Printmaking, Drawing, and Design at the City College of San Francisco.[7]\n",
  "concepts": [
    "Amy Díaz-Infante",
    "díaz",
    "infante",
    "díaz infante",
    "printmaking",
    "arts",
    "youth",
    "university",
    "time",
    "san francisco",
    "san"
  ],
  "findings": [
    "Life and education",
    "Art (exhibitions and collaborations)",
    "Further reading",
    "Interviews",
    "Publications",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:30:47.752338"
}