{
  "title": "Henri Hubert",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Henri_Hubert",
  "content": "Henri Hubert (23 June 1872 – 25 May 1927) was a French archaeologist and sociologist of comparative religion who is best known for his work on the Celts and his collaboration with Marcel Mauss and other members of the Année Sociologique.\n\nHubert was born and raised in Paris, where he attended Lycée Louis-le-Grand. There he was influenced by the school chaplain, Abbé Quentin, who instilled in him an interest in religion and in particular in religion amongst Assyrians. He entered the École Normale Supérieure. He began to study the history of Christianity. He passed the agrégation in history in 1895 after studying the Eastern Orthodox Church, the Byzantine Empire, and iconoclasm. His doctoral thesis focused on pre-Christian religion in Asia Minor.\n\nUnlike most French academics, Hubert focused on research rather than teaching after graduation. He took a position at the École Pratique des Hautes Études and in 1898 he also took up a position at the Musée des Antiquités. It was at this time that he grew increasingly interested in Celtic history and culture.\n\nIt was also in 1898 that Hubert became a close friend of Marcel Mauss and began collaborating on the Année Sociologique of Émile Durkheim, where he eventually became responsible for the section on the 'sociology of religion'.[1][2] Hubert and Mauss were to collaborate on several important works in the future, including an \"Sacrifice: Its Nature and Function\" (1899) and their Outline of a General Theory of Magic (1904).\n\nBy 1906 Mauss was thoroughly ensconced at the Ecole Pratique, where he would remain until his death. It was also this time that he took up a post at the École du Louvre where he lectured on the ethnographic prehistory of Europe. Throughout the first two decades of the twentieth century Hubert continued to publish on both Asia and the Celts as well as more general topics. Works from this period include (in English translation) The Rise of the Celts and The Greatness and Decline of the Celts, both available in a single volume entitled The History of the Celtic People (London: Kegan Paul, Trench, Trubner 1934; reprint Bracken 1993). His follow-up work on the Germanic peoples, entitled Les Germains and published posthumously in 1952, has yet to be translated to English. Also from this period is Essay on Time: A Brief Study of the Representation of Time in Religion and Magic.\n\nDurkheim's death in 1917 affected Hubert greatly, as did the death of his wife in childbirth in 1924.[1] After years of bereavement, Hubert died in 1927.[3]\n",
  "concepts": [
    "Henri Hubert"
  ],
  "findings": [
    "Life and work",
    "Bibliography",
    "References",
    "Further reading"
  ],
  "timestamp": "2025-04-11T10:47:45.646436"
}