{
  "title": "2018 Japan–South Korea radar lock-on dispute",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/2018_Japan–South_Korea_radar_lock-on_dispute",
  "content": "1 destroyer\n\nThe 2018 Japan–South Korea radar lock-on dispute is about an incident between a Japanese airplane and a South Korean warship. The aircraft was part of the Japan Maritime Self-Defense Force (JMSDF), while the vessel was part of the Republic of Korea Navy (ROKN). The event occurred on 20 December 2018, without the firing of any weapon, and was followed by a large diplomatic dispute between Japan and South Korea. In June 2024, both countries agreed on steps to prevent a recurrence, effectively dropping the issue without resolving the exact circumstances around the event itself.\n\nAccording to the Japanese government,[3] a South Korean naval destroyer, ROKS Gwanggaeto the Great,[4] directed its STIR-180 fire-control radar at a maritime patrol aircraft, Kawasaki P-1 belonging to the Fleet Air Wing 4 of JMSDF, which was conducting surveillance off the Noto Peninsula in the Sea of Japan on Thursday 20 December 2018 at around 3:00 p.m. (JST).[3][5] According to Japan's Ministry of Defense (MOD), aiming the fire-control (FC) radar at a plane is a violation of the Code for Unplanned Encounters at Sea (CUES),[6] as a lock with the FC radar is generally considered a hostile act one step before actual firing.[7] The MOD further said the irradiation of the P-1 plane by the radar hit multiple times continuously over a certain period.[4]\n\nIn contrast, the South Korean government denied Japan's claims, stating that it was not operating a STIR-180 radar (FC radar) but MW08 radar for the rescue when the Japanese airplane arrived at the site. The MW08 radar is a 3D radar for medium-range air and surface surveillance, target acquisition and tracking, capable of gun control against surface targets.[8] MW08 can be used as an FC radar, but it is not connected with the fire-control system in the destroyer.[9][10] In addition, South Korea claimed that the Japanese aircraft made a threatening \"8-shape\" flight continuously at a distance of 500 meters (1,600 ft) and altitude of 150 meters (490 ft) while the warship was participating in the rescue of a distressed North Korean fishing boat.[11]\n\nOn 17 November 2022, the ROK Navy claimed that it had not irradiated radar.[63]\n\nOn 4 June 2023, Japanese Defense Minister Yasukazu Hamada and South Korean Defense Minister Lee Jong-sup held talks as part of the Shangri-La Dialogue in Singapore and agreed to accelerate working-level discussions to resolve the radar dispute, with a focus on outlining \"steps to prevent a recurrence\".[64]\n\nOn 2 June 2024, Japanese Defense Minister Minoru Kihara and South Korean Defense Minister Shin Won-sik met on the sidelines of the Shangri-La Dialogue and agreed to normalize relations between their respective militaries and resume defense cooperation and exchanges. Characterizing the radar lock-on dispute as an obstacle to security cooperation between Japan and South Korea, as well as tripartite cooperation with the United States, the two countries released a document detailing measures to prevent a recurrence of the incident. In the document, the JMSDF and the South Korean navy undertook to comply with the Code for Unplanned Encounters at Sea, and agreed to improve communications and build trust. No mention was made regarding the exact chain of events in the 2018 incident, effectively putting the matter to rest.[65][66][67]\n\nToshio Tamogami, a retired general and ex–chief of staff of the JASDF, has given his views on Twitter denying the offensiveness of aiming FC radar.[68] However, Toshiyuki Ito, a retired JMSDF admiral and ex-commandant of the Joint Staff College, rebutted Tamogami's view since the former had been retired for ten years and has no experience as a pilot.[69]\n\nThe South Korean government claimed this flight of P-1 was menacing and unfriendly to the warship of a neighboring country which was operating a rescue mission in the high seas. According to the South Korean government, it was Japan and not South Korea that acted improperly in this incident and should apologize.[70] However, Paul Giarra, a retired U.S. naval aviator and ex-senior Country Director for Japan in the Office of the ASD (ISA), pointed it out that there was absolutely no danger in the actions of the Japanese aircraft.[71]\n\nSome South Korean media were concerned about the friction between Seoul and Tokyo. On 7 January 2019, a JoongAng Daily editorial argued that the two governments \"should join forces to address the nuclear threats from North Korea and other urgent issues\" and that \"This emotional fighting does not help. Though what really happened at the moment has not yet been found, either side did not suffer substantial damage. Therefore, if [the South] Korean destroyer really aimed its FCR at the approaching airplane, our military authorities should apologize to Japan and wrap up the case. If the Japanese aircraft was really confused about the radar signal, it should apologize\", and that \"[i]t is time to take a deep breath and find a reasonable solution\".[72]\n\nWhile there is no international law regulating the altitude of military flights, Japan, the U.S. military, and NATO assert they follow the custom of the International Civil Aviation Organization (ICAO) to keep a distance of 150 meters (490 ft) from vessels under normal operations.[73]\n",
  "concepts": [
    "2018 Japan–South Korea radar lock-on dispute"
  ],
  "findings": [
    "Incident",
    "Timeline",
    "2018",
    "2019",
    "2022",
    "2023",
    "2024",
    "Views and opinions",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:09:34.206216"
}