{
  "title": "Brian Smyth",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Brian_Smyth",
  "content": "Brian Smyth (born 1967)[1] is an Irish figurative painter.[2] Born in Cork, Smyth studied art at the Crawford College of Art and Design in Cork, where he specialised in painting and graduated with an honours degree in art and design in 1995.[1] Subsidiary subjects included print, video and photography.[1]\n\nIn January 2000, Smyth exhibited at Lavit gallery with Tom Climent and Martin Finnin.[3] Jo Allen in Circa described Smyth's work as \"tastefully hued paintings of photographs of a pretty woman resting were slick and pleasing to the eye. But they seemed to have little to say beyond their cool, ironic stance.\"[3]\n\nMark Ewart in The Irish Times said the work of each of the three exhibiting artists was \"quite distinctive\", Smyth's colours being toned down to the point where they approached monochrome, and that his work, like Climent's, was nostalgic: \"The paintings of the reclining female figures are particularly atmospheric, the features seeming to melt into an understated, yet fluidly painted background.\"[4]\n\nHis first solo show took place in November 2001 at the Blue Leaf Gallery, Fairview, of around 25 oil paintings, mostly portraits, using film scenes, his girlfriend, and portraits by artists such as Titian, Klimt and Rembrandt as source material.[5] A concern with tone, light and character created a postmodern style, which he saw as \"timeless\".[5] In 2008 at the Lavit Gallery, Smyth curated Brian Smyth Selects, and chose five artists who, like him, work in representational painting. The artists were Patrick Cashin, Mary Clancy, Philip Lindey, Stephen Murphy, and Jennifer O’Connor.[6][7]\n\nAt the start of 2012, Smyth moved to Florence, to study at the Angel Academy of Art.  There, he developed his drawing and painting skills, working under the tutelage of John Michael Angel and Jered Wosnicki.  Working directly from the life model, in a naturalistic style, Smyth's drawings and paintings developed a new level of realism.[8]\n\nSmyth began to paint still life paintings, pushing out the boundaries of his use of colour.\n\nFrom 2013, Smyth became a student instructor, tutoring other students in Bargue drawings and sight size method cast drawings in charcoal.\nIn September 2014, Smyth became an instructor at the Angel Academy, teaching the  life drawing course to new students at the Angel Academy.\n\nSmyth's work has been exhibited in Ireland (Lavit Gallery and Buckley Fine Art, Cork, and the Oisin gallery, Dublin), the UK (Red Rag Gallery in Stow on the Wold),[1] and abroad (New York, Chicago and Switzerland).[9]\n",
  "concepts": [
    "Brian Smyth",
    "smyth",
    "gallery",
    "work",
    "paintings",
    "art",
    "artists",
    "angel",
    "painting",
    "new",
    "life"
  ],
  "findings": [
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:19.895277"
}