{
  "title": "Çandarlı Kara Halil Hayreddin Pasha",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Çandarlı_Kara_Halil_Hayreddin_Pasha",
  "content": "Çandarlı Kara Halil Hayreddin Pasha (Ottoman Turkish: چندارلی کارا حلیل خير الدين پاشا) was the first Grand Vizier of Murad I's reign. He was also technically the first in Ottoman history who held the title \"Grand Vizier\" (although several before him held equivalent but differently named offices), the first who had a military background (his predecessors under Orhan came from the class of learned men, the \"ilmiye\"), and the first member of the illustrious Çandarlı family to hold high office. His family was to mark the rise of the Ottoman Empire between 1360 and 1450.[1] He was a successful commander, setting the precedent for centuries of Ottoman presence in Albania after his victory at the Battle of Savra.\n\nHe rose to the rank of grand vizier from the position of the chief military judge (kazasker) in September 1364 and held this top seat after the sultan until his death on January 22, 1387. He died in Serrai during the Ottoman campaign on Macedonia.[2] As such, he became the grand vizier who had the longest term of administration, a record he would hold until the abolition of the position 535 years after his death in 1922. He was also notable for being the initiator of the \"devşirme\" system of recruitment in the Ottoman Empire. Çandarlı Kara Halil Pasha is not to be confused with his grandson, Çandarlı Halil Pasha the Younger, grand vizier under the reign of Murad II and during the first years of that of Mehmed II.\n\nÇandarlı Kara Halil Pasha gave the idea for the formation of elite corps of soldiers. Later they were recruited through the Devshirme, also known as the blood tax or tribute in blood. In this way, the Janissary elite infantry units were formed.[3]\n\nHe was succeeded as grand vizier by his son Çandarlı Ali Pasha. His other son, Çandarlı Ibrahim Pasha the Elder, would also later serve as grand vizier.\n",
  "concepts": [
    "Çandarlı Kara Halil Hayreddin Pasha"
  ],
  "findings": [
    "See also",
    "References"
  ],
  "timestamp": "2025-04-11T10:09:55.864121"
}