{
  "title": "Charles B. Warren",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Charles_B._Warren",
  "content": "Charles Beecher Warren (April 10, 1870 – February 3, 1936) was an American diplomat and politician. He was United States Ambassador to Japan from 1921 to 1923, United States Ambassador to Mexico in 1924, and was an unsuccessful nominee for United States Attorney General in 1925.\n\nCharles B. Warren was born in Bay City, Michigan, and graduated from the University of Michigan in 1891. During World War I, He served in the U.S. Army on the staff of the Judge Advocate General, ending his service with a rank of lieutenant colonel and a Distinguished Service Medal.[1]\n\nHe was an alternate delegate from Michigan to the Republican National Convention in 1908, 1912, and 1916, and a regular delegate in 1924, 1928, and 1932.\n\nWarren died in Grosse Pointe, Michigan, on February 3, 1936.[2] He is buried at Elmwood Cemetery in Detroit.\n\nHis wife was also a member of Republican National Committee.\n\nWarren served as U.S. Ambassador to Japan between 1921 and 1923. His arrival was eagerly anticipated in the context of an upcoming Washington Naval Conference on Far Eastern matters and armaments.[3] Kaneko Kentarō (Harvard '98), Privy Councilor to the Emperor, and president of the America-Japan Society of Tokyo, presided at a formal dinner in honor of the newly arrived Ambassador Warren; and he expressed the hope that the Washington Naval Conference would be a golden opportunity to clear away any misunderstandings and to speak frankly about Japan's aspirations.[4][5]\n\nNot all of Warren's activities were limited to conventional Tokyo events. Following the usual Thanksgiving Day celebrations in 1922, Ambassador Warren and his two sons traveled to Korea, Manchuria and Peking, and this unremarkable trip was reported in The New York Times.[6]\n\nIn late January 1923, Ambassador Warren took leave of the Empress before departing his post in Tokyo. In addition to Foreign Minister Uchida and Prince Tokugawa Iesato, the recently appointed Japanese Ambassador to the United States, Masanao Hanihara, was at the Imperial Palace reception.[7] The 1921 portrait photo to the right was taken two months prior to Warren's beginning his position as U.S. Ambassador to Japan.[8]\n\nWarren served as U.S. Ambassador to Mexico in 1924.\n\nIn 1925, President Coolidge nominated Warren to be Attorney General, but his nomination was narrowly rejected twice.[9] The first vote was originally a 40–40 tie, with Vice President Charles G. Dawes being unable to reach the Capitol in time to break the tie in Warren's favor.[10] The second vote resulted in a 39–46 vote to not confirm Warren. The votes made Warren the first cabinet nominee to be rejected by the Senate since Henry Stanbery in 1868.\n\nIn the wake of the Teapot Dome scandal, Senate Democrats and Progressive Republicans objected to the nomination of Warren, who was closely associated with the \"Sugar Trust\".[11] Michigan governor Alex J. Groesbeck, whom Coolidge had also considered for the position, was active in trying to undermine Warren's acceptance.[12][13] However, John G. Sargent was ultimately nominated and confirmed.\n",
  "concepts": [
    "Charles B. Warren"
  ],
  "findings": [
    "Life",
    "Ambassador to Japan",
    "Ambassador to Mexico",
    "Nomination for Attorney General",
    "See also",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:12:51.535049"
}