{
  "title": "Euphrosyne of Bulgaria",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Euphrosyne_of_Bulgaria",
  "content": "Euphrosyne (died before 1308) was Bulgarian empress consort (tsarina), first wife of tzar Theodore Svetoslav of Bulgaria.\n\nThe date of her birth is unknown. She was the daughter and heiress of the rich Manux[1] (Mankus[citation needed]), who was a son of Pandoleon, a Byzantine merchant from Crimea[2] and a close friend of Nogai Khan,[1] the effective leader of the Mongol Golden Horde. George Pachymeres records that the birth name of Euphrosyne was Encona[2] or Enconen[citation needed] but later she adopted the name of her god-mother Euphrosyne Palaiologina,[1] the Byzantine wife of Nogai Khan, who was herself an illegitimate daughter of Emperor Michael VIII Palaiologos.\n\nEuphrosyne married Theodore Svetoslav of Bulgaria at the court of Nogai Khan,[1] to where he was sent by his father as hostage in about 1289. Perhaps in connection with the same events, Theodore Svetoslav's sister, Elena, married Nogai's son Chaka. During part of his exile, Theodore Svetoslav became impoverished and sought to improve his fortunes by marrying the rich Euphrosyne.[1] The marriage was arranged by Euphrosene Palaiologina in order to improve the position of Svetoslav in the Mongolian court and to gain support for Svetoslav against her cousin Smiltsena Palaiologina, who ruled in Tarnovo as regent of Ivan II, son of the late Tsar Smilets.\n\nThe husband of Euphrosyne left obscurity in 1298 or 1299, when he, accompanied by his brother-in-law Chaka, invaded Bulgaria. The regency for Ivan II fled Tarnovo in 1299, and the gold of Theodore Svetoslav's wife convinced the Bulgarian nobility to open the city gate[1] and to accept Chaka as ruler. However, the armies of the new khan of the Golden Horde Toqta entered Bulgaria in pursuit of his enemy Chaka, and Theodore Svetoslav promptly organized a plot, deposing Chaka and having him strangled in prison in 1300. Theodore Svetoslav now became emperor of Bulgaria and sent Chaka's severed head as a present to Toqta, who withdrew his armies from the country.\n\nAfter the ascension of Theodor Svetoslav, Euphrosyne was proclaimed as the new empress consort (tsarina) of Bulgaria. According to the Bulgaria historian Plamen Pavlov, at this time Euphrosyne was the first crowned woman in Medieval Europe, who belonged to the third estate.[1]\n\nThe date of her death is unknown, but in 1308 Theodore married the Byzantine princess Theodora Palaiologina.\n\nThe memory of Euphrosyne is honored in the Synodic of Bulgarian Church (Obituary of Borill):\n\nFor Euphrosyne, the pious tsarina of tsar Svetoslav, may her memory live forever.[3]\nEuphrosyne and Theodore Svetoslav had at least one child, the future tsar George II of Bulgaria.\n",
  "concepts": [
    "Euphrosyne of Bulgaria"
  ],
  "findings": [
    "Family",
    "References",
    "Sources"
  ],
  "timestamp": "2025-04-11T10:16:14.267032"
}