{
  "title": "WKJV (AM)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/WKJV_(AM)",
  "content": "WKJV (1380 kHz) is a listener-supported Christian radio station licensed in Asheville, North Carolina.  It serves Buncombe, Madison, McDowell, Mitchell, Haywood, Henderson, Yancey, and Transylvania Counties.  WKJV is a ministry of International Baptist Outreach Missions, Inc., a not-for-profit organization.  The station's programming features Southern gospel music and preaching from the King James Bible. WKJV has a daytime non-directional power of 25,000 watts and a night-time directional power of 1,000 watts.\n\nWLOS began broadcasting August 11, 1947, as a Mutual affiliate on 1380 kHz with power of 5 kW (daytime) and 1 kW (night). The station was licensed to Skyway Broadcasting Corporation.[2]\n\nIn 1969, WLOS was sold to Greater Asheville Broadcasting Co., owned by the John Jenkins family of Huntington, West Virginia. As the previous owners retained WLOS-FM and WLOS-TV, the call letters were changed to WKKE; the format was MOR/Top 40.\n\nIn 1977, WKKE became WRAQ and played adult rock. In 1982, Sid Highes became program director and the format changed to Southern Gospel.\n\nIn 1988, GHB Broadcasting purchased the station and changed its letters to WTOO. In 1992, WTOO was not profitable and a format change to rock and roll was planned. Hearing this news, Pastor Doug Roland of Maple Ridge Baptist Church in Candler told some area pastors about the problem, and the decision was made to buy the station by asking listeners to contribute. In five days, $53,000 was raised. Anchor Baptist Broadcasting, which also runs WGCR, took over the station and the call letters WKJV were selected, referring to the King James Version of the Bible.\n\nInternational Baptist Outreach Missions took over in 1997. In September 2001 the signal increased to 25,000 watts. WKJV can now be heard in parts of South Carolina and Tennessee.[3] On July 17, 2013, the former WFGW, after being purchased by I.B.O.M., became WKJW.\n\nThis article about a radio station in North Carolina is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "WKJV (AM)",
    "station",
    "wkjv",
    "broadcasting",
    "wlos",
    "baptist",
    "000",
    "watts",
    "power",
    "letters",
    "format"
  ],
  "findings": [
    "History",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:11.076468"
}