{
  "title": "Corrientes campaign",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Corrientes_campaign",
  "content": "The Corrientes campaign or the Paraguayan invasion of Corrientes was the second campaign of the Paraguayan War. Paraguayan forces occupied the Argentinian city of Corrientes and other towns in Corrientes Province. The campaign occurred at the same time as the Siege of Uruguaiana.\n\nArgentina and Uruguay declared war against the Paraguayan invaders, who were already at war with the Empire of Brazil, and signed the Treaty of the Triple Alliance. The Paraguayan invasion of Argentina failed, but led to the invasion of Paraguay in later campaigns.\n\nIn the early 1860s, liberal parties took power during civil wars in Argentina and Uruguay. In Argentina, General Bartolomé Mitre assumed the presidency in 1862.[4] Mitre and Uruguayan General Venacio Flores were allied with the Empire of Brazil, and Flores launched a rebellion to take power with Brazilian and Argentinian support.\n\nFaced with the advance of liberal forces backed by the empire, the conservative Paraguayan government of Marshal Francisco Solano López anticipated that Brazil and Argentina would try to incite a civil war in Paraguay. Solano Lopez, on the other hand, wanted to influence the other countries in the Río de la Plata basin.\n\nThe Brazilian- and Argentinian-backed invasion of Uruguay by Flores motivated López to demand the withdrawal of foreign forces from Uruguay at the Uruguayan government's request. \nThe Paraguayan invasion of Mato Grosso was a success, but the Partido Blanco government in Uruguay was defeated and General Flores assumed the presidency.\n\nLópez asked Argentinian president Bartolomé Mitre to allow his troops to cross Corrientes Province towards the Uruguay River to restart the civil war in Uruguay and attack the Brazilian province of Rio Grande do Sul. López told Mitre that Argentina was neutral in the conflict between Paraguay and Brazil (as it had been in the Uruguayan Civil War) and, since he had allowed Uruguayan rebel troops and the Brazilian navy to cross Argentine territory and jurisdictional waters, López could expect the same authorization for Paraguayan troops going to Brazil or Uruguay. Mitre refused, saying that he could not allow the passage of troops through his territory and remain neutral.\n\nParaguay invaded and occupied Mato Grosso, although Brazil had claimed some of that territory. Paraguay had little or no communication with the rest of Brazil, so Paraguayan troops could not further advance into Brazil to force it to surrender or negotiate. For results in Uruguay or to prevent further attacks on Paraguayan territory, it had to continue the war in the province of Rio Grande do Sul.\n\nBefore Mitre's refusal, López had planned to concentrate his forces along the Uruguay River to attack Brazil or enter Uruguayan territory. When war was declared on Argentina, however, he needed to prevent the Argentine Army from hindering the Paraguayan advance with a diversionary maneuver along the Uruguay River. The objective was to occupy the city of Corrientes, a strategy that would also make it possible to control the upper Paraná River, leaving communications open through Corrientes Province.\n\nBetween the decision to invade and the troop advance, López decided to use troops occupying the capital of the invaded province to support the passage on the Uruguay River. Instead of concentrating most of the troops in this last column, he formed an army of only about 12,000 men and sent 25,000 soldiers to the Paraná River.\n\nBefore implementing his plan, López sent Lieutenant Cipriano Ayala to deliver the declaration of war to Buenos Aires. War was declared on 18 March 1865, and was published in Asunción a week later. The attack would be launched after the expected delivery date of the declaration of war but before the news arrived back in Paraguayan territory to give the disorganized, under-equipped Argentine army no time to react. The messenger carrying the declaration of war met with many obstacles, however, and the Argentine public learned about the invasion of Corrientes before it heard about the declaration of war.\n\nAt dawn on 13 April 1865, a squadron of five Paraguayan steamboats appeared at the city of Corrientes with a landing party of 2,500 under the command of Commander Pedro Ignacio Meza. They passed the city headed south, then turned north and attacked the Gualeguay and the 25 de Mayo (Argentine steamers in port for repairs); the 25 de Mayo had a crew of 80 men. The crews of two Paraguayan ships boarded the Argentine ships, and captured them after a skirmish with some casualties. About 3,500 to 4,000 men landed and occupied the city the following day.\n\nAfter the attack, residents led by Desiderio Sosa [es] constructed a defense on the roofs of houses closest to the port. The attacking fleet withdrew, and an attempt was made to organize battalions under Colonel Solano González; volunteers were summoned to the Plaza 25 de Mayo and the Plaza del Mercado.[5]\n\nParaguayan general Wenceslao Robles had settled in Paso de Patria with more than three thousand men, awaiting the Paraguayan fleet after it attacked Corrientes. Robles loaded as many soldiers as he could; the small Paraguayan squadron returned to Corrientes at dawn on 14 April, taking possession of the city square without any resistance. Shortly afterward, the column from Paso de la Patria arrived under Robles and the rest of the invading forces. The 25 de Mayo and Gualeguay did not return to Corrientes, since they had been incorporated into the Paraguayan Navy and sent to Asunción for repairs.[6]\n\nThe Argentine authorities withdrew with the few battalions, which could not resist the invading Paraguayan forces. Withdrawing to the interior was their only option to reorganize under Nicanor Cáceres, who harassed the invaders and kept the troops loyal to Governor Manuel Lagraña.[7]\n\nCorrientes reacted in two different ways. Some residents fled to rural areas away from the city, to country houses in Lomas; others crossed the Paraná and took refuge in the interior of the Chaco Territory. The rest, a significant fraction of the population, did not resist the Paraguayan troops. A contemporary chronicler wrote that the city's inhabitants were not hostile to the invaders, which made it easier for them to receive good treatment (unlike the abusive treatment carried out in other occupied territories).[6]\n\nParaguayan control of the square was irreversible in principle, so Governor Lagraña, his closest collaborators, and security groups moved to rural areas to avoid being taken prisoner. Before he withdrew, Lagraña ruled that every citizen of Corrientes between sixteen and seventy years of age was required to enlist and fight the occupation forces.[6]\n\nIn the afternoon, a column of 800 cavalry arrived by land and entered the city. Robles met with a popular assembly apparently consisting of members of the Federalist Party and other opponents of the national government. A provisional government was formed by Teodoro Gauna, Víctor Silvero [es] and Sinforoso Cáceres. Local political action was carried out by Cáceres, but the triumvirate was limited to endorsing the activities of the Paraguayan commissioners José Berges, Miguel Haedo and Juan Bautista Urdapilleta in commercial matters and relations with Paraguay.\n\nThe Federalist Party leaders in the capital initially supported the Paraguayan occupation as allies in their attempt to recover the political dominance they had lost at the end of 1861 after the Battle of Pavón and the Corrientes revolution. Colonel Cayetano Virasoro stood out, although he was later accused of collaborating with the Paraguayans. The Paraguayan troops continued to receive reinforcements, reaching just over 25,000 men over the following days.\n\nLagraña assembled the province's population and summoned all males between 17 and 50 years of age to arms. He entrusted Colonel Desiderio Sosa with the military organization of the capital and its surroundings, and settled in the nearby town of San Roque. Lagraña gathered about 3,500 volunteers, many of whom had no military experience and very little equipment. He was joined a few weeks later by General Nicanor Cáceres, who arrived from the Curuzú Cuatiá area and contributed about 1,500 men (almost all veterans).\n\nThe presence on the governor's side of Cáceres, who (despite his ambiguous record) was considered to belong to the Federalist Party, cooled federal enthusiasm for the invaders and deprived them of provincial support. As the Paraguayan army began its advance south, Lagraña and his army had to withdraw to Goya.\n\nIn the early hours of 11 July 1865, Paraguayan soldiers kidnapped Toribia de los Santos, Jacoba Plaza, Plaza's son Manuel, Encarnación Atienza, Carmen Ferré Atienza and her daughter Carmen, Victoria Bar and wives of the Corrientes resistance leaders from their homes. The occupation of Corrientes was difficult for its inhabitants. In his essay La toma de Corrientes, Wenceslao Domínguez wrote:\n\nThe slightest suspicion was enough for summary trial if there was one, and the slightest reason for Argentine patriotism was punished with the death penalty. It would be long to detail the conditions of the gloomy outing in Corrientes; and besides, it is also quite well known.\nIn his book Historia ilustrada de la provincia de Corrientes, historian Antonio Emilio Castello wrote: \n\nThe city of Corrientes dragged out a miserable existence immersed in fear of accusations, abuses, and captivity in Paraguayan prisons. One day the invaders carried out a ferocious massacre of the Chaco Indians in the streets of Corrientes. The poor Indians had been selling firewood and grass for years, from house to house. As some of them refused to receive Paraguayan paper money, they were exterminated with sabers and bullets in broad daylight.\nThe population of the big cities denounced the invasion, which they saw as unjustified and treacherous. President Mitre's speech, delivered the day that news of the attack arrived in Buenos Aires, included the later-reviled phrase \"In 24 hours to the barracks, in fifteen days in Corrientes, in three months in Asunción!\" and fueled the desire for revenge. Many young men rushed to enlist in regiments created for the war. The same thing happened in Rosario, and to a lesser extent in Córdoba and Santa Fe. The reaction in the rest of the country was very different; only the most determined supporters of the ruling party publicly opposed the Paraguayan attack.\n\nEntre Ríos Province opposed the national government. Respecting his previous commitments, governor and former president Justo José de Urquiza assembled a provincial army of 8,000 men and moved it to the northern border of the province. When they reached Corrientes in July 1865, soldiers who had believed that they were going to fight on the Paraguayan side rose up in the Disbandment of Basualdo [es] and deserted en masse. The central government refrained from reprisals against the rebels. Urquiza recruited about 6,000 soldiers from the provincial forces who had a reputation as excellent cavalry troops, but they disbanded in the Disbandment of Toledo [es] in November 1865. This second rebellion was harshly repressed with the help of Brazilian and Uruguayan troops.[8]\n\nOn 1 May, the Treaty of the Triple Alliance was signed by Argentina, Uruguay, and Brazil. The speed with which an agreement was reached makes a number of historians suspect that the treaty had been prepared in advance.\n\nMitre gathered the available troops in Buenos Aires, Rosario, and San Nicolás de los Arroyos, and moved a strong division north aboard the war fleet. He ordered each provincial government to provide a large contingent of infantry forces to reinforce the enlisted troops. Most of the cavalry who served in the frontier forts with indigenous people in the south of the country were also sent north.\n\nIn late April, the Paraguayan army slowly advanced south along the Paraná River and seized Bella Vista, Empedrado, Santa Lucía, and Goya. During the advance, the Corrientes forces engaged in guerrilla warfare and established ambush points on the roads. Battles at Caá Catí and Naranjito consolidated the route along the rivers, since the center and south of Corrientes Province remained under government control with a new capital in San Roque. In a battle on 10 May, Colonel Fermín Alsina led 800 men and was defeated by about 5,000 Paraguayans. In the Battle of Palmira nine days later, Colonel Manuel Vallejos realized that the Paraguayan troops could not confront an organized army. That battle and the Battle of Corrientes, led by General Wenceslao Paunero, were crucial to stopping the Paraguayan troops on the Paraná. San Roque, from which the governor of Corrientes exercised local power, prevented movement towards the center. The Imperial Brazilian Navy, in control of the Paraná River, prevented assistance by water.\n\nPart of the Allied squadron arrived at Corrientes on 25 May, with 725 men led by Paunero. The four battalions were commanded by Juan Bautista Charlone, Ignacio Rivas, and Adolfo Orma [es]; Manuel Rosetti, with an artillery squad, was also part of the division.\n\nCharlone's battalion attacked without waiting for reinforcements, interposing themselves between the fleet and the Paraguayan defenders and preventing the use of artillery. When the other battalions landed, the Argentines advanced towards the city in street-by-street fighting. The Paraguayans were defeated and expelled from the city, with about 400 dead; the Argentines had 62 dead and dozens wounded.\n\nThe Paraguayans, commanded by Major José del Rosario Martínez, withdrew towards Empedrado to reorganize and receive reinforcements; a large division was advancing from Paso de la Patria toward the capital. General Cáceres refused to advance in support of the Argentinians despite the insistence of General Manuel Hornos, who had joined his forces with cavalry. Although this decision made it difficult for Paunero's men to resist the expected counterattack, their presence in the south of the province prevented the Paraguayan division which had occupied Goya and Santa Lucía from advancing to support the Uruguay River.\n\nWithout prior warning or taking advantage of his military position, Paunero left with his troops at dawn on the 27th. At the request of Governor Lagraña and General Hornos, Paunero agreed to land in the south of the province at the town of Esquina.\n\nThe Paraguayan troops subjected the population to violent repression because they suspected them of aiding Paunero's troops. On 11 July, they took five wives of resistance leaders hostage and brought them to Paraguayan territory. Four returned in 1869 after harsh treatment, but Colonel Desiderio Sosa's wife died in Asunción.\n\nA Brazilian squadron was stationed near the city of Corrientes, blocking the Paraguayan fleet from the Paraná. The squadron consisted of nine ships, almost all battleships, commanded by Francisco Manuel Barroso.\n\nMarshal López organized a plan of attack o",
  "concepts": [
    "Corrientes campaign"
  ],
  "findings": [
    "Background",
    "Military situation",
    "Plans",
    "Occupation of Corrientes",
    "Argentine reaction",
    "Paraguayan advance",
    "Battle of Riachuelo",
    "Uruguay campaign",
    "Battle of Yatay",
    "Siege of Uruguaiana",
    "Paraguayan withdrawal",
    "Battle of Pehuajó",
    "Aftermath",
    "See also",
    "References",
    "Bibliography"
  ],
  "timestamp": "2025-04-11T10:10:10.457717"
}