{
  "title": "Robert Alstead",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Robert_Alstead",
  "content": "Robert Alstead OBE JP (23 October 1873 – 9 September 1946) was a self-made businessman in the clothing trade and a Liberal Party politician in the United Kingdom.\n\nAlstead was born in Upholland, Lancashire, the son of a joiner and carpenter. He was educated at Wigan Elementary School and Wigan Mining Technical College.[1] In 1896, he married Sarah Ann Deakin of Wigan.[2] He and his wife had 7 children, 6 boys and a girl.[1]\n\nAlstead started life as a newsboy on a railway book stall at the age of 10.[3]  He became a self-made businessman. He was a sauce and pickle manufacturer in the 1890s, then moved into the clothing trade, eventually owning a chain of shops tailoring for men in the Wigan area and founding Robert Alstead, Ltd, woollen manufacturers and clothing manufacturers.[4]\n\nAlstead was an elected member of Wigan Town Council from 1913 to 1929 and was Mayor of Wigan in 1926–27. He was a governor of Wigan Grammar School and a governor of the Wigan Mining Technical College between 1913 and 1932. He also served as a Justice of the Peace.[4]\n\nAlstead unsuccessfully contested the Wigan parliamentary constituency at the 1918 general election.\n\nHe next contested Altrincham in Cheshire at the 1922 general election. The Liberals had not contested Altrincham at the previous election in 1918 when a Labour candidate challenged the sitting Unionist. Despite this disadvantage, Alstead was easily able to push the Labour candidate into third place;\n\nAnother General Election took place a year later, fought on the issue of Free trade v Protectionism. Across the country there was a swing away from the Unionists and in Altrincham this helped Alstead, as the only challenger, to take the seat. He was the first Liberal to win Altrincham since January 1910.\n\nWith only a Labour minority government in office, another General Election was called a year later. With the Unionists regaining ground across the country, Alstead was defeated at Altrincham.\n\nAfter 4 years of Unionist majority government which included a General Strike, the Liberal Party, now led by David Lloyd George, were challenging strongly again and Alstead had hopes of regaining Altrincham. However, this time, Alstead faced a Labour candidate as well as a Unionist, making winning the seat too difficult. \n\nHe did not contest the 1931 general election, when Atkinson was returned unopposed as a supporter of the National Government. Alstead did not stand for Parliament again, although he was prospective Liberal candidate for Preston in 1934–1935, but pulled out the month before the 1935 election.[5]\n\nHe received the Order of the British Empire in the 1939 New Year's Honours List.[6]\n\nAlstead died at Gathurst, near Wigan, on 9 September 1946, aged 72 years.\n",
  "concepts": [
    "Robert Alstead",
    "alstead",
    "wigan",
    "election",
    "general",
    "altrincham",
    "general election",
    "liberal",
    "labour",
    "candidate",
    "year"
  ],
  "findings": [
    "Family and education",
    "Career",
    "Politics",
    "Local politics",
    "Parliament",
    "Honours",
    "Death",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:30:32.878178"
}