{
  "title": "2014 XL7",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/2014_XL7",
  "content": "2014 XL7 is a near-Earth object and Apollo asteroid, approximately 230 meters (750 feet) in diameter. It was the most dangerous potentially hazardous asteroid on Sentry Risk Table upon its discovery by the Mount Lemmon Survey in December 2014.[7] At the time, the asteroid had a cumulative 1 in 83000 chance of impacting Earth on 4–5 June between the years 2048 and 2084.[4] After the object's observation arc had been extended to 35 days, it was removed from the Sentry Risk Table on 15 January 2015.[8] Since then the asteroid's orbit has been secured. Although it has an Earth minimum orbit intersection distance of less than one lunar distance, there are no projected close encounters with Earth in the foreseeable future, with its closest passage to occur in May 2046, still millions of kilometers away.[9]\n\nOn 1 September 2014, the asteroid passed about 0.259 AU (38,700,000 km; 24,100,000 mi) from Earth,[9] but remained undetected as at that time the asteroid had an apparent magnitude of 25 and was roughly 25° from the Sun.[10] It was discovered on 11 December 2014, by the Mount Lemmon Survey at an apparent magnitude of 20 using the Steward Observatory's 1.52-meter (60 in) reflecting telescope at Mount Lemmon Observatory near Tucson, Arizona, and received the provisional designation 2014 XL7.[1]\n\nWith an observation arc of only 19 days, it had a cumulative Palermo Scale rating of –2.85 and was briefly the 9th most dangerous asteroid known.[7] It was calculated that on 4 June 2065, there was a 1 in 270,000 chance of impact and on 4 June 2076, there was a 1 in 137,000 chance of impact.[4] On 15 January 2015, the asteroid was recovered by Cerro Paranal Observatory which extended the observation arc to 35 days,[2] and 2014 XL7 was subsequently removed from the Sentry Risk Table using JPL solution 9.[8]\n\nAs of 2021[update], and last observed in November 2016, the asteroid has a better constrained orbit with an observation arc of 713 days and an uncertainty parameter of 2, which ranges from 0 (good) to 9 (highly uncertain).[2][3] It has an apparent magnitude of 25.82,[6] and orbits the Sun at a distance of 0.77–2.5 AU once every 2 years and 2 months (777 days; semi-major axis of 1.65 AU). Its orbit has an eccentricity of 0.53 and an inclination of 8° with respect to the ecliptic.[3] The potentially hazardous asteroid has a minimum orbit intersection distance with Earth of 0.00217 AU (325,000 km; 0.844 LD), or less than the distance to the Moon. Its closest encounter with Earth will occur on 29 May 2046, at a nominal distance of 13,875,000 km; 8,622,000 mi (0.09275 AU).[9] With an absolute magnitude of 21,[3] the asteroid is approximately 170–380 meters (560–1,200 feet) in diameter.[5][a]\n",
  "concepts": [
    "2014 XL7"
  ],
  "findings": [
    "Discovery",
    "Palermo Scale rating",
    "Orbit and classification",
    "Notes",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:19:55.784841"
}