{
  "title": "Caroline-Barbe Colchen Carré de Malberg",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Caroline-Barbe_Colchen_Carré_de_Malberg",
  "content": "Caroline-Barbe Colchen Carré de Malberg (8 April 1829 - 28 January 1891) was a French Roman Catholic from Metz who founded both the Salesian Missionaries of Mary Immaculate and the Association of Saint Francis de Sales (1872).[1] She married in 1849 to her first cousin and co-founded the association with the Servant of God Henri Chaumont and the missionaries with the Servant of God Félice Gros.[2]\n\nHer beatification process commenced in 1909 under Pope Pius X and culminated in 2014 after Pope Francis named her Venerable following the recognition of her life of heroic virtue.[3]\n\nCaroline-Barbe Colchen Carré de Malberg was born on 8 April 1829 in France to as the second child to the middle-class Françcois Dominique Colchen Victor and Élisabeth-Charlotte Simon.[2] She was baptized in the Church of Saint Martin on 11 April 1829. In her childhood her father had her promise not to miss invoking the intercession of the Blessed Mother; her father served as the regional President of the Society of Saint Vincent de Paul.[1]\n\nShe was related to Jean-Victor Colchen (1751-1830) and Claude Nicolas Colchen (1755-1833) who were both cousins of Jean-Pierre Lubin Colchen - her grandfather.\n\nIn 1841 she began to attend school in Metz and had a long period in which she suffered from typhoid; her studies ended in 1846. Her confessor around that time was the priest Jegou who realized her sincerest desire for personal holiness; the two kept in close contact and the priest was decisive in her realizing her vocation. She felt drawn to a life with the Carmelites as a nun but decided she would not be able to bear it due to her ill health.[3]\n\nIn 1846 she returned to her hometown and her parents began to prepare her for marriage. Her cousin - Paul Carré (b. 1824) - asked her parents to organize such a marriage with her in 1848 and she replied to this without hesitation in the affirmative. The pair married on 2 May 1849 despite the fact that the two were almost strangers to each other. The two relocated to Paris due to her husband being stationed at the local garrison there. The couple's children died in their childhood save for their son Paul.[2] The children included:\n\nMarie-Therese's death prompted her to go to the confessional of the Servant of God Father Henri Chaumont and she told him of her deep sufferings. She befriended Chaumont at this point as well as female officers that her husband knew from the garrison. Chaumont encouraged her to bring people together in a group to form a religious congregation but the conflict of 1870 halted these meetings though resumed after it had ended.[3] In September 1872 the group met to invoke the patronage and guidance of Saint Francis de Sales for their project while the order was established in its first meeting of 15 October 1872 in Paris. She and Chaumont began finalizing aspects of the rule alongside two married friends of hers.[1]\n\nShe also established the Salesian Missionaries of Mary.[2] She blessed four missionaries who left for Nagpur in India on 13 October 1869 as catechists which included the Servant of God Felicé Gros.[1] Her son Paul was admitted to the Paris War College - much like his father - but suffered fatal injuries after a riding accident and he died on 5 June 1855. This aggravated her condition for she suffered from cancer since 1879.[3]\n\nDuring the Franco-Prussian War of 1870 she attended to her ill brother in Luchon.[2]\n\nShe died at 10:00am on 28 January 1891 due to cancer; her remains were later transferred on 5 August 1899. Her husband outlived her. The Association of Saint Francis de Sales - which received full approval from Pope Pius X in 1911 - now operates in places such as Bangladesh and in the Philippines with a worldwide number of 2700.[1][2]\n\nThe beatification process commenced in both Metz and Paris in an informative process that spanned from 1895 until 1898. A team of theologians granted their assent to her collection of religious writings on 2 June 1909, declaring them to be orthodox in nature and not in contradiction with the Catholic faith.[4] The apostolic process opened in both Metz and Paris and spanned from 1911 until 1912. The Congregation of Rites validated the process on 18 December 1929.[citation needed]\n\nThe formal introduction of the cause came under Pope Pius X on 23 June 1909, granting Malberg the title of Servant of God.[4]\n\nThe Congregation for the Causes of Saints took possession of the Positio dossier in 1997 and sent it to the team of historians to determine whether or not obstacles existed that would impede upon the progression of the cause; the historians voted in favor of the cause on 6 March 2001 while passing it onto consulting theologians a decade later on 16 March 2012 for their own assent. The C.C.S. voted in favor of the cause on 21 January 2014.[citation needed]\n\nColchen was proclaimed to be Venerable - on 9 May 2014 - after Pope Francis recognized that she had lived a model life of heroic virtue.\n\nThe current postulator assigned to the cause is the Rev. José Carlos Briñón Dominguez.[citation needed]\n",
  "concepts": [
    "Caroline-Barbe Colchen Carré de Malberg"
  ],
  "findings": [
    "Life",
    "Beatification process",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:14:12.123581"
}