{
  "title": "Ogden Raptors",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Ogden_Raptors",
  "content": "The Ogden Raptors are an independent baseball team of the Pioneer League, which is not affiliated with Major League Baseball (MLB) but is an MLB Partner League. They are located in Ogden, Utah and play their home games at Lindquist Field.\n\nPitcher Ben Sheets, first baseman Prince Fielder, shortstop J. J. Hardy and third baseman Bill Hall formerly played for the Raptors. Hall of Famer Frank Robinson played for the Ogden Reds, a previous Ogden franchise in the Pioneer League. The Raptors' inaugural 1994 season is chronicled in the book Minor Players, Major Dreams (1997, University of Nebraska Press) by author-in-uniform Brett Mandel. [citation needed]\n\nDuring their second season of play the Raptors set a league record for most runs scored in a single game, defeating the Helena Brewers 33–10 on August 27, 1995.[1]\n\nThe official mascot of the Ogden Raptors minor league baseball team is Oggie. Oggie is a cartoon green raptor who wears the white home uniform with a \"#\" as the number. He is a regular part of Raptors' home games and events.\n\nBefore they arrived in Ogden, the team was known as the Pocatello Posse and played in Pocatello, Idaho.\n\nOn September 17, 2017, the Raptors beat the Great Falls Voyagers 8–3 to win their first ever Pioneer League championship.[2]\n\nIn conjunction with a contraction of Minor League Baseball in 2021, the Pioneer League, of which the Raptors have been members since 1994, was converted from an MLB-affiliated Rookie Advanced league to an independent baseball league and granted status as an MLB Partner League, with Ogden continuing as members.[3]\n\nPitchers\n\nUtility players\n\nCatchers\n\nInfielders\n\nOutfielders\n\nManager\n\nCoaches\n\n Disabled list\n‡ Inactive list\n§ Suspended list\n\n[4] Roster updated June 29, 2024\nTransactions\n",
  "concepts": [
    "Ogden Raptors"
  ],
  "findings": [
    "Playoffs",
    "Major League alumni",
    "Roster",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:11:50.019388"
}