{
  "title": "Noppon Saengkham",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Noppon_Saengkham",
  "content": "Noppon Saengkham[needs  IPA] (Thai: นพพล แสงคำ; born 15 July 1992) is a Thai professional snooker player. Since turning professional in 2010, he has reached one ranking final (the 2023 Scottish Open) in which he finished as runner-up to Gary Wilson.\n\nIn April 2009, Saengkham lost in the final of the ACBS Asian Under-21 Snooker Championship 1–5 to Zhang Anda.[2] He went one better at the 2009 IBSF World Under-21 Snooker Championship by claiming the title with a 9–8 win over Soheil Vahedi in the final. It also secured his place on the main snooker tour for the 2010/2011 season.[3]\n\nHe lost his first three matches as a professional, only picking up one frame in the process before beating Luca Brecel 3–1 in qualifying for the 2010 World Open.[4] He lost to Martin Gould 0–3 in the next round and could only win one more match in the next six months.[4] The closest he came to qualifying for a ranking event came at the Welsh Open where he beat Matthew Couch 4–2 and Adrian Gunnell 4–0, but then lost 1–4 to Nigel Bond.[5] Saengkham ended his first season ranked world number 92 which relegated him from the tour.[6]\n\nSaengkham did not play a match in a professional snooker event during the 2011/2012 season.[7] In the 2012/2013 season he came through Group G of the 2012 Six-red World Championship, but then lost 5–6 to Graeme Dott in the last 32.[8] He was awarded a wildcard for the 2013 World Open and lost 4–5 to Mark Joyce.[8] In April he won the ACBS Asian Under-21 Snooker Championship by defeating Pakistan's Mohammad Majid Ali 6–5 on the final pink. The title earned him a place back on the snooker tour for the 2013/2014 season.[9]\n\nIn qualifying for the 2013 Australian Goldfields Open, Saengkham beat Andrew Pagett 5–3 and Thanawat Thirapongpaiboon, Anthony McGill and Jamie Jones all by 5–1 scorelines to reach the main draw of a ranking event for the first time in his career. He played Stuart Bingham in the first round and lost 5–1.[10] He also won through to the last 32 stage of the UK Championship with victories over Tom Ford and Sean O'Sullivan, before being beaten 6–2 by Shaun Murphy.[11] Saengkham made it to the second round of the Welsh Open and World Open, but lost to multiple ranking event winners in Mark Allen and Mark Selby respectively.[10] Saengkham's season ended when he was edged out 10–9 by Vinnie Calabrese in the first round of World Championship qualifying.[10] He finished the season ranked world number 84.[12]\n\nSaengkham defeated Alfie Burden 6–4 to qualify for the International Championship and beat Stephen Maguire 6–5, before losing in another deciding frame in the second round to Xiao Guodong. He was knocked out in the first round of the UK Championship 6–1 by Luca Brecel.[13] Saengkham eliminated David Grace, Mitchell Mann, Ross Muir and Kurt Maflin at the Lisbon Open to reach his first quarter-final in a ranking event, where he lost 4–2 to Maguire.[14] He was unable to build on this during the rest of the season as he lost eight of his last nine matches with his only win coming against German amateur Lukas Kleckers in the first round of World Championship qualifying.[13] Saengkham finished the year outside of the top 64 in the world rankings (he was 71st), but his good play in the European Tour events saw him placed 43rd on the Order of Merit to earn a new two-year tour card.[15][16]\n\nIn his homeland, Saengkham beat the likes of reigning world champion Stuart Bingham and ranking event winners Michael White and Joe Perry to play in the semi-finals of the 2015 Six-red World Championship, where he lost 7–3 to compatriot Thepchaiya Un-Nooh.[17] A 6–2 win over Stephen Maguire saw him qualify for the International Championship for the second year in a row, but he was knocked out 6–4 by Oliver Lines in the opening round.[18] He lost 6–5 and 4–3 in the first rounds of both the UK Championship and Welsh Open to Xiao Guodong and Fergal O'Brien respectively. Saengkham won a deciding frame against Lines to qualify for the China Open.[18] He shocked Neil Robertson 5–3 in the first round and then beat Ben Woollaston 5–4 and Graeme Dott 5–1 to make the quarter-finals of a ranking event for the first time.[19] A bad start from Saengkham saw him lose the opening four frames to John Higgins, but he then pulled it back to 4–3. Saengkham missed a yellow in the next frame and would be defeated 5–3.[20] His final match of the season was a 10–8 loss to Dott in the second round of World Championship qualifying.[18]\n\nSaengkham had to wait until October to win his first match of the season in the main draw of a ranking event when he beat Michael Georgiou 4–1 at the English Open. He lost 4–0 to Xiao Guodong in the second round. A 6–0 thrashing of Ken Doherty saw him reach the second round of the UK Championship, where he made a 131 break to lead John Higgins 3–2, before going on to be defeated 6–4.[21] He reached the last 32 of the Scottish Open by beating Craig Steadman and Aditya Mehta, but he was whitewashed 4–0 by Judd Trump. Saengkham defeated Tom Ford 5–3 to qualify for the China Open. A 5–3 victory against Robert Milkins followed and he then lost 5–2 to Stuart Bingham.[22] After Saengkham overcame Jak Jones 10–5 and Anthony Hamilton 10–9 he was one win away from qualifying for the World Championship. He overturned a 6–3 deficit against Lee Walker to win 10–8 and met Neil Robertson in the first round.[23] Saengkham lost the opening session 8–1 and, though he won three of the next four frames, he was defeated 10–4.[24] The run meant he finished the season 64th in the world rankings.[25]\n\nHis 2017–18 season began positively, reaching the last 32 of the opening Riga Masters event where he lost 4-2 to Sam Baird. He also reached this stage at the Northern Ireland Open, UK Championship and Scottish Open.[26] At the Welsh Open, he recorded the best ranking performance of his career by reaching the semi-finals including notable wins over Judd Trump and Kyren Wilson. He was defeated 6-4 by Barry Hawkins.[27] He finished his season by losing to Hossein Vafaei in World Championship qualifying, but reached his then-highest ranking of 52 at the end of the season.[26]\n\nSaengkham picked up where he left off the following season. He reached a ranking semi-final for the second time, this time at the World Open where, in the last 16, he recorded an impressive 5-4 victory against Mark Selby on the final black in a match which lasted 4 hours and 26 minutes.[28] In the semi-final against Mark Williams, he was 5-2 up and one frame from his first appearance in a ranking final, but lost 6-5.[29] He followed this up with another impressive run in the English Open, reaching the quarter-finals where he lost 5-3 to Stephen Maguire.[30] He also lost to Williams 6-3 in the UK Championship, before suffering back-to-back defeats to Mark Selby in the last 16 of the World Grand Prix and the last 32 of the Welsh Open. Although ending the season on a low note after losing to Zhao Xintong in World Championship qualifying, he continued to climb up the rankings, reaching a then-career high of 38.[30]\n\nHis 2019–20 season was a bit quieter, and by the time of the World Championship, his best ranking performance over the course of the season was reaching the last 16 of the China Championship, where he lost 5-2 to David Gilbert.[31] In the World Championship, postponed to July and August 2020 due to the COVID-19 pandemic, he recorded qualifying victories over Michael White and Eden Sharav before being drawn against former world champion Shaun Murphy in the last 32. Saengkham won 10-4 to record his first victory at the Crucible.[32] Facing Mark Selby in the last 16, he lost out 13-12 on a deciding frame in a tremendous match.[33] He also broke into the top 32 of the rankings for the first time, being ranked 32 at the end of the season.[31]\n\nIn a season played behind closed doors due to the COVID-19 pandemic, Saengkham's best showing was a last 16 finish at the Northern Ireland Open held in Milton Keynes where he was defeated 4-2 by Scott Donaldson.[34] His season ended on a disappointing note as a positive COVID test forced him to withdraw from the World Championship.[35]\n\nHe managed to recapture a bit of form the following season, and at the UK Championship he recorded victories over Aaron Hill, Ali Carter and Stuart Bingham to meet Ronnie O'Sullivan in the last 16. In a hard fought match and despite leading 3-2 he lost out 6-3.[36] After missing out on the World Championship the previous season, he managed to find some redemption by qualifying for the 2022 edition after defeating Daniel Wells 6-3 and Robert Milkins 10-8.[37] In the last 32, he faced Luca Brecel and won 10-5, recording two centuries in the process.[38] Facing four-time world champion John Higgins in the last 16, Saengkham was defeated 13-7.[39] After dropping to 44 at the end of the previous season, his ranking had now improved again to 37.[37]\n\nAt the British Open, Saengkham recorded victories over Fraser Patrick, Zhao Xintong, Jordan Brown and Jamie Jones to set up his first ranking semi-final since the 2018 World Open.[40] In the semi-final against Mark Allen, he was comfortably outplayed in a 6-1 defeat.[41] The rest of 2022 was largely uneventful but he did qualify for the 2023 World Grand Prix. He defeated Mark Selby 4-1 in the opening round[42] before defeating Ronnie O'Sullivan 4-2 in the last 16, a result which he said left him feeling \"over the moon\".[43] He then defeated Mark Williams 5-3 in the quarter-final[44] to set up another semi-final with Mark Allen. However he lost out again 6-1 in a relatively one-sided match.[45] After coming through a final frame decider against Zhang Anda in the final round of qualifying for the World Championship, he was drawn against Jack Lisowski in the last 32 where he lost 10-7.[46] For the second time, he finished the season inside the top 32 of the rankings, at 27.[40]\n\nSaengkham's daughter was born in April 2022 in Thailand[47] He couldn't attend the birth, as he was competing in his first round match against Belgian Luca Brecel at the 2022 World Snooker Championship.\n",
  "concepts": [
    "Noppon Saengkham"
  ],
  "findings": [
    "Career",
    "Early years",
    "Professional debut",
    "2013–14 season",
    "2014–15 season",
    "2015–16 season",
    "2016–17 season",
    "2017–18 season",
    "2018–19 season",
    "2019–20 season",
    "2020–21 season",
    "2021–22 season",
    "2022–23 season",
    "Personal life",
    "Performance and rankings timeline",
    "Career finals",
    "Ranking finals: 1",
    "Pro-am finals: 1",
    "Amateur finals: 4 (2 titles)",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:23:46.303702"
}