{
  "title": "Kirklees",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Kirklees",
  "content": "Kirklees is a metropolitan borough of West Yorkshire, England. The borough comprises the ten towns of Batley, Birstall, Cleckheaton, Dewsbury, Heckmondwike, Holmfirth, Huddersfield, Meltham, Mirfield and Slaithwaite. It is governed by Kirklees Council. Kirklees had a population of 422,500 in 2011; it is the third-largest metropolitan district in Yorkshire by area, behind Doncaster and Leeds.[2]\n\nThe borough was formed on 1 April 1974 by the provisions of the Local Government Act 1972 as part of a reform of local government in England. Eleven former local government districts were merged: the county boroughs of Huddersfield and Dewsbury, the municipal boroughs of Batley and Spenborough and the urban districts of Colne Valley, Denby Dale, Heckmondwike, Holmfirth, Kirkburton, Meltham and Mirfield.\n\nThe name Kirklees was chosen by the merging councils from more than fifty suggestions, including Upper Agbrigg, Brigantia and Wooldale.[3] It was named after Kirklees Priory, which is claimed to be site of Robin Hood's death, situated midway between Huddersfield and Dewsbury. The priory was located within the present-day Kirklees Park estate, most of which actually lies in the neighbouring borough of Calderdale.[3][4]\n\nUnder the original draft of the Act, the district would have included Ossett, part of the Dewsbury Parliamentary constituency at that time. It was eventually decided that Ossett was too remote to be governed from Huddersfield and the town was included within the Wakefield district instead.[5]\n\nKirklees sits in quite a central position to all the other surrounding unitary boroughs of West Yorkshire, with people living in the northern parts commuting to Leeds and York for work and education. People living in the western parts commute to Bradford, Halifax and Huddersfield for education and work. People living in the southern and eastern parts commute to Wakefield, Barnsley, Sheffield and Manchester for work and education. The largest towns and principal districts in the borough are Huddersfield, Dewsbury, Batley, Heckmondwike and Cleckheaton.\n\nThe principal settlements of Kirklees are mill towns in the Colne Valley, Holme Valley, Calder Valley and Spen Valley. Those areas of the district with a more urban character bound Calderdale to the west, Bradford to the north-west, Leeds to the north-east and Wakefield to the east.\n\nThe district also includes several rural villages, with the largest rural area extending from the south of Huddersfield. The Pennine countryside to the south-west of Meltham and Holme lies within the Peak District National Park.[6] This moorland area mostly bounds Saddleworth, a traditional part of Yorkshire but now locally governed from Oldham, Greater Manchester. There is also a relatively short border with the High Peak district of Derbyshire, running across the summit of Black Hill, and the main border to the south of Kirklees is with Barnsley.\n\nThe inclusion of two county boroughs resulted in a district without an obvious centre. Over the years there have been suggestions of splitting the district into two, administered from Huddersfield and Dewsbury.[7][8] Graham Riddick, as MP for Colne Valley, campaigned for a split in the early 1990s.[9][10] A similar ambition was mentioned by Elizabeth Peacock, MP for Batley and Spen in 1991.[11] The boundaries of metropolitan boroughs were outside the remit of the Banham Commission appointed to review local government structures in 1992 or its successors, and only minor boundary changes were made with neighbouring districts in 1994.[12][13][14]\n\nThe district includes parts of three postcode areas. Huddersfield and the rural areas to the south have HD postcodes, Birkenshaw, Cleckheaton and Gomersal have BD postcodes, and the rest of the Heavy Woollen area has WF postcodes. Similarly the district is split between several telephone dialling codes, with most residents in the 01484 (Huddersfield), 01274 (Bradford) and 01924 (Wakefield) codes.  A small number of residents in Birchencliffe and Birkenshaw villages fall within the 01422 (Halifax) and 0113 (Leeds) codes respectively.\n\nPublic transport information is provided by Metro, as is the case across West Yorkshire.\n\nKirklees lies along the core Huddersfield line of the TransPennine Express network, with services calling at Huddersfield and Dewsbury. Direct Grand Central services to London King's Cross call at Mirfield. Other railway stations in the district on these routes and on the Penistone line have local Northern Trains services. Some towns in Kirklees have not been served by rail transport since the Beeching cuts. Dewsbury and Batley are served by the Calder Valley Line and the TransPennine Express lines. These serve an important urban area around Leeds and Kirklees with services to further away stations including Manchester Victoria and Liverpool Lime Street.\n\nMost bus services in the Huddersfield area are operated by Team Pennine and First West Yorkshire, and most bus services in the Heavy Woollen area are operated by Arriva Yorkshire.\n\nThe urban areas of Kirklees are served by the M62 and M1 motorways. Parts of the local road network are considered to require improvement, such as the main route from Huddersfield to the southbound M1 which narrows as it passes through Flockton.[15]\n\nKirklees Council has developed a number of traffic-free cycle paths called Greenways in partnership with Sustrans.[16]\n\nTourism in Kirklees is based around the area's countryside and industrial heritage:\n\nKirklees Council closed Dewsbury Museum and Red House Museum at the end of 2016, claiming it could not afford to continue running them following cuts to its budget.[17]\n\nTourist information in Kirklees can be obtained from major libraries.[18]\n\nHuddersfield Town play football in the EFL Championship as of the 2022–23 season. They were the first English club to win three successive league titles.\nThere are also 3 semi professional football teams within Kirklees, Liversedge, Emley and Golcar United.\n\nThe birthplace of rugby league was at the George Hotel, Huddersfield; local clubs include Super League side Huddersfield Giants, alongside Batley Bulldogs and Dewsbury Rams who both play in the Championship.\n\nKirkless is served by BBC Yorkshire and ITV Yorkshire broadcasting from the Emley Moor transmitter which is situated near the village of Emley, in Huddersfield.[19]\n\nLocal radio stations are: [20]\n\nLocal newspapers are Huddersfield Daily Examiner, Yorkshire Evening Post and Yorkshire Post.\n\nKirklees Council is the local authority of the district. The council is composed of 69 councillors, three for each of the borough's 23 wards. Elections are held three years out of four, on the first Thursday of May. One third of the councillors are elected, for a four-year term, in each election. The council is currently led by a Labour executive.\n\nThe shadow Kirklees District Council petitioned the privy council for a royal charter under section 245 of the Local Government Act 1972 granting the status of a borough from 1 April 1974.[21] The grant of borough status entitled the chairman of the council to the title of \"mayor\", effectively continuing the mayoralties of the former boroughs of Dewsbury (1862), Huddersfield (1898), Batley (1869) and Spenborough (1955).[22] The mayor is elected from among the councillors for a one-year term (the \"civic year\") at the council's annual meeting.[23]\n\nKirklees is the most populated borough or district in England not to have city status. In 2001 it was announced that a grant of city status was to be made to an English town to mark the Golden Jubilee of Elizabeth II, and Kirklees council indicated that it was considering applying on behalf of Huddersfield. An unofficial telephone poll by the Huddersfield Examiner found a slim majority against the proposal, and the council did not proceed with the application.[24]\n\nBorough status also allows the council to confer the freedom of the borough on \"persons of distinction\". Since its formation Kirklees Council has granted this right to two individuals and two groups:\n\n[28]\n\nKirklees is twinned with:\n\nKirklees Borough Council was granted armorial bearings by the College of Arms by letters patent dated 24 June 1974. the blazon of the arms is as follows:\n\nVert on a bend Argent a bendlet wavy azure on a chief Or a pale between two cog-wheels azure on the pale a Paschal Lamb supporting a staff of the fourth flying therefrom a forked pennon argent charged with a cross gules; and for a Crest, On a wreath of the colours a ram's head affronty couped argent armed Or gorged with a mural crown sable masoned argent.\n\nSupporters: On either side a lion guardant purpure resting the inner hind leg on a cross crosslet Or embellished in each of the four angles with a fleur de lis azure. Badge or device: A roundel purpure charged with a Lacy Knot Or all within a circle of eleven roses argent barbed and seeded proper.[31]\n\nThe green colouring of the shield represents the fields, woods and moorland of the borough. The white stripe or bend represents the M62 motorway, while the blue wave upon it is for the many waterways of the area. On the chief or upper third of the shield is a paschal lamb, symbol of St John the Baptist. John was the patron saint of woolworkers, and the inclusion of the emblem represents the historic woollen industry. The cogwheels are for the modern engineering industries. The crest is a ram's head, found in the arms of the County Borough of Huddersfield and the Mirfield Urban District Council. The black mural crown stands for the district's status as a borough, recalling a city wall. The supporters are purple lions from the arms of the de Laci family, medieval lords of Huddersfield. For heraldic \"difference\" from other lion supporters a distinctive cross has been placed below their inner feet. This device, combining the symbols of Christ and the Virgin Mary, represents the priory from which the borough took its name.[31][32]\n\nIn five areas of the borough there is a second tier of local government: the civil parish. Parish or town councils have limited powers of a purely local character, such as owning or maintaining allotments, burial grounds, footpaths and war memorials. Four of the parishes were formed as successor parishes to urban districts abolished in 1974.[33] The fifth was formed in 1988.[34] The five town or parish councils are:\n\nThe remainder of the borough is unparished, with the borough council exercising parish powers.\n\nSince 1997 Kirklees has been divided into five constituencies: four being entirely within the borough, while one ward (Wakefield) is included in the Wakefield Council borough.\n\nThe boundaries of two of the Colne Valley and Huddersfield constituencies were virtually unchanged from those defined in 1983. Denby Dale and Kirkburton wards were transferred from Dewsbury to Wakefield, with the former constituency receiving Heckmondwike ward from Batley and Spen.\n\nThe constituencies were first used at the 1997 general election, when the Labour Party came to power in a landslide, gaining all the seats in the borough. The party held the seats at the subsequent elections of 2001 and 2005.[41] The incumbent MP for Batley and Spen, Jo Cox, was murdered on 16 June 2016.[42] A constituency by-election took place on 20 October 2016 and Tracy Brabin was elected.[43] A further by-election will be held in the constituency on 1 July 2021, after Brabin's resignation, following her election as Mayor of West Yorkshire.[44][45]\n\n2010–present:\nBatley East, Batley West,Birstall and Birkenshaw, Cleckheaton,Heckmondwike, Liversedge and Gomersal.\n\n2010–present:Denby Dale, Dewsbury East,Dewsbury South, Dewsbury West,Kirkburton, Mirfield.\n\n2010–present:Horbury and South Ossett, Ossett,Wakefield East, Wakefield North,Wakefield Rural, Wakefield West.\n\nThe 1983 general election was the first at which constituencies based on the administrative areas created in 1974 were used. Kirklees was divided into four constituencies.[56] The Conservative Party polled well in the 1983 election, and took two of the borough's constituencies. Labour held Huddersfield, while the Liberals, running in an alliance with the Social Democrats, held Colne Valley. In the following election in 1987 the Labour vote increased slightly, and they gained Dewsbury from the Conservatives. At the same time the Alliance vote fell, and the Conservatives took Colne Valley. The four MPs elected in 1992 were all returned in 1997.\n\nKirkburton, Mirfield and Thornhill.[56]\n\nParliamentary constituencies in England and Wales continued to be defined in terms of the boroughs and districts abolished in 1974 until a general redistribution of seats in 1983. Accordingly, Kirklees was divided between seven constituencies, which had first been used in the 1950 general election.[68]\n\n(Defected to the Social Democratic Party in 1981 when he seemed unlikely to be reselected as Labour candidate for the next election.)[78]\n\n53°35′35″N 1°48′04″W﻿ / ﻿53.593°N 1.801°W﻿ / 53.593; -1.801\n",
  "concepts": [
    "Kirklees",
    "kirklees",
    "huddersfield",
    "borough",
    "council",
    "district",
    "dewsbury",
    "local",
    "yorkshire",
    "west",
    "wakefield"
  ],
  "findings": [
    "History",
    "Geography",
    "Transport",
    "Rail",
    "Road",
    "Bicycle",
    "Tourism",
    "Sport",
    "Media",
    "Governance",
    "Council",
    "Borough status and mayoralty",
    "Twin towns",
    "Coat of arms",
    "Parish and town councils",
    "Parliamentary representation",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [
    {
      "subject": "Kirklees",
      "relationship": "is a",
      "object": "metropolitan borough of west yorkshire",
      "sentence": "Kirklees is a metropolitan borough of West Yorkshire, England."
    },
    {
      "subject": "Kirklees",
      "relationship": "are",
      "object": "mill towns in the colne valley",
      "sentence": "The principal settlements of Kirklees are mill towns in the Colne Valley, Holme Valley, Calder Valley and Spen Valley."
    },
    {
      "subject": "Kirklees",
      "relationship": "are",
      "object": "served by the m62 and m1 motorways",
      "sentence": "The urban areas of Kirklees are served by the M62 and M1 motorways."
    }
  ],
  "timestamp": "2025-04-11T13:30:55.190167"
}