{
  "title": "Cholpon-Ata Airport",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Cholpon-Ata_Airport",
  "content": "Cholpon-Ata Airport (Kyrgyz: Чолпон-Ата аэропорту, Russian: Чолпон-Атинский аэропорт) (IATA: none (ЧЛА), ICAO: UAFG) is an airport serving the resort town of Cholpon-Ata in the Issyk Kul Province (oblast) of Kyrgyzstan. The Russian IATA code for Cholpon-Ata Airport is ЧЛА.[2]\n\nCholpon-Ata Airport started its operations in the 1930s as a landing strip on the northern shore of Issyk-Kul Lake. The current runway and terminal were built in the 1970s. The runway has a weight limit of 22 tonnes, and has no instrument landing facilities and operates only during daylight hours.\n\nCholpon-Ata Airport is currently being replaced by Tamchy Airport.[3] There are plans to reconstruct it as a VIP airport due to its proximity to the governmental resorts. Until 2003, Cholpon-Ata had regular links with Bishkek, Osh and Jalal-Abad.\n\nCurrently the airport is abandoned, as it was replaced by the Issik Kull International Airport.\nWhat was its landing strip ends right in the petroglyph area in Cholpon Ata. \nUpon arriving at the place it is possible to see the ruins of the aforementioned airport.\nOne of the main places of interest in Cholpon-Ata (in English) is the open-air petroglyph museum, located just outside the city center. The museum's 42 hectares are dotted with stone circles, tombs, balbals (tombstones) and a variety of petroglyphs. These petroglyphs date back to the second millennium BC. until the 4th century AD.\n\nIt is believed that the site was once an open-air temple, where people worshiped the sun and other celestial bodies. Many of the stones depict animals, including snow leopards and deer. One of the stones near the entrance shows hunters chasing deer with domesticated snow leopards, while another stone depicts snow leopards in motion, an image unique in Central Asian petroglyphs. There are also images of the sun, and cars racing across the rocks.\n\nThis article about an Asian airport is a stub. You can help Wikipedia by expanding it.\nThis article about transport in Kyrgyzstan is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Cholpon-Ata Airport",
    "airport",
    "cholpon ata",
    "cholpon",
    "ata",
    "ata airport",
    "snow leopards",
    "snow",
    "petroglyphs",
    "leopards",
    "landing"
  ],
  "findings": [
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T14:34:24.830364"
}