{
  "title": "People's Socialist Party (Spain)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/People's_Socialist_Party_(Spain)",
  "content": "The People's Socialist Party (Spanish: Partido Socialista Popular, PSP) was a Spanish political party of socialist ideology, led by Enrique Tierno Galván. Founded under Francoism, it merged into the Spanish Socialist Workers' Party shortly after the 1977 general election.\n\nThe origins of the party dated back to 1954 when the university professor Enrique Tierno Galván published various academic studies of a Marxist character.[1] In 1965, working with Raúl Morodo, he formed the Castillian Socialist Federation (Federación Socialista Castellana).[1] Two years later, the party became the Partido Socialista del Interior or the Socialist Party of the Interior, reflecting the fact that most of its members were based in Spain, in contrast to the Spanish Socialist Workers' Party (PSOE), many of whose members were exiles.[1] The party attempted to reach agreements with the PSOE, but ideological differences proved insurmountable.[1]\n\nIn Francoist Spain, it was an illegal underground movement on university campuses, and it adopted the Popular Socialist Party name in 1974. Its President was Tierno Galván. That same year, the party formed the Democratic Junta of Spain (Junta Democrática de España) together with the Communist Party of Spain (PCE) and the Carlist Party.\n\nIt defined itself as socialist and Marxist.[1] In contrast to the PSOE, which had a base in the trade union movement, many PSP members were university professors and intellectuals.[1]\n\nThe PSP stood in the 1977 Spanish general election in coalition with a number of regional left wing movements, especially the Socialist Party of Andalusia (where they stood under the name Socialist Unity). Overall, the PSP won 816,582 votes (4.46%) and six seats in Congress.[2] In the Senate, Socialist Unity had two representatives elected.\n\nIn February 1978, the party entered into discussions with other parties, including the Communist Party of Spain and the PSOE, about possible future electoral cooperation. Although Tierno denied suggestions of mergers during those discussions,[3] the party congress voted in favour of a merger with the PSOE on 1 April 1978;[4] this was concluded at a joint press conference between Tierno and Felipe Gonzalez, the PSOE leader in April 1978.[5] The following year, Tierno Galván was elected Mayor of Madrid by the PSOE and PCE.\n",
  "concepts": [
    "People's Socialist Party (Spain)",
    "party",
    "socialist",
    "psoe",
    "tierno",
    "spanish",
    "spain",
    "tierno galván",
    "socialist party",
    "psp",
    "galván"
  ],
  "findings": [
    "History",
    "Origins",
    "Legalization and elections",
    "Integration into the PSOE",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T17:04:17.737556"
}