{
  "title": "York County, Nebraska",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/York_County,_Nebraska",
  "content": "York County is a county in the U.S. state of Nebraska. As of the 2020 United States census, the population was 14,125.[1] Its county seat is York.[2]\n\nIn the Nebraska license plate system, York County is represented by the prefix 17 (it had the seventeenth-largest number of vehicles registered in the county when the license plate system was established in 1922).\n\nYork County was organized in 1870. Sources differ on the origin of the county's name: some state it was named after York in England, while others maintain it was named by early settlers from York County, Pennsylvania.[3]\n\nThe terrain of York County consists of rolling prairie, mostly devoted to agriculture. The ground slopes toward the Platte River, to the northwest. The county has a total area of 576 square miles (1,490 km2), of which 573 square miles (1,480 km2) is land and 3.3 square miles (8.5 km2) (0.6%) is water.[4]\n\nAs of the 2000 United States Census,[14] there were 14,598 people, 5,722 households, and 3,931 families in the county. The population density was 25 people per square mile (9.7 people/km2). There were 6,172 housing units at an average density of 11 per square mile (4.2/km2). The racial makeup of the county was 96.78% White, 0.96% Black or African American, 0.29% Native American, 0.49% Asian, 0.08% Pacific Islander, 0.64% from other races, and 0.77% from two or more races. 1.40% of the population were Hispanic or Latino of any race. 52.0% were of German, 8.2% Irish, 7.2% English and 5.1% Swedish ancestry.\n\nThere were 5,722 households, out of which 31.10% had children under the age of 18 living with them, 60.20% were married couples living together, 6.00% had a female householder with no husband present, and 31.30% were non-families. 27.50% of all households were made up of individuals, and 14.00% had someone living alone who was 65 years of age or older. The average household size was 2.42 and the average family size was 2.96.\n\nThe county population contained 25.30% under the age of 18, 9.00% from 18 to 24, 25.40% from 25 to 44, 23.00% from 45 to 64, and 17.40% who were 65 years of age or older. The median age was 39 years. For every 100 females there were 91.50 males. For every 100 females age 18 and over, there were 88.80 males.\n\nThe median income for a household in the county was $37,093, and the median income for a family was $44,741. Males had a median income of $30,658 versus $19,874 for females. The per capita income for the county was $17,670. About 6.00% of families and 8.50% of the population were below the poverty line, including 9.90% of those under age 18 and 7.10% of those age 65 or over.\n\nThe County Board of Commissioners is the executive and legislative authority of the county.[15]\n\nYork County voters have traditionally been strong Republicans. In only one national election since 1916 has the county selected the Democratic Party candidate (as of 2024).\n\nSchool districts include:[17]\n\n40°52′N 97°36′W﻿ / ﻿40.87°N 97.60°W﻿ / 40.87; -97.60\n",
  "concepts": [
    "York County, Nebraska"
  ],
  "findings": [
    "History",
    "Geography",
    "Major highways",
    "Adjacent counties",
    "Protected areas",
    "Demographics",
    "Communities",
    "Cities",
    "Villages",
    "Former Communities",
    "Government",
    "Politics",
    "Education",
    "See also",
    "References"
  ],
  "timestamp": "2025-04-11T10:12:41.740841"
}