{
  "title": "Norah Gurdon",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Norah_Gurdon",
  "content": "Norah Gurdon (Jan-March 1882 - 27 June 1974) was an Australian artist. Her first name is often misspelled Nora in many articles reviewing her work.[1]\nNorah Gurdon was born around Jan-March 1882 in Norfolk, England, to Dr. Edwin John Gurdon and Ellen Ann Randall.[2] She was baptised on 11 April 1882.[citation needed] She was the second of four surviving children, and her family emigrated to Ballarat, Victoria in 1886,[2] travelling on board ship the Carlisle Castle.[3] They eventually settled in Brighton where her father had a doctor's surgery at their home.[2] Gurdon showed early artistic talent while attending Brighton High School for Girls.[2]\n\nGurdon attended the National Gallery School from 1901 to 1908, being taught by noted artists Frederick McCubbin and Bernard Hall.[2] While there she studied with fellow artists Jessie Traill, Dora Wilson, Constance Jenkins, and Janet Cumbrae Stewart, who were to become her lifelong friends.[2][3] An accomplished landscape and still-life painter,[3] Gurdon exhibited her works with the Victorian Artists Society while still a student.[2] She established her artistic prowess early on by winning the major category for oil painting in the 1909 City of Prahran's Art Exhibition Prize.[2] By the following year she had rented a studio in Collins Street along with friends Stewart and Traill. As well as being a prominent figure in the Melbourne Society of Painters and Sculptors, Gurdon went on to exhibit with fellow National Gallery School alumni in 1913 as part of Twelve Melbourne Painters. The group included Ruth Sutherland, Charles Wheeler, Dora Wilson, May Roxburgh, Percy Leason, Louis McCubbin, Penleigh Boyd, H. B. Harrison, and Frank Cozier.[2]\n\nIntending to continue her artistic training overseas, in 1914 Gurdon travelled to England with her sister Winifred.[4] Gurdon along with friend Jessie Traill was stuck in Europe[2] due to the outbreak of war ten weeks after arriving.[3] She signed up as a British Red Cross volunteer nurse in a French military hospital at Le Croisic, serving for three and a half years[5] and was awarded a British Victory medal for her services.[3] Much of her painting during this time was landscapes from travels to England and Scotland prior to war breaking out,[5] and when armistice was reached in 1920 she stayed on to paint through Scotland, Suffolk, and Cornwall.[2] This was hardly her only venture overseas however, as she returned in 1927,[2] meeting fellow artists Pegg Clarke and Dora Wilson in Rome,[6] and narrowly avoiding World War II on her 1938 travels to Norway and Sweden.[7]\n\nUnlike many other female artists of the time, Norah Gurdon was unmarried and financially independent.[4] She purchased land in 1922 with plans to build her dream house in the Dandenong Ranges at Kalorama.[2] When the house was finished she lived there with her sister Winifred and had many fellow artists as guests, with former students and teachers joining her for plen air landscape painting.[2] While Gurdon painted in an impressionist style similar to her contemporaries, she favoured muted blue and grey tones to capture the hills of the Dandenongs.[3] She also enjoyed handicrafts, spending her spare time at tapestry looms designing and producing her own floor rugs and mats.[7]\n\nGurdon was a regular and successful exhibitor of work, exhibiting with the Victorian Artists Society, Melbourne Society of Women Painters and Sculptors, and the Australian Art Association.[3] In the 1920s she held many solo exhibitions at the Athenaeum Gallery, and later at the Women's Industrial Arts Society in Sydney, and the Royal Queensland Art Society in Brisbane.[3] She held an exhibition in 1937 at the Fine Arts Gallery in aid of the construction of St George's Hospital in Kew.[4][8]\n\n1909\n\n1910\n\n1911\n\n1912\n\n1913\n\n1915\n\n1920\n\n1921\n\n1922\n\n1923\n\n1924\n\n1925\n\n1926\n\n1927\n\n1928\n\n1929\n\n1930\n\n1931\n\n1932\n\n1933\n\n1934\n\n1935\n\n1936\n\n1937\n\n1939\n\n1940\n\n1941\n\n1942\n\n1943\n\n1944\n\n1945\n\n1946\n\n1949\n\n1950\n\n1953\n\n1977\n\n1995\n\n2021\n\nNorah Gurdon's work is held in the collections of Shepparton Art Museum,[112] Yarra Ranges Regional Museum,[113] Castlemaine Art Gallery,[114] National Gallery of Victoria,[115] Bendigo Art Gallery,[116] Benalla Art Gallery,[117] and Brighton Historical Society.\n\nHer Own Path: Norah Gurdon, Bayside City Council\n\nNorah Gurdon [Australian art and artists file], State Library Victoria\n",
  "concepts": [
    "Norah Gurdon"
  ],
  "findings": [
    "Early life",
    "Career",
    "World War I",
    "Kalorama",
    "Exhibitions",
    "Collections",
    "Further reading",
    "References"
  ],
  "timestamp": "2025-04-11T10:24:26.649975"
}