{
  "title": "Richard Ansdell",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Richard_Ansdell",
  "content": "Richard Ansdell RA (11 May 1815 – 20 April 1885) was a British painter of animals and genre scenes.[1]\n\nAnsdell was born in Liverpool (then in Lancashire), the son of Thomas Griffiths Ansdell, a freeman who worked at the port, and Anne Jackson. His father died young; Richard was educated at The Liverpool Blue Coat school for orphans. He had a natural talent for art from an early age, and after leaving school worked for a portrait painter in Chatham Street Liverpool, and also spent time as a sign painter in the Netherlands.[1]\n\nHe first exhibited at the Liverpool Academy in 1835, becoming a student there the following year. His animal and rural subjects proved to be popular and he soon attracted wealthy patrons.[2] His first exhibition at the Royal Academy, London, was in 1840, with two paintings called \"Grouse shooting\" and \"A Galloway farm\". This was followed, in 1841 by \"The Earl of Sefton and party returning from hunting\", in 1842 \"The death of Sir William Lambton at the Battle of Marston Moor\" (1842; Harris Museum and Art Gallery, Preston), in 1843 \"The Death\" and in 1844 \"Mary Queen of Scots returning from the chase to Stirling Castle\". He went on to exhibit pictures every year at the academy until 1885 (149 canvases in all).[1][3] In 1846 he exhibited his first picture, \"A Drover's Halt\" at the British Institution, London, and went on to show 30 canvases there.\n\nIn June 1841, he married Maria Romer; the couple went on to have 11 children. In 1847 the family left Liverpool to live in Kensington in London.\n\nIn 1850, Ansdell started collaborating on pictures with Thomas Creswick, who specialised in landscapes (e.g.:\"The South Downs\", \"England's day in the country\" etc.). He also worked with William Powell Frith (\"The Keeper's daughter\") and John Phillip, with whom he travelled to Spain in 1856 and painted a series of Spanish subjects  – \"The Water Carrier\", \"The Road to Seville\", \"The Spanish shepherd\" etc. He returned to Spain alone the following year to paint more pictures there.\n\nIn 1855, Andsell was awarded a gold medal at the Paris Exhibition for his works, \"The Wolf Slyer\" and \"Taming the Drove\". He also won the \"Heywood medal\" three times for his work at the Manchester Royal Institution. He was elected an Associate of the Royal Academy (ARA) in 1861 and a Royal Academician (RA) in 1870.[4]\n\nDuring part of his career he kept a \"summer house\" at Lytham St Annes, in the borough of Fylde, where a district, Ansdell, is named after him. He is the only English artist to have been honoured in this way.\n\nAnsdell died at \"Collingwood Tower\" at Frimley, near Farnborough in Hampshire on 20 April 1885.[5] He was buried at Brookwood Cemetery.\n\nAnsdell's best known works include Stag at Bay (1846), The Combat (1847), and Battle of the Standard (1848) – depicting the capture of the French flag at Waterloo by Sergeant Ewart of the Scots Greys.[4]\n\nAnsdell's subject matter was compared to that of Edwin Landseer, though critical opinion was that, though popular, his works lacked the latter's emotional impact. His reputation was as a hardworking but occasionally over-proud artist; for instance, he received no royal commissions after refusing to paint Queen Victoria's dogs unless they were brought to his studio.\n\nMany of his works are under the guardianship of Fylde Borough Council, having been donated to the former Lytham St Annes Corporation in the 1930s. A selection of these paintings is periodically exhibited at the Fylde Gallery above Booths supermarket in Lytham where The Herd Lassie is on long-term loan. There are further Ansdell paintings hanging in non-public rooms at Fylde Borough Council Town Hall that can be viewed by prior arrangement or on heritage open days in September.\n\nIn October 2017 a large painting by Ansdell of a Friesian cow was featured on BBC One's Antiques Roadshow and was valued, by art expert Rupert Maas, as being worth between 15,000 and £20,000.[6]\n\nThe largest public collections of Ansdell's paintings in Britain are in Liverpool's Walker Art Gallery, the Lytham St Annes Art Collection, and Preston's Harris Museum.[7]\n",
  "concepts": [
    "Richard Ansdell"
  ],
  "findings": [
    "Life",
    "Works",
    "Military Paintings",
    "Selected works",
    "Notes",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:23:13.172434"
}