{
  "title": "Batyrkhan Shukenov",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Batyrkhan_Shukenov",
  "content": "Batyrkhan Kamaluly Shukenov[a] (18 May 1962 – 28 April 2015) was a Kazakh and Soviet singer, musician, composer, and poet.[1] Shukenov was co-founder and lead singer of the Kazakh-Russian pop music group A-Studio from 1987 until 2000.[2][3][4] After leaving the group in 2000, he began his solo career.[2]\n\nShukenov was born in Kyzylorda, Kazakh Soviet Socialist Republic. In 1985, he joined the Soviet Army to serve as part of the 12th HQ Military Band of the Central Asian Military District. In 2010, he received the title of \"Honored Worker of Arts of Kazakhstan\".[5][6] He was the first UNICEF Goodwill ambassador in Kazakhstan, from 2009 to 2015.[7][8]\n\nBatyrkhan Shukenov died at age 52 in his apartment in Moscow from a heart attack.[9][10][11][12] He was buried in his native Kazakhstan.[13] On 29 April 2015 in Moscow, the ceremony of farewell to Shukenov was attended by hundreds of people.[14] In Almaty, thousands of fans gathered in the square in front of the Palace singing his songs.[15]\n\nOn May 18, 2018, on the birthday of Batyrkhan Shukenov, a monument was unveiled in his homeland in the city of Kyzylorda.[16] On the pedestal is a kneeling musician with a saxophone. Also in the city of Kyzylorda, a park was named after Batyrkhan Shukenov. In the city of Almaty in the Bostandyk district, a street was named after Batyrkhan Shukenov.\n\nIn 2021, director Galina Pyanova staged a performance dedicated to Batyrkhan Shukenov \"Golden Square\" in Almaty.[17]\n\nOn May 18, 2022, the National Bank of Kazakhstan, in honor of the 60th anniversary of the birth of the composer and performer Batyrkhan Shukenov, issues street art collection coins into circulation BATYR BEINESI from silver with a denomination of 500 tenge.[18]\n\n Media related to Batyrkhan Shukenov at Wikimedia Commons\n",
  "concepts": [
    "Batyrkhan Shukenov",
    "shukenov",
    "batyrkhan",
    "batyrkhan shukenov",
    "kazakhstan",
    "18",
    "soviet",
    "kyzylorda",
    "kazakh",
    "city",
    "almaty"
  ],
  "findings": [
    "Memory",
    "Notes",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:42.745377"
}