{
  "title": "Yamatai Kyushu Theory",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Yamatai_Kyushu_Theory",
  "content": "The Yamatai Kyushu Theory is the theory that the Yamatai kingdom was located in Kyushu rather than in Honshu as the Yamatai Honshu Theory proposes.[1]\n\nThe theory proposes that the original capital of Japan was located in Kyushu, and when the Kofun period began, the Yamato Kingship moved the capital east to the Kinai region, first in the Yamato Province (Nara prefecture), then Kyoto in the Yamashiro Province (Kyoto Prefecture).[1]\n\nIn the Edo period, Arai Hakuseki adovocated the \"Kinai Yamataikoku theory\" which says Yamatai-koku was located in 大和 (Yamato Province, ie. Nara prefecture) in the Kinai, Honshu. Later, Arai adovocated the different theory, \"Kyūshū Yamataikoku theory\" which says Yamatai-koku was located in \"Yamato county (山門-郡, Yamato-gun)\" in Chikugo Province (Fukuoka prefecture, Northern Kyushu) in his \"Foreign Affairs Record\".\n\nSince then, the mainstream of academic circles has been divided into the two major theories:\n\nThe Kyūshū theory has been, additionally, divided into the two schools. One school insists the \"Kyushu Yamatai-koku\" moved to the East and became the Yamato dynasty. The other school insists \"Kyushu Yamatai-koku\" did not move, and was conquered by the influences of the Yamato (located in Kinai).  \n\nThe basic arguments for the Kyushu theory of the Yamatai Kingdom include the following.\n\nAdvocates of the Kyushu theory of the Yamataikoku include Arai Hakuseki, Shiratori Kurakichi, Dairoku Harada, Taku Tanaka,[6] Takehiko Furuta, Kenzaburo Torigoe,[7] Toshiaki Wakai,[8] Biten Yasumoto, Toshio Hoga and others. In addition, it is said that research based on domestic materials such as \"Kiki\" tends not to be taken into consideration, despite the indications of Taro Sakamoto's \"The Birth of the Nation\" and Hidesaburo Hara, and Toshiaki Wakai said about this tendency before the war. He criticizes the repressed theory of Sokichi Tsuda as being caused by being touted even after the war.[8]\n",
  "concepts": [
    "Yamatai Kyushu Theory"
  ],
  "findings": [
    "Overview",
    "Basic rationale",
    "Basis",
    "Advocates",
    "See also",
    "Notes",
    "References"
  ],
  "timestamp": "2025-04-11T10:20:27.237461"
}