{
  "title": "James McManus",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/James_McManus",
  "content": "James \"Jim\" McManus (born March 22, 1951) is an American teacher, writer and poker player living in Kenilworth, Illinois. He is a professor in the Master of Fine Arts program for writers at the Art Institute of Chicago.\n\nMcManus is best known as the author of the book Positively Fifth Street: Murderers, Cheetahs, and Binion's World Series of Poker (ISBN 0-374-23648-8). The book is dedicated to his son, James McManus (1979–2001). The book is based on his trip to Las Vegas to cover the progress of women in the 2000 World Series of Poker (WSOP) and the death of Ted Binion.\n\nHe used his advance to enter a satellite tournament for entry into the main event, defeating the likes of Hasan Habib to qualify for the seat. He made the final table of the Main Event, finishing in 5th place and winning $247,760. He credited his success in the tournament to the book Championship No-Limit & Pot-Limit Hold'em (ISBN 1-58042-127-X) by T. J. Cloutier and Tom McEvoy. Cloutier, Habib and Chris Ferguson were also at the same final table.\n\nMcManus made the quarter-finals of the 2006 National Heads-Up Poker Championship, where he was eliminated by Ferguson.[1] McManus continues to play live poker when not teaching and raising two young daughters with his second wife, Jennifer Arra.\n\nAs of 2012, his total live tournament winnings exceed $760,000.[2]\n\nHe has also written for The New York Times, The Boston Globe, Harper's Magazine, and The New Yorker among others.\n\nHis Esquire article on stem cell research [4] was featured in The Best American Science and Nature Writing 2005 and was a finalist for the National Magazine Award.\n\nHe has been the poker columnist of the New York Times and currently writes the history column for Card Player. He has spoken about the game at Yale, Harvard, Google, Goldman Sachs, and on numerous media outlets.\n\nHis work has also appeared in The Best American Poetry, Best American Magazine Writing, Best American Sports Writing, Best American Political Writing, Best Erotic Writing in Modern Fiction, The New Kings of Nonfiction, Richter 858, The Book of Irish American Poetry, and other anthologies. He has received the Peter Lisagor Award for Sports Journalism, fellowships from the Guggenheim and Rockefeller foundations, and other awards.\n\nHe was born to Kevin Joseph McManus (1927-1989) and Mary Agnes (née Madden) (1928-2016), both of Irish descent.\n\nMcManus pursued undergraduate degrees from Loyola University Chicago and University of Illinois Chicago. He received a Bachelor of Arts degree in 1974 and a Master of Arts degree in 1977, both from UIC. He teaches at the School of the Art Institute of Chicago, as well as the history section of Harvard's new online poker university.\n",
  "concepts": [
    "James McManus"
  ],
  "findings": [
    "Poker and Positively Fifth Street",
    "Other works",
    "Fiction",
    "Non-fiction",
    "Poetry",
    "Journalism",
    "Personal life",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:19:22.455820"
}