{
  "title": "National Shrine of Saint Joseph (Karlovac)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/National_Shrine_of_Saint_Joseph_(Karlovac)",
  "content": "National Shrine of Saint Joseph (Croatian: Nacionalno svetište svetog Josipa) is a Croatian Catholic national shrine dedicated to Saint Joseph located in the city of Karlovac, in Parish of Our Lady of the Snows.[1]\n\nSaint Joseph is a patron saint of Karlovac, Karlovac County and Croatia.[2]\n\nEarliest written mention of the parish is found in the records of the Diocese of Zagreb in 1334.[1] Parish was founded around Dubovac Castle, named after Croatian word for oak (\"dub\"), as it was surrounded by and oak forest.[1] Originally, parish was dedicated to Saint Michael, to whom chapel near the castle was dedicated.[1] By the end of the 17th century, new chapel was erected at the hill near the Dubovac Old City, which was proclaimed parish church in 1741 and consercrated to Our Lady of Snows.[1] Nowadays, parish has around 5,000 parishioners.[1] Besides parish church and the shrine, there are also calvary dedicated to Saint Anne and Greek Catholic chapel of the Wounded Jesus.[1]\n\nThe initiator of the construction of the church and sanctuary was Msgr. Marijan Radanović (hr), who was parson in Dubovac from 1955 to 1998.[3]\n\nFollowing proclamation of Saint Joseph as a patron saint of Kingdom of Croatia by Croatian Sabor on 9 and 10 June 1687,[4] Croatian bishops at their assembly in Split in 1972 confirmed \"that the decision of the Croatian Sabor from 1687 is still in force, because the Sabor did not have in mind the abstract Croatian kingdom, but the Croatian people, who survive all vicissitudes surrounding their sovereignty...\".[5]\n\nChurch construction started in 14 July 1968, with cornerstone blessed by then auxiliary bishop of Zagreb Franjo Kuharić; church was consecrated by archbishop Franjo Šeper on 15 September 1974.[6] The main designer of the building was Josipa Šponar Muth.[5] At Christmas in 1974, the sculpture of Saint Joseph was consecrated in the church.[6] In 1975, bell tower was finished and sculpture of St. Mary was consercrated.[6] Stations of the Cross was finished and placed in 1979.[6] In 1980, three church bells were purchased and dedicated to Saint Joseph (980 kg), Mother of God (520 kg) and Saint Francis of Assisi (297 kg), all of which were consecrated and blessed by archbishop mons. Franjo Kuharić.[6] In 1983, the organ was installed and blessed by auxiliary bishop of Zagreb Mijo Škvorc.[6] Stained glass elements were made by Croatian painter Josip Botteri Dini.[7]\n\nTogether with Zagreb Cathedral, Croatian National Shrine of Saint Mary of Marija Bistrica and Church of the Most Holy Trinity in Krašić, during 2016 Extraordinary Jubilee of Mercy it was among the four churches with Doors of Mercy in the Archdiocese of Zagreb.[8] It is also one of the holy places of the 2025 Jubilee.[9]\n\nAfter a one year preparation, on 1 September 2021 Josip Botteri Dini started placing his altar mosaic with a scene of the Nativity of Jesus.[7] At the time of its installation, it was the largest church mosaic in Croatia.[10] The mosaic was blessed by auxiliary bishop of Zagreb Mijo Gorski on 8 December 2021.[10] Mosaic consists of 168 surfaces with the total area of 120 m2 and 2,500 pieces of industrial and Murano glass.[10]\n\nSanctuary publishes quarterly magazine Glasnik svetog Josipa (hr, \"The Messenger of the St. Joseph\"), founded by Josip Stadler in 1873.[11]\n\nShrine feast days are 19 March (feast day of Saint Joseph), which is preceded by nine Wednesdays of preparation (Great novena to Saint Joseph),[12] 1 May (St. Joseph the Worker) and 15 September (consercration day, \"Posvetilo crkve\").[4] Every Wednesday devotions to St. Joseph are held.[13]\n\nAs part of the sanctuary, the devotion \"Wreath of the Immaculate Heart of Joseph\" (Vijenac Prečistog Srca Josipova) was created, which consists of prayer wreaths consisting of 31 supplicants, leader and priest. Each member is responsible for having his own prayer day on a certain day of the month for specific purposes, which consists of the Rosary, attendance at Holy Mass, Holy Communion, confession, and if possible, fasting.[14] The Brotherhood of St. Joseph for aid to the dying (Bratovština svetog Josipa za pomoć umirućima) also operates within the sanctuary, with hundreds of supporting members throughout Croatia and in the Croatian diaspora.[15]\n\nBetween 2015 and 2019 sanctuary was visited by around 210,000 pilgrims.[16] In 2023, there were 80,000 pilgrims.[2]\n",
  "concepts": [
    "National Shrine of Saint Joseph (Karlovac)",
    "saint",
    "joseph",
    "croatian",
    "church",
    "saint joseph",
    "parish",
    "zagreb",
    "st",
    "shrine",
    "sanctuary"
  ],
  "findings": [
    "History",
    "Parish",
    "Sanctuary",
    "Publishing",
    "Pilgrims and devotions",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:26:08.940654"
}