{
  "title": "Holcombe Burnell",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Holcombe_Burnell",
  "content": "Holcombe Burnell is a civil parish in the Teignbridge district, in Devon, England, the church of which is about 4 miles west of Exeter City centre. There is no village clustered around the church, rather the nearest village within the parish is Longdown. Only the manor house and two cottages are situated next to the church. The former manor house next to the church is today known as Holcombe Burnell Barton having subsequently been used as a farmhouse. The manor was in the historical Hundred of Wonford. In 2011 the parish had a population of 536.\n\nThe church was dedicated originally to St Nicholas, mentioned in a charter dated 1150.[1] In the 15th century the manor was acquired by a member of the Denys family of Orleigh in Devon, and the church was then substantially reconstructed. The church was restored in the Victorian era in 1843–1844, to the plans of the Exeter architect John Hayward with Henry Lloyd of Bristol. The church was extended at the east end and the vestry added at that time. The church contains a rare Easter Sepulchre, situated on the north side of the chancel. The advowson of the church was acquired by the Bishop of Wells, which made it into a prebendary for one of its canons. The advowson was acquired by the Bishop of Exeter in about 1850.\n\nThe altar is an ancient Spanish chest in carved oak from Culver House, one of the principal residences in the parish. The font is 15th century. There existed formerly next to the manor house a private chapel, demolished in the 18th century, the only remains of which are some stone blocks made into a mounting block by the church gate.\n\nThe Domesday Book of 1086 records the manor as held by Queen Matilda. Before the Norman Conquest it had been a possession of Brictric, a powerful thane based in Gloucestershire. After the death of Queen Matilda the manor was granted by the king to Tetbald FitzBerner, one of King William's knights. The manor derives its appellation \"Burnell\" from a corruption which has developed over the centuries of the name \"Berner\".[citation needed]\n\nFrom the 15th century the manor was held by a branch of the Denys family. Thomas Denys (died 1498) of Holcombe Burnell married Janera Loveday, daughter of Philip Loveday of Sneston in Suffolk, and their son was Sir Thomas Denys (c. 1477 – 1561), a prominent lawyer who served as Sheriff and MP for Devon.  He married twice, firstly to Anne, widow of Thomas Warley a Treasury official, and secondly to Elizabeth Donne, widow of Sir Thomas Murfyn, Lord Mayor of London. Sir Thomas is notorious as having supervised the burning at the stake of the Protestant martyr Thomas Benet in Exeter in January 1531/2.\n\nHis eldest son was Sir Robert Dennis (died 1592), MP for Devon in 1555 and Sheriff of Devon, who acquired Bicton House. According to W. G. Hoskins, the Easter Sepulchre in the church is his tomb and monument.[2] Sir Robert married Mary Blount, a first cousin of Lady Jane Grey. In March 1591 he founded the Livery Dole Almshouses in Heavitree Road, Exeter.[3]\n\nSir Robert's eldest son and heir, Sir Thomas Denys married Anne Paulet, daughter of William Paulet, 3rd Marquess of Winchester, and left two co-heiresses, Anne Denys who married Sir Henry Rolle (died 1616) of Stevenstone, and Margaret Denys (died 1649) who married Sir Arthur Mainwaring of Ightfield, Shropshire.\n\nThe principal historic houses in the parish are:\n",
  "concepts": [
    "Holcombe Burnell"
  ],
  "findings": [
    "Church of St John the Baptist",
    "Medieval manor",
    "Principal houses",
    "See also",
    "References",
    "Sources"
  ],
  "timestamp": "2025-04-11T10:18:34.152129"
}