{
  "title": "1996 Summer Olympics closing ceremony",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/1996_Summer_Olympics_closing_ceremony",
  "content": "The Closing Ceremony of the 1996 Summer Olympics took place on August 4, 1996, at the Centennial Olympic Stadium in Atlanta, United States at approximately 8:00 PM EDT (UTC−4). It was produced by Don Mischer.\nThe official motto of the closing ceremony is \"An American Day of Inspiration\".\n\nAs the Opening,the closing ceremony began with a 22-part countdown, for the total number of Modern Olympic Games held up to that point. With each count, footage from the relevant competition was shown, with the competition held in Atlanta represented by an image of the opening ceremony.\n\nThe closing ceremony began after a 22-second countdown in tribute to all the past Summer Olympic Games with the Atlanta Olympic Band, led by John Williams, performing his piece \"Summon the Heroes\". After that, the R&B group Boyz II Men performed the  U.S. anthem. The Greek and Australian (with Sydney being the next host) anthems were also performed.[2]\n\nMedals for the competition were presented by Mario Vázquez Raña, IOC Member; Mexico, and the medalists' bouquets were presented by Primo Nebiolo, IAAF President; Italy.\n\nThe presentation of the medals for the men's marathon followed:\n\n Josia Thugwane - Gold\n Lee Bong-Ju - Silver \n Erick Wainaina - Bronze\n\nThe spectators and athletes then performed a card trick stunt which revealed a laurel wreath similar to the Quilt of Leaves pattern. Members of the Morehouse College Glee Club performed \"Faster, High, Stronger\". Cuban singer Gloria Estefan then joined the Glee Club and they performed the song \"Reach\", one of the official songs of the Atlanta Olympic Games.\n\nAfter these performances, a plethora of BMX bikers, skaters, and skateboarders performed a stunt show, showcasing sports that were invented in the United States. As the show concluded, the 197 flags of the participating nations were carried into the stadium by athletes of each of their respective countries. The song \"The Sacred Truce\", written exclusively for the occasion, was performed by the Atlanta Olympic Band and the Atlanta Symphony Youth Orchestra. In keeping with tradition dating from the 1920 Summer Olympics, the flag of the host nation (in this case the American flag) was raised beside the Olympic flag that had been flying inside the stadium over the previous 16 days. After that, the Greek flag and the Australian flag (in honor of the  Sydney, Australia, the host city of the Games of the XXVII Olympiad scheduled for September 15 to October 1, 2000) were raised at the awarding ceremonies flagpoles.[3]\n\n\nIn accordance with the Olympic Charter, IOC President Juan Antonio Samaranch called on the youth of the world to assemble in Sydney, in four years, for the next Summer Olympics. In a speech, he denounced the Centennial Olympic Park bombing of the previous week. Samaranch asked for a moment of silence to remember the victims of the bombing, as well as the 11 Israeli athletes killed in the Munich massacre during the 1972 Summer Olympics.[4] He said that the attacks would be remembered, and added: \nNo act of terrorism has ever destroyed the Olympic movement, and none ever will. More than ever we are fully committed to building a better, more peaceful world in which forms of terrorism are eradicated.[5]\nThough this was first official IOC recognition of the Munich tragedy since 1972,[4] commentators had mentioned it during the competition several times, They noted that the next Olympics were due to take place in Nagano, Japan, which had also last hosted an the last Olympics in 1972: when the Winter Games were held in Sapporo.\n\nSamaranch thanked Atlanta, saying the city's effort had been \"most exceptional\". He broke with precedent and did not say 1996 had been the best Olympics ever, as he had done at every previous closing ceremony during his tenure as IOC president. Four years later he called the Sydney Olympics the best ever. After that, IOC presidents ceased referring to the Olympics as \"the best ever\", meaning that Sydney was the last host city to be honored that way.This measure was made to avoid any type of competition and comparison between future host cities[6]\n\nBefore Samaranch declared the games officially closed, R&B singer Stevie Wonder sang a cover of John Lennon's \"Imagine\" in memory of the victims of the Centennial Olympic Park bombing.[4]\n\nThis part of the program culminated in the \"Antwerp Ceremony\" (so called because this act started at the 1920 Summer Olympics in Antwerp and consisted on the transfer of the Olympic Flag, from the mayor of Atlanta, Bill Campbell, to Samaranch, and then to the mayor of Sydney, Frank Sartor. Immediately succeeding the transition, an eight-minute elaborate act called \"One Day in Sydney\" was presented to introduce the next host city (Sydney) to the world started. It featured  music of the composers Carl Vine and David Page, as well as dance members from the indigenous dance company Bangarra Dance Theatre (including the young Kirk Page)[7] and members of the Australian Olympic Team. This segment was directed by Stephen Page and Ric Birch, and recorded songs by Christine Anu, Djakapurra Munyarrun, Mathew Doyle, and Leroy Cummings were played. The Sydney handover act was called \"A Day in the Life of Sydney\", and featured representations of aboriginal and australiana cultures, along with flora and fauna endemic to the Australian state of New South Wales, such as the Waratah and sulphur-crested cockatoo. Four inflated balloons arose to form the shape of the Sydney Opera House to present the then Sydney 2000 logo, while members of the Australian Olympic Team and local volunteers held up blue Olympic banners around the prop to form a simulation of the Olympic Rings at  waters of the Sydney Harbour as a clues of what would happen in 4 years.[8][9]\n\nAfterwards, Atlanta native mezzo-soprano Jennifer Larmore, along with the Morehouse College Glee Club and the Atlanta Symphony Youth Orchestra sang the Olympic Hymn while the Olympic flag was lowered. Eight USA volunteers where choosen  \nto remove the flag from the Stadium as a form of thanks to all those who worked to make the event happen. The flag was raised again in Nagano for the 1998 Winter Olympics; its opening ceremony took place at the Nagano Olympic Stadium on the morning of February 7, 1998.\n\nAfter the lowering of the Olympic flag and the singing of the Olympic Hymn, some 600 children from Atlanta ranging from ages six though twelve sang a rendition of \"The Power of the Dream\", which was performed by Celine Dion in the opening ceremony. The segment started with ten-year-old Rachel McMullin singing the first stanza. As the song progresses more children join in creating a full choir. The children line up and hold hands to form the Atlantic Olympic emblem while holding up flashlights. The spectators and athletes then sing and hold hands in unison. At the end of the song, the children shout in unison, \"Y'all come back now!\" a friendly gesture inviting the athletes and citizens of the world to come together at Sydney four years from that time, though the next Olympics would happen 18 months afterward in Nagano, Japan, Olympic customs and regulations maintain that the Olympic Winter Games and the Games of the Olympiad (Summer) are separate events.\n\nHighlights of the past events were once more replayed on two jumbotrons in the stadium as the Atlanta Symphony Youth Orchestra performs \"The Flame\", composed by John Barlow Jarvis with lyrics by Joseph Lee Henry.[10] The crowd was silenced, as Georgia native and country singer Trisha Yearwood sang an a cappella version of the same song. Upon conclusion of the song, the flame extinguished slowly.\n\nThe ceremony concluded with an all-star tribute to American popular music. A New Orleans-style funeral commenced the segment which eventually turns into a celebration with elaborate swing music.\n\nAn array of performers culminated in the finale which was led by Late Show's Paul Shaffer,[11] and conductor Harold Wheeler. As with most closing ceremonies, the athletes were invited onto the field below the stadium to sing and dance along with the music. Among the performers were:\n\nA fireworks display officially closed the segment, though the performers continued to play music.\n",
  "concepts": [
    "1996 Summer Olympics closing ceremony",
    "olympic",
    "sydney",
    "olympics",
    "atlanta",
    "flag",
    "ceremony",
    "performed",
    "games",
    "summer",
    "stadium"
  ],
  "findings": [
    "Dignitaries",
    "Dignitaries from International organizations",
    "Host country dignitaries",
    "Foreign dignitaries",
    "The ceremony",
    "Countdown",
    "Summon the Heroes",
    "Marathon medal presentation",
    "Reach",
    "Sydney 2000",
    "Power of the Dream",
    "Extinguishing of the flame",
    "Musical finale",
    "Anthems",
    "Notes",
    "TV coverage",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T15:40:26.131207"
}