{
  "title": "Burnett v. National Enquirer, Inc.",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Burnett_v._National_Enquirer,_Inc.",
  "content": "Carol Burnett v. National Enquirer, Inc. was a decision by the California Court of Appeal, which ruled that the \"actual malice\" required under California law for imposition of punitive damages is distinct from the \"actual malice\" required by New York Times Co. v. Sullivan to be liable for defaming a \"public figure\", and that the National Enquirer is not a \"newspaper\" for the purposes of California libel law.\n\nIn 1976, the leading U.S. gossip tabloid, the National Enquirer, published a brief column incorrectly implying that actress-comedienne Carol Burnett had been drunk and boisterous in a nightclub encounter with U.S. Secretary of State Henry Kissinger. Burnett, a passionate campaigner against alcoholism, sued the National Enquirer for libel, persistently, over several years, ultimately settling out-of-court for a reported $200,000. Though offering no witnesses to its defense, initially, the Enquirer argued that it was exempt from liability on legal grounds—particularly on grounds arising from the First Amendment to the United States Constitution. Initially Burnett sought $10 million, but her attorney sued in California courts for $1.6 million—which a jury awarded Burnett, in actual and punitive damages. However, the presiding court cut the award, and in subsequent appeals the award was reduced to $200,000—though the final settlement was out-of-court. The case was widely regarded as a watershed event in tabloid journalism, and some analysts suggest it may have increased celebrities' willingness to sue tabloids for libel, and dampened tabloids' recklessness in reporting—though others contend it did little to reduce a profitable industry's flouting of the laws against libel.[1][2][3][4][5][6][7][excessive citations]\n\nIn January 1976, the actress Carol Burnett was dining at the Rive Gauche restaurant in Georgetown, Washington, D.C. She drank \"two or three\" glasses of wine but was not drunk. She exchanged parts of her dessert, a chocolate soufflé, with diners at a couple of neighboring tables after they became curious about it. Later, as she was leaving the restaurant, she was introduced to Henry Kissinger, who was also dining in the restaurant.\n\nIn March of that year, the National Enquirer published a short item about the incident, \"Carol Burnett and Henry K. in Row\". It read, in its entirety:\n\nIn a Washington restaurant, a boisterous Carol Burnett had a loud argument with another diner, Henry Kissinger. Then she traipsed around the place offering everyone a bite of her dessert. But Carol really raised eyebrows when she accidentally knocked a glass of wine over one diner and started giggling instead of apologizing. The guy wasn't amused and 'accidentally' spilled a glass of water over Carol's dress.\nCalifornia law specifies that a \"newspaper\" is protected from all non-economic damages for libel if it publishes a retraction equally conspicuous to the original offending article. The Enquirer published a short retraction in April 1976:\n\nAn item in this column on March 2 erroneously reported that Carol Burnett had an argument with Henry Kissinger at a Washington restaurant and became boisterous, disturbing other guests. We understand these events did not occur and we are sorry for any embarrassment our report may have caused Miss Burnett.\nThe retraction proved unsatisfactory to Burnett, who went on to sue the Enquirer for libel in Los Angeles Superior Court. Because Burnett was judged to be a public figure under the standard of New York Times Co. v. Sullivan, she was required to prove \"actual malice:\" that the defendant, which published the item, knew that it was false or had reckless disregard for whether it was true or false by \"clear and convincing evidence.\" During the trial, it became apparent that the Enquirer had published the story on the basis of the account of a paid informant, Couri Hays, who had told the Enquirer that Burnett had taken her souffle around the restaurant in a boisterous manner but that she was emphatically not drunk. He had not said anything about Kissinger.\n\nAn Enquirer reporter had attempted to verify the story but had discovered nothing other than that Burnett had shared her souffle and had conversed with Kissinger. Still, the story was published.\n\nCalifornia law specifies that punitive damages can be awarded only if an item is published with \"actual malice,\" which is defined as \"that state of mind arising from hatred or ill will toward the plaintiff; provided, however, that such a state of mind occasioned by a good faith belief on the part of the defendant in the truth of the libelous publication or broadcast at the time it is published or broadcast shall not constitute actual malice.\" The trial court instructed the jury that it had to find the \"actual malice\" (as defined in California state law) \"by a preponderance of the evidence\" to award punitive damages.\n\nThe jury awarded Burnett $300,000 in compensatory damages and $1.3 million in punitive damages. The trial court reduced this to $50,000 in compensatory damages and $750,000 in punitive damages.\n\nThe Enquirer subsequently appealed on four grounds:\n\nThe Court of Appeal ruled against the Enquirer on its first three arguments. The Court distinguished the standard of \"actual malice\" defined by New York Times vs. Sullivan, which had to be proved by \"clear and convincing evidence,\" from that required by California state law for the imposition of punitive damages, which has to be established only by a preponderance of the evidence. In addition, the Court found that the National Enquirer did not qualify as a \"newspaper\" under California libel and so was not protected by the fact that it had issued a retraction.[8]\n\nThe Court, however, found for the Enquirer in its final argument. It found that the award was nearly 35% of the net value of The Enquirer and reduced the punitive damages to $150,000.\n",
  "concepts": [
    "Burnett v. National Enquirer, Inc.",
    "enquirer",
    "burnett",
    "damages",
    "court",
    "california",
    "punitive damages",
    "punitive",
    "published",
    "carol",
    "actual"
  ],
  "findings": [
    "Facts",
    "Action",
    "Judgment",
    "References",
    "Bibliography",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:34.017752"
}