{
  "title": "Melvin Johnson",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Melvin_Johnson",
  "content": "Melvin Maynard Johnson Jr. (August 6, 1909 – January 9, 1965), nicknamed Maynard Johnson, was an American designer of firearms, lawyer, and United States Marine Corps officer.\n\nBorn into an affluent Boston, Massachusetts, family, he was commissioned into the Marine Corps Reserve in 1933 as a Second Lieutenant and completed Harvard Law School in 1934. Johnson designed a recoil-operated rifle (M1941 Johnson rifle) while serving for the Marines as an observer at the Army's Springfield Armory in 1935. Johnson received four U.S. patents on various design features. He also designed the Johnson Light Machine Gun, derived from the M1941 rifle, which was used in limited numbers during World War II and the M1947 Johnson auto carbine, also derived from the M1941 rifle and M1941 light machine gun.\n\nHe co-authored the 1942 book Weapons for the Future, which is part of the Infantry Journal series. The other author was Army Ordnance Corps member Charles T. Haven. Throughout the war, Johnson put up a lot of effort to promote his machine gun and rifle.\n\nJohnson transferred to the Army Ordnance Corps Reserve from the Marine Corps Reserve in 1949 and rose to the rank of Colonel. In 1949, Winchester bought the Johnson Automatics corporation and employed Johnson for a short period.[1] While at Winchester, Johnson was employed alongside \"Carbine\" Williams though it is unknown if they worked on the same projects. \n\nHe was later appointed as weapons consultant to the Secretary of Defense in 1951.\n\nJohnson's patents were used by Armalite on the AR-10, AR-15, and later M16 rifles. Johnson was hired by Armalite as a consultant to promote their rifle incorporating his bolt design.[2] Johnson also worked to improve the M1 Carbine eventually developing the 5.7mm MMJ (commonly known as .22 Spitfire) cartridge, unsuccessfully submitting it to the U.S. Ordnance Department as a cost effective alternate cartridge conversion for the M1 Carbine. Such conversions are easily accomplished by replacing the barrel, or relining the barrel with a .22 caliber liner and restoring the gas port, as well as adding a caliber specific feed ramp. In 1963, he then started Johnson Arms, Inc. to make, sell, convert, and promote M1 Carbines using his 5.7mm MMJ cartridge.\n\nWhile on a business trip to New York City in 1965, Johnson died of a heart attack. He is buried in Mount Auburn Cemetery in Cambridge, Massachusetts.\n\nJohnson's practice was to give all of his weapons a \"pet\" nicknames.\n\nThis biographical article related to the United States Marine Corps is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Melvin Johnson"
  ],
  "findings": [
    "Biography",
    "Designs",
    "References",
    "Further reading"
  ],
  "timestamp": "2025-04-11T10:18:29.492049"
}