{
  "title": "Gosho clan",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Gosho_clan",
  "content": "The Gosho clan (御所氏 or 五所氏, Gosho-shi) is a Japanese samurai and shake family descending from the Fujiwara clan. They served the Kamakura Shogunate in close service of shogun Minamoto no Yoritomo during the early Kamakura period, and served as shinkan government officials at the Atsuta Shrine in the Nanboku-chō and Muromachi periods. As of modern times, they have been a prominent family (meizoku) in Usa, Buzen Province, in the area of Fukuoka and Ōita Prefecture.\n\nThe Gosho clan is a branch of the Fujiwara clan,[1] a powerful family of Japanese regents and court nobility, founded by Fujiwara no Kamatari in the 7th century. Their origins are in Atsuta, Owari Province (present-day Atsuta, Nagoya, Aichi Prefecture). They took the name Gosho from the Atsuta Palace (Atsuta Gosho) that they lived in as the acting governor (daikan) of the shrine and its territory.[2]\n\nIn the late 12th century, Gosho no Gorōmaru became a close retainer of shogun Minamoto no Yoritomo,[2] and is recorded in the historical chronicle Azuma Kagami and the chronicle-tale Soga Monogatari.[3] In 1193, Gorōmaru participated in the shogun's grand hunting event Fuji no Makigari,[4] during which on June 28, 1193, the Soga brothers, Soga Sukenari and Soga Tokimune, killed Kudō Suketsune and planned an attack on the shogun, an incident known as the Revenge of the Soga Brothers. The brothers began a bloodbath at the event during which Sukenari was killed and after which Gorōmaru apprehended Tokimune before he could attack the shogun. Gorōmaru's apprehension of Tokimune marked an end to the Revenge of the Soga Brothers incident,[5] and his legacy lives on in noh and kabuki Sogamono theater.[6][7]\n\nAccording to legend, Gosho no Gorōmaru was the lord of Tobe (in present-day Yokohama) in the Kamakura period and succeeded the former lands of the Mutō clan. A tomb of Gorōmaru and a monument exist in Goshoyama, Yokohama, part of the historic Tobe, but there is no further information on his activities in the area. Tobe was originally territory of the Mutō clan until Mutō Sukeyori descended to Kyushu and established the Shōni clan.[8] However, apart from legend, it remains uncertain who succeeded the Mutō clan's domains in Musashi Province.[9] Goshogaoka, Goshogayatsu and Goshonoyato in Koshigoe, Kamakura, Kanagawa Prefecture are named after Gorōmaru's mansion whose remains exist there.[10][11]\n\nIn June 1196, the Gosho clan descended to Kyushu with Ōtomo Yoshinao,[2] the newly-appointed Governor of Buzen and Bungo Provinces and Defense Commissioner of the West who was also a retainer of Yoritomo. On June 11, 1196, they entered Kyushu from Hamawakiura, Hayami, Bungo Province (present-day Ōita Prefecture).[12][13]\n\nLater, they served in several positions such as magistrate general (sōbugyō) or administrator general (sōkengyō) of the Atsuta Shrine. They succeeded the court rank of Senior Sixth Rank and the position of grand officer of divine offerings (ōuchibito), a position passed down from generation to generation in the Moribe no Sukune clan, and began the hereditary succession of the position. Gosho no Gorōmaru's (a descendant of the 12th century Gosho no Gorōmaru) son, head priest (saishu) Hataya Taifu Masatsugu, succeeded as ōuchibito in 1334.[2] In 1442, Moribe Gorōmaru succeeded the same position. In 1470, Moribe Yasutomi was appointed Fifth Rank. The Moribes, along with several members of the Gosho clan succeeding the name Moribe, served as ōuchibito of the Atsuta Shrine from 686 until 1872 for over 1,100 years from first generation Moribe no Sukune Hikoya until 24th generation Moribe Kiyonobu.[14]\n\nAs of modern times, the Gosho clan have been a prominent family (meizoku) in Usa, Buzen Province (part of present-day Fukuoka and northern Ōita Prefecture).[2] In Usa, Ōita Prefecture, the tradition tells that they are the descendants of shinkan of the Atsuta Shrine.[15]\n",
  "concepts": [
    "Gosho clan"
  ],
  "findings": [
    "Origins",
    "History",
    "See also",
    "References"
  ],
  "timestamp": "2025-04-11T10:15:24.924702"
}