{
  "title": "Majestic Record Corporation",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Majestic_Record_Corporation",
  "content": "Majestic Record Corporation was an American record label in 1916 and 1917.\n\nMajestic was incorporated in the state of New York on September 25, 1916 with a capitalization of $10,000. Three names behind the start of Majestic were J. C. Reis, R. V. Schoenfeld and D. Green.[1] They had their corporate office and their manufacturing site at two separate locations in New York City.\n\nMajestic was part of the miniature record fad of this era that was started by Little Wonder Records in 1914. They initially produced 7-inch 78rpm vertical-cut records and would later also produce 9.25-inch vertical cut records. Both records had an etched label design. They marketed heavily to the trade looking for distributors for their records throughout the country. The 7-inch record sold for 25 cents while the 9.25-inch record sold for 50 cents. The selling point for Majestic was both the selling price and that they had 165 threads to the inch (or grooves to the inch) — a very fine groove. This meant they played as long as their competitors' standard 10-inch records for a fraction of the price. The 9.25-inch records claimed four-and-a-half minutes of music. Since these records were vertical-cut, they also sold the Majestic Adaptor so that the records could be played on any phonograph.[2]\n\nOne of the companies they did strike a distribution deal with was the King Talking Machine Company, also of New York City, makers of the Harrolla line of phonographs. This was announced to the trade in February 1917.[3] It is not clear when exactly, but by June 1917 both of these companies appear to have folded.\n",
  "concepts": [
    "Majestic Record Corporation",
    "records",
    "inch",
    "majestic",
    "record",
    "25",
    "york",
    "vertical cut",
    "vertical",
    "sold",
    "new york"
  ],
  "findings": [
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:29.048934"
}