{
  "title": "The Amazing Race 18",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/The_Amazing_Race_18",
  "content": "The Amazing Race 18 (also known as The Amazing Race: Unfinished Business) is the eighteenth season of the American reality competition show The Amazing Race. Hosted by Phil Keoghan, it featured eleven teams of two, each returning from a previous edition of the series, competing in a race around the world in order to win US$1,000,000. This season visited five continents and nine countries and traveled over 40,000 miles (64,000 km). Starting in Palm Springs, California, racers traveled through Australia, Japan, China, India, Austria, Liechtenstein, Switzerland, and Brazil before returning to the United States and finishing in the Florida Keys. A new twist introduced in this season includes the automatic U-Turn for the last team to finish the first task. This season was also the first to be filmed and broadcast for high-definition television. The season premiered on CBS on Sunday, February 20, 2011, and the finale aired on May 8, 2011.\n\nSisters Kisha and Jen Hoffman from The Amazing Race 14 were the winners of this season, while Herbert \"Flight Time\" Lang and Nathaniel \"Big Easy\" Lofton of the Harlem Globetrotters from The Amazing Race 15 finished in second place, and father and daughter Gary Ervin and Mallory Ervin from The Amazing Race 17 finished in third place.\n\nThe Amazing Race 18 was the first season of the United States series to be broadcast on high-definition television.[2] While most other prime-time television shows had transitioned to high definition, including other reality television shows, previous seasons of The Amazing Race used standard-definition television due to the cost and fragility of high-definition recording equipment.[3]\n\nFilming started on November 20, 2010, at the San Gorgonio Pass wind farm near Palm Springs, California.[4] Teams were spotted at Oceanworld Manly around November 22, 2010,[5] and a day later around the mining town of Broken Hill, New South Wales, in the Australian Outback.[6] Other locales cited as destinations were Yokohama, Japan, where teams swam in freezing waters near Mount Fuji, and the series' first visit to Liechtenstein.[7] In total, this season traveled a little over 40,000 miles (64,000 km) across 23 cities and five continents.[8]\n\nThe Express Pass, introduced in the previous season, returned and allowed a team to bypass one single task later in the season. The last team to complete the first task was forced to complete a U-Turn in the next leg, performing both tasks of the leg's Detour.[9]\n\nPhil Keoghan described all the contestants as teams that \"came so close to winning but for one reason or another just didn't quite make it over the finish line in first place.”[10] Keoghan gave examples of two teams: Zev & Justin from season 15, who had finished first on a leg, but lost a passport too late to continue racing; and Kisha & Jennifer from season 14, who took an ill-timed restroom break while racing to the Pit Stop and were eliminated.[10] The prior experience of all the teams in previous seasons allowed the producers to increase the difficulty of the various tasks and challenges.[10] All of the teams were from recent seasons of The Amazing Race with the earliest season being season 12. According to Bertram van Munster, they stayed with more recent teams because \"if we're digging too far back, people might not even remember who they were\".[7] Season 14 was represented by five of the eleven teams; van Munster called this particular season of The Amazing Race \"a very unique season\" and justified its larger proportion of teams.[7] Though they had considered mother and son fan-favorites Toni and Dallas Imbimbo from season 13, Keoghan stated they felt the other selected teams \"have the best stories and the best motivation\" for casting.[11] During an interview with CBS's The Early Show, season 17 runners-up Brook Roberts and Claire Champlin revealed they were asked to take part on the season, but couldn't due to the latter's pregnancy.[12]\n\nSnapple served as a sponsor this season of The Amazing Race, with \"Snapple Real Facts\" introduced during commercial breaks. The sixth leg of the season in Kolkata, India, featured several tasks involving a papaya-and-mango flavored tea Snapple developed and named after the show.[13] Ford also sponsored the season, with their new Focus serving as a prize during the eighth leg.\n\nThis season featured eleven returning teams from previous seasons vying a second chance to win.\n\nThe teams cited the following details from their respective races as their reason for having \"unfinished business\":\n\nMargie & Luke, Flight Time & Big Easy, and Jet & Cord returned for a third time to compete on The Amazing Race: All-Stars.[15] Mallory returned on the same season forming a composite team with Mark Jackson when his partner, William \"Bopper\" Minton, was not medically cleared to compete.[16]\n\nOutside of The Amazing Race, Mallory appeared on the Discovery Channel reality show Backyard Oil in 2013.[17] On May 25, 2016, Flight Time & Big Easy appeared on an Amazing Race-themed primetime special of The Price Is Right.[18] Mike White later competed on Survivor: David vs. Goliath.[19] Flight Time & Big Easy also appeared on 100 Day Dream Home in 2021.[20]\n\nThe following teams are listed with their placements in each leg. Placements are listed in finishing order.\n\nA new feature to this season is an online show, allowing the viewers to see what happens behind the scenes of The Amazing Race, hosted by Keoghan.[1] This feature replaced the \"Elimination Station\" videos as seen in previous seasons.\n\nThe Amazing Race 18 received mixed reviews. Scott Von Doviak of The A.V. Club wrote that by the end of the season, it was \"finishing (mostly) strong after so many lackluster weeks along the way.\"[23] Daniel Fienberg of HitFix wrote that \"this 'Amazing Race' season was almost conspicuously designed to prevent memorable moments.\"[24] Luke Dwyer of TV Fanatic wrote that \"the start of The Amazing Race: Unfinished Business was chock full of dynamic challenges, interesting legs and surprises. As the number of teams got whittled down, the legs became less creative.\"[25] Michael Hewitt of the Orange County Register wrote that \"the show still has much to recommend it: spectacular locations, engrossing human drama and brilliant editing. But it needs to be a race once again.\"[26] Patrick Hodges of CinemaBlend wrote that it was \"all in all, a very good season. Lots of great locations, lots of sportsmanship, very few assclownish moments.\"[27] In 2016, this season was ranked 13th out of the first 27 seasons by the Rob Has a Podcast Amazing Race correspondents.[28] Kareem Gantt of Screen Rant wrote that this \"the legs are fantastically planned and executed, the suspense was high, and viewers even got some emotional eliminations that made for great TV.\"[29] In 2021, Jane Andrews of Gossip Cop ranked this season as the show's 7th best season.[30] In 2022, Rhenn Taguiam of Game Rant ranked this season as the sixth-best season.[31] In 2024, Taguiam's ranking was updated with this season becoming the eighth-best season.[32]\n\nCanadian broadcaster CTV also airs The Amazing Race on Sundays at 8 p.m., with only two exceptions: Episode two aired an hour earlier than its normal start time due to CTV's broadcast of the 83rd Academy Awards. Episode six aired an hour earlier due to the said network's broadcast of the 2011 Juno Awards.\n",
  "concepts": [
    "The Amazing Race 18"
  ],
  "findings": [
    "Production",
    "Development and filming",
    "Casting",
    "Release",
    "Marketing",
    "Contestants",
    "Results",
    "Race summary",
    "Leg 1 (United States → Australia)",
    "Leg 2 (Australia)",
    "Leg 3 (Australia → Japan)",
    "Leg 4 (Japan → China)",
    "Leg 5 (China)",
    "Leg 6 (China → India)",
    "Leg 7 (India)",
    "Leg 8 (India → Austria)",
    "Leg 9 (Austria → Liechtenstein → Switzerland)",
    "Leg 10 (Switzerland)",
    "Leg 11 (Switzerland → Brazil)",
    "Leg 12 (Brazil → United States)",
    "Phil's Video Diary",
    "Reception",
    "Critical response",
    "Ratings",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:47:14.692974"
}