{
  "title": "Sex-determining region Y protein",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Sex-determining_region_Y_protein",
  "content": "1HRY, 1HRZ, 1J46, 1J47, 2GZK\n6736\n21674\nENSG00000184895\nENSMUSG00000069036\nQ05066\nQ05738\nNM_003140\nNM_011564\nNP_003131\nNP_035694\nSex-determining region Y protein (SRY), or testis-determining factor (TDF), is a DNA-binding protein (also known as gene-regulatory protein/transcription factor) encoded by the SRY gene that is responsible for the initiation of male sex determination in therian mammals (placentals and marsupials).[5] SRY is an intronless sex-determining gene on the Y chromosome.[6] Mutations in this gene lead to a range of disorders of sex development with varying effects on an individual's phenotype and genotype.\n\nSRY is a member of the SOX (SRY-like box) gene family of DNA-binding proteins. When complexed with the (SF-1) protein, SRY acts as a transcription factor that causes upregulation of other transcription factors, most importantly SOX9.[7] Its expression causes the development of primary sex cords, which later develop into seminiferous tubules. These cords form in the central part of the yet-undifferentiated gonad, turning it into a testis. The now-induced Leydig cells of the testis then start secreting testosterone, while the Sertoli cells produce anti-Müllerian hormone.[8] Effects of the SRY gene, which normally take place 6–8 weeks after fetus formation, inhibit the growth of female anatomical structural in males. The gene also contributes towards developing the secondary sexual characteristics of males.[9]\n\nSRY may have arisen from a gene duplication of the X chromosome bound gene SOX3, a member of the SOX family.[10][11] This duplication occurred after the split between monotremes and therians. Monotremes lack SRY and some of their sex chromosomes share homology with bird sex chromosomes.[12] SRY is a quickly evolving gene, and its regulation has been difficult to study because sex determination is not a highly conserved phenomenon within the animal kingdom.[13] Even within marsupials and placentals, which use SRY in their sex determination process, the action of SRY differs between species.[11] The gene sequence also changes; while the core of the gene, the high-mobility group (HMG) box, is conserved between species, other regions of the gene are not.[11] SRY is one of only four genes on the human Y chromosome that have been shown to have arisen from the original Y chromosome.[14] The other genes on the human Y chromosome arose from an autosome that fused with the original Y chromosome.[14]\n\nSRY has little in common with sex determination genes of other model organisms, therefore, mice are the main model research organisms that can be utilized for its study. Understanding its regulation is further complicated because even between mammalian species, there is little protein sequence conservation. The only conserved group in mice and other mammals is the HMG box region that is responsible for DNA binding. Mutations in this region result in sex reversal, where the opposite sex is produced.[15] Because there is little conservation, the SRY promoter, regulatory elements and regulation are not well understood. Within related mammalian groups there are homologies within the first 400–600 base pairs (bp) upstream from the translational start site. In vitro studies of human SRY promoter have shown that a region of at least 310 bp upstream to translational start site are required for SRY promoter function. It has been shown that binding of three transcription factors, steroidogenic factor 1 (SF1), specificity protein 1 (Sp1 transcription factor) and Wilms tumor protein 1 (WT1), to the human promoter sequence, influence expression of SRY.[15]\n\nThe promoter region has two Sp1 binding sites, at -150 and -13 that function as regulatory sites. Sp1 is a transcription factor that binds GC-rich consensus sequences, and mutation of the SRY binding sites leads to a 90% reduction in gene transcription. Studies of SF1 have resulted in less definite results. Mutations of SF1 can lead to sex reversal, and deletion can lead to incomplete gonad development. However, it is not clear how SF1 interacts with the SR1 promoter directly.[16] The promoter region also has two WT1 binding sites at -78 and -87 bp from the ATG codon. WT1 is transcription factor that has four C-terminal zinc fingers and an N-terminal Pro/Glu-rich region and primarily functions as an activator. Mutation of the zinc fingers or inactivation of WT1 results in reduced male gonad size. Deletion of the gene resulted in complete sex reversal. It is not clear how WT1 functions to up-regulate SRY, but some research suggests that it helps stabilize message processing.[16] However, there are complications to this hypothesis, because WT1 also is responsible for expression of an antagonist of male development, DAX1, which stands for dosage-sensitive sex reversal, adrenal hypoplasia critical region, on chromosome X, gene 1. An additional copy of DAX1 in mice leads to sex reversal. It is not clear how DAX1 functions, and many different pathways have been suggested, including SRY transcriptional destabilization and RNA binding. There is evidence from work on suppression of male development that DAX1 can interfere with function of SF1, and in turn transcription of SRY by recruiting corepressors.[15]\n\nThere is also evidence that GATA binding protein 4 (GATA4) and FOG2 contribute to activation of SRY by associating with its promoter. How these proteins regulate SRY transcription is not clear, but FOG2 and GATA4 mutants have significantly lower levels of SRY transcription.[17] FOGs have zinc finger motifs that can bind DNA, but there is no evidence of FOG2 interaction with SRY. Studies suggest that FOG2 and GATA4 associate with nucleosome remodeling proteins that could lead to its activation.[18]\n\nDuring gestation, the cells of the primordial gonad that lie along the urogenital ridge are in a bipotential state, meaning they possess the ability to become either male cells (Sertoli and Leydig cells) or female cells (follicle cells and theca cells). SRY initiates testis differentiation by activating male-specific transcription factors that allow these bipotential cells to differentiate and proliferate. SRY accomplishes this by upregulating SOX9, a transcription factor with a DNA-binding site very similar to SRY's. SOX9 leads to the upregulation of fibroblast growth factor 9 (Fgf9), which in turn leads to further upregulation of SOX9. Once proper SOX9 levels are reached, the bipotential cells of the gonad begin to differentiate into Sertoli cells. Additionally, cells expressing SRY will continue to proliferate to form the primordial testis. This brief review constitutes the basic series of events, but there are many more factors that influence sex differentiation.\n\nThe SRY protein consists of three main regions. The central region encompasses the high-mobility group (HMG) domain, which contains nuclear localization sequences and acts as the DNA-binding domain. The C-terminal domain has no conserved structure, and the N-terminal domain can be phosphorylated to enhance DNA-binding.[16] The process begins with nuclear localization of SRY by acetylation of the nuclear localization signal regions, which allows for the binding of importin β and calmodulin to SRY, facilitating its import into the nucleus. Once in the nucleus, SRY and SF1 (steroidogenic factor 1, another transcriptional regulator) complex and bind to TESCO (testis-specific enhancer of Sox9 core), the testes-specific enhancer element of the Sox9 gene in Sertoli cell precursors, located upstream of the Sox9 gene transcription start site.[7] Specifically, it is the HMG region of SRY that binds to the minor groove of the DNA target sequence, causing the DNA to bend and unwind. The establishment of this particular DNA \"architecture\" facilitates the transcription of the Sox9 gene.[16] In the nucleus of Sertoli cells, SOX9 directly targets the Amh gene as well as the prostaglandin D synthase (Ptgds) gene. SOX9 binding to the enhancer near the Amh promoter allows for the synthesis of Amh while SOX9 binding to the Ptgds gene allows for the production of prostaglandin D2 (PGD2). The reentry of SOX9 into the nucleus is facilitated by autocrine or paracrine signaling conducted by PGD2.[19] SOX9 protein then initiates a positive feedback loop, involving SOX9 acting as its own transcription factor and resulting in the synthesis of large amounts of SOX9.[16]\n\nThe SF-1 protein, on its own, leads to minimal transcription of the SOX9 gene in both the XX and XY bipotential gonadal cells along the urogenital ridge. However, binding of the SRY-SF1 complex to the testis-specific enhancer (TESCO) on SOX9 leads to significant up-regulation of the gene in only the XY gonad, while transcription in the XX gonad remains negligible. Part of this up-regulation is accomplished by SOX9 itself through a positive feedback loop; like SRY, SOX9 complexes with SF1 and binds to the TESCO enhancer, leading to further expression of SOX9 in the XY gonad. Two other proteins, FGF9 (fibroblast growth factor 9) and PDG2 (prostaglandin D2), also maintain this up-regulation. Although their exact pathways are not fully understood, they have been proven to be essential for the continued expression of SOX9 at the levels necessary for testes development.[7]\n\nSOX9 and SRY are believed to be responsible for the cell-autonomous differentiation of supporting cell precursors in the gonads into Sertoli cells, the beginning of testes development. These initial Sertoli cells, in the center of the gonad, are hypothesized to be the starting point for a wave of FGF9 that spreads throughout the developing XY gonad, leading to further differentiation of Sertoli cells via the up-regulation of SOX9.[20] SOX9 and SRY are also believed to be responsible for many of the later processes of testis development (such as Leydig cell differentiation, sex cord formation, and formation of testis-specific vasculature), although exact mechanisms remain unclear.[21] It has been shown, however, that SOX9, in the presence of PDG2, acts directly on Amh (encoding anti-Müllerian hormone) and is capable of inducing testis formation in XX mice gonads, indicating it is vital to testes development.[20]\n\nEmbryos are gonadally identical, regardless of genetic sex, until a certain point in development when the testis-determining factor causes male sex organs to develop. A typical male karyotype is XY, whereas a female's is XX. There are exceptions, however, in which SRY plays a major role. Individuals with Klinefelter syndrome inherit a normal Y chromosome and multiple X chromosomes, giving them a karyotype of XXY. Atypical genetic recombination during crossover, when a sperm cell is developing, can result in karyotypes that are not typical for their phenotypic expression.\n\nMost of the time, when a developing sperm cell undergoes crossover during meiosis, the SRY gene stays on the Y chromosome. If the SRY gene is transferred to the X chromosome instead of staying on the Y chromosome, testis development will no longer occur. This is known as Swyer syndrome, characterized by an XY karyotype and a female phenotype. Individuals who have this syndrome have normally formed uteri and fallopian tubes, but the gonads are not functional. Swyer syndrome individuals are usually considered as females.[22] On the other spectrum, XX male syndrome occurs when a body has 46:XX Karyotype and SRY attaches to one of them through translocation. People with XX male syndrome have a XX Karyotype but are male.[23] Individuals with either of these syndromes can experience delayed puberty, infertility, and growth features of the opposite sex they identify with. XX male syndrome expressers may develop breasts, and those with Swyer syndrome may have facial hair.[22][24]\n\nWhile the presence or absence of SRY has generally determined whether or not testis development occurs, it has been suggested that there are other factors that affect the functionality of SRY.[25] Therefore, there are individuals who have the SRY gene, but still develop as females, either because the gene itself is defective or mutated, or because one of the contributing factors is defective.[26] This can happen in individuals exhibiting a XY, XXY, or XX SRY-positive karyotype.\n\nAdditionally, other sex determining systems that rely on SRY beyond XY are the processes that come after SRY is present or absent in the development of an embryo. In a normal system, if SRY is present for XY, SRY will activate the medulla to develop gonads into testes. Testosterone will then be produced and initiate the development of other male sexual characteristics. Comparably, if SRY is not present for XX, there will be a lack of the SRY based on no Y chromosome. The lack of SRY will allow the cortex of embryonic gonads to develop into ovaries, which will then produce estrogen, and lead to the development of other female sexual characteristics.[27]\n\nSRY has been shown to interact with the androgen receptor and individuals with XY karyotype and a functional SRY gene can have an outwardly female phenotype due to an underlying androgen insensitivity syndrome (AIS).[28] Individuals with AIS are unable to respond to androgens properly due to a defect in their androgen receptor gene, and affected individuals can have complete or partial AIS.[29] SRY has also been linked to the fact that males are more likely than females to develop dopamine-related diseases such as schizophrenia and Parkinson's disease. SRY encodes a protein that controls the concentration of dopamine, the neurotransmitter that carries signals from the brain that control movement and coordination.[30] Research in mice has shown that a mutation in SOX10, an SRY encoded transcription factor, is linked to the condition of Dominant megacolon in mice.[31] This mouse model is being used to investigate the link between SRY and Hirschsprung disease, or congenital megacolon in humans.[31] There is also a link between SRY encoded transcription factor SOX9 and campomelic dysplasia (CD).[32] This missense mutation causes defective chondrogenesis, or the process of cartilage formation, and manifests as skeletal CD.[33] Two thirds of 46,XY individuals diagnosed with CD have fluctuating amounts of male-to-female sex reversal.[32]\n\nOne of the most controversial uses of this discovery was as a means for sex verification at the Olympic Games, under a system implemented by the International Olympic Committee in 1992. Athletes with an SRY gene were not permitted to participate as females, although all athletes in whom this was \"detected\" at the 1996 Summer Olympics were ruled false positives and were not disqualified. Specifically, eight female participants (out of a total of 3387) at these games were found to have the SRY gene. However, after further investigation of their genetic conditions, all these athletes were verified as female and allowed to compete. These athletes were found to have either partial or full androgen insensitivity, de",
  "concepts": [
    "Sex-determining region Y protein",
    "sry",
    "gene",
    "sex",
    "sox9",
    "transcription",
    "male",
    "cells",
    "development",
    "binding",
    "factor"
  ],
  "findings": [
    "Gene evolution and regulation",
    "Evolution",
    "Regulation",
    "Function",
    "Action in the nucleus",
    "SOX9 and testes differentiation",
    "SRY disorders' influence on sex expression",
    "Role in other diseases",
    "Use in Olympic screening",
    "Ongoing research",
    "Fetal development- knockout models",
    "See also",
    "References",
    "Further reading",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:27.308336"
}