{
  "title": "Alfredo Catalani",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Alfredo_Catalani",
  "content": "Alfredo Catalani (19 June 1854 – 7 August 1893) was an Italian operatic composer. He is best remembered for his operas Loreley (1890) and La Wally (1892).[1] La Wally was composed to a libretto by Luigi Illica, and features Catalani's most famous aria \"Ebben? Ne andrò lontana.\" This aria, sung by American soprano Wilhelmenia Fernandez, was at the heart of Jean-Jacques Beineix's 1981 film Diva. Catalani's other operas were much less successful.\n\nBorn in Lucca, Catalani came from a musical family.[2] He was trained at the Milan Conservatory,[3] where his teachers included Antonio Bazzini. Despite the growing influence of the verismo style of opera during the 1880s and early 1890s, Catalani chose to compose in a more traditional manner, which had traces of Wagner in it. As a result, his operas (La Wally excepted) have largely lost their place in the modern repertoire, even compared to those of Massenet and Puccini, whose style his own periodically resembles. (Catalani much resented Puccini's emergence and even accused Puccini, falsely, of plagiarism.)\n\nThe influence of Amilcare Ponchielli can also be recognized in Catalani's output. Catalani's reputation, like Ponchielli's, now rests almost entirely on one work. However, while La Wally enjoys occasional revivals, Ponchielli's La Gioconda has always been the more popular opera of the two (287 performances, most recently in 2008 at the Metropolitan Opera, New York, as opposed to only four for La Wally, not produced there since 1909).\n\nIn 1893, upon his premature death from tuberculosis in Milan, Catalani was interred in the Cimitero Monumentale, where Ponchielli and conductor Arturo Toscanini also lie. A passionate admirer of Catalani's music, Toscanini even named one of his daughters Wally. Toscanini recorded the prelude to Act IV of La Wally and the \"Dance of the Water Nymphs\" from Loreley in Carnegie Hall in August 1952 with the NBC Symphony Orchestra for RCA Victor.\n\nIn 1981, his work was highlighted by the release of Diva, a thriller directed by Jean-Jacques Beineix which employed the aria from La Wally.\n",
  "concepts": [
    "Alfredo Catalani"
  ],
  "findings": [
    "Life and career",
    "Operas",
    "Symphonic works",
    "References",
    "Further reading",
    "External links"
  ],
  "timestamp": "2025-04-11T10:16:11.887622"
}