{
  "title": "Liam Heath",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Liam_Heath",
  "content": "Liam Heath (born 17 August 1984) is a British sprint canoeist.[1][2]  He is the most successful British canoeist at the Olympics with a total of four medals; he won a gold medal in the individual 200m kayak sprint event at the 2016 Summer Olympics and a bronze in the 2020 Olympics, as well as a silver in the men's double with Jon Schofield in 2016.[3] and a bronze at the 2012 London Olympics in the K-2 200 with Schofield.[4][5]\n\nHe is a member of Wey Kayak Club.[6]\n\nLiam Heath was born in Guildford, Surrey on 17 August 1984.[7] He attended the George Abbot School in Guildford.[8] His parents are Lawrence and Linda Heath. He was first introduced to kayaking when he was 10 at a 'holiday fun' activity week at the Wey Kayak Club based in Guildford, and competed with GB Canoeing as a junior.[7][9]\n\nHeath studied industrial design and technology at Loughborough University between 2003 and 2006.[5] In his first year at Loughborough, he commuted to Holme Pierrepont near Nottingham to train in the Under-23s.  In his second year, after suffering from appendicitis, he decided to give up canoeing to concentrate on his studies.[10] Shortly after graduating he returned to canoeing and trained at the Wey Kayak Club under the guidance of Paul Dimmock. To finance his training Liam worked for a time mixing cocktails at T.G.I. Friday's in Guildford.[5] Liam gave up on kayaking for the second time after failing to be selected by GB Canoeing.  Although Liam Heath and Jon Schofield were at Loughborough concurrently – they overlapped for two years – they did not meet until several years later when they were introduced by Dimmock at a Nottingham regatta.\n\nIn August 2009, the IOC announced that the 200 metres Sprint Canoe events would be introduced at the London Olympics, and Liam was persuaded to take up the sport again.[11] In November 2009, at the age of 25, he was invited to train with the GB sprint canoe team, and in his first six months of training he was funded entirely by his parents. He paired up with Jonathan Schofield in the K2 200m and, in their first season, they won gold medals in the K2 200m at the 2nd World Cup in Szeged and the 3rd World Cup in Duisburg  – where they also won silver as members of the 4xMK1 200m relay team – and became European Champions in July 2010. They also won two medals at the 2010 ICF Canoe Sprint World Championships in Poznań with a silver in the K-1 4 × 200m relay and a bronze in the K-2 200m event.\n\nIn the 2011 international season he and Schofield won two silver medals at World Cups 1 and 2 at Poznan and Racice and retained their K2 200m title at the European Championships in Belgrade in June 2011.  At the ICF Canoe Sprint World Championships in Szeged in August they won the silver medal, thereby gaining qualification for the GB K2 boat in the Men's 200m event at the 2012 Olympics.  A fortnight later Heath and Schofield took part in the London Invitational Olympic Canoe Sprint test event at Eton Dorney where they won the bronze medal in the K2 200m.\n\nAt the end of 2011 Heath and Schofield received Olympic Athlete of the Year awards in canoeing from the British Olympic Association.[12]\n\nAt the National Regatta in Nottingham in April 2012 Heath and Schofield met GB Canoeing's K2 200m nomination criteria to compete in the 2012 Summer Olympiad. They won silver medals in World Cup 1 in Poznan and World Cup 2 in Duisburg and were part of the four-man GB 200m relay team that won the gold medal in Duisburg.\n\nHeath and Schofield formally became members of Team GB on 14 June 2012. A week later, at the European Canoe Sprint Championships in Zagreb they won the K2 200m title for the third year in a row.[13]\n\nIn the inaugural men's K2 200m Olympic event at London 2012 Heath and Schofield secured a bronze medal in the final at Eton Dorney on 11 August 2012, just edged out of the silver by the Belarus team.[14][15]\n\nDuring the 2013 international canoe sprint season Heath and Schofield won the K2 200m silver medals at the first two World Cup regattas in Szeged and Racice respectively but missed out on a medal when they came 4th at the European Championships in Montemor-o-Velho, Portugal.  Two months later at the World Championships in Duisburg the pair came second behind the Russians Postrigay and Dyachenko and were part of the fourth placed GB men's 4 × 200 m team.\n\nAt the British Canoe Union's National Canoe Sprint Championships in April 2014 Heath won the K1 200m and (with Jon Schofield) the K2 200m titles.  As a result, Heath was selected to compete in the K1 200m for the first time in a senior international event at the ICF World Cup 2 in Racice in the Czech Republic, where he won the silver medal 0.033 seconds behind Mark de Jonge. 20 minutes later Heath was back on the water with Schofield for the K2 200m final in which they came 4th 0.036 seconds behind the French boat.  At World Cup 3 in Szeged Heath competed in the K2 200m only, winning silver with Schofield behind the new German pairing of Ronald Rauhe and Tom Liebscher. Heath and Schofield came 4th in both the European Championships (in Brandenburg - see ‘Postscript’ below) and World Championships (in Moscow) and won a bronze medal with Ed McKeever and Kristian Reeves in the Men's K1 4 × 200m relay in Moscow.\n\nIn April 2015 Heath won the K1 200m and (with Jon Schofield) the K2 200m selection races at the BCU Canoe Sprint Regatta at Holme Pierrepont, Nottingham.  At World Cup 2, in Duisburg, Heath and Schofield won bronze in the K2 200m, and at World Cup 3, in Copenhagen, they won gold. At the inaugural European Games in Azerbaijan in June, as members of Team GB, they came joint 4th in the K2 200m final, 0.006 seconds off winning bronze.  At the World Championship in Milan in August Heath and Schofield came 5th thereby qualifying Team GB to enter a boat in the Men's K2 200m event at the 2016 Olympics.[16]\n\nBritish Canoeing held its Olympic Selection event for canoe sprint in April 2016 in Nottingham, during which Heath and Schofield won the K2 200m race, setting a course record and guaranteeing their nomination to the BOC to compete at the Rio Olympics.[17] At the same event Heath won the K1 200m race making him \"holder\" of the right to also be nominated for this event in Rio. At World Cup 1 in Duisburg Heath was joint-3rd in the K1 200m and, with Schofield, came 7th in the K2 200m. A week later, at World Cup 2 in Racice, the duo won bronze and on the following day Heath came first in the K1 200m race. At the end of June Heath became the K1 200m 2016 European Canoe Sprint Champion in Moscow.[18]\n\nAt the 2016 Summer Olympics, Heath and Schofield won the silver K-2 200 event, finishing behind Spain's Saúl Craviotto and Cristian Toro.[19] He then won the gold in the K-1 200 final, making him the then most successful British canoeist at the Olympics, overtaking Tim Brabants' record of one gold and two bronze medals.[3][5]\n\nThe K-2 200m event was dropped for the 2020 Tokyo Olympics, Heath therefore focused his attention on the single Kayak events in the following seasons.[20]\n\nAt the beginning of the year Heath's long-time coach, Alex Nikonorov, left British Canoeing to take up a senior coaching role with the Chinese national team. At the same time the GB canoe sprint squad moved its training base to Nottingham. However, Heath chose to remain in the South, training at Dorney Lake and Bisham Abbey with the assistance of Tim Brabants' former coach, Eric Farrell.[21]\n\nIn the MK1 200m events at the second and third ICF Canoe Sprint World Cups Heath won gold in Szeged and silver in Belgrade.[20][22] At the European Championships in Plovdiv, Bulgaria, he successfully defended his K1 200m title in a World best time of 33.38 seconds.[23] A month later, in a time of 33.73 seconds, Heath took gold at the ICF Canoe Sprint World Championships in Racice to achieve the grand-slam of European, World and Olympic titles within a calendar year.[24]\n\nWith the birth of his and his wife Em's first child in September 2017 Heath decided to take a year out from competing in the K1 200m to focus on family life. He did, however, stay in training and became a member of GB Canoeing's new K4 500m crew.[25] The make-up of the crew was unconventional, inasmuch as it consisted of four short-distance paddlers, but its performance gradually improved over the season achieving fourth place in the B Final of the World Championships in Montemor O Velho, Portugal.[26]\n\nAt the end of the 2018, after discussions with GB Canoeing and his family, Heath decided to return to competing at 200m with the aim of defending his Olympic title at Tokyo 2020. After Winter training at Dorney Lake, Bisham Abbey and the Wey Kayak Club with coach Eric Farrell, Heath was selected for the GB Canoeing squad at the national regatta at Holme Pierrepont in late April. In May Heath won gold in the MK1 200m at both ICF Canoe Sprint World Cups (in Poznań and Szeged).[27][28] At the 2019 ICF Canoe Sprint World Championships held in Szeged, Hungary, Heath regained his K-1 200m title thereby qualifying Team GB to enter a boat in the Men's event at the 2020 Tokyo Olympics.[29] In accordance with British Canoeing's \"Joint Canoe Sprint & Paracanoe International Panel Statement\" [30] Heath's gold medal secured his nomination, on 10 October 2020, to the British Olympic Association for selection to Team GB at Tokyo 2020.[31]\n\nHalfway through March 2020 British Canoeing recalled its senior canoe sprint squad from training camp in Spain as COVID-19 began to spread through the continent. Heath had to train at home due to the national lockdown announced by the government.[32] The 2020 Tokyo Olympics was postponed until July 2021, and the BOC and British Canoeing confirmed that the five canoeing athletes already nominated for Tokyo 2020 would remain as selected to represent Team GB at the rescheduled Games.[33]  After the first lockdown ended, Heath was able to resume training on water, and was allowed to continue training behind closed doors throughout the duration of the second[34] and third lock-downs in England.\n\nHeath did not have the opportunity to race until the Senior Squad Selection regatta at the Holme Pierrepont National Watersports Centre in April 2021 at which he set a new 200m course record of 34.03 seconds.[35] A month later he raced at his first international competition in over 20 months, ICF Canoe Sprint World Cup 1 in Szeged, where he won gold by 0.03 of a second over Hungary's Sándor Tótka.[36] Liam did not travel to Barnaul in Russia for World Cup 2 and was one of only two British paddlers to compete at the European Championships in Poznan at the beginning of June where he won silver in the men's K1 200m, 0.022 seconds behind Sándor Tótka.[37]\n\nAt the 2020 Summer Olympics held in Tokyo in 2021 Liam won a bronze medal in the K-1 200 metres event behind Hungary's Sandor Totka and Italian Manfredi Rizza.[38] In his quarter-final race he set a new Olympic best time of 33.985 seconds.[39]\n\nAfter the birth of his second daughter at the beginning of the year Liam Heath announced his retirement from competitive racing in April 2022.[40]\n\nIn June 2022 the Court of Arbitration for Sport (CAS) upheld appeals filed by the World Anti-Doping Agency (WADA) against the International Canoe Federation (ICF) decisions not to charge three Russian canoe sprint athletes, including Aleksandr Dyachenko, with breaking anti-doping rules. All three had been found to have committed anti-doping violations in 2014 by the CAS. Consequently Heath and Schofield’s fourth place at the Brandenburg 2014 European Championships was upgraded to the bronze medal position.[41]\n\nHeath was awarded the MBE in the Queen's 2017 New Year Honours list for services to canoeing.[42]\n\nHeath has been awarded Honorary Doctorates by the University of Surrey, in 2017,[43] and Loughborough University, in 2018.[44]\n",
  "concepts": [
    "Liam Heath"
  ],
  "findings": [
    "Early life",
    "Career",
    "2009–2011",
    "2012 Olympics",
    "2013–2015",
    "2016 Olympics",
    "2017",
    "2018",
    "2019",
    "2020",
    "2021-2022",
    "Postscript",
    "Honours",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:24:16.555866"
}