{
  "title": "William Mason (1757–1818)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/William_Mason_(1757–1818)",
  "content": "William Mason (22 October 1757 – 7 February 1818)[1][2] was an American planter and soldier. He was a militiaman in the American Revolutionary War and a prominent Virginia planter. Mason was the third son of George Mason, an American patriot, statesman, and delegate from Virginia to the U.S. Constitutional Convention.\n\nMason was born on 22 October 1757.[1][2] He was the fourth child and third eldest son of George Mason and his wife Ann Eilbeck.[1][2] Like his brothers, Mason was educated by tutors at Gunston Hall.[1]\n\nDuring the American Revolutionary War, Mason accepted a captain's commission and served in the Fairfax Militia fighting under Henry Lee III in South Carolina.[1][3] In 1780, Mason's father declined an offer by Lee to continue his military service because his father felt Mason's \"lot must be that of a farmer and gentleman.\"[1] Mason was presented with a sword by General George Washington, which was said to have been given to him by Charles III of Spain.[3] Mason returned to private life between December 1780 and June 1781.[1]\n\nIn 1780, Mason inherited the Eilbeck family estates, Araby and Mattawoman, in Charles County, Maryland, from his maternal grandfather upon the death of his widow (Mason's grandmother), Sarah Eilbeck.[1][4] \nMason also received all his father's properties in Charles County.[1] These properties were located along Chicamuxen and Mattawoman Creeks, adjacent to the Eilback lands.[5][6]\n\nUnlike his eldest two brothers (but like his two younger brothers), Mason did not marry during his father's lifetime, but rather within a year after his death. On July 11, 1793 William Mason married Ann Stuart, daughter of Rev. William and Sarah Stuart, on 11 July 1793 at St. Paul's Episcopal Church in King George, Virginia.[1][2] The bride's grandfather as well as her father served as rector of St. Paul's parish in King George County, and Sarah became the heiress of her maternal grandfather, Richard Foote of Cedar Grove plantation in King George County. The couple had five children, of whom four married.[1][2] Their second son, another George Mason, would purchase Lexington from his uncle's estate and in turn left it to his son George Mason of Springbank, who died of typhoid fever and without children in Portland, Oregon on April 19, 1888.[7]\n\nMason died on 7 February 1818 at Mattawoman in Charles County, Maryland at age 60.[2] Although that plantation house no longer exists, Araby does. His descendants occupied Araby until 1849.[4]  Mason's daughter Mary Elizabeth Mason sold the 402 acres (1.63 km2) including the mansion to William Thompson in that year.[4]\n\nWilliam Mason (1757–1814) was:\n",
  "concepts": [
    "William Mason (1757–1818)",
    "mason",
    "george",
    "william",
    "father",
    "county",
    "son george",
    "son",
    "george mason",
    "charles",
    "american"
  ],
  "findings": [
    "Early life and education",
    "American Revolutionary War",
    "Properties",
    "Marriage and children",
    "Death and legacy",
    "Relations",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:35.308063"
}