{
  "title": "Nigel Cox (artist)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Nigel_Cox_(artist)",
  "content": "Nigel Cox (born 1959) is an Irish figurative artist.[1]\n\nCox, the second youngest of four children, grew up in Dundalk, Ireland; he had three sisters, Sandra, Jacqui and Nicola.  Cox left Ireland in 1977 to study marine radio and radar technology, at Riversdale College of Technology, Liverpool, UK in order to become a Radio Officer in the Merchant Navy. He then joined the Transglobe Expedition,[2] led by Sir Ranulph Fiennes. This three-year expedition achieved the first circumnavigation of the globe on land,[3] sea and ice via North and South poles along the Greenwich Meridian.  In 1989 Cox moved to London.\n\nDuring the Transglobe Expedition,[4] whose Patron was HRH Prince Charles,[5] Cox was at sea, on an ice cap or in a remote location, surrounded by the vast and desolate spaces which had a profound effect and influenced his art.[6]  During the expedition Cox's medium was sketchbook and watercolour.\n\nCox began painting in watercolour while on the Transglobe Expedition creating illustrations for his diary. He continued painting when living in Germany developing his technique in both watercolour and oils.  In his work, Cox takes everyday people out of their busy surroundings[6] and places them out of context, in minimalist empty landscapes.  His techniques and influences are further explored in his interview in The Argus, by Margaret Roddy.[7]\n\n2018 - Corey Helford Gallery, Los Angeles, California, Solo Exhibition, Solitude & The Road to Extinction [8]\n\n2018 - Galerie Hegemann, Munich, Germany, Contempo, Group Exhibition [9]\n\n2017 - Jonathan LeVine Gallery, New York, USA, The Shape of Things to Come, Group Exhibition [10]\n\n2016 - CONTEXT Art Miami, Miami, USA with Corey Helford Gallery [11]\n\n2016 - Corey Helford Gallery, Los Angeles, USA, Group Exhibition [12]\n\n2016 - Galerie Hegemann Gallery, Munich, Germany (Two man show with sculptor Michael Pickl) [13]\n\n2016 - Gormleys Fine Art, Dublin 2, Ireland, Far from the Crowd, Solo Show [14]\n\n2015 - Rarity Gallery, Mykonos, Greece, Group Exhibition[15]\n\n2014 - Oblivious, Coates & Scarry, Mayfair, London, U.K. Solo Show [16]\n\n2014 - Quantum Contemporary Art, Art Wynwood, Miami, Florida [17]\n\n2013 - Coates & Scarry, Philadelphia Street Gallery, Bristol, UK, Group Exhibition[18]\n\n2013 - Stroke Urban Art Fair, Coates & Scarry, Munich, Germany [19]\n\n2013 - Trailblazers, Above Second Gallery/Coates & Scarry, Hong Kong, Group Exhibition [20]\n\n2013 - Sanguine, Elisabeth Weinstock and Coates & Scarry, LA, California, Group Exhibition [21]\n\n2012 - Rarity Gallery Summer Salon Show, Mykonos, Greece, Group Exhibition[22]\n",
  "concepts": [
    "Nigel Cox (artist)",
    "gallery",
    "exhibition",
    "group exhibition",
    "group",
    "cox",
    "art",
    "scarry",
    "expedition",
    "coates scarry",
    "coates"
  ],
  "findings": [
    "Biography",
    "Early life",
    "Transglobe expedition",
    "Work",
    "Paintings and technique",
    "Exhibitions",
    "Acknowledgments",
    "Commissions & Awards",
    "Contributions",
    "Resources",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:09.961293"
}