{
  "title": "Lazaretto (song)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Lazaretto_(song)",
  "content": "\"Lazaretto\" is the first single from Jack White's second solo album of the same name. The live version of the song was recorded, pressed and released on the same day (19 April 2014).[1] On the B-side was a cover of Elvis Presley's song \"Power of My Love\".[2][3]\n\nBy recording, pressing and releasing the live version of \"Lazaretto\" in less than four hours, Jack White broke the previous Guinness World Record set by Swiss polka trio Vollgas Kompanie, who issued their album Live on August 16, 2008, a day after they recorded it.  There is a hidden message alongside matrix numbers in the runout areas on both sides of the \"Lazaretto\" \"world's fastest record\" vinyl: side A \"Guinness\", side B \"Can Kiss My...\"\n\nThe studio version of the song was released on April 21 on YouTube, and on April 22 the single was available for purchase digitally and as an instant download with all iTunes Lazaretto album pre-orders.[4]\n\nA music video for \"Lazaretto\" was created by Jonas & François.\n\nThe song is a playable track in Guitar Hero Live and Rock Band 4. The song could also be heard in the TV Show Black Lighting.\n\nAccording to White, the musical arrangement to \"Lazaretto\" was inspired by MC Lyte's 1989 hit single \"Cha Cha Cha\".[5][6]\n\nIn one positive review that emphasized White's guitar prowess, Billboard wrote that the single \"is in-and-out, leaving the listener panting and ready to hear more from White's new album.\"[7]  Giving the single four stars, Chuck Arnold of People said that on the track, White \"unleashes one of his funkiest grooves since 'Seven Nation Army'.\"[8]  Madison Vain, with Entertainment Weekly called the song a \"dense, manic, and fantastically indulgent display of musicality,\" and said it \"further cement[s] his position as rock & roll's primal keeper of the flame.\"[9]\n\nThe song was nominated for two Grammy Awards—Best Rock Song and Best Rock Performance—winning the latter.\n\nThis 2014 single-related article is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Lazaretto (song)",
    "song",
    "white",
    "single",
    "lazaretto",
    "rock",
    "live",
    "album",
    "version",
    "cha",
    "april"
  ],
  "findings": [
    "Background",
    "Critical reception",
    "Track listing",
    "Charts",
    "Weekly charts",
    "Year-end charts",
    "Personnel",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:20:18.889105"
}