{
  "title": "Diletta Rizzo Marin",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Diletta_Rizzo_Marin",
  "content": "\nDiletta Rizzo Marin (born in Vicenza) is an Italian operatic mezzo-soprano admired for the quality of her voice and her skills in acting.[1][2] She has appeared frequently at the Festival Internacional de Santander.\n\nDiletta Rizzo Marin was born into a family of musicians. Her father, Roberto Scandiuzzi, is also an opera singer.[3] She studied piano and she received her laurea in theatrical performance from L'Università Ca' Foscari in Venice.\n\nHer official debut was in July 2004 in a solo recital at the 53rd Festival Internacional de Santander. She returned to the Festival again in 2005 appearing in a concert with Roberto Scandiuzzi, the Coral Salvé de Laredo, and the Orchestra 900 del Teatro Regio di Torino. The live recording of the concert was issued by the RTVE-Música label in February 2006.[4] (A further performance of the concert took place at the Festival de Úbeda in June 2007.)[5] Her most recent appearance at the Festival Santander was in August 2007 when she sang the leading role of Amina in a production of Bellini's La sonnambula directed by Hugo de Ana.\n\nRizzo Marin is a university representative for UNICEF Italia and appears in benefit concerts for the organization, the most notable of which was a Gala at the Teatro Comunale di Treviso on 6 January 2007 with Roberto Scandiuzzi, Luciana D'Intino and Roberto Frontali. The gala, in aid of UNICEF's project to reduce infant mortality in Tajikistan, also celebrated the 25th anniversary of Scandiuzzi's stage debut.[6]\n\nIn 2008 she made her French debut in the role of Lucietta from I quattro rusteghi at the Théâtre du Capitole in Toulouse and sang the role of Lisette in Puccini's La rondine with Opéra de Nice.\n\nIn the 2011/2012 season she sang at the Teatro Verdi in Trieste for the first time as Lauretta in Gianni Schicchi and Monica in The Medium and returned there to sing  Musetta in La bohème.  In Bari she sang Euridice in a concert performance of Gluck's Orfeo ed Euridice. She sang at the Teatro Verdi in Sassari in a double bill of Nino Rota's  operas La notte di un nevrastenico (as Lei) and I due timidi (as Mariuccia)' She made her Latin American debut that season as Xenia in a production of Boris Godunov at the Teatro Municipal in Santiago, Chile.  She also sang in the Rossini's Stabat Mater at the Rudolfinum in Prague and in recitals at the Musashino Cultural Center in Tokyo.\n\nLe Plaisir Du Chant Songs by Purcell, Handel, Mozart, Faurè, Granados, Serrano (Diletta Rizzo Marin, Soprano; Alberto Boischio, Piano). Velut Luna CVLD157.[7]\n",
  "concepts": [
    "Diletta Rizzo Marin"
  ],
  "findings": [
    "Biography",
    "Recording",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:47:07.309675"
}