{
  "title": "Rosa arvensis",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Rosa_arvensis",
  "content": "Rosa arvensis, the field rose, is a species of wild rose native to Western, Central and Southern Europe.\n\nThe plant is variously known as the field rose[2] and white-flowered trailing rose.[3]\n\nThe following synonyms were recognised in October 2018:[4]\n\nRosa arvensis is closely related to Rosa sempervirens L. and Rosa phoenicia Boiss.[5]\n\nThe plant can grow to be between 3 and 3.7 metres (9.8 and 12.1 ft) tall. Its flowers are white, 4 to 5 centimetres (1.6 to 2.0 in) across, and its fruits ('hips') are red. It blooms in the summer (July in England,[2] May–June in Bulgaria).[6] Rosa arvensis is a vigorous, thorny, rambling shrub with long arching or scrambling purple stems and slightly fragrant, single creamy-white flowers produced in one flush in midsummer, followed by oval orange-red hips.[7]\n\nRosa arvensis was first identified in England and has been subsequently observed elsewhere in Europe.[8][9] In England, it can be seen principally in hedges and thickets,[3] while in Bulgaria, it also forms part of the understory of deciduous forests.[6]\n\nIt is found in most of the British Isles, France and Belgium, the Pyrenees (at altitudes up to 1000 m) and in more scattered localities elsewhere in Spain, in the west and south of Germany, the foothills of the Alps (up to 1330 m in the Central and Eastern Alps, up to 1400 m in the Maritime Alps), in Italy, Western Hungary, in the Little Carpathians of Slovakia, the Carpathians of Romania, most of the Balkan Peninsula (in Bulgaria up to 1000 m).[10] It has been reported in isolated occurrences in North-western Africa, southern Anatolia and the Levant, but it is likely these are instead instances of R. phoenicia. In Caucasia it is present only as a cultivated plant.[11]\n",
  "concepts": [
    "Rosa arvensis"
  ],
  "findings": [
    "Names",
    "Classification",
    "Description",
    "Distribution",
    "References",
    "Citations",
    "Bibliography"
  ],
  "timestamp": "2025-04-11T10:49:14.808609"
}