{
  "title": "Oliphaunt",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Oliphaunt",
  "content": "In J. R. R. Tolkien's epic fantasy The Lord of the Rings, an oliphaunt (known in Gondor as a mûmak, plural: mûmakil)[1] is a giant elephant-like beast. They are encountered only as war elephants used by the army of the Haradrim. Tolkien borrowed the word from Middle English to give a rustic feeling to Sam Gamgee's speech. The beasts are first mentioned by Sam as he explains to Gollum what an oliphaunt is; he hopes to see one. His wish is fulfilled as he witnesses Faramir's ambush of a contingent from Harad in Ithilien. Several mûmakil take part in the Battle of the Pelennor Fields.\n\nTolkien wrote two \"Oliphaunt\" poems, one a playfully childlike rhyme recited by Sam in The Lord of the Rings, the other a humorous poem in the medieval bestiary tradition mocking the excessive use of allegory in Middle English verse. Scholars have analysed Tolkien's sources for his oliphaunts, noting the Old English account in the Homily on the Maccabees and his mention of Pyrrhus of Epirus's use of war elephants against Ancient Rome.\n\nPeter Jackson modifies the beast, making it more like a Gomphotherium, and adds two fights with the mûmakil during the Battle of the Pelennor Fields, one featuring the Elf Legolas, the other Éowyn, the lady of Rohan, gaining a mixed reception.\n\nTolkien borrowed the term oliphaunt from Middle English, which in turn was a borrowing of Old French olifaunt. These terms meant an ordinary elephant.[T 1] Tolkien stated in his guide for translators that the word was \"used as a 'rusticism', on the supposition that rumour of the Southern beast would have reached the Shire long ago in the form of legend.\"[T 2]\n\nIn The Lord of the Rings, oliphaunts are mentioned as Samwise Gamgee explains what one is to Gollum by reciting an old Shire poem,[T 3] and then encountered twice. Sam and Frodo Baggins see one in Ithilien as they witness the ambush of a contingent from Harad by Faramir's men of Gondor. Tolkien implies that they are a larger (and now extinct) relative of the elephant.[T 4]\n\nFear and wonder, maybe, enlarged him in the hobbit’s eyes, but the Mûmak of Harad was indeed a beast of vast bulk, and the like of him does not walk now in Middle-earth; his kin that live still in latter days are but memories of his girth and majesty.[T 4]\nMany more are present at the Battle of the Pelennor Fields, where the Haradrim are part of Sauron's assault on Minas Tirith, and the horses of the Rohirrim were too scared to approach them.[T 5]\n\nElizabeth Solopova and Stuart D. Lee argue that the Haradrim's mûmakil war elephants put their country far to the East, since only India and lands to its east went on using war elephants after classical times.[3] They mention that Tolkien could have used the Old English version by Ælfric of the Book of Maccabees, which carefully introduces elephants to its Anglo-Saxon audience, using much the same phrase as Sam Gamgee, \"māre þonne sum hūs\", \"bigger than a house\", before describing their use in battle; the hero stabs the elephant, which is carrying a \"wīghūs\", a \"battle-house\", from below.[3] Tolkien however mentioned Pyrrhus of Epirus's use of war elephants against Ancient Rome in 280–275 BC in his notes for the illustrator Pauline Baynes.[2]\n\nKathleen O'Neill, in Cistercian Studies Quarterly, writes that while Sam is \"open to wonder\" and excited about the possibility of seeing an oliphaunt, Gollum's fearful mind is \"so utterly closed to the goodness of what is as to will away its very existence\".[4] In O'Neill's view, God \"quickly\" rewards Sam with the terrifying view of an out-of-control oliphaunt, giving him \"lasting delight\" and gratitude. She adds that this capacity for seeing the good even in dark moments comes to his aid in Mordor, when he sees a white star, knows its beauty, and realises that \"the Shadow was only a small and passing thing\".[4][T 6]\n\nBefore seeing the oliphaunt, Sam recites a poem of Shire-lore, to explain to Gollum what one is. It begins:[T 3][a]\n\nGrey as a mouse,\nBig as a house, \nNose like a snake, \nI make the earth shake.\n\nThe folklorist and Tolkien scholar Dimitra Fimi writes that with this song and the later encounter with the oliphaunt, Tolkien \"playfully complete[s]\" his depiction of Sam as an \"authentic active transmitter\" of folklore-style tradition among his people, despite his lack of Frodo's formal education and his rustic style of speech.[5]\n\nTolkien had published a different[6] poem on the oliphaunt theme, \"Iumbo, or ye Kinde of ye Oliphaunt\", in the Stapeldon Magazine in 1927. It begins:[T 9]\n\nThe Indic oliphaunt's a burly lump,\nA moving mountain, a majestic mammal\n(But those that fancy that he wears a hump\nConfuse him incorrectly with the camel).\n\nJohn D. Rateliff notes that Tolkien stated that when he read a medieval work, he wanted to write a modern one in the same tradition.[6] In the case of \"Iumbo\" the oliphaunt and \"Fastitocalon\", an island-sized whale, that was the medieval bestiary tradition. Tolkien adopts the pseudonym 'Fisiologus', imitating the medieval name 'Physiologus', \"the naturalist\", author of just such a bestiary. Rateliff notes that \"Iumbo\" is written in medieval style in two sections, a natura describing the oliphaunt's habits (addiction to mandrakes), and a significacio drawing a \"highly facetious, and egregiously inappropriate\" moral from the story, \"mocking the incessant allegorizing\"[6] of its Middle English model.[6]\n\nThe 1980 Rankin/Bass animated version of The Return of the King portrayed oliphaunts as resembling woolly mammoths.[8]\n\nIn Peter Jackson's film The Two Towers, the Haradrim appear Middle Eastern, with turbans, flowing robes, and riding mûmakil.[9] The beasts, constructed in CGI animation, differ markedly from Tolkien's account; Kristine Larsen describes his treatment of the oliphaunt as taking \"artistic liberties\" on the \"visual aspects\".[10] They have two pairs of tusks, one being curved upwards, and a third small pair from the cheekbones; their skull shape resembles Gomphotherium.[7]\n\nJackson's depiction was criticised in Mythprint for being \"too much just visual quotes from [the 1988 fantasy film] Willow.\"[11] Janet Brennan Croft writes that Jackson's invention of a battle between the Elf Legolas and a mûmak unnecessarily distracts attention from Éowyn's far more important fight with the Witch-king.[12]\nMaureen Thum on the other hand argues that while, as Jackson admits, his films offer \"only a relatively shallow rendering\" of the book, details like Éowyn's invented attack on the mûmakil – galloping beneath them with two swords raised – usefully gives a picture of the lady of Rohan as \"a strong able warrior\", preparing the viewer for the final showdown with the Witch-king.[13]\n\nAn oliphaunt in the 2024 anime film The Lord of the Rings: The War of the Rohirrim succeeds, according to Polygon, in \"mak[ing] oliphaunts terrifying again\".[14] The beast is \"rabid ... foaming at the mouth, covered in open wounds, without a handler in sight.\"[14] The tense effect is achieved, the article states, without any \"wizards and rings and gods and big, flashy magic\".[14]\n",
  "concepts": [
    "Oliphaunt"
  ],
  "findings": [
    "Etymology",
    "The Lord of the Rings",
    "Narrative",
    "Classical and medieval sources",
    "Christian perspective",
    "Poems",
    "Playful depiction",
    "Modern work in bestiary tradition",
    "In film",
    "Notes",
    "References",
    "Primary",
    "Secondary",
    "Sources"
  ],
  "timestamp": "2025-04-11T10:19:14.952758"
}