{
  "title": "Beauty in Trouble",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Beauty_in_Trouble",
  "content": "Beauty in Trouble (Czech: Kráska v nesnázích) is a 2006 Czech tragicomedy directed by Jan Hřebejk. Eddie Cockrell, writing in Variety, said the \"[t]itle comes from the Robert Graves poem, itself adapted into a Czech popular song in the 1980s, and performed in the film by homegrown thrush Radůza. Germ of the pic's idea was the first line, 'Beauty in trouble flees to the good angel/On whom she can rely...'\"[1]\n\nThe script is based on Robert Graves's enigmatic poem \"Beauty in Trouble\", and it begins with these words sung by a chanteuse who accompanies herself on the accordion.\n\nThe film is a naturalistic love story about the sex life of a beautiful woman, Marcela, and her concurrent relationships with three men; Jarda, her abusive husband, Risha, her abusive step-father, and Evžen, a dashing, older man she meets shortly after the film begins. With her husband, Jarda, she enjoys lustful sex and his physical abusiveness is an extension of a chauvinism that powers strong sexual encounters, but he is vain and not particularly bright about this. Richard, her mother's husband is unwittingly cruel, like an obnoxious and malicious child. He is played like  one of Steve Martins \"wild and crazy guys\" but more repulsively. Evžen, who becomes Marcela's benefactor/meal ticket, is a man of sophisticated tastes and fortunate parentage, a Czech who has inherited vineyards in Tuscany, to which home he takes Marcela and her two children.\n\nAt the beginning of the story, Marcela, Jarda and their children are living in Prague above the garage where Jarda operates his chop shop. She isn't happy with this situation. Jarda couldn't care less how she feels about their situation and is even less interested in the health of their son, who is suffering because of their living conditions. By chance, Jarda's associate steals Evžen’s car, which is equipped with a satellite tracking device and when Jarda goes to prison, Marcela takes her children to her mother's apartment, where they are met with Risha's venomous attention. Marcela despises her mother’s lecherous boyfriend and it eventually comes out that Risha fathered her first child and she escaped into marriage with Jarda at the age of seventeen.\n\nEvžen and Marcela meet at the police station, when they both came to deal with the fate of Jarda. Taken by her, although she doesn't encourage it, Evžen offers to help her and eventually, her children move into Jarda's empty manse in Prague when life with Risha becomes unbearable. Marcela gives herself to Evžen and they move to Italy but when Marcela’s mother dies, she and the children come back to Prague to the funeral where she sees Jarda, now released from prison. She and Jarda have one of their typical sexual encounters and when he speaks to her as he did during their marriage she pushes him away and leaves. Jarda's character is patently chauvinistic, which turns her on but insults her afterwards. When they return to Italy, ironically, Evjzen invites Risha to come with them to live in their guest house.\n\nCritic Roger Ebert rated the film three stars out of four, describing the film as \"This is the kind of film that achieves one simple but difficult thing: It pleases you.\"[2]\n\nThe film was released on 7 October 2006 in the Czech Republic and as of 2007[update], has grossed 1,428,703 US$. It was released in the United States on 13 June 2008 and grossed $19,300 in revenue while it acquired $1,471,868 from foreign markets for worldwide total of $1,491,168.[3]\n\nThe soundtrack album was released on 7 September 2006 in the Czech Republic.[4]\n\nIt is notable for including the song Falling Slowly which later received Academy Award for Best Original Song for its reuse in the movie Once.\n",
  "concepts": [
    "Beauty in Trouble",
    "jarda",
    "marcela",
    "film",
    "evžen",
    "czech",
    "risha",
    "children",
    "released",
    "mother",
    "trouble"
  ],
  "findings": [
    "Plot",
    "Cast",
    "Reception",
    "Box office",
    "Accolades",
    "Soundtrack",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:15.084983"
}