{
  "title": "Alan Griffin (basketball)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Alan_Griffin_(basketball)",
  "content": "Alan Griffin (born April 14, 2000) is an American professional basketball player who last played for the Westchester Knicks. He played college basketball for the Illinois Fighting Illini and the Syracuse Orange.\n\nGriffin attended Oak Park and River Forest High School in Oak Park, Illinois before moving to Ossining High School in Ossining, New York, where he played basketball alongside Obi Toppin.[1][2] For his final two years, he transferred to Archbishop Stepinac High School in White Plains, New York. As a senior, he averaged 19.2 points and 9.9 rebounds per game, shooting 48 percent from three-point range, and led his team to its first-ever New York State Federation Class AA title. Griffin also helped Stepinac win Catholic High School Athletic Association Archdiocesan and Class AA titles. He was named Player of the Year for Westchester County and Putnam County by The Journal News.[3] He committed to playing college basketball for Illinois over offers from Fordham, Iona and La Salle.[4]\n\nAs a freshman at Illinois, Griffin averaged 2.8 points in 8.1 minutes per game.[5] He became the team's sixth man as a sophomore.[2] On February 27, he scored a season-high 24 points and six three-pointers in a 74–66 win over Northwestern.[6] Griffin averaged 8.9 points and 4.5 rebounds per game per game.[7] He led the NCAA Division I in offensive rating among players who were used in at least 20 percent of their team's possessions.[8] After the season, Griffin transferred to Syracuse and received a waiver for immediate eligibility.[9] Through his first 5 games as a member of the Orange, he led the team in scoring with 18.4 points per game, and he led the team in points in 3 of those games, tallying 23, 20, and 22 points against Rider, Rutgers, and Boston College respectively. After going scoreless in the team's following game against Northeastern on December 16, Griffin would have a huge comeback game on December 19 against Buffalo, putting up 24 points, 10 rebounds, 3 assists, 2 steals and 3 blocks, including the game-saving rejection to send the game into overtime, which would eventually lead to an 11-point victory for Syracuse after being down by as many as 16 points.[10] Griffin averaged 13.3 points and 5.8 rebounds per game. Following the season he declared for the 2021 NBA draft.[11]\n\nAfter going undrafted in the 2021 NBA draft, Griffin joined the Rio Grande Valley Vipers after being acquired in a trade with the Santa Cruz Warriors in October.[12] However, he was waived on December 14 after 4 games.[13]\n\nOn December 19, 2021, Griffin signed with the Westchester Knicks.[14] On January 9, 2022, Griffin was reacquired by the Westchester Knicks.[15] He was then later waived on January 23, 2022.[16]\n\nGriffin is the son of Adrian Griffin and Audrey Sterling. His father played in the NBA for nine years. His mother was an All-American who ran track for Seton Hall. Griffin's younger brother, AJ, Selected in the 16th pick in the 2022 draft. He has an older sister, Vanessa, and his younger sister, Aubrey, plays college basketball for UConn.[17]\n",
  "concepts": [
    "Alan Griffin (basketball)",
    "griffin",
    "points",
    "game",
    "team",
    "high",
    "basketball",
    "westchester",
    "school",
    "rebounds",
    "played"
  ],
  "findings": [
    "High school career",
    "College career",
    "Professional career",
    "Rio Grande Valley Vipers (2021)",
    "Westchester Knicks (2021–2022)",
    "Career statistics",
    "College",
    "Personal life",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:31:10.329593"
}