{
  "title": "Pinosava",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Pinosava",
  "content": "Pinosava (Serbian Cyrillic: Пиносава) is a small town and a suburb of Belgrade, Serbia. It is located in Belgrade's municipality of Voždovac, on the western slope of the Avala mountain, in the valley of the Topčiderka river, over 15 kilometers south of downtown Belgrade. It is located in the Low Šumadija, and the neighboring plateau is named after the town (Pinosava plateau).\n\nOn 14 August 1932, the gliding school was opened in Pinosava, due to its position on the slopes of the Avala mountain. On the same day, Mrs. Srškić christened the first Yugoslav glider, naming it Orlić (\"eaglet\"). On 1 October 1933, additional hangar was added to the complex, and named \"Živko Jozanov\" after the student and gliding pioneer who was killed in accident.[3]\n\nPinosava is statistically classified as an urban settlement (town). The population has been fluctuating in the last several decades. Population of Pinosava according to the official censuses of population.\n\nEthnic structure: according to the census of 2002, the Serbs make 2,781 or 98% of the population.\n\nIn September 2019 it was announced that a large sports complex will be built in Pinosava. Total projected area of the complex is 78.8 ha (195 acres), of which 63 ha (160 acres) is planned for the golf courses, including a large, 18 holes course. The complex will also include restaurants, shops, warehouses and sports objects. Areas for basketball, volleyball, tennis, handball, indoor and outdoor swimming pools, sports hall and aqua park will cover 10 ha (25 acres) in total. One section, which covers 1.1 ha (2.7 acres), is allocated for apartments. The complex is planned in the southern part of the village, next to the Avala Road and the projected Avala-Ripanj Interchange.[4]\n",
  "concepts": [
    "Pinosava"
  ],
  "findings": [
    "History",
    "Population",
    "Characteristics",
    "References"
  ],
  "timestamp": "2025-04-11T10:08:52.739234"
}