{
  "title": "David Drake bibliography",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/David_Drake_bibliography",
  "content": "\nA list of list of works by or about American military science fiction and fantasy writer David Drake.\n\nWith Janet Morris\n\nThe ARC Riders are an elite time traveling force, dedicated to preserving history as it is, preventing (or reversing) any attempt by \"Revisionist\" time-travelers to change it, and severely punishing any Revisionists who they catch.\n\nWritten by Eric Flint. Drake contributed to the outlines only, but is listed as a co-author from the publisher.\n\nWith John Lambshead\n\nEach volume has a different co-author.\n\nWritten by S. M. Stirling. Drake contributed to the outlines only, but is listed as a co-author by the publisher.\n\nThe first three books in this series are available as ebooks via the Baen Free Library.\n\nA reworking of the story of King Arthur in a world of realistic magic.\n\nThree thematically linked anthologies containing SF hunting stories.\n\nWith Bill Fawcett\n\nWith Bill Fawcett\n\nSword & sorcery fantasy stories set at the time of the later Roman Empire. All of these stories have been collected in Vettius and His Friends (1989) which also contains a couple more unrelated stories.\n\nThese time travel stories about the dinosaur-hunting Henry Vickers have been published in various places. Time Safari (1982) collects the first three stories, Tyrannosaur (1993) also collects three stories but replaces \"Calibration Run\" with \"King Tyrant Lizard\". All four stories were first published together in Dinosaurs & a Dirigible (2014) which also contains the unrelated time travel story \"Travellers\".\n",
  "concepts": [
    "David Drake bibliography",
    "stories",
    "time",
    "drake",
    "author",
    "written",
    "unrelated",
    "travel",
    "time travel",
    "story",
    "publisher"
  ],
  "findings": [
    "Novels (series)",
    "ARC Riders",
    "Belisarius series",
    "The Books of the Elements",
    "Car Warriors",
    "Citizen",
    "Crisis of Empire series",
    "The General series",
    "Hammer's Slammers",
    "The Harriers",
    "Heroes in Hell",
    "Lord of the Isles",
    "Northworld",
    "RCN series",
    "Reaches",
    "Time of Heroes",
    "Thieves' World",
    "The Tom Kelly novels",
    "Venus series",
    "Novels (non-series)",
    "Short fiction",
    "Collections",
    "Anthologies edited",
    "Short stories",
    "Critical studies and reviews of Drake's work",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T15:50:23.479345"
}