{
  "title": "His Chance in Life",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/His_Chance_in_Life",
  "content": "\n\"His Chance in Life\" is a short story by Rudyard Kipling. It was first published in the first Indian edition of Plain Tales from the Hills (1888), and in subsequent editions of that collection. The story is illuminating about Kipling's attitudes to race, which are less cut-and-dried than is often thought. Kipling is interesting, if not very detailed, on people of mixed race and the snobberies involved. (For some detail, see the Kipling Society notes.)\n\nThe epigraph includes the line \"'Love hath made this thing a Man'\", which adumbrates one of Kipling's themes in this story, as in others. The 'love' in 'His Chance in Life' is that between Michele d'Cruze, who \"looked down on natives as only a man with seven-eighths native blood in his veins can\" and Miss Vezzis, similarly \"from across the Borderline\" \"where the last drop of White blood ends and the full tide of black sets in\". D'Cruze works as a telegrapher, and Miss Vezzis' Mamma won't let them marry till he earns at least 50 rupees per month: he has 35 rupees a month at the start of the story.\n\nThe story concerns his new posting to the telegraph station at Tibasu, a remote sub-station whose real function is only to relay messages. One day in the Muslim period of Mohurrum, the locals start a riot, with Hindus and Muslims joining in: \"It was a nasty little riot, but not worth putting in the papers.\" An angry crowd approaches Michele's office with the intention of wrecking it. (\"Never forget that unless the outward and visible signs of Our Authority are always before a native he is as incapable as a child of understanding what authority means, or where is the danger of disobeying it\" - a second theme of Kipling's is that of the difference between the British and the Indian, in terms of 'fitness to rule'.) The Native Police Inspector panics, but obeys \"the old race-instinct which recognises a drop of White blood as far as it can be diluted\", asks \"the Sahib\" for orders. \"The Sahib decided Michele.\" He leads the native police and fires on the crowd, killing a man, whereupon the others flee \"curs to a man\". A deputation of the locals claim he has acted unconstitutionality, citing the (presumably native) Sub-Judge. Michele replies that he is the effective Government, and the deputation \"bowed their heads\".\n\nThe next day, Michele greets the Sub-Collector. \"[I]n the presence of this young Englishman\", Michele loses the effect of whiteness and weeps, to his shame. \"But the Englishman understood\", reports Michele's conduct favourably, through the Proper Channels, and he is transferred back 'up-country' on a salary of 66 rupees per month. So he marries Miss Vezzis. \"Which proves that, when a man does good work out of all proportion to his pay, in seven cases out of nine there is a woman at the back of the virtue.\"\n\nAll quotations in this article have been taken from the Uniform Edition of Plain Tales from the Hills published by Macmillan & Co., Limited in London in 1899. The text is that of the third edition (1890), and the author of the article has used his own copy of the 1923 reprint. Further comment, including page-by-page notes, can be found on the Kipling Society's website.\n",
  "concepts": [
    "His Chance in Life",
    "michele",
    "kipling",
    "story",
    "native",
    "man",
    "vezzis",
    "sub",
    "rupees month",
    "rupees",
    "race"
  ],
  "findings": [],
  "relationships": [],
  "timestamp": "2025-04-11T16:57:20.750615"
}