{
  "title": "William Henry Boulton",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/William_Henry_Boulton",
  "content": "William Henry Boulton (April 19, 1812 – February 15, 1874) was a lawyer and political figure in Canada West. He served as Mayor of Toronto from 1845 to 1847. In 1858, he was considered \"a colourful figure with varied interests\" due to his seemingly polar opposite influences in office. He was inclined to the \"sympathies for Family Compact traditions\" and the inherent righteousness of the Church of England (especially in educational institutions) juxtaposed to elective institutions, the \"rep-by-pop\" system, and his interests in republicanism and \"popularism\".[1]\n\nHe was a highly influential member of the Orange Order in Canada, as he was made deputy grand master of British North America for the Toronto Orange Lodge in 1854. William supported the \"more Protestant and vocal wing\" of the Orange Order, led by George Benjamin over the Orangeism of Ogle Robert Gowan.[1]\n\nBoth sides of Boulton's family had connections to the Family Compact,wherein William was considered a part of the \"third generation family\". His paternal grandfather was Chief Justice George D'Arcy Boulton, his cousin was D'Arcy Boulton Jr., and he was nephew to Family Compact leader Sir John Beverly Robinson, in addition to George Strange Boulton and Henry John Boulton.[1]\n\nBoulton died in Toronto in 1874.\n\nBoulton was born in York (Toronto) in Upper Canada in 1812. He was the eldest son of D'Arcy Boulton Jr. (1785–1846) and Sarah Ann Robinson, and the grandson of G. D'Arcy Boulton. He studied law, became an attorney at 23, and entered practice with Gamble and Boulton. He was also a keen cricketer, and his public support of the Canadian cricket team is said to have significantly furthered his political ambitions.[2]\n\nBoulton was somewhat of a demagogue, occasionally opting to fire up opinion over action in order to retain his position, once warning electors that their interests would be sacrificed to the \"Tobacco-smoking, Dram Drinking (a \"dram\" being a \"small amount of whisky\"), Garlick Eating Frenchmen\" following the \"Conservative debacle\" of 1847–1848.[1]\n\nHe was first elected to Toronto city council in 1838. In 1844, he was elected to the Legislative Assembly of the Province of Canada, representing Toronto as a Conservative member. He was re-elected in 1848 and 1851. He was known to oppose a bill proposing King's College to be a secular institution which was affiliated to the Church of England in Canada at that time. He supported a surprise constitutional amendment which created the Legislative Council in order to develop “the elective system more fully\". However, this was not agreed upon by Conservatives backing Boulton, and so he campaigned for another aspect in 1851.  The need for \"radical changes in the working of the Government\" was his main proposition in this period. He was supported by the Orange Order in Toronto and was also viewed as a member of the Family Compact. In 1854, he became deputy grand master for the order in British North America. After he left politics, he continued to practice law.\n\nAs Mayor of Toronto, one of Boulton's major interests was the Provincial Agricultural Association. Boulton would play a \"leading role\" in the decision of the Toronto City Council to vote $20,000 towards an exhibition building for industrial and agricultural arts – this building would become the Crystal Palace, opened in 1858. There would be annual exhibitions there for eight years, until 1866.[1] The Crystal Palace would burn down on October 18, 1906. The Toronto Horticulture Building stands in the former location of the Crystal Palace.[3]\n\nBoulton was disliked and feared by Reformers Robert Baldwin and George Brown.[1]\n\nBoulton was married to woman named Harriette Elizabeth Dixon, and they did not have any children. After Boulton's death in 1874, Dixon would marry Professor Goldwin Smith a year later, in 1875.[1]\n\nThe majority of Boulton's support came from the Toronto Orangemen, grateful for Boulton's \"efforts in having the act of 1843 restricting party processions\" repealed. However, Boulton himself would claim that he owed his 1851 election victory to \"the bone and sinew of the country...the mechanics, the artisans, and the labourers\".[1]\n\nHis former residence, \"The Grange\", is now part of the Art Gallery of Ontario. The Boultons were said to be very hospitable people and hosted many guests at the Grange. Lord Elgin, when Governor-General of Canada, was a guest of Boulton in the home when Boulton was Mayor of Toronto, during Elgin's tour of Canada West in 1847. It received the name \"The Grange\" after the family estate in England. Boulton lived in the home until his death in 1874.[4]\n",
  "concepts": [
    "William Henry Boulton"
  ],
  "findings": [
    "Life and career",
    "References",
    "Sources"
  ],
  "timestamp": "2025-04-11T10:12:29.722368"
}