{
  "title": "Nils Thornander",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Nils_Thornander",
  "content": "Nils Thornander (3 May 1958 – 10 June 2022) was a Swedish-born French visual artist and composer.[1]\n\nThornander was born in Stockholm in 1958 to a Swedish father and a French mother. He attended the Franska Skolan, founded for French students in Stockholm in 1862. At the age of 15, he moved to France and attended the Lycée Condorcet. He was interviewed in front of the school in 1973 on the lowering of the voting age to 18.[2]\n\nThornander decided early on to become an experimental artist. He first set out to acquire the best techniques used by Great Masters, to whom he relentlessly paid homage, in order to ply them towards exploring new aesthetic forms. In his pictorial work, he confronts categories of art considered to be opposite by Art History. His sound compositions question the border between scholarly and popular music. Seeking the paths to beauty for today's world, he blurs the boundaries imposed by techniques, combining paint and video, physical and digital matters, images, words and sound. He explains his approach in the \"Continuum Manifesto\" (1994), a paper for the Swedish magazine 90Tal [sv], in which he theorizes the artistic contribution to the contemporary world: \"It is about rethinking the articulation of multiple points of view, themselves constantly changing. (...) A vast continuum must link previously contradictory systems of representation\".[3] \nHis works discuss the stakes of the various \"Aesthetic Wars\" waged between past and present, borders and identities, scales, the visible and the invisible, the flesh and the digit, the admitted and the forbidden. His views inspired artist Magnus Bärtås [sv] to write Wem är Nils Thornander?.[4] Art critic Lars O. Ericsson [sv] described him as a \"Geographer of Chaos\". His works were \"a committed approach to achieve harmony\", according to Isabelle Kevorkian.[5]\n\nThroughout his life, Thornander oil-painted on canvas. He also experimented spreading the canvas over 3D spaces and he created a 4D immersive Hypercube (1990s). He confronted the effect on a painting of sun light versus electric light and versus video projections, in particular in his On/Off light boxes series (1980s) and his Walldreams (2000s). In the mid-1990s, he became interested in digital art and created an interactive labyrinth for the group work \"Just From Cynthia\" at the invitation of Alberto Sorbelli [fr], presented at the Centre Pompidou. He worked with Mildred Simantov on the installation \"Refectory\", presented at the Musée Carnavalet during the Nuit Blanche in 2010,[6] as well as the QRCode-music album \"L’Age adulte, le Tuning Book\", presented at the Palais de Tokyo.[7]\n\nMusic composition became prominent for him during the 2000s. In 1998 Silke Fischer [de] chose Thornander to create music for her documentary \"Putzen in Paris/Paris poussière\". He produced the sound design for Magnus Bärtås's \"Claims of Victory\", presented in Seoul in 2015. He composed the sound-track for the feature film Reception (Save The Date), directed by Gilles Verdiani [fr], in 2018.[8] At the end of the 2010s, he undertook the composition of a 24hour piece,\"Absolute Value\", which \"sound frequencies aim to tune the world\". An extract was performed in 2019 at IRCAM.[9]\n\n“Confronting himself” (20) or aesthetic thoughts defended by others, he pursued collaborations with artists in the fields of opera, theater, cinema, television, installations, art books.\n\nIn 2000, he created with Gilles Verdiani “The Erogenous Zone, a life-design laboratory” (21), which Brian Lucas and Hortense Vorringen later joined. This “quartet of ambitious aesthetes” (22) produced, among other things, “Preliminaries”, video works on DVD.\n\n“The Nice Institution” (23) was created with the artist and designer Mildred Simantov in 2009. In addition to works, concerts and performances produced by contrasting their approaches, they invited artists and thinkers to collaborate, including Brian Lucas, Igor Antic, Antonio Casilli, Michaël Stora, Rebecca Dolinski, …\n\nFrom 2008 on, his Facebook profile (24) became a privileged relational space to test his thinking on the continuum against the great contemporary upheavals. He designed the book JOUR, based on a selection of his publications, which was published 10 months after his death [1].\n",
  "concepts": [
    "Nils Thornander"
  ],
  "findings": [
    "Biography",
    "Artistic intent",
    "Paintings, videos and installations",
    "Musical and sound creations",
    "Collaborative and relational works",
    "Exhibitions and public works",
    "References"
  ],
  "timestamp": "2025-04-11T10:20:22.588422"
}