{
  "title": "Tianxingzhou Yangtze River Bridge",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Tianxingzhou_Yangtze_River_Bridge",
  "content": "The Tianxingzhou Yangtze River Bridge (Chinese: 武汉天兴洲长江大桥) is a combined road and rail bridge across the Yangtze River in the city of Wuhan, the capital of the Hubei Province of China.\n\nThe bridge crosses the Yangtze in the northeastern part of the city, a few kilometers downstream of the  Second Wuhan Yangtze River Bridge. Its name is due to the Tianxing Island (天兴洲, Tianxingzhou), above which it crosses the river. Built at the cost of CN¥11 billion, the 4,657-meter cable suspension bridge was opened on December 26, 2009,[1] in time for the opening of the Wuhan railway station. The bridges main span measures 504 metres (1,654 ft), the longest combined road and rail cable-stayed span in the world.[2]\n\nThe bridge is a combined road and rail bridge; it has 4 railroad tracks and 6 vehicular traffic lanes.[3] It is the northeastern (downstream) Yangtze crossing for Wuhan's Third Ring Road (the southwestern, upstream, crossing is the Baishazhou Bridge).\n\nAs of 2012[update] there are at least half a dozen of road crossings of the Yangtze River in Wuhan, as well as a subway line under the river. The Tianxingzhou Bridge is only the second railway crossing. It carries the Wuhan–Guangzhou high-speed railway across the river and allows trains to cross the river at speeds up to 250 kilometres per hour (160 mph).[3] It also makes it possible for some of the high-speed trains arriving to Wuhan from the east over the Hefei–Wuhan railway to cross the river and to reach Wuhan railway station (instead of their usual destination, Hankou railway station).\n",
  "concepts": [
    "Tianxingzhou Yangtze River Bridge",
    "wuhan",
    "river",
    "bridge",
    "yangtze",
    "railway",
    "road",
    "yangtze river",
    "wuhan railway",
    "tianxingzhou",
    "station"
  ],
  "findings": [
    "Description",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:47.927021"
}