{
  "title": "Anzac Day Act (New Zealand)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Anzac_Day_Act_(New_Zealand)",
  "content": "The Anzac Day Act in New Zealand is a law which makes Anzac Day a national holiday in New Zealand.\n\nAnzac Day is the anniversary of the landing of the Australian and New Zealand Army Corps at Gallipoli in Turkey during World War I. This was the first major battle Australian or New Zealand troops had been in, and losses were severe. From 1916, the day was given over to commemoration of the Anzacs who died in this battle. In 1920 the Reform Government of New Zealand passed the Anzac Day Act 1920 to make the day an official public holiday. This stated that the day was in \"commemoration of the part taken by New Zealand troops in World War I, and in memory of those who gave their lives for the Empire\" rather than only those who died at Gallipoli. The Act stated that the day would be observed \"as a public holiday\", banned the holding of horse races on Anzac Day and required the closing of licensed premises on the same basis as Christmas Day and Good Friday.\n\nThe following year the Act was amended by repealing the sections on licensed premises and horse-racing, and stated that the day would be observed 'as if Anzac Day were a Sunday' rather than as a public holiday, perhaps in order to better express the quasi-religious mood of the day.\n\nFollowing World War II, the 1920 Act was repealed and replaced with the Anzac Day Act 1949. The day became one of commemoration of the part taken by New Zealand servicemen and women in the Second World War and the Boer War as well as World War I, and in memory of \"those who gave their lives for New Zealand and the British Empire or Commonwealth of Nations\". It also banned employers from transferring their employees' Anzac Day holiday or holiday pay to another day.\n\nIn 1966 the 1949 Act was repealed and replaced with the Anzac Day Act 1966. This specified that the day was in commemoration of those who \"at any time have given their lives for New Zealand the British Empire or Commonwealth of Nations\". It also specified that when Anzac Day falls on a Sunday it will be observed on the Sunday and not moved to the Monday, and made the day a half-day rather than full-day holiday, with any activities normally permitted on a Saturday allowed after 1pm. The Act also allowed the Royal New Zealand Returned and Services' Association (a veterans' association) to establish charitable trusts. \n\nThe 1966 Act was passed following several years of controversy over the Anzac Day holiday. Many people resented that sport and other entertainment was banned (generally by local authorities rather than central government), especially as there was a widespread perception that returned servicemen spent the day drinking. At the same time, some felt that the day had become less respected, and simply a 'day off' for most. The law was changed with the support of the RSA and followed partial liberalisation of the day by several local councils. In debates on the Act, MP Sir Basil Arthur and former Prime Minister Walter Nash suggested that New Zealanders should be ashamed that they could not set an entire day aside for remembrance. The Evening Post newspaper, however, argued that if the day was not changed it 'was surely destined to die not many years hence'.[1]\n\nIn 2013, the Holidays (Full Recognition of Waitangi Day and ANZAC Day) Amendment Act 2013 was passed, with the effect that if Anzac Day should fall on a Saturday or Sunday, for those employees who would not otherwise work on that Saturday or Sunday, the public holiday must be treated as falling on the following Monday.  \n\nThe 1966 Act remains part of New Zealand law.\n",
  "concepts": [
    "Anzac Day Act (New Zealand)",
    "day",
    "anzac day",
    "anzac",
    "act",
    "new",
    "zealand",
    "new zealand",
    "holiday",
    "war",
    "world war"
  ],
  "findings": [
    "Context",
    "History",
    "Sources",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:27.327664"
}