{
  "title": "St. Paul's Hospital Millennium Medical College",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/St._Paul's_Hospital_Millennium_Medical_College",
  "content": "St. Paul's Hospital Millennium Medical College is health sciences teaching institution at St. Paul Hospital, Addis Ababa Ethiopia.[1][2]\n\nSt. Paul's Hospital was built in 1969 (was named St Paul General Specialized Hospital until 2008) by Emperor Haile Selassie in collaboration with the German Evangelical Church, as a source of medical care for underserved populations. It currently has 700+ beds, with an annual average of 200,000 patients and a catchment population of more than 5 million. Approximately 75% of the patients receive medical services free of charge.[3] There are over 1300 clinical and non-clinical staff[4] in over 13 departments, most recently launching its new hemodialysis unit and the country's National Kidney Transplant Center.\n\nThe Medical School opened in 2014. It was intended to alleviate the severe shortage of medical doctors in the country. In line with various encouraging efforts performed by the Ethiopian Federal Ministry of Health in this regard, it is clear that the newly opened school, with a practical modular and integrated curriculum,[clarification needed] will be providing much-needed medical professionals to the people of Ethiopia.\n\nThe school was established by the Ethiopian Ministry of Health with the initiative of Tedros Adhanom (the then-minister) together with Gordon Williams of the department of urology at the Hammersmith Hospital in London as its first dean.\n\nThe students are selected by written exam and a structured interview with their previous educational background and their motive to work in the homeland accredited. The students come from all regions in Ethiopia, with students from emerging and underrepresented regions given special consideration. The college also prioritizes gender equality in its student body, and the percentage of female students has now reached almost forty percent.[verification needed]\n\nThere are currently[when?] 510 medical students at St. Paul's, with an additional 18 students in training to receive their Bachelor's in critical care and ICU nursing, and 16 studying for a Bachelor's in operation theater nursing. The 2012-2013 school year marks the inaugural year of the OB/GYN residency post-graduate program, with 7 residents in the first class. There is also a new Master's program in Integrated Emergency Surgery in Obstetrics. The following fiscal year will see new post-graduate specialties in pediatrics, surgery, and internal medicine, as well as a Bachelor's degree in Midwifery.\n\nThe curriculum at St. Paul's is unique in Ethiopia; the medical school and other undergraduate programs follow an integrated and modular educational model, using hybrid problem-solving techniques. The post-graduate programs are similarly distinctive, as they are competency-based.\n\nWith the new maternity hospital, children's hospital, and college complexes under construction, the college is intended to become a model integrated curriculum with undergraduate and graduate health sciences programs. The school has already created strong ties to local and international institutions, like Addis Ababa University, Jimma University, Tulane University, University of Michigan as well as the Open University.\n\nTulane University's collaboration with St. Paul's is spearheaded by Wuleta Lemma, its Country Director. It is mainly focused on undergraduate medical education, concentrating on library resources, ICT support for infrastructure and technical support, and financing staff development programs and now expanding to postgraduate programs like specialty in Pediatrics.\n\nThe initial goal of the partnership between University of Michigan and St. Paul's, spearheaded by [Senait Fisseha], was to improve maternal child health and decrease maternal mortality. Their efforts have led to the obstetrics and gynecology residency program and the addition of comprehensive family planning to the medical school curriculum. The partnership has since been expanded, and plans for new training programs in multiple fields and departments are in the works.\n\nOther partnerships include the Egyptian Ministry of Health, which is helping to develop a Gastrointestinal/Hepatology Unit and Renal Center, as well as the Harvard School of Public Health, University of Bergen, and University of Alberta.\n\nAs of 2016, the provost is Zerihun Abebe; an associate professor in dermatology, who has been the medical director of Mekele hospital. There are three vice-provosts: for academic programs and research; for medical services; and for administration and development. The college has its senate and is governed by a board under the FMOH.[citation needed]\n\n9°02′53″N 38°43′39″E﻿ / ﻿9.047974°N 38.727557°E﻿ / 9.047974; 38.727557\n",
  "concepts": [
    "St. Paul's Hospital Millennium Medical College",
    "medical",
    "university",
    "st paul",
    "st",
    "school",
    "paul",
    "hospital",
    "programs",
    "health",
    "students"
  ],
  "findings": [
    "Hospital Service",
    "History",
    "Student body",
    "Partnerships",
    "Leadership",
    "Notable alumni",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T17:10:05.934742"
}