{
  "title": "Ramchandran Jaikumar",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Ramchandran_Jaikumar",
  "content": "Ramchandran Jaikumar, also known as Jai Jaikumar, (December 17, 1944 – February 10, 1998) was an Indian-born, US-based decision scientist. He was the Daewoo Professor of Business Administration at the Harvard Business School. He was an expert in computer-aided manufacturing, robots and operating systems. He won several awards for his research.\n\nRamchandran Jaikumar was born on December 17, 1944, in Madras, now known as Chennai, India.[1]\n\nJaikumar graduated from the Indian Institute of Technology Madras, where he earned a bachelor's degree.[1][2][3] While he was in college, he took up rock climbing.[4] He subsequently earned a master's degree in industrial engineering from Oklahoma State University and a PhD in decision sciences from the Wharton School of the University of Pennsylvania,[1][2] where his thesis supervisor was Professor Marshall L. Fisher.[5]\n\nJaikumar began his career at the Harvard Business School in 1980, where he taught MBA students.[1][3] He subsequently became the Daewoo Professor of Business Administration.[2][5][3] He was an expert in computer-aided manufacturing.[2] In a 1984 article, he compared robots made in the United States and Japan, and he concluded that Japanese robots were far superior.[2] By the 1990s, he published research about operating systems, and he argued for a minimalist approach.[2]\n\nJaikumar worked with his thesis advisor Fisher on a consulting project between the University of Pennsylvania and Air Products & Chemicals, which won the 1983 Franz Edelman Award for Achievement in Operations Research and the Management Sciences.[1] He won the same award in 1998.[1] He also won the E. Grosvener Best Paper Award from the Council of Supply Chain Management Professionals in 1984.[1] Additionally, he won the Frederick Winslow Taylor Medal from the American Society of Mechanical Engineers and the Grosvenor Plowman Prize from the National Council for Physical Distribution Management.[3]\n\nJaikumar served on committees of the National Research Council.[1][3] He was an advisor to the Office of Technology Assessment and the United States Senate Committee on Commerce and Science.[1][3]\n\nJaikumar encouraged his students to enjoy their lives outside the classroom.[4] He also taught that success was ultimately a matter of luck, which meant successful professionals were duty-bound to give back and help the less fortunate.[4]\n\nJaikumar was married to Mrinalini Mani, and they had two sons, Nikhil and Arjun.[2][3] They resided in West Newton, Massachusetts.[2] Jaikumar climbed the Himalayas.[2] On another trip to Greenland, he climbed a previously nameless mountain and called it \"Minarjnik.\"[2]\n\nAs an adult, Jaikumar built a school and paid for the teaching staff of a Himalayan village where he had been rescued from a fall by an Indian shepherdess during a climbing expedition when he was a college student.[4]\n\nJaikumar died of a heart attack while he was rock-climbing in Quito, Ecuador on February 10, 1998.[2][4] He was 53.[2] A memorial service was held at the Memorial Church of Harvard University.[3]\n",
  "concepts": [
    "Ramchandran Jaikumar"
  ],
  "findings": [
    "Early life",
    "Career",
    "Personal life and death",
    "References"
  ],
  "timestamp": "2025-04-11T10:12:18.216196"
}