{
  "title": "Wikipedia administrators",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Wikipedia_administrators",
  "content": "On Wikipedia, trusted and experienced editors may be appointed as administrators (also referred to as admins, sysops or janitors) by the editing community,[1]: 327  following a successful request for adminship. Currently, there are 849 administrators on the English Wikipedia.[2] Administrators have some technical privileges not enjoyed by other editors, such as the ability to protect and delete pages and to block users from editing pages.\n\nOn Wikipedia, becoming an administrator is often referred to as \"being given [or taking up] the mop\",[3] a term which has also been used elsewhere.[4] In 2006, The New York Times reported that administrators on Wikipedia, of whom there were then about 1,000, were \"geographically diverse\".[5] In July 2012, it was widely reported that Wikipedia was \"running out of administrators\", because in 2005 and 2006, 40 to 50 people were often appointed administrators each month, but in the first half of 2012, only nine in total were appointed.[6][7]\n\nHowever, Jimmy Wales, Wikipedia's co-founder, denied that this was a crisis or that Wikipedia was running out of admins, saying, \"The number of admins has been stable for about two years, there's really nothing going on.\"[8] Wales had previously (in a message sent to the English Wikipedia mailing list on February 11, 2003) stated that being an admin is \"not a big deal\", and that \"It's merely a technical matter that the powers given to sysops are not given out to everyone.\"[9]\n\nIn his 2008 book Wikipedia: The Missing Manual, John Broughton states that while many people think of administrators on Wikipedia as judges, that is not the purpose of the role.[10] Instead, he says, admins usually \"delete pages\" and \"protect pages involved in edit wars\".[10] Wikipedia administrators are not employees or agents of the Wikimedia Foundation.[11]\n\nWhile the first Wikipedia administrators were appointed by Jimmy Wales in October 2001,[12] administrator privileges on Wikipedia are now granted through a process known as requests for adminship (RfA).[1] Registered editors may nominate themselves, or may request another editor to do so. Andrew Lih, a scientist and professor who is himself an administrator on the English Wikipedia, has said the process is \"akin to putting someone through the Supreme Court\". Lih also said, \"It's pretty much a hazing ritual at this point\", in contrast to how the process worked early in Wikipedia's history, when all one had to do to become an admin was \"prove you weren't a bozo\".[6]\n\nCandidacy for the role is normally considered only after \"extensive work on the wiki\".[1] Unlike most of Wikipedia, which uses consensus-based decision making, RFA is basically a vote, although some votes may be discounted if the result is close or contested. The vote is described as a \"consensus building process\", but in practical reality those above 75% support will pass, those below 65% will fail, and those in between are in the \"discretionary zone\" and subject to further discussion by Wikipedia's bureaucrats, another group of advanced permission holders whose role it is to determine and enact a consensus in certain situations.[13] This may have been implemented as a result of RfAs attracting increasing levels of attention: Stvilia et al. quoted that \"Prior to mid-2005, RfAs typically did not attract much attention. Since then, it has become quite common for RfAs to attract huge numbers of RfA groupies who all support one another\".[14] The record number of votes in one RfA, as of May 2022, was 468: The RfA of the editor Tamzin was supported by 340 users and opposed by 116, amidst controversy over that candidate's criticism of supporters of Donald Trump.[15]\n\nOnce granted administrator privileges, a user has access to additional functions in order to perform certain duties.[6] These include \"messy cleanup work\",[1] deletion of articles deemed unsuitable, protecting pages (restricting editing privileges to that page),[16]: 66  and blocking the accounts of disruptive users.[1][6] Blocking a user must be done according to Wikipedia's policies and a reason must be stated for the block, which will be permanently logged by the software.[1]: 401 [16]: 120  Use of this privilege to \"gain editing advantages\" is considered inappropriate.[1]\n\nA 2013 scientific paper by researchers from Virginia Tech and Rensselaer Polytechnic Institute found that after editors are promoted to administrator status, they often focus more on articles about controversial topics than they did before. The researchers also proposed an alternative method for choosing administrators, in which more weight is given to the votes of experienced editors.[17] This corresponds to a modality of plural voting. Another paper, presented at the 2008 Conference on Human Factors in Computing Systems, analyzed data from all 1,551 requests for adminship from January 2006 to October 2007, with the goal of determining which (if any) of the criteria recommended in Wikipedia's Guide to requests for adminship[18] were the best predictors of whether the user in question would actually become an admin.[4] In December 2013, a similar study was published by researchers from the Polish-Japanese Institute of Information Technology in Warsaw, which aimed to model the results of requests for adminship on the Polish Wikipedia using a model derived from Wikipedia's edit history. They found that they could \"classify the votes in the RfA procedures using this model with an accuracy level that should be sufficient to recommend candidates.\"[19]\n",
  "concepts": [
    "Wikipedia administrators"
  ],
  "findings": [
    "Requests for adminship",
    "Role",
    "Scientific studies",
    "References"
  ],
  "timestamp": "2025-04-11T10:09:11.618865"
}