{
  "title": "James Walker (RCAF officer)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/James_Walker_(RCAF_officer)",
  "content": "James Walker, DFC & Two Bars (4 April 1918 – 25 April 1944) was a flying ace of the Royal Canadian Air Force (RCAF) during the Second World War. The first Canadian to be awarded the Distinguished Flying Cross three times, he is credited with the destruction of at least ten aircraft.\n\nFrom Alberta in Canada, Walker joined the RCAF in 1940. Sent to the United Kingdom, he served with No. 81 Squadron in Russia, where he made his first claims for aircraft shot down, and then flew operations to German-occupied Europe before the squadron was sent to North Africa. There he achieved several aerial victories during Operation Torch. In February 1943 he was given command of No. 243 Squadron, achieving more successes in the following Tunisian campaign before being sent to Canada on leave later in the year. Appointed commander of No. 144 Wing RCAF in March 1944, he died the following month on 25 April as a result of injuries received in an aircraft crash earlier in the day.\n\nJames Elmslie Walker was born at Claresholm, Alberta, in Canada on 4 April 1919. A scout in the 3rd Edmonton Group, after completing his schooling, he studied banking. In 1936, he was employed by the Canadian Bank of Commerce as a teller.[1][2]\n\nFollowing the outbreak of the Second World War, Walker applied to join the Royal Canadian Air Force (RCAF) but his enlistment was deferred. With support from Wilfred May, a Canadian fighter pilot who had served in the Royal Air Force (RAF) in the First World War, Walker was called up for training in May 1940. He gained his wings at the end of the year and, commissioned as a pilot officer, was posted to England to serve with the RAF.[1][2]\n\nHeld at a training facility for several months, it was not until August 1941 that Walker was posted to an operational unit, No. 81 Squadron.[1][2] This was stationed at Leconfield but was preparing to be relocated to Vaenga, in the northwest of Russia. Later in the month, the squadron's personnel and its Hawker Hurricane fighters embarked on the aircraft carrier HMS Argus. The Hurricanes were flown off the deck of Argus on 1 September and all safely landed at Vaenga. It became operational several days later; its duties were mainly patrols and flying as escorts to bombers of the Soviet Air Forces.[3]\n\nOn 12 September, while flying No. 81 Squadron's second patrol of the day, Walker shot down a Messerschmitt Bf 109 fighter to the west of Murmansk. Two other Bf 109s were shot down in this engagement, the first time the squadron had encountered the Luftwaffe.[2][4] He probably destroyed a Junkers Ju 88 medium bomber near Voyenga on 6 October. From mid-November, the squadron began training up Soviet pilots on the Hurricanes, eventually handing them to the Russians when the RAF personnel departed Vaenga for the United Kingdom on 29 November.[2][3] Walker was promoted to flying officer the following month.[1]\n\nOnce back in England, No. 81 Squadron was stationed at Turnhouse where it re-equipped with Supermarine Spitfire fighters. In February 1942, it resumed operations but was mainly engaged in patrols over the North Sea. In May it went south to Hornchurch from where it sortied to German-occupied Europe on offensive sweeps, intended to draw out Luftwaffe fighters as part of the RAF's Circus offensive, and bomber escort duties.[3] By this time Walker held the rank of flight lieutenant. On one sortie, carried out on 2 June, Walker shot down a Focke Wulf 190 fighter off Le Touquet.[1][2]\n\nIn August No. 81 Squadron was operating from Fairlop, a satellite station of Hornchurch, when it sortied in the morning of 19 August as part of Operation Jubilee, the raid on Dieppe.[5] It flew again later in the morning as part of the aerial cover over Dieppe, and Walker engaged a Fw 190 but without success.[6] In the afternoon, it sortied again to cover a convoy returning troops landed at Dieppe back to the United Kingdom.[7] Walker was recognised for his successes over the previous months with an award of the Distinguished Flying Cross. The citation, published in The London Gazette on 11 September, read:\n\nThis officer is a determined and skilful pilot. He has at all times shown a keen desire to engage the enemy. While serving in Russia, Flight Lieutenant Walker destroyed one hostile aircraft. Since March, 1942, he has led his flight continuously in all its operations.\nIn September No. 81 Squadron was taken off operations in anticipation of being transferred to North Africa. Its flying personnel departed for Gibraltar the following month where it received new Spitfires. On 8 November, the opening day of Operation Torch, it was the first Allied squadron to land in Algeria, at Maison Blanche. It formed part of the aerial defences there, and at Bône.[3][9] Walker destroyed a Ju 88 over Algiers on 9 November. He probably destroyed a Bf 109 and damaged a second on 25 November. The next day he damaged another Bf 109. He shot down a Bf 109 near Medjez el Bab on 28 November, also damaging another of the same type. On 6 December Walker had encounters with fighters of the Regia Aeronautica (Royal Italian Air Force); he shared in the shooting down of a Reggiane Re.2001 fighter over the harbour at Bône, and also shared in damaging two more. He also damaged a Fw 190 in the vicinity of Tebourba the same day.[2]\n\nOn 1 January 1943 Walker shot down two Fw 190s over Bône harbour although only one of these was definitive. The other was deemed to have probably been destroyed.[2] In February Walker was promoted to squadron leader and appointed commander of No. 243 Squadron.[1] This was another Tunisian-based RAF squadron, flying Spitfires from Souk-el-Khemis Airfield on patrol and ground support operations.[10] Walker damaged a Bf 109 on 4 March, repeating the feat at the end of the month. By this time he had been awarded a second DFC to recognise his services in North Africa.[2] The published citation read:\n\nIn operations in North Africa, Squadron Leader Walker has destroyed 4 enemy aircraft By his great skill, fine leadership and untiring efforts, this officer has won high praise.\nOn 7 April, No. 243 Squadron engaged several Junkers Ju 87 dive bombers of Sturzkampfgeschwader 3 (Dive Bomber Wing 3); Walker shot down one, probably destroyed a second and damaged a third. Two days later he shared in damaging a Bf 109 and on 10 April destroyed another Bf 109 near Medjez el Bab. A second Bf 109 was also damaged by Walker in the same vicinity and on the same day. On a sortie to the north of Oued Zarga on 11 April, he shot down a Ju 87 and damaged a second. His own aircraft was damaged by gunfire from the Ju 87s, and he had to bale out. On 16 April he damaged a Bf 109 near Pont du Fahs. Two days later he destroyed another Bf 109 and damaged a second, both near Téboursouk. His last claim for an aerial victory was on 26 April, for a Bf 109 damaged to the south of Medjez el Bab.[2]\n\nIn June, Walker relinquished command of the squadron and was repatriated back to the United Kingdom.[2] The following month he was promoted to wing commander and awarded his third DFC.[12] Walker was the first Canadian receive three DFCs.[13] He was posted to RCAF Overseas Headquarters in London but his stay there was brief as he was assigned to command of No. 127 Airfield. In September Walker was returned to Canada for a period of leave.[1][2]\n\nWalker returned to the United Kingdom in late November and was sent to the RAF Staff College on a three-month course, which was completed in February 1944.[2] The next month, three RCAF Spitfire squadrons were gathered together to form No. 144 Wing RCAF; Walker was appointed its commander. It flew its first operation on 28 March, to the Seine valley, where it destroyed several German aircraft at Dreux aerodrome.[13] Walker died of injuries received on 25 April 1944 in a flying accident; he was flying an Auster light aircraft as it was approaching the airfield at Westhampnett. It struck a tree and crashed. Both he and his passenger, Sergeant Reginald Tearle, neither appearing to have secured their seatbelts, were critically injured. Walker died that evening, and Tearle two days later.[1][2]\n\nBuried at Brookwood Military Cemetery, Walker is credited with having destroyed ten aircraft, one shared with another pilot, and the probable destruction of four others. He also damaged fifteen aircraft, three shared with other pilots.[2][14]\n",
  "concepts": [
    "James Walker (RCAF officer)",
    "walker",
    "squadron",
    "damaged",
    "bf",
    "destroyed",
    "bf 109",
    "aircraft",
    "109",
    "flying",
    "april"
  ],
  "findings": [
    "Early life",
    "Second World War",
    "Russia",
    "Circus offensive",
    "Operation Torch",
    "Later war service",
    "Notes",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:26:31.539742"
}