{
  "title": "Tel Aviv International Student Film Festival",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Tel_Aviv_International_Student_Film_Festival",
  "content": "The Tel Aviv International Student Film Festival (TISFF) is one of the largest student film festivals in the world[1] and is considered one of the most important in its field.[2] The film festival hosts hundreds of students, lecturers and guests of honor from the world's leading film industry in Tel Aviv, for a week of screenings and cultural events. Hundreds of films, premieres, cinematic events, workshops, conferences and special projects are held, inviting thousands of visitors to the Tel Aviv Cinematheque halls every day. Since 2013, it has been held once a year, in June, in Tel Aviv.\n\nTISFF supports and promotes young filmmakers in their first steps in the world of filmmaking, with more than 200 short films from over 30 countries around the world competing. The festival is supported by Tel Aviv University, the Tel Aviv Municipality, the Film Council of the Ministry of Culture and other bodies. The team running the Tel Aviv International Film Festival is comprised mainly by students of the Steve Tisch School of film and Television.\n\nTISFF was founded in 1986 by a group of students from The Steve Tisch Department of Film and Television at Tel Aviv University. Throughout its years of operation, the festival has maintained its uniqueness as a cultural, cinematic, young and kicking event, which has become a major festival in Israel and around the world, and presents original groundbreaking student work[citation needed] from the best film schools in the world.\n\nThe festival holds five major competitions for short films, including student films from Israel and all around the world, independent films made by young filmmakers in Israel, experimental works of art and an exhibition for digital media projects.\n\nThe festival also hosts various film events: artist workshops, masterclasses, social projects, parties, exhibitions and conferences. The international and local film industry attends the festival and nurtures the young filmmakers and the wide audience of critics who come to the Tel Aviv Cinematheque.\n\nIn addition to students from films schools from abroad, TISFF hosts international judges and guests of honor, thus bringing the international film industry to Israel. Among past guests of the festival: Martin Scorsese, David Lynch, Claire Denis, Celine Sciamma, Leos Carax, Paolo Sorrentino, Gus Van Sant, Richard Gere, Claude Lanzmann, Marcello Mastroianni, Emir Kusterica, Chantal Ackerman, the Darden brothers, Liev Schreiber, Michel Hazanavicius, David Gordon Green, Wim Wenders and many more.\n",
  "concepts": [
    "Tel Aviv International Student Film Festival"
  ],
  "findings": [
    "History",
    "Programmes",
    "Additional events",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:18:51.349664"
}