{
  "title": "Simon Britto Rodrigues",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Simon_Britto_Rodrigues",
  "content": "Simon Britto Rodrigues (27 March 1954 – 31 December 2018) was an Indian politician and writer. He was an Anglo-Indian member in the Kerala Legislative Assembly during the term of Left Democratic Front government from 2006 to 2011.\n\nSimon Britto Rodrigues was born to Nichlos Rodrigues and Irin Rodrigues on 27 March 1954, in Pongikkara, Ernakulam District, Kerala.[1] Britto was an active member of Students' Federation of India (SFI), he was a former student of St. Albert's College, Ernakulam,  Government Law College, Ernakulam, Government Law College, Thiruvananthapuram, Kerala Law Academy Law College, Thiruvananthapuram, Lalit Narayan Mithila University in his college days during the '80s.\n\nSimon was paralysed in 1983 after he was stabbed by the workers of Kerala Students Union (KSU)- the students' wing of the Indian National Congress at Maharajas College, Ernakulam. At the time, Britto was a volatile student leader of the Students' Federation of India (SFI). He was the district president of the organisation. [2] Even after the attack, Britto was active in mainstream politics and continued to be in office until 1988. Ten years later he married Seena Bhaskar.[3] From 2006 to 2011, he was a nominated MLA representing the Anglo-Indian community.[4] With his wheel-chair, urine bottle, and walker, he had travelled across the country.[5]\n\nBritto was last seen in public as a part of mourning Abhimanyu, an SFI activist from Maharaja's College, who was murdered by his political opponents on 2 July 2018, with whom he had a very special relationship. He then remembered that Abhimanyu, whom he met during a TV interview, was a regular visitor to his home, and was like a son to him. He also remembered the help given by Abhimanyu, and strongly condemned his murder. He also switched on the biopic about Abhimanyu, titled 'Padmavyoohathile Abhimanyu', in which he starred as himself, at Sree Kerala Varma College in Thrissur, on 9 October 2018.\n\nBritto died suddenly of a heart attack at a hotel room in Thrissur on 31 December 2018, aged 64. He is survived by his wife Seena, a journalist, and daughter Nilavu.[4]\n\nBritto authored a couple of novels: Agragami and 'Maharandram. Agragami won the Abu Dhabi Sakthi Award in 2009,[6] and the Patyam Gopalan award. He was a state representative of Kerala Grandhasala Sangam.[1]\n\nHe wrote \"Maharaja's Abhimanyu\", a book in the memory of Abhimanyu who was killed in Maharajas College by Campus Front of India activists.[7]\n",
  "concepts": [
    "Simon Britto Rodrigues",
    "college",
    "britto",
    "abhimanyu",
    "kerala",
    "students",
    "rodrigues",
    "law",
    "indian",
    "ernakulam",
    "2018"
  ],
  "findings": [
    "Early life",
    "Assault and Activism",
    "Death",
    "Literary contributions",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T17:32:49.578882"
}