{
  "title": "Ioryi Mucitano",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Ioryi_Mucitano",
  "content": "Ioryi Mucitano[a] (also Mucitani or Mucitanu, 1882 – 2 August 1911), nicknamed Kasapcheto[b] (\"Butcher\"), was an Ottoman Aromanian revolutionary during the Macedonian Struggle. He was the first leader of the first Aromanian band of the Internal Macedonian Revolutionary Organization (IMRO).\n\nMucitano fought in the 1903 Ilinden–Preobrazhenie Uprising as part of the IMRO, after which he became leader of the first Aromanian band of the organization following the band's formation in 1906. Mucitano was involved in the death of the prominent Greek military officer Tellos Agras and his ally Antonis Mingas [bg; el]. After seeing himself forced to resign as leader of the band, Mucitano continued his activities in Macedonia, dying poisoned in 1911.\n\nIoryi Mucitano was born in 1882 in Kruševo (Aromanian: Crushuva), then in the Ottoman Empire and now in North Macedonia. He was an ethnic Aromanian.[1] Mucitano studied at a Romanian school in his hometown and at another in Sofia, Bulgaria;[2] he stood out for having been one of the few Aromanian armatole leaders during the Macedonian Struggle who had a high school degree.[3]\n\nMucitano fought during the 1903 Ilinden–Preobrazhenie Uprising in the Ottoman Balkans, being part of the Internal Macedonian Revolutionary Organization (IMRO) band of Gyorche Petrov.[4] He led an Aromanian committee in Sofia, which, along with another Aromanian committee in Bucharest in Romania, would come into contact with leaders of the IMRO.[5]\n\nFollowing this, Petrov organized the first Aromanian band of the IMRO in 1906,[5] and 24-year-old Mucitano was chosen as its voivode (leader).[2] Young Aromanian migrant workers in Sofia were recruited as the first members of the band. The band was first deployed on 29 August 1906 in the IMRO post in Kyustendil in Bulgaria, after which they departed for Ottoman Macedonia.[4] It would operate in the areas of Giannitsa, Veria and Vodena for almost two years.[6]\n\nDuring his presence in the area of Veria, Mucitano gave speeches on the objectives and tasks of the IMRO, threatened pro-Greek Aromanians with withdrawing their children from Greek schools and enrolling them into Romanian schools and forced local Aromanian inhabitants to start an economic boycott against the ethnic Greeks of the region.[7] Although Mucitano gained the nickname of Kasapcheto (Касапчето; \"Butcher\"), he preferred to solve problems diplomatically, and his band generally applied relatively pacific measures despite being constantly pursued by ethnic Greek antartes fighters.[8]\n\nA notable exception would be the murder of the prominent Greek military officer Tellos Agras and his pro-Greek Bulgarian companion Antonis Mingas [bg; el]. This was the only murder committed by the band during Mucitano's leadership and would be the most famous episode of any Aromanian armatole band in Macedonia. After the capture of both, and with strong opposition from the Aromanians' Bulgarian allies led by Ivan Zlatanov (better known as \"Zlatan\"), Agras and Mingas were hanged on 7 June 1907 in an area between the villages of Techovo and Vladovon [el]. Allegedly, this would have happened at the insistence of the inhabitants of the villages of Grammatikovon and Sarakinovo, with Mucitano having previously proposed to send Agras to Sofia.[9] According to Cola Nicea's Memorii (\"Memoirs\"), during an interrogation to Agras by Mucitano before the former's hanging, Mucitano defined Romania as the homeland of the Aromanians, or the \"Macedonian Romanians\" as he named them. However, he believed that Romania could not help the Aromanians, as it had its own \"great goals\" different from theirs. Thus, Mucitano would have supported autonomy for Macedonia, which effectively meant \"taking our fate into our own hands\" for him.[10]\n\nEventually, to reduce the band's influence over Macedonia, which had begun to be seen as aligned with Romania, Austro-Hungarian and Russian consuls, but also Romanian diplomatic representatives in their aim to decrease tensions with Greece, took measures to cut off local supports of the band of Mucitano. Romanian agents in Macedonia also brought to light the connections between Mucitano and IMRO leader Boris Sarafov, to whom he reported all his actions and from whom he took orders; this would have served them to demonstrate that the band was not connected with Romania but rather with Bulgaria. In the view of all this pressure, Mucitano saw off his comrades and left for Bulgaria on around 11–12 August 1907, naming Mihail Handuri as the new leader of the band. Handuri would be a more sanguinary leader against both Greek fighters and civilians.[11] He would in turn be succeeded posteriorly by Nicea.[12]\n\nMucitano did not stop his revolutionary activities, and he continued fighting in Macedonia. On 2 August 1911, Mucitano and his allies Apostol Petkov and Vasil Pufkata died of poisoning in Krushari [el]. Their bodies were taken to Giannitsa, where they were identified and buried.[13]\n\nCosta Dabija, who had joined Mucitano during the formation of his band in Sofia, said about him that he was interested in poetry, having written a collection of poems which he read to his comrades in their spare time. He was also interested in ethnology, geography and history, and studied places inhabited by Aromanians in the Veria region. He wrote down his findings and things of his interest in a diary.[4]\n\nToday, Mucitano is included under the name of \"Georgi Kasapcheto\" at the Monument to Todor Aleksandrov [bg; mk] in Kyustendil, Bulgaria, which honors the revolutionaries who fought in Macedonia.[14] There is an Aromanian-language song, Cãnticlu-al Mucitani (\"The Song of Mucitani\"), composed in his honor. The document containing the song is preserved at the Institute of National History [bg; mk] in Skopje, North Macedonia.[15] Furthermore, on the 1981 Bulgarian film Mera spored mera [bg] (\"Measure for Measure\"), actor Lyudmil Todorov [bg] plays as Mucitano.[16]\n",
  "concepts": [
    "Ioryi Mucitano",
    "mucitano",
    "band",
    "aromanian",
    "macedonia",
    "imro",
    "leader",
    "greek",
    "bg",
    "sofia",
    "romania"
  ],
  "findings": [
    "Biography",
    "Early life",
    "Leading of the first Aromanian band of the IMRO",
    "Final years and death",
    "Notes",
    "References",
    "Citations",
    "Bibliography"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:36.886848"
}