{
  "title": "James C. Nance Memorial Bridge",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/James_C._Nance_Memorial_Bridge",
  "content": "The US 77 James C. Nance Memorial Bridge [3] connecting Purcell and Lexington[4] was originally built as a circa 1938 deck truss two-lane bridge and in 2019 rebuilt as a concrete pier four-lane bridge [5] crossing the Canadian River and the BNSF Railway between Purcell and Lexington, Oklahoma.[6] The bridge designated on the list of state highways in Oklahoma carries U.S. Route 77 (US-77) and Oklahoma State Highway 39 (SH-39) from McClain County to Cleveland County.[7] The bridge is named for James C. Nance,[8] longtime community newspaper chain publisher and Speaker of the Oklahoma House of Representatives, President pro tempore of the Oklahoma Senate and member of U.S Uniform Law Commission.[9]\n\nThe Nance bridge allows travel time from Purcell (west side of the Canadian River) to Lexington (east side of the river) to be only 3 minutes by car, according to google maps. When the bridge was closed (Emergency Closure, below), the same trip was 43 minutes when re-routed North to the nearest bridge, or 1 hour and 4 minutes when re-routed Southeast to the nearest bridge. The Nance bridge features a scenic pedestrian walkway with sweeping views of the South Canadian River valley.\n\nThe 1938 construction of this bridge enabled communities from West and Southwest (Byars, Cole, Dibble, Paoli, Pauls Valley, Purcell, Rosedale, and Wayne) side of the river to reach the communities on the east side of the river (Lexington, Slaughterville, and Wanette). Traffic using the bridge allows trade and commerce to freely flow in this retail trade area of southern McClain County, southern Cleveland County, Southern Pottawatomie County, and northern area of Garvin County, and eastern portion of Grady county. The 2019 rebuilt bridge features the same design elements with concrete post and original circa 1938 design wrought iron railings.[5]\n\nIn 1982, the James C. Nance bridge was structurally reinforced and a large elevated pipeline was attached underneath to carry the bulk of Purcell's water supply which comes from deep water wells that tap into an aquifer east of Lexington. The pipeline was later bored under the river during bridge reconstruction\n\nThe James C. Nance Memorial Bridge was officially named by House Joint Resolution 525, Okla. Session Laws 1967, pg. 709; 69 O.S. 1981, Section 1612 to enable the State Highway Commission name the Purcell/Lexington US-77/SH-39 bridge the James C. Nance Bridge, to honor his legislative service, under OK title 69, Chapter 1, Article 16 Section 1612 established the James C. Nance Bridge which is 1,110.1 meters[2] (3,642 ft) long, making it among the longest in the state.[10]\n\nThe James C. Nance Memorial Bridge was listed in the National Register of Historic Places on 09-02-2003.[2][1]\n\nThe two year project to rebuild the bridge in 2 sections used 20,000 Cubic Yards of Concrete, 6 million pounds of rebar and is 3,726 feet long taking 325,000 man hours to build at a cost $38 million. The project met with numerous challenges including inclement weather and local protected wildlife living on or under the historical bridge and delayed work. Despite the challenges, the James C. Nance Memorial Bridge project was finished 5 months early.[11]\n\nIn 2019, the US 77 Purcell/Lexington James C. Nance bridge was re-opened by Oklahoma Department of Transportation[5]\nAccording to the Oklahoma Department of Transportation, \"History was made Friday July 26, 2019  in Purcell and Lexington, just as it was more than 80 years ago when the two cities celebrated the grand opening of a new bridge connecting their communities. The new US 77 Purcell/Lexington James C. Nance Bridge that links the cities, located less than one mile apart, fully opened to traffic with much fanfare on Friday, July 26, 2019, the culmination of a major two-year, expedited reconstruction project.\nThe 2 lane state owned bridge built in 1938 was the first bridge in the area to be on the list of state highways in Oklahoma and installed at the site by Oklahoma Department of Transportation and replaced a bridge in nearby vicinity within several blocks north which was a 1 lane privately owned toll bridge built in 1911, which in turn had replaced a wooden constructed 1 lane Cleveland County bridge over the river, according to historic records.\n",
  "concepts": [
    "James C. Nance Memorial Bridge",
    "bridge",
    "nance",
    "james nance",
    "james",
    "purcell",
    "oklahoma",
    "lexington",
    "river",
    "county",
    "nance bridge"
  ],
  "findings": [
    "History",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T15:40:25.793661"
}