{
  "title": "C2 (classification)",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/C2_(classification)",
  "content": "\nIn Paralympic sports, C2  is a para-cycling classification. The UCI recommends this be coded as MC2 or WC2.[1]\n\nPBS defined this classification as \"Riders with upper or lower limb impairments and moderate to severe neurological disfunction [sic?].\"[2] The Telegraph defined this classification in 2011 as \"C 1–5: Athletes with cerebral palsy, limb impairments and amputitions [sic?].\"[3]\n\nCycling first became a Paralympic sport at the 1988 Summer Paralympics.[4]\n\nIn September 2006, governance for para-cycling passed from the International Paralympic Committee's International Cycling Committee to UCI at a meeting in Switzerland.  When this happened, the responsibility of classifying the sport also changed.[5]\n\nFor the 2016 Summer Paralympics in Rio, the International Paralympic Committee had a zero classification at the Games policy.  This policy was put into place in 2014, with the goal of avoiding last minute changes in classes that would negatively impact athlete training preparations. All competitors needed to be internationally classified with their classification status confirmed prior to the Games, with exceptions to this policy being dealt with on a case-by-case basis.[6]\n\nClassification is handled by Union Cycliste Internationale.[7] Classification for the UCI Para-Cycling World Championships is completed by at least two classification panels.  Members of the classification panel must not have a relationship with the cyclist and must not be involved in the World Championships in any other role than as classifier.[8] In national competitions, the classification is handled by the national cycling federation.[8] Classification often has three components: physical, technical and observation assessment.[8]\n\nThis classification has UCI rankings for elite competitors.[9]\n",
  "concepts": [
    "C2 (classification)",
    "classification",
    "cycling",
    "uci",
    "paralympic",
    "policy",
    "para cycling",
    "para",
    "international",
    "committee",
    "classification uci"
  ],
  "findings": [
    "Definition",
    "Classification history",
    "At the Paralympic Games",
    "Becoming classified",
    "Rankings",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:31:05.160915"
}