{
  "title": "Louth Island",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Louth_Island",
  "content": "Louth Island (Nauo: Jorunu or Yoruna) is a 135 ha island located in Louth Bay, Spencer Gulf, South Australia. The island is privately owned, and has previously been used for the grazing of sheep and mining of guano. The island has an old building with sleeping quarters, several beaches, inshore rocky reef and a boat anchorage.[2] It is 17.5 km NNE of Port Lincoln and is easily accessible by boat. The indigenous name for the island is Yorunu.[3]\n\nIn January 1861, a sheep which had been grazing on Louth Island for three years demonstrated remarkable growth of wool. One sample showed a staple twelve inches long, and its fleece was said to have weighed 24 lbs. At the time, the island and its stock were in the custody of Captain Bishop of Port Lincoln.[4][5]\n\nIn the late 1800s, Louth Island was in the custody of Alexander Watherston.\n\nIn the early 1900s, waters around Louth Island were dredged for oysters.[6]\n\nOn October 13, 1905, William Watherstone, lessee of the island, died in Port Lincoln. He was 49 years of age and suffered from Bright's disease and complications. He was one of the region's oldest residents, having arrived in 1859.[7]\n\nIn 1910, it took three shearers on Louth Island a fortnight to shear 800 sheep due to bad weather.[8]\n\nIn 1915, Louth Island was purchased at auction by W. B. White of Port Lincoln. The price paid was £4 8/6 per acre.[9]\n\nIn 1917, a lease was offered at auction to permit the removal of guano from the coastal reserve surrounding Louth Island.[10]\n\nIn 1938, a photograph of Louth Island was placed on display in the window of H. K. Williams' Snapshot Service in Port Lincoln as part of an exhibition of local 'Beauty Spots'.[11]\n\nIn 1972, the island was purchased by the Schoder family. When they placed it on the market in 2009, it was expected to sell for up to $3 million.[12]\n\nIn 2021, Louth Island was purchased by Australian entrepreneur Che Metcalfe, the co-founder and former CEO of telecommunications infrastructure company Uniti Group.\n\nThe island is undergoing an estimated 40-million dollar development to become South Australia’s first luxury off-grid private island accommodation, Rumi on Louth.\n\nRumi on Louth is a luxury eco resort, offering exclusive accommodation and immersive experiences for guests and visitors. The island contains a series of fully off-grid accommodations, a range of culinary offerings, a spa facility, and offer onsite activities that grant access to the whole island.\n\nCreated with a vision to restore the island over a 10 year programme, sustainability is a key focus in the project’s development. Rumi on Louth is 100% solar powered, with recycling, waste water, and composting practices designed to help preserve the island’s pristine nature.\n\nOn October 18, 1910 W. E. Goode of White's River and his two young sons were caught in a squall when returning home from a fishing excursion in Louth Bay. Their boat was driven out to sea. They were sighted on Louth Island by a search party and were recovered the following morning in an exhausted state.[13]\n\nIn March 1921, Thomas Russell disappeared from Louth Island, where he had been the labourer in charge as employee of White. The island was searched for clues to his disappearance. The house was discovered in 'a desolate state' with 'poultry lying about dead' after a boat bringing provisions from the mainland discovered his absence.[14]\n\nIn 1935, two farmers claimed to have seen what they believed to be the wreck of the ketch Vivid between Louth Island and the mainland. The vessel was lost with all hands aboard some years prior.[15]\n\nIn 1947, Captain F. G. Sawford of the ketch Hawthorne lost his pet cocker-spaniel Queenie overboard some miles off Louth Island in rough seas after dark. The dog swam safely to land at the island, after which she was eventually returned to her owner.[16][17]\n\nLouth Island has supported a large colony of little penguins. An account from 1874 from a man named Masters, described them breeding there \"in millions\" and noted that by November the young had already hatched. Masters said that his party had to \"entrench themselves at night to prevent the penguins tumbling everything over in the tent.\" A pair of white-bellied sea eagles had built a nest near the penguin colony and was preying upon the penguins. Penguin skins were observed piled around the eagles' nest.[18] Earlier records of little penguin presence exist from November 1865.[19]\n\nIn 2008, the presence of little penguins on Louth Island was inferred by the discovery of tracks.[20] The same year, penguins were present and nesting on nearby Rabbit Island, to the south-east.[21]\n\nAs of 2015 the status of the little penguin colony is unknown.\n",
  "concepts": [
    "Louth Island"
  ],
  "findings": [
    "Ownership & development",
    "Rumi on Louth",
    "Accidents & mysteries",
    "Little Penguin colony",
    "See also",
    "References"
  ],
  "timestamp": "2025-04-11T10:19:56.574820"
}