{
  "title": "126 Artist-run Gallery",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/126_Artist-run_Gallery",
  "content": "126 Artist-run Gallery is an artist-run space located in Galway City, Ireland. It was founded in 2005 and, according to the Galway Advertiser, has \"built an international reputation for ambitious programming\".[1]\n\n126 was founded in 2005 by artists Austin Ivers and Ben Geoghegan in the living room of their home in Galway.[2] The gallery was named after the number of the house. The two aimed to create more exhibition opportunities in the city, and to highlight artists who had a connection to Galway.[3] After 2 years, they curated a large \"quality\" survey show of contemporary Irish art in the Galway Art Centre in the autumn of 2006.[4] After, in late 2006, the gallery moved to a white cube space in an industrial estate outside of Galway City showing the work of Benjamin de Burca for the Tulca Festival of Visual Arts.[5]\n\nIn January 2007, 126 was re-constituted directly on the ethos of Catalyst Arts and the Transmission Gallery democratic artist-run model – which have their roots in the Scottish New 57 Gallery.[6][7][8] This included a membership and annual members show, a non-commercial orientation, a voluntary board with 2-year term limits on board members, and a requirement that board members not show their own work. \"The new gallery aims to provide a venue for younger, emerging artists, thus fulfilling an obvious need\" and was considered \"tremendously innovative\" by The Irish Times art critic Aidan Dunne.[5][9][10] \"126 is the radical departure from galleries, museums, kunsthalles, and art centres. This is a much more rarified offshoot of the world of Artist-run projects. It is derived from the model that came out of Edinburgh’s 57 Gallery.\"[11]\n\nIn 2009, with its future in doubt, the gallery moved to Galway City centre near the docks.[12][13] Since, the gallery has experienced several struggles for survival in its bids for consistent funding from both local authorities and the Arts Council of Ireland.[14][15] It has moved 2 additional times, for a total of 5 locations in 15 years.[1][16] Its most recent location also rents artist studio spaces.[17]\n\n126 has worked regularly with the Galway International Arts Festival, Tulca, and the Burren College of Art.[18][19][20][21][22] As well as with the Royal Hibernian Academy, Catalyst Arts, ARTFarm, and National Women's Council of Ireland.[23][7][24][25] It has been described as having come to be seen as a progressive example of an artist led project, while simultaneously providing important training for its voluntary board.[26]\n\n126 has shown many significant artists, organisations and presentations. Some of those include: Aideen Barry, Vivienne Dick, Hank Willis Thomas, Rainer Ganahl, Niall De Buitlear, Jim Ricks, Kelly Richardson, Samara Halperin, Stephanie Syjuco, Ceara Conway, Diana Copperwhite, Sylvère Lotringer, Ormston House, Transmission Gallery, and Catalyst Arts.[27]\n",
  "concepts": [
    "126 Artist-run Gallery"
  ],
  "findings": [
    "History",
    "Origins",
    "Reconstitution",
    "Operations and partners",
    "Artists shown",
    "Bibliography",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:10:17.510498"
}