{
  "title": "Photography in New Zealand",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Photography_in_New_Zealand",
  "content": "New Zealand photography first emerged in the mid-nineteenth century, and over time has become an important part of New Zealand art. A number of photography associations exist to support photographers in New Zealand.\n\nNew Zealand photography began in the mid-19th century when photographers first documented the country's natural beauty and people. The first photographs of the world-famous Pink and White Terraces were taken in 1859 by Bruno Hamel on Ferdinand Hochstetter's expedition.[1] Local photographers embellished, staged and sometimes faked early tourist prints to ensure sales.[2] Alfred Burton, of the Dunedin Burton Brothers, also travelled through many of the Pacific islands near New Zealand with the P&O Shipping line, in the early days of tourism through the region.  The photographic collections at Museum of New Zealand Te Papa Tongarewa, the national museum, hold many of the surviving images from this era, including images by Thomas Andrew, Leslie Adkin, James Bragge, Leslie Hinge and Spencer Digby in addition to archives of the Burton Brothers, Alfred James Tattersall and John McGarrigle's American Photographic Company. The Alexander Turnbull Library in Wellington also hosts a significant catalogue of historic images, many of which can be viewed online and browsed by location, name, and more. The seminal  development history of New Zealand photography was written by medical photographer and historian Hardwicke Knight in 1971. Archives New Zealand hold photos from government departments such as the National Publicity Studios and some individuals employed by government such as Leslie Hinge.\n\nGeorge D. Valentine was a Scottish photographer, who relocated to New Zealand due to his health, and documented much of the country at a time of great transition – his images of the Pink and White Terraces, taken in 1885, show scenes of incredible beauty that were buried less than a year later by 1886 eruption of Mount Tarawera. An exhibition of his work was mounted by the Christchurch Art Gallery in 2004.\n\nContemporary New Zealand photographers include Laurence Aberhart, Mark Adams, Brian Brake, Ben Cauchi, Marti Friedlander,[3] Anne Geddes, Anne Noble,[4] Fiona Pardington,[5] Patrick Reynolds,[6] Yvonne Todd,[7] Christine Webster, Rita Dibert, Yvonne Westra and Ans Westra.[8] Luit Bieringa has curated a number of influential New Zealand photography exhibitions.\n\nThe New Zealand Institute of Professional Photography[9] has a membership of 250 professional photographers, and the Advertising & Illustrative Photographers Association comprises another hundred or more.\n\nMany amateur and professional New Zealand photographers are members of PhotoForum NZ, a non-profit society that publishes PhotoForum magazine, organises exhibitions, workshops and lectures, and maintains a website.\n\nThe Photographic Society of New Zealand[10] is also a popular group for amateurs, representing camera clubs throughout the country.\n\nNew Zealand has two locally produced publications for the photographic community: The Photographer's Mail (focuses on the professional and industry) and D-Photo (focuses on the consumer and enthusiast).\n",
  "concepts": [
    "Photography in New Zealand",
    "zealand",
    "new zealand",
    "new",
    "photographers",
    "photography",
    "zealand photography",
    "professional",
    "photographic",
    "images",
    "photographer"
  ],
  "findings": [
    "Origins of New Zealand photography",
    "Contemporary photography",
    "Photography associations",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T17:04:22.517826"
}