{
  "title": "William Eskelinen",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/William_Eskelinen",
  "content": "William Eskelinen (born 3 September 1996) is a Swedish professional footballer who plays for Veikkausliiga club AC Oulu as a goalkeeper.[1]\n\nEskelinen started playing football for Skogås-Trångsunds FF at the age of five. As a 12-year-old he moved to the IF Brommapojkarna academy.[2] Eskelinen started playing senior football at Division 2 club Värmdö IF in 2014.[3]\n\nIn March 2015, Eskelinen was signed by Hammarby IF on a one-year contract and was immediately loaned back to Värmdö IF.[4] In January 2016, Eskelinen extended his contract in Hammarby by one year.[5] In March 2016, he was loaned out to the Division 2 club IFK Aspudden-Tellus on a loan agreement until the summer.[6] In August 2016, Eskelinen was loaned out to the Ettan club Enskede IK.[7]\n\nIn January 2017, Eskelinen was signed by GIF Sundsvall on a three-year contract.[8] On 18 September 2017, Eskelinen made his Allsvenskan debut in a 2–1 win over AFC Eskilstuna, where he was substituted in the 35th minute for the injured Tommy Naurin.[9]\n\nIn July 2019, Eskelinen signed a five-year contract with Danish Superliga club AGF.[10] In March 2022, he returned to Sweden, signing a deal until the end of 2023 with Örebro SK.[11]\n\nOn 4 March 2024, Eskelinen signed with Vestri in Iceland.[12]\n\nOn 14 January 2025, Eskelinen signed with Veikkausliiga club AC Oulu on a one-year deal with a one-year option.[13]\n\nEskelinen's father is the former professional footballer Kaj Eskelinen, who was a striker.[14] William is of Finnish descent through his father.[15]\n\nThis biographical article related to an association football goalkeeper from Sweden is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "William Eskelinen"
  ],
  "findings": [
    "Career",
    "Personal life",
    "Career statistics",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:49:26.772938"
}