{
  "title": "Baba-Hadji Mausoleum",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Baba-Hadji_Mausoleum",
  "content": "The Baba-Hadji Mausoleum is an Islamic Mausoleum and shared Armenian-Azerbaijani pilgrimage site built in the late 16th or early 17th century and located near the Shvanidzor village of Armenia some seventeen kilometres to the east of Meghri.[1] In 1926 Lisitsian wrote that: \"Baba Haji was a Turk and Armenian pilgrimage site not very far from the abandoned Armenian village of Gyumerants or Gumerants, and near the former Armenian village Bolishen.\"[2]\n\nThe Mausoleum is listed as a protected site for the cultural heritage of the ethnic minorities of Armenia by the government under the “Non-Armenian historical and cultural Monuments in Syunik” category and is maintained as state property.[3][4][5]\n\nThe mausoleum sits on the crest of a hill, encircled by the arm of an oak tree. It is conical with a diameter of roughly six metres and a height in the inner chamber of just under four. It is made of stone and contains a small square enclosure within covered in black cloth, surrounding two standing stones. There are two inscriptions on the stones, one Armenian inscription that says “Baba” along with the Arevakhach, Armenian infinity symbol, as well as, one inscription in the Arabic script that says “Hadji” along with a star and crescent.[1]\n\nThe exact history and nationality of this monument is unknown.[3] The only comprehensive study of the monument by researcher and journalist Gohar Isakhanyan acknowledges the complications in researching it: “To this day’ she concludes ‘the inhabitants of Shvanidzor do not know whether Baba-Hadji is of Azerbaijani, Persian, or Turkish origin, as all local Muslims used to be called “Turks.” Regardless 2 legends prevail on the origin of this site.[1]\n\nThe most popular legend, which is also seen as the most credible by the mayor of the town, states that the Armenian inhabitants of the village of Shvanidzor and the Azerbaijani inhabitants of the village of Nyuvadi were in constant conflict with each other until two elders from both villages, “Baba” and “Hadji”, resolved the conflict by becoming blood brothers and built a shrine in between the villages as a representation of the future peace between the villages.[4][1]\n\nAccording to another legend, the Armenian villages, in order to save themselves from the Turks, would climb the nearest mountain. With the purpose of breaking through the Armenians’ defense, the Turks would cut off the water having found the pipes with the help of an old woman. They would then take horses where the pipes were supposed to be and the horses, hearing the water sound, would start digging the soil. Left without water, the Armenians would give in. Therefore, they say, that in the sign of victory, the Turks built the Baba-Hajji holy place. The traces of the water pipe are still visible.[4][1]\n\nPrior to the Nagorno-Karabakh conflict, a mullah occasionally came over from Azerbaijan to lead prayers. Additionally, an Azerbaijani lived permanently near the shrine and collected donations for its upkeep. Food and water were offered to visitors, as was tea from ‘good quality samovars.’ Both Armenians and Azerbaijanis climbed up to Baba-Hadji to pay their respects and do matakh (religious sacrifice of animals). For this reason, the site has been described as a rare symbol of ethnic harmony between the two groups.[1]\n\nThe Azerbaijani population of the Meghri region of the Armenian SSR that made up 15.3% of the overall population per the 1989 soviet census and maintained this shrine have been largely forced out following the Nagorno-Karabakh conflict. Any remaining Azerbaijanis have changed their names and do not publicly state their ethnicity. Despite this, the Mausoleum is still listed as state property who is charged with maintaining it.[5][1]\n\nThe mayor of Shvanidzor, Oganyan, says that despite state maintenance, parts of the mausoleum have collapsed and the interior is in a ruined condition although the mausoleum is still largely intact. Village elders are described as still “swearing on Baba-Hadji rather than their own mother and father.” However, the existence of said mausoleum is largely unknown to the younger generation.[1]\n",
  "concepts": [
    "Baba-Hadji Mausoleum",
    "armenian",
    "mausoleum",
    "baba",
    "village",
    "hadji",
    "water",
    "site",
    "baba hadji",
    "azerbaijani",
    "villages"
  ],
  "findings": [
    "Architecture",
    "History",
    "Mausoleum today",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:32.390415"
}