{
  "title": "Gamelan Sekaten",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Gamelan_Sekaten",
  "content": "The Gamelan Sekaten (or Sekati) is a ceremonial gamelan (musical ensemble) from central Java, Indonesia, played during the annual Sekaten festival. The word \"sekaten\" itself is derived from syahadatain or shahada, the first requirement for converting into Islamic faith. Traditionally it is played once per year, on the occasion of Mawlid, Muhammad's birthday, for the week from the 6-12 of the month of Mulud (the third month of the Javanese calendar, corresponding to the Islamic Rabi' al-awwal). On this celebration it is brought from the palace at 11 pm to two pavilions before the Great Mosque. It is played every day during that week except the Thursday night/Friday morning. On the eve of the birthday proper, it is returned at 11 pm.[1]\n\nThe ensemble is said to have been created by Java's first Muslim prince,[2] or one of the Wali Sanga, in order to convert reluctant Javanese to the Islamic faith. However, it almost certainly already existed, though the music was probably used to propagate the faith.[3] The style of the Sekaten ensemble is very loud and majestic, because it seeks to attract people to the mosque.[1] It was said that if a saron player was able to play so hard that he broke one of the bronze keys, he would get a reward from the sultan.[3] The gamelan sekaten includes neither singers nor the soft instruments, unlike most Javanese ensembles.[4]\n\nThe ensembles are kept in the royal palaces. Two sets dating to the 16th century are found in each of the kraton in Surakarta and Yogyakarta, and two in Cirebon, one at Keraton Kasepuhan and one at Keraton Kanoman. Previously they were found in Madura and Banten as well.[1] The names of the sets at Yogyakarta are Kyai Guntur Madu and Kyai Naga Wilaga; those at Surakarta are Kyai Guntur Madu and Kyai Guntur Sari.[5] According to Benjamin Brinner, the gamelan sekaten, exists in halves: divided between the two rival courts in Surakarta and Yogyakorta, each court had a matching second half made.[4]\n\nThe pitches of the Sekaten ensemble is in pelog, but lower than standard ensembles today.[3] According to Benjamin Brinner it is the lowest pitched, largest, and loudest ensemble in Java.[4] In recent times the gamelan at ISI Surakarta commissioned a special Sekaten set that would be compatible with their other gamelan, to be used in new experimental compositions.[6]\n\nHistorically, the Sekaten ensemble is notable in the development of the gamelan because it marked the change from the use of the bonang as the most important melody instrument, as it is in the earlier Munggang and Kodokngorek ensembles, to \"leading\" the ensemble by playing the pitches in anticipating patterns.[7] In the ensemble, players sit on opposite sides of the bonang, which may have led to the modern configuration of pots, which is aimed at making octaves comfortable.[8]\n",
  "concepts": [
    "Gamelan Sekaten"
  ],
  "findings": [
    "See also",
    "Further reading",
    "References"
  ],
  "timestamp": "2025-04-11T10:14:16.748847"
}