{
  "title": "Science fiction",
  "source": "Wikipedia",
  "source_url": "https://en.wikipedia.org/wiki/Science_fiction",
  "content": "\n\nScience fiction (sometimes shortened to sci-fi or abbreviated SF) is a genre of speculative fiction which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life. It can explore science and technology in different ways, such as human responses to theoretical new advancements, or the consequences thereof. \n\nScience fiction is related to fantasy, horror, and superhero fiction and contains many subgenres. Its exact definition has long been disputed among authors, critics, scholars, and readers. Subgenres include hard science fiction, which emphasizes scientific accuracy, and soft science fiction, focusing on social sciences. Other notable subgenres are cyberpunk, which explores the interface between technology and society, and climate fiction, addressing environmental issues.\n\nPrecedents for science fiction are argued to exist as far back as antiquity, but the modern genre primarily arose in the 19th and early 20th centuries when popular writers began looking to technological progress and speculation. Mary Shelley's Frankenstein, written in 1818, is often credited as the first true science fiction novel. Jules Verne and H.G. Wells are pivotal figures in the genre's development. In the 20th century, expanded with the introduction of space operas, dystopian literature, pulp magazines, and the Golden Age of Science Fiction.\n\nScience fiction has come to influence not just literature but film, TV, and culture at large. Besides providing entertainment, it can also criticize present-day society and explore alternatives and inspire a \"sense of wonder\".\n\nAccording to Isaac Asimov, \"Science fiction can be defined as that branch of literature which deals with the reaction of human beings to changes in science and technology.\"[1]\n\nRobert A. Heinlein wrote that \"A handy short definition of almost all science fiction might read: realistic speculation about possible future events, based solidly on adequate knowledge of the real world, past and present, and on a thorough understanding of the nature and significance of the scientific method.\"[2]\n\nAmerican science fiction author and editor Lester del Rey wrote, \"Even the devoted aficionado or fan—has a hard time trying to explain what science fiction is,\" and the lack of a \"full satisfactory definition\" is because \"there are no easily delineated limits to science fiction.\"[3]\n\nAnother definition comes from The Literature Book by DK and is, \"scenarios that are at the time of writing technologically impossible, extrapolating from present-day science...[,]...or that deal with some form of speculative science-based conceit, such as a society (on Earth or another planet) that has developed in wholly different ways from our own.\"[4]\n\nThere is a tendency among science fiction enthusiasts as their own arbiter in deciding what exactly constitutes science fiction.[5] David Seed says it may be more useful to talk about science fiction as the intersection of other more concrete subgenres.[6] Damon Knight summed up the difficulty, saying \"Science fiction is what we point to when we say it.\"[7]\n\nForrest J Ackerman has been credited with first using the term \"sci-fi\" (analogous to the then-trendy \"hi-fi\") in about 1954.[8] The first known use in print was a description of Donovan's Brain by movie critic Jesse Zunser in January 1954.[9] As science fiction entered popular culture, writers and fans active in the field came to associate the term with low-budget, low-tech \"B-movies\" and with low-quality pulp science fiction.[10][11][12] By the 1970s, critics within the field, such as Damon Knight and Terry Carr, were using \"sci fi\" to distinguish hack-work from serious science fiction.[13]\n\nPeter Nicholls writes that \"SF\" (or \"sf\") is \"the preferred abbreviation within the community of sf writers and readers.\"[14]\n\nRobert Heinlein found even \"science fiction\" insufficient for certain types of works in this genre, and suggested the term speculative fiction to be used instead for those that are more \"serious\" or \"thoughtful\".[15]\n\nSome scholars assert that science fiction had its beginnings in ancient times, when the line between myth and fact was blurred.[16] Written in the 2nd century CE by the satirist Lucian, A True Story contains many themes and tropes characteristic of modern science fiction, including travel to other worlds, extraterrestrial lifeforms, interplanetary warfare, and artificial life. Some consider it the first science fiction novel.[17] Some of the stories from The Arabian Nights,[18][19] along with the 10th-century The Tale of the Bamboo Cutter[19] and Ibn al-Nafis's 13th-century Theologus Autodidactus,[20] are also argued to contain elements of science fiction.\n\nSeveral books written during the Scientific Revolution and later the Age of Enlightenment are considered true works of science-fantasy. Francis Bacon's New Atlantis (1627),[21] Johannes Kepler's Somnium (1634), Athanasius Kircher's Itinerarium extaticum (1656),[22] Cyrano de Bergerac's Comical History of the States and Empires of the Moon (1657) and The States and Empires of the Sun (1662), Margaret Cavendish's \"The Blazing World\" (1666),[23][24][25][26] Jonathan Swift's Gulliver's Travels (1726), Ludvig Holberg's Nicolai Klimii Iter Subterraneum (1741) and Voltaire's Micromégas (1752).[27]\n\nIsaac Asimov and Carl Sagan considered Johannes Kepler's Somnium the first science fiction story; it depicts a journey to the Moon and how the Earth's motion is seen from there.[28][29] Kepler has been called the \"father of science fiction\".[30][31]\n\nFollowing the 17th-century development of the novel as a literary form, Mary Shelley's Frankenstein (1818) and The Last Man (1826) helped define the form of the science fiction novel. Brian Aldiss has argued that Frankenstein was the first work of science fiction.[32][33] Edgar Allan Poe wrote several stories considered to be science fiction, including \"The Unparalleled Adventure of One Hans Pfaall\" (1835), which featured a trip to the Moon.[34][35]\n\nJules Verne was noted for his attention to detail and scientific accuracy, especially in Twenty Thousand Leagues Under the Seas (1870).[36][37][38][39] In 1887, the novel El anacronópete by Spanish author Enrique Gaspar y Rimbau introduced the first time machine.[40][41]  An early French/Belgian science fiction writer was J.-H. Rosny aîné (1856–1940).  Rosny's masterpiece is Les Navigateurs de l'Infini (The Navigators of Infinity) (1925) in which the word astronaut, \"astronautique\", was used for the first time.[42][43]\n\nMany critics consider H. G. Wells one of science fiction's most important authors,[36][44] or even \"the Shakespeare of science fiction\".[45] His works include The Time Machine (1895), The Island of Doctor Moreau (1896), The Invisible Man (1897), and The War of the Worlds (1898). His science fiction imagined alien invasion, biological engineering, invisibility, and time travel. In his non-fiction futurologist works he predicted the advent of airplanes, military tanks, nuclear weapons, satellite television, space travel, and something resembling the World Wide Web.[46]\n\nEdgar Rice Burroughs's A Princess of Mars, published in 1912, was the first of his three-decade-long planetary romance series of Barsoom novels, which were set on Mars and featured John Carter as the hero.[47] These novels were predecessors to YA novels, and drew inspiration from European science fiction and American Western novels.[48]\n\nIn 1924, We by Russian writer Yevgeny Zamyatin, one of the first dystopian novels, was published.[49] It describes a world of harmony and conformity within a united totalitarian state. It influenced the emergence of dystopia as a literary genre.[50]\n\nIn 1926, Hugo Gernsback published the first American science fiction magazine, Amazing Stories. In its first issue he wrote:\n\nBy 'scientifiction' I mean the Jules Verne, H. G. Wells and Edgar Allan Poe type of story—a charming romance intermingled with scientific fact and prophetic vision... Not only do these amazing tales make tremendously interesting reading—they are always instructive.  They supply knowledge... in a very palatable form... New adventures pictured for us in the scientifiction of today are not at all impossible of realization tomorrow... Many great science stories destined to be of historical interest are still to be written... Posterity will point to them as having blazed a new trail, not only in literature and fiction, but progress as well.[51][52][53]\nIn 1928, E. E. \"Doc\" Smith's first published work, The Skylark of Space, written in collaboration with Lee Hawkins Garby, appeared in Amazing Stories.  It is often called the first great space opera.[54] The same year, Philip Francis Nowlan's original Buck Rogers story, Armageddon 2419, also appeared in Amazing Stories. This was followed by a Buck Rogers comic strip, the first serious science fiction comic.[55]\n\nLast and First Men: A Story of the Near and Far Future is a \"future history\" science fiction novel written in 1930 by the British author Olaf Stapledon. A work of unprecedented scale in the genre, it describes the history of humanity from the present onwards across two billion years.[56]\n\nIn 1937, John W. Campbell became editor of Astounding Science Fiction, an event that is sometimes considered the beginning of the Golden Age of Science Fiction, which was characterized by stories celebrating scientific achievement and progress.[57][58] The \"Golden Age\" is often said to have ended in 1946, but sometimes the late 1940s and the 1950s are included.[59]\n\nIn 1942, Isaac Asimov started his Foundation series, which chronicles the rise and fall of galactic empires and introduced psychohistory.[60][61] The series was later awarded a one-time Hugo Award for \"Best All-Time Series\".[62][63] Theodore Sturgeon's More Than Human (1953) explored possible future human evolution.[64][65][66] In 1957, Andromeda: A Space-Age Tale by the Russian writer and paleontologist Ivan Yefremov presented a view of a future interstellar communist civilization and is considered one of the most important Soviet science fiction novels.[67][68]\n\nIn 1959, Robert A. Heinlein's Starship Troopers marked a departure from his earlier juvenile stories and novels.[69] It is one of the first and most influential examples of military science fiction,[70][71] and introduced the concept of powered armor exoskeletons.[72][73][74] The German space opera series Perry Rhodan, written by various authors, started in 1961 with an account of the first Moon landing[75] and has since expanded in space to multiple universes, and in time by billions of years.[76] It has become the most popular science fiction book series of all time.[77]\n\nIn the 1960s and 1970s, New Wave science fiction was known for its embrace of a high degree of experimentation, both in form and in content, and a highbrow and self-consciously \"literary\" or \"artistic\" sensibility.[78][79]\n\nIn 1961, Solaris by Stanisław Lem was published in Poland.[80] The novel dealt with the theme of human limitations as its characters attempted to study a seemingly intelligent ocean on a newly discovered planet.[81][82] Lem's work anticipated the creation of microrobots and micromachinery, nanotechnology, smartdust, virtual reality, and artificial intelligence (including swarm intelligence), as well as developing the ideas of \"necroevolution\" and the creation of artificial worlds.[83][84][85][86]\n\nIn 1965, Dune by Frank Herbert featured a much more complex and detailed imagined future society than had previously in most science fiction.[87] In 1967 Anne McCaffrey began her Dragonriders of Pern science fantasy series.[88] Two of the novellas included in the first novel, Dragonflight, made McCaffrey the first woman to win a Hugo or Nebula Award.[89]\n\nIn 1968, Philip K. Dick's Do Androids Dream of Electric Sheep? was published. It is the literary source of the Blade Runner movie franchise.[90][91] In 1969, The Left Hand of Darkness by Ursula K. Le Guin was set on a planet in which the inhabitants have no fixed gender. It is one of the most influential examples of social science fiction, feminist science fiction, and anthropological science fiction.[92][93][94]\n\nIn 1979, Science Fiction World began publication in the People's Republic of China.[95] It dominates the Chinese science fiction magazine market, at one time claiming a circulation of 300,000 copies per issue and an estimated 3–5 readers per copy (giving it a total estimated readership of at least 1 million), making it the world's most popular science fiction periodical.[96]\n\nIn 1984, William Gibson's first novel, Neuromancer, helped popularize cyberpunk and the word \"cyberspace\", a term he originally coined in his 1982 short story Burning Chrome.[97][98][99] In the same year, Octavia Butler's short story \"Speech Sounds\" won the Hugo Award for Short Story. She went on to explore in her work of racial injustice, global warming, women's rights, and political conflict.[100] In 1995, she became the first science-fiction author to receive a MacArthur Fellowship.[101] In 1986, Shards of Honor by Lois McMaster Bujold began her Vorkosigan Saga.[102][103] 1992's Snow Crash by Neal Stephenson predicted immense social upheaval due to the information revolution.[104]\n\nIn 2007, Liu Cixin's novel, The Three-Body Problem, was published in China. It was translated into English by Ken Liu and published by Tor Books in 2014,[105] and won the 2015 Hugo Award for Best Novel,[106] making Liu the first Asian writer to win the award.[107]\n\nEmerging themes in late 20th and early 21st century science fiction include environmental issues, the implications of the Internet and the expanding information universe, questions about biotechnology, nanotechnology, and post-scarcity societies.[108][109] Recent trends and subgenres include steampunk,[110] biopunk,[111][112] and mundane science fiction.[113][114]\n\nThe first, or at least one of the first, recorded science fiction film is 1902's A Trip to the Moon, directed by French filmmaker Georges Méliès.[115] It was influential on later filmmakers, bringing a different kind of creativity and fantasy.[116][117] Méliès's innovative editing and special effects techniques were widely imitated and became important elements of the cinematic medium.[118][119]\n\n1927's Metropolis, directed by Fritz Lang, is the first feature-length science fiction film.[120] Though not well received in its time,[121] it is now considered a great and influential film.[122][123][124]\n\nIn 1954, Godzilla, directed by Ishirō Honda, began the kaiju subgenre of science fiction film, which feature large creatures of any form, usually attacking a major city or engaging other monsters in battle.[125][126]\n\n1968's 2001: A Space Odyssey, directed by Stanley Kubrick and based on the work of Arthur C. Clarke, rose above the mostly B-movie offerings up to that time both in scope and quality, and influenced later science fiction films.[127][128][129][130]\n\nThat same year, Planet of the Apes (the original), directed by Franklin J. Schaffner and based on the 1963 French novel La Planète des Singes by Pierre Boulle, was released to popular and critical acclaim, its vivid depiction of a post-apocalyptic world in which intelligent apes dominate humans.[131]\n\nIn 1977, George Lucas began the Star Wars film series with the film now identified as \"Star Wars: Episode IV – A New Hope.\"[132] The series, often called a space opera,[133] went on to become a worldwide popular culture phenomenon,[134][135] and the third-highest-grossing film series of all time.[136]\n\nSince the 1980s, science fiction films, along with fantasy, horror, and superhero films, have dominated Hollywood's big-budget productions.[137][136] Science fiction films often \"cross-over\" with other genres, including film noir (Blade Runner - 1982), family film (E.T. the Extra-Terrestrial - 1982), war film (Enemy Mine - 1985), comedy (Spaceballs - 1987, Galaxy Quest - 1999), animation (WALL-E – 2008, Big Hero 6 – 2014), Western (Serenity – 2005), action (Edge of Tomorrow – 2014, The Matrix – 1999), adventure (Jupiter Ascending – 2015, Interstellar – 2014), mystery (Minority Report – 2002), thriller (Ex Machina – 2014), drama (Melancholia – 2011, Predestination – 2014), and romance (Eternal Sunshine of the Spotless Mind – 2004, Her – 2013).[138]\n\nScience fiction and television have consistently been in a close relationship. Television or television-like technologies frequently appeared in science fiction long before television itself became widely available in the late 1940s and early 1950s.[139]\n\nThe first known science fiction television program was a thirty-five-minute adapted excerpt of the play RUR, written by the Czech playwright Karel Čapek, broadcast live from the BBC's Alexandra Palace studios on 11 February 1938.[140] The first popular science fiction program on American television was the children's adventure serial Captain Video and His Video Rangers, which ran from June 1949 to April 1955.[141]\n\nThe Twilight Zone (the original series), produced and narrated by Rod Serling, who also wrote or co-wrote most of the episodes, ran from 1959 to 1964. It featured fantasy, suspense, and horror as well as science fiction, with each episode being a complete story.[142][143] Critics have ranked it as one of the best TV programs of any genre.[144][145]\n\nThe animated series The Jetsons, while intended as comedy and only running for one season (1962–1963), predicted many inventions now in common use: flat-screen televisions, newspapers on a computer-like screen, computer viruses, video chat, tanning beds, home treadmills, and more.[146]\n\nIn 1963, the time travel-themed Doctor Who premiered on BBC Television.[147] The original series ran until 1989 and was revived in 2005.[148] It has been extremely popular worldwide and has greatly influenced later TV science fiction.[149][150][151]\n\nOther programs in the 1960s included The Outer Limits (1963–1965),[152] Lost in Space (1965–1968), and The Prisoner (1967).[153][154][155]\n\nStar Trek (the original series), created by Gene Roddenberry, premiered in 1966 on NBC Television and ran for three seasons.[156] It combined elements of space opera and Space Western.[157] Only mildly successful at first, the series gained popularity through syndication and extraordinary fan interest. It became a very popular and influential franchise with many films, television shows, novels, and other works and products.[158][159][160][161] Star Trek: The Next Generation (1987–1994) led to six additional live action Star Trek shows: Deep Space Nine (1993–1999), Voyager (1995–2001), Enterprise (2001–2005), Discovery (2017–2024), Picard (2020–2023), and Strange New Worlds (2022–present), with more in some form of development.[162][163][164][165]\n\nThe miniseries V premiered in 1983 on NBC.[166]  It depicted an attempted takeover of Earth by reptilian aliens.[167] Red Dwarf, a comic science fiction series aired on BBC Two between 1988 and 1999, and on Dave since 2009.[168] The X-Files, which featured UFOs and conspiracy theories, was created by Chris Carter and broadcast by Fox Broadcasting Company from 1993 to 2002,[169][170] and again from 2016 to 2018.[171][172]\n\nStargate, a film about ancient astronauts and interstellar teleportation, was released in 1994. Stargate SG-1 premiered in 1997 and ran for 10 seasons (1997–2007). Spin-off series included Stargate Infinity (2002–2003), Stargate Atlantis (2004–2009), and Stargate Universe (2009–2011).[173]\n\nOther 1990s series included Quantum Leap (1989–1993) and Babylon 5 (1994–1999).[174] Syfy, launched in 1992 as The Sci-Fi Channel,[175] specializes in science fiction, supernatural horror, and fantasy.[176][177]\n\nThe space-Western series Firefly premiered in 2002 on Fox. It is set in the year 2517, after the arrival of humans in a new star system, and follows the adventures of the renegade crew of Serenity, a \"Firefly-class\" spaceship.[178] Orphan Black began its five-season run in 2013, about a woman who assumes the identity of one of her several genetically identical human clones. In late 2015, Syfy premiered The Expanse to great critical acclaim, an American TV series about humanity's colonization of the Solar System. Its later seasons would then be aired through Amazon Prime Video.\n\nScience fiction's rapid rise in popularity during the first half of the 20th century was closely tied to the popular respect paid to science at that time, as well as the rapid pace of technological innovation and new inventions.[179] Science fiction has often predicted scientific and technological progress.[180][181] Some works predict that new inventions and progress will tend to improve life and society, for instance the stories of Arthur C. Clarke and Star Trek.[182] Others, such as H.G. Wells's The Time Machine and Aldous Huxley's Brave New World, warn about possible negative consequences.[183][184]\n\nIn 2001 the National Science Foundation conducted a survey on \"Public Attitudes and Public Understanding: Science Fiction and Pseudoscience\".[185] It found that people who read or prefer science fiction may think about or relate to science differently than other people. They also tend to support the space program and the idea of contacting extraterrestrial civilizations.[185][186] Carl Sagan wrote: \"Many scientists deeply involved in the exploration of the solar system (myself among them) were first turned in that direction by science fiction.\"[187]\n\nScience fiction has predicted several existing inventions, such as the atomic bomb,[188] robots,[189] and borazon.[190] In the 2020 series Away astronauts use a Mars rover called InSight to listen intently for a landing on Mars. In 2022 scientists used InSight to listen for the landing of a spacecraft.[191]\n\nScience fiction  can act as a vehicle to analyze and recognize a society's past, present, and potential future social relationships with the other. Science fiction offers a medium and representation of alterity and differences in social identity.[192] Brian Aldiss described science fiction as \"cultural wallpaper\".[193] This widespread influence can be found in trends for writers to employ science fiction as a tool for advocacy and generating cultural insights, as well as for educators when teaching across a range of academic disciplines not limited to the natural sciences.[194]\n\nScholar and science fiction critic George Edgar Slusser said that science fiction \"is the one real international literary form we have today, and as such has branched out to visual media, interactive media and on to whatever new media the world will invent in the 21st century. Crossover issues between the sciences and the humanities are crucial for the century to come.\"[195]\n\nScience fiction has sometimes been used as a means of social protest. George Orwell's Nineteen Eighty-Four (1949) is an important work of dystopian science fiction.[196][197]  It is often invoked in protests against governments and leaders who are seen as totalitarian.[198][199] James Cameron's 2009 film Avatar was intended as a protest against imperialism, and specifically the European colonization of the Americas.[200] Science fiction in Latin America and Spain explore the concept of  authoritarianism.[201]\n\nRobots, artificial humans, human clones, intelligent computers, and their possible conflicts with human society have all been major themes of science fiction since, at least, the publication of Shelly's Frankenstein. Some critics have seen this as reflecting authors' concerns over the social alienation seen in modern society.[202]\n\nFeminist science fiction poses questions about social issues such as how society constructs gender roles, the role reproduction plays in defining gender, and the inequitable political or personal power of one gender over others. Some works have illustrated these themes using utopias to explore a society in which gender differences or gender power imbalances do not exist, or dystopias to explore worlds in which gender inequalities are intensified, thus asserting a need for feminist work to continue.[203][204]\n\nClimate fiction, or \"cli-fi\", deals with issues concerning climate change and global warming.[205][206] University courses on literature and environmental issues may include climate change fiction in their syllabi,[207] and it is often discussed by other media outside of science fiction fandom.[208]\n\nLibertarian science fiction focuses on the politics and social order implied by right libertarian philosophies with an emphasis on individualism and private property, and in some cases anti-statism.[209] Robert A. Heinlein is one of the most popular authors of this subgenre, including The Moon is a Harsh Mistress and Stranger in a Strange Land.[210]\n\nScience fiction comedy often satirizes and criticizes present-day society, and sometimes makes fun of the conventions and clichés of more serious science fiction.[211][212]\n\nScience fiction is often said to inspire a \"sense of wonder\".  Science fiction editor, publisher and critic David Hartwell wrote:[213]\n\nScience fiction's appeal lies in combination of the rational, the believable, with the miraculous. It is an appeal to the sense of wonder.\nCarl Sagan said:[187]\n\nOne of the great benefits of science fiction is that it can convey bits and pieces, hints, and phrases, of knowledge unknown or inaccessible to the reader . . . works you ponder over as the water is running out of the bathtub or as you walk through the woods in an early winter snowfall.\nIn 1967, Isaac Asimov commented on the changes then occurring in the science fiction community:[214]\n\nAnd because today's real life so resembles day-before-yesterday's fantasy, the old-time fans are restless. Deep within, whether they admit it or not, is a feeling of disappointment and even outrage that the outer world has invaded their private domain. They feel the loss of a 'sense of wonder' because what was once truly confined to 'wonder' has now become prosaic and mundane.\nThe science fiction studies is the critical assessment interpretation, and discussion of science fiction literature, film, TV shows, new media, fandom, and fan fiction.[215] Science fiction scholars study science fiction to better understand it and its relationship to science, technology, politics, other genres, and culture-at-large.[216]\n\nScience fiction studies began around the turn of the 20th century, but it was not until later that science fiction studies solidified as a discipline with the publication of the academic journals Extrapolation (1959), Foundation: The International Review of Science Fiction (1972), and Science Fiction Studies (1973),[217][218] and the establishment of the oldest organizations devoted to the study of science fiction in 1970, the Science Fiction Research Association and the Science Fiction Foundation.[219][220] The field has grown considerably since the 1970s with the establishment of more journals, organizations, and conferences, as well as science fiction degree-granting programs such as those offered by the University of Liverpool.[221]\n\nScience fiction has historically been sub-divided between hard science fiction and soft science fiction, with the division centering on the feasibility of the science.[222] However, this distinction has come under increasing scrutiny in the 21st century. Some authors, such as Tade Thompson and Jeff VanderMeer, have pointed out that stories that focus explicitly on physics, astronomy, mathematics, and engineering tend to be considered \"hard\" science fiction, while stories that focus on botany, mycology, zoology, and the social sciences tend to be categorized as \"soft\", regardless of the relative rigor of the science.[223]\n\nMax Gladstone defined \"hard\" science fiction as stories \"where the math works\", but pointed out that this ends up with stories that often seem \"weirdly dated\", as scientific paradigms shift over time.[224] Michael Swanwick dismissed the traditional definition of \"hard\" SF altogether, instead saying that it was defined by characters striving to solve problems \"in the right way–with determination, a touch of stoicism, and the consciousness that the universe is not on his or her side.\"[223]\n\nUrsula K. Le Guin also criticized the more traditional view on the difference between \"hard\" and \"soft\" SF: \"The 'hard' science fiction writers dismiss everything except, well, physics, astronomy, and maybe chemistry. Biology, sociology, anthropology—that's not science to them, that's soft stuff. They're not that interested in what human beings do, really. But I am. I draw on the social sciences a great deal.\"[225]\n\nMany critics remain skeptical of the literary value of science fiction and other forms of genre fiction, though some accepted authors have written works argued by opponents to constitute science fiction. Mary Shelley wrote a number of scientific romance novels in the Gothic literature tradition, including Frankenstein; or, The Modern Prometheus (1818).[227] Kurt Vonnegut was a highly respected American author whose works have been argued by some to contain science fiction premises or themes.[228][229]\n\nOther science fiction authors whose works are widely considered to be \"serious\" literature include Ray Bradbury (including, especially, Fahrenheit 451 (1953) and The Martian Chronicles (1951)),[230] Arthur C. Clarke (especially for Childhood's End),[231][232] and Paul Myron Anthony Linebarger, writing under the name Cordwainer Smith.[233] Doris Lessing, who was later awarded the Nobel Prize in Literature, wrote a series of five SF novels, Canopus in Argos: Archives (1979–1983), which depict the efforts of more advanced species and civilizations to influence those less advanced, including humans on Earth.[234][235][236][237]\n\nDavid Barnett has pointed out that there are books such as The Road (2006) by Cormac McCarthy, Cloud Atlas (2004) by David Mitchell, The Gone-Away World (2008) by Nick Harkaway, The Stone Gods (2007) by Jeanette Winterson, and Oryx and Crake (2003) by Margaret Atwood, which use recognizable science fiction tropes, but which are not classified by their authors and publishers as science fiction.[238] Atwood in particular argued against the categorization of works like the Handmaid's Tale as science fiction, labeling it, Oryx, and the Testaments as speculative fiction[239] and deriding science fiction as \"talking squids in outer space.\"[240]\n\nIn his book \"The Western Canon\", literary critic Harold Bloom includes Brave New World, Stanisław Lem's Solaris, Kurt Vonnegut's Cat's Cradle, and The Left Hand of Darkness as culturally and aesthetically significant works of western literature, though Lem actively spurned the Western label of \"science fiction\".[241]\n\nIn her 1976 essay \"Science Fiction and Mrs Brown\", Ursula K. Le Guin was asked: \"Can a science fiction writer write a novel?\" She answered: \"I believe that all novels ... deal with character... The great novelists have brought us to see whatever they wish us to see through some character. Otherwise, they would not be novelists, but poets, historians, or pamphleteers.\"[242]\n\nOrson Scott Card, best known for his 1985 science fiction novel Ender's Game, has postulated that in science fiction the message and intellectual significance of the work are contained within the story itself and, therefore, does not require accepted literary devices and techniques he instead characterized as gimmicks or literary games.[243][244]\n\nJonathan Lethem, in a 1998 essay in the Village Voice entitled \"Close Encounters: The Squandered Promise of Science Fiction\", suggested that the point in 1973 when Thomas Pynchon's Gravity's Rainbow was nominated for the Nebula Award and was passed over in favor of Clarke's Rendezvous with Rama, stands as \"a hidden tombstone marking the death of the hope that SF was about to merge with the mainstream.\"[245] In the same year science fiction author and physicist Gregory Benford wrote: \"SF is perhaps the defining genre of the twentieth century, although its conquering armies are still camped outside the Rome of the literary citadels.\"[246]\n\nScience fiction has been written by diverse authors from around the world. According to 2013 statistics by the science fiction publisher Tor Books, men outnumber women by 78% to 22% among submissions to the publisher.[247] A controversy about voting slates in the 2015 Hugo Awards highlighted tensions in the science fiction community between a trend of increasingly diverse works and authors being honored by awards, and reaction by groups of authors and fans who preferred what they considered more \"traditional\" science fiction.[248]\n\nAmong the most significant and well-known awards for science fiction are the Hugo Award for literature, presented by the World Science Fiction Society at Worldcon, and voted on by fans;[249] the Nebula Award for literature, presented by the Science Fiction and Fantasy Writers of America, and voted on by the community of authors;[250] the John W. Campbell Memorial Award for Best Science Fiction Novel, presented by a jury of writers;[251] and the Theodore Sturgeon Memorial Award for short fiction, presented by a jury.[252] One notable award for science fiction films and TV programs is the Saturn Award, which is presented annually by The Academy of Science Fiction, Fantasy, and Horror Films.[253]\n\nThere are other national awards, like Canada's Prix Aurora Awards,[254] regional awards, like the Endeavour Award presented at Orycon for works from the U.S. Pacific Northwest,[255] and special interest or subgenre awards such as the Chesley Award for art, presented by the Association of Science Fiction & Fantasy Artists,[256] or the World Fantasy Award for fantasy.[257] Magazines may organize reader polls, notably the Locus Award.[258]\n\nConventions (in fandom, often shortened as \"cons\", such as \"comic-con\") are held in cities around the world, catering to a local, regional, national, or international membership.[259][48][260] General-interest conventions cover all aspects of science fiction, while others focus on a particular interest like media fandom, filking, and others.[261][262] Most science fiction conventions are organized by volunteers in non-profit groups, though most media-oriented events are organized by commercial promoters.[263]\n\nScience fiction fandom emerged from the letters column in Amazing Stories magazine. Soon fans began writing letters to each other, and then grouping their comments together in informal publications that became known as fanzines.[264] Once in regular contact, fans wanted to meet each other and organized local clubs.[264][265] In the 1930s, the first science fiction conventions gathered fans from a wider area.[265]\n\nThe earliest organized online fandom was the SF Lovers Community, originally a mailing list in the late 1970s with a text archive file that was updated regularly.[266] In the 1980s, Usenet groups greatly expanded the circle of fans online.[267] In the 1990s, the development of the World-Wide Web increased the community of online fandom by of websites devoted to science fiction and related genres for all media.[268][failed verification]\n\n\nThe first science fiction fanzine, The Comet, was published in 1930 by the Science Correspondence Club in Chicago, Illinois.[269][270] One of the best known fanzines today is Ansible, edited by David Langford, winner of numerous Hugo awards.[271][272] Other notable fanzines to win one or more Hugo awards include File 770, Mimosa, and Plokta.[273] Artists working for fanzines have frequently risen to prominence in the field, including Brad W. Foster, Teddy Harvia, and Joe Mayhew; the Hugos include a category for Best Fan Artists.[273]\nScience fiction elements can include, among others:\n",
  "concepts": [
    "Science fiction"
  ],
  "findings": [
    "Definitions",
    "Alternative terms",
    "History",
    "Film",
    "Television",
    "Social influence",
    "As protest literature",
    "Sense of wonder",
    "Science fiction studies",
    "Classification",
    "Literary merit",
    "Community",
    "Authors",
    "Awards",
    "Conventions",
    "Fandom and fanzines",
    "Elements",
    "International examples",
    "Subgenres",
    "Related genres",
    "See also",
    "References",
    "General and cited sources",
    "External links"
  ],
  "timestamp": "2025-04-10T23:34:15.648085"
}