{
  "title": "Late Bloomers (2023 film)",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Late_Bloomers_(2023_film)",
  "content": "Late Bloomers is a 2023 American comedy drama film, directed by Lisa Steen in her directorial debut, from a screenplay by Anna Greenfield. It stars Karen Gillan, Margaret Sophie Stein, Jermaine Fowler, Talia Balsam and Kevin Nealon. Principal photography took place in New York.\n\nThe film had its world premiere at South by Southwest on March 10, 2023, and was released on June 7, 2024, by Vertical.\n\nLouise, an aimless twenty-eight year old musician who is recently single, is injured when she drunkenly breaks her hip. The subsequent physical therapy sees her associate with elderly people, and she meets Antonina, a Polish lady who speaks no English, and is hired to be her caretaker.[1]\n\nThe script was written by Anna Greenfield and based on her personal experiences. Greenfield collaborated on the film with Lisa Steen, whom she had known since college.[2] In July 2022, Karen Gillan, Margaret Sophie Stein, and Jermaine Fowler were revealed to have joined the cast, and principal photography was said to have wrapped in Brooklyn, New York. The film was produced by We're Doin' Great and Park Pictures.[3]\n\nThe film had its world premiere at the South by Southwest Festival in Austin, Texas on March 10, 2023.[4] In March 2024, Vertical acquired distribution rights to the film.[5] It was released on June 7, 2024.[6]\n\nOn the review aggregator website Rotten Tomatoes, 82% of 22 critics' reviews are positive, with an average rating of 6.40/10.[7] Metacritic, which uses a weighted average, assigned the film a score of 58 out of 100, based on 5 critics, indicating \"mixed or average\" reviews.[8]\n\nIn Deadline Hollywood, Damon Wise described Late Bloomers as \"an intimate, defiantly female-fronted indie, showcasing an engaging and refreshingly vanity-free performance from Karen Gillan\".[9] Jason Bailey of The Playlist felt the film was predictable in places and had familiar tropes, but described it as \"about as well-acted and enjoyable a version of this particular thing as you're likely to find.\"[10] Samantha Bergeson of IndieWire gave the film a grade of D, writing that \"the film doesn't open up in time to blossom into something great\", and its \"whispers of emotional depth…come too little and too late.\"[4]\n",
  "concepts": [
    "Late Bloomers (2023 film)"
  ],
  "findings": [
    "Synopsis",
    "Cast",
    "Production",
    "Release",
    "Reception",
    "Critical reception",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:13:22.449491"
}