{
  "title": "León Febres Cordero",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/León_Febres_Cordero",
  "content": "León Esteban Febres-Cordero Ribadeneyra (9 March 1931 – 15 December 2008), known in the Ecuadorian media as LFC or more simply Febres-Cordero, was an Ecuadorian politician who was the 35th President of Ecuador, serving a four-year term from 10 August 1984 to 10 August 1988. During his presidency he sought to introduce market-oriented reforms, and also led a security crackdown on a guerrilla group named ¡Alfaro Vive, Carajo!.[1][2]\n\nFebres-Cordero was born in a wealthy Guayaquil family on 9 March 1931. His father sent him to study in the United States, where he first attended Charlotte Hall Military Academy in Maryland, then Mercersburg Academy in Pennsylvania for high school, and then graduated as a mechanical engineer from the Stevens Institute of Technology in Hoboken, NJ (which he visited after being elected in 1984).[3]\n\nUpon his return to Guayaquil, Febres-Cordero worked in the private sector, mainly in industry, including paper, electrical parts, chemicals and textiles.  Eventually he became an executive partner in the Noboa Group, a large agribusiness Ecuadorian conglomerate.[3]\n\nThe Febres Cordero government promoted a conservative economic policy. While some praised Febres-Cordero's economic policies, they became largely unpopular amongst most Ecuadorians. Several of his secretaries were accused of corruption. His Secretary of Finance (and future Vice President), Alberto Dahik, was impeached by Congress.[4]\n\nFebres-Cordero, a close ally of US President Ronald Reagan, was sharply criticized for an increase in human rights violations, including torture and extrajudicial executions.[5] Decades later, Rafael Correa established the so-called Truth Commission to investigate human rights violations, particularly those that occurred during Febres Cordero's administration.[citation needed]\n\nIn January 1987 Febres-Cordero was kidnapped for 11 hours[6] by a group of Air Force members who were demanding freedom for General Frank Vargas Pazzos, who had been imprisoned after leading two uprisings in March 1986, aimed to topple the Secretary of Defense. Congress approved a resolution granting Vargas Pazzos amnesty, but Febres-Cordero refused to sign the resolution, thus denying it the rule of law. It was only after his 1987 kidnapping that he signed the amnesty and released Vargas Pazzos.[4]\n\nFebres-Cordero later became the mayor of Guayaquil for two consecutive terms (1992–1996, and 1996–2000.)[7] His time as mayor is widely considered successful as he lifted the city from years of mismanagement, corruption, and paternalist practices by the populist Bucaram family (particularly the administrations of Abdalá Bucaram and his sister Elsa Bucaram). Febres-Cordero's policies brought order to the government's administration and finances and brought about a massive infrastructure increase, thus cementing a base for his protégé, Jaime Nebot (also from the Social Christian Party). Nebot turned out to be the main political rival of President Correa (2007–2017), establishing a reputation as an important force in the Ecuadorian politics.[8]\n\nIn 2002 Febres-Cordero ran successfully for a seat in Congress, representing his native province, Guayas, for the 2003–2007 term. Despite being a regular absentee due to health issues, he was reelected in 2006, but those same issues forced him to retire shortly before the beginning of the new legislative period early 2007. This symbolically marked the end of his political clout over the country.[8][9]\n\nThat same year, and in what was his last public appearance, he criticized the conformation of a Truth Commission by the new left-wing government of Rafael Correa, who in his 2006 presidential campaign promised to \"halt the impunity\" of the Febres-Cordero regime.[10] The latter said that the body was a persecution tool of the new government, denounced an alleged leftist bias (as a former AVC member was among the commissioners) and accused it of being \"inquisitorial.\"[10]\n\nFebres-Cordero was first married to former First Lady of Ecuador María Eugenia Cordovez, to whom he had four daughters – María Eugenia, María Fernanda, María Liliana and María Auxiliadora.[3][7] They divorced in 1988 after thirty-four years of marriage.[11] Later he married Cruz Maria Massu, but they had no children.[7]\n\nFebres-Cordero died aged 77 in Guayaquil, on 15 December 2008, from lung cancer and emphysema.[7] He was granted a state funeral. His remains are buried at the Cementerio Parque de la Paz.\n",
  "concepts": [
    "León Febres Cordero"
  ],
  "findings": [
    "Early life",
    "Career",
    "Presidency (1984–1988)",
    "Post-presidency",
    "Personal life",
    "Death",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:15:39.149520"
}