{
  "title": "Norbertus van den Eynde",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Norbertus_van_den_Eynde",
  "content": "Norbertus van den Eynde (I), Norbrecht van den Eynde and Norbert van den Eynde (also spelled: Norbertus van den Eynden, Norbert van den Eynden, and Norbertus van den Eynden) (Antwerp, baptized 11 December 1628 – Antwerp, 7 October 1704)[1][2] was a Flemish sculptor.  He is mainly known for his religious sculptures and church furniture. He was the son of the prominent sculptor Huibrecht van den Eynde and a member of the van den Eynde family of sculptors.[3][4]  Van den Eynde was a close associate of Artus Quellinus II.[4] He undertook several commission in the Antwerp Cathedral, including several altarpieces.[4]\n\nNorbertus van den Eynde was born in Antwerp as the son of Huibrecht van den Eynde and Maria Anthonia Bagenier and was baptized on 11 December 1628. Van den Eynde was born into  one of the leading families of sculptors in Antwerp.[4] The family's workshop part of the informal Quellinus-Verbrugghen-Willemsens-Scheemaeckers-van den Eynde collaborative partnership, which had turned the sculpture market of Antwerp into a virtua; monopoly.[4] The extensive collaboration between the workshops of these families in the late 17th century \"may be the most important factor\" to account for the intricate \"unity of style and approaches that have made disentangling of hands particularly difficult for art historians.\"[4]\n\nHe trained with his father and became in the guild years 1662-1663 a master of the Guild of Saint Luke in Antwerp as a wijnmeester (son of a master).[2][1]   In the guild year 1968-1968 Jan van Bredael was registered as his pupil.[2]\n\nNorbertus van den Eynde married twice. He first married Maria Anthonia Bagenier (who was buried on 2 June 1691 in the St.-Michael's Church).[2] He later married Isabella Maria Reuckelenberg (or van Beirenbergh).[2] From his first marriage he had sons Norbertus the younger and Cornelis (both sculptors) and daughters Franchoise Theresia and Isabella Maria.[2] The latter married the prominent still life painter Jan Pauwel Gillemans the Younger on 3 March 1693, by whom she had a son before dying prematurely in October 1697.[5]\n\nVan den Eynde and his wife lived on the Arenbergstraat,[4] in the Wapper district of Antwerp, where they owned at least two houses.[2] They moved to Ghent for ten months between May 1692 and March 1693, leasing their house in the Wapper to their daughter Isabella Maria.[2]\n\nUpon their return to Antwerp, they witnessed the birth of a grandson, as well as the deaths of their daughters and their son Norbertus. Van den Eynde experienced financial trouble and had to sell his two houses on the 'Wapper'.  He was eventually able to pay off all his debts and distribute part of his estate to his surviving family members before his death in 1704.[2][6]\n\nHe is  known for his religious sculptures and church furniture. In 1653 he collaborated with his father on the production of the high altar for the Onze-Lieve-Vrouw van de Goede Wil church of Duffel.[7]\n\nVan den Eynde entered in 1653 into a contract to create two statues of saints and a crucifix for the church of the Professed house of the Society of the Antwerp jesuits.[6]  He further created in 1663 a throne for the Groenendael Priory.[3] The wooden choir-stalls in the Onze-Lieve-Vrouw van Goede Hoop Church of Vilvoorde, which were originally made for the Groenendael Priory, were previously attributed to him as they are in his style but that attribution may no longer be supported.[3][8]   He also made the marble altars of Our Lady (1658–9) and St Nicholas (1664 and 1668; with figures of St Nicholas, St Anna, St Joseph, St Teresa of Avila and St Roch) for the church of St Nicholas in Sint-Niklaas-Waas.[3]\n\nHe worked on various altars of the subsequently demolished Saint George Church in Antwerp. He first made in 1664 a marble altar.[6]  Then in 1671 he made two side altars and in 1677 he made together with Artus Quellinus II the high altar for that church.  In 1683 a conflict ensued from the latter project as Quellinus put him in default for failure to deliver the six pillars for the altar.[6]  The high altar was completed between 1677 and 1685 and consisted of a grand white and black marble altar of almost 15 meter high. A large painting (478 x 279 cm) of the Martyrdom of Saint George (ca. 1684, now in the Royal Museum of Fine Arts Antwerp(inv. 240)) by Godfried Maes (Antwerp 1649–1700) was the center of the altar. . It depicts the legend of the martyrdom of Saint George as recorded in the Legenda Aurea of Jacobus de Voragine, in mid 13th century. The executioners are waiting for the order of Roman Emperor Diocletian to execute George for having refused to worship the Roman gods.  The altar was crowned with statues of angels by van den Eynde and an equestrian statue of St. George by Quellinus. This is likely the equestrian statue that now stands in the north aisle of the rebuilt Saint George Church of Antwerp.[9]\n\nIn 1670 he and Quellinus entered into a contract to make the altar and altar garden of the fencers' guild in Antwerp Cathedral, completing the work commenced by Norbertus' father Huibrecht. During the execution of this project the sculptors had a number of conflicts with their patrons for non-payment of their bills.[6] Between 1683 and 1688, Van den Eynde completed in collaboration with the Antwerp sculptor Lodewijk Willemsens an altarpiece dedicated to Saint Catherine for the oudekleerkopersgilde (guild of used clothes buyers) in Antwerp Cathedral.[4]\n\nIn 1670, van den Eynde and the Antwerp sculptor Hendrik Frans Verbrugghen were \"specifically invited for their advice\" to travel to Mechelen as consultants for works on the St. Rumbold's Cathedral.[4]\n\nVan den Eynde was a frequent supplier of marble plaques (used for ebony cabinets) for the Musson and Forchondt art dealing firms.[4]\n",
  "concepts": [
    "Norbertus van den Eynde",
    "van",
    "van den",
    "den",
    "eynde",
    "den eynde",
    "antwerp",
    "st",
    "church",
    "altar",
    "norbertus"
  ],
  "findings": [
    "Life",
    "Work",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:58.948615"
}