{
  "title": "Rainel Rosario",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Rainel_Rosario",
  "content": "Rainel Rosario (born March 29, 1989) is a Dominican-Mexican professional baseball outfielder for the Bravos de León of the Mexican League. He has previously played in Nippon Professional Baseball (NPB) for the Hiroshima Toyo Carp, and in the Chinese Professional Baseball League (CPBL) for the Uni-President Lions.\n\nRosario signed with the St. Louis Cardinals organization as an international free agent in 2006 and made his professional debut for the GCL Cardinals. He played the 2007 and 2008 seasons with the rookie ball GCL Cardinals, batting .096 and .243 respectively. In 2009, Rosario played for the rookie ball Johnson City Cardinals, batting .272/.350/.408 in 36 contests. He split the 2010 season between the Low-A Batavia Muckdogs and the Single-A Quad Cities River Bandits, accumulating a .284/.387/.507 batting line in 64 games. He spent the next year with the High-A Palm Beach Cardinals, slashing .270/.333/.398 with 9 home runs and 70 RBI in 122 games. He split 2012 between Palm Beach and the Double-A Springfield Cardinals, batting .213/.282/.288 in 121 games between the clubs.[1] On November 2, 2012, Rosario elected free agency.\n\nRosario played the 2014 and '15 seasons in Japan for the Hiroshima Toyo Carp of Nippon Professional Baseball. He appeared in a total of 111 games, batting .309 with 16 home runs and 61 RBIs. in two seasons for Hiroshima, Rosario batted .309/.370/.503 with 16 home runs and 61 RBI.\n\nOn December 12, 2015 he signed a minor league contract with the Boston Red Sox and was assigned to their Double-A affiliate, the Portland Sea Dogs, to start the 2016 season. He split the year between Portland and the Triple-A Pawtucket Red Sox, batting .248 in 103 games between the two clubs before electing free agency on November 7, 2016.[2]\n\nOn March 30, 2017, Rosario signed with the Saraperos de Saltillo of the Mexican League. In 2017, Rosario batted a stellar .331/.406/.472 with 26 home runs and 104 RBI in 108 games. He played the entire 2018 season with the Saraperos, hitting 10 home runs with 50 RBI. In 2019, Rosario played in 114 games for Saltillo, slashing .324/.407/.569 with 28 home runs and 91 RBI.[3] Rosario did not play in a game in 2020 due to the cancellation of the Mexican League season because of the COVID-19 pandemic.[4]\n\nOn August 12, 2022, Rosario signed with the Uni-President 7-Eleven Lions of the Chinese Professional Baseball League.[5] He played in 35 games for the Lions, batting .232/.296/.370 with 4 home runs and 21 RBI.\n\nOn March 16, 2023, Rosario signed with the Saraperos de Saltillo of the Mexican League.[6] On June 18, Rosario beat his teammate, Fernando Villegas, to win the 2023 Home Run Derby.[7] For the season, he batted .331/.429/.581 with 17 home runs and 49 RBI. Rosario returned in 2024, hitting .261/.335/.376 with four home runs and 19 RBI across 40 games.\n\nOn June 14, 2024, Rosario and Henry Urrutia were traded to the Bravos de León of the Mexican League in exchange for infielders Keven Lamas and Alejandro Mejía.[8] In 37 appearances for León, he batted .328/.445/.552 with seven home runs and 28 RBI.\n\nRosario re-signed with León for a second season in 2025.\n\nIn June 2023, Rosario represented Mexico at the 2023 Central American and Caribbean Games, where the team won the gold medal.[9][10][11]\n",
  "concepts": [
    "Rainel Rosario",
    "rosario",
    "home",
    "runs",
    "home runs",
    "games",
    "rbi",
    "league",
    "played",
    "batting",
    "signed"
  ],
  "findings": [
    "Career",
    "St. Louis Cardinals",
    "Hiroshima Toyo Carp",
    "Boston Red Sox",
    "Saraperos de Saltillo",
    "Uni-President 7-Eleven Lions",
    "Saraperos de Saltillo (second stint)",
    "Bravos de León",
    "International career",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:55:25.519997"
}