{
  "title": "WKJS",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/WKJS",
  "content": "WKJS (105.7 FM) is an urban adult contemporary formatted broadcast radio station licensed to Richmond, Virginia, serving Richmond, Mechanicsville, and Midlothian in Virginia.[1]  WKJS is owned and operated by Radio One.[5]  The station's studios and offices are located just north of Richmond proper on Emerywood Parkway[6] in unincorporated Henrico County, and its transmitter is located in the Southside of Richmond.[7]\n\nThe 105.7 frequency began operations on November 8, 1995, under then owner Hoffman Communications as Christian-formatted WDYL, after moving from its long-time dial location of 92.1. WDYL traded 92.1 with Sinclair Telecable in order for Sinclair to increase signal power for its urban station WCDX, then known as \"Power 93\" and broadcasting on 92.7 FM. After the switch, WCDX, signed off 92.7 and continued with its urban format on 92.1 as Power 92, while WDYL assumed control of the 105.7 frequency and continued their longtime Christian format.[8]\n\nIn September 1998, Sinclair Telecable traded their 101.1 frequency, where Sinclair was running a smooth jazz format as WSMJ, with that of 105.7. After the transaction, on September 28, Hoffman moved their Christian format onto 101.1. Once Sinclair took control of 105.7, instead of moving the jazz format to the frequency, they decided to launch a country music format branded as \"The River\" under new call letters WJRV. (\"The River\" eventually began simulcasting with 100.3 in Petersburg with the calls WARV a few years later.)[9]\n\nSinclair Telecable later sold WJRV, WCDX, WPLZ, and WGCV-AM to Radio One, who already had purchased the 104.7 and 100.3 frequencies from local owners Radio 100, and 101.1 from Hoffman (Radio One had flipped WDYL from Christian to alternative rock as \"Y101\" by this time, and around this time began simulcasting WJRV with 100.1 using the call letters WARV).[10]\n\nIn March 2001, Radio One ditched the country format and moved the urban oldies format, \"Magic\" branding and the WPLZ call letters from 99.3 to 105.7 to take advantage of a better signal.[11] The station would change call letters to WJMO on June 4 of that year.\n\nOn November 18, 2004, as part of a series of moves, WJMO signed off and began simulcasting the urban AC \"Kiss FM\" format with 99.3 FM. The WKJS calls would be adopted on December 14.[12]\n",
  "concepts": [
    "WKJS"
  ],
  "findings": [
    "History",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:09:49.029136"
}