{
  "title": "2008 Nevada budget crisis",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/2008_Nevada_budget_crisis",
  "content": "The 2008 budget crisis in Nevada was a fiscal crisis in which the state faced a budget shortfall of at least US$1.2 billion out of a $6.8 billion budget.[1] The budget crisis was a result of the larger subprime mortgage crisis and the late-2000s recession.\n\nThe budget shortfall resulted Nevada Governor Jim Gibbons and the Nevada Legislature making large cuts to many state programs and agencies.\n\nAs the fastest growing state in the U.S. during the United States housing bubble, Nevada was hit especially hard by subprime mortgage crisis.[1] The Nevada Policy Research Institute argues that the state government raised taxes during an economic boom and increased government spending more than 20% in 2004. The shortfall for 2008 and 2009 resulted from, they argue, government spending money at unsustainable levels.[2][3]\n\nThe libertarian Nevada Policy Research Institute blames the financial crisis in Nevada, especially Las Vegas, on poor monetary policies, moral hazards created by government bailouts, and bad regulations such as the Community Reinvestment Act and the Security and Exchange Commission allowing several investment banks to increase their capital ratios. The result, according to NPRI was to rapidly increase home prices in Nevada, from a median level of about $130,000 to about $330,000 in less than 3 years.[4]\n\nNPRI created a chart that documents this rapid rise in home prices. It can be viewed here:http://npri.org/docLib/20081013_Chart_Las_Vegas_Home_Prices.pdf\n\nSeveral camps have emerged with solutions to solving the budget crisis.\n\nGovernor Jim Gibbons has successfully pushed for spending cuts, which have allowed Nevada to balance its budget.[5] Gibbons has opposed placing limits on government spending and currently opposes raising taxes.\n\nState Assembly Speaker Barbara Buckley has proposed restructuring the tax code so it is less reliant on gaming and sales taxes which she claims make up more than 60% of the general fund revenue.  She also supports increasing the rainy day fund.[6] Barbara Buckley is supported by Nevada System of Higher Education Chancellor Jim Rogers and TV personality Jon Ralston.\n\nThe Nevada Policy Research Institute supports balancing the budget by reducing spending but argues that Nevada needs spending limits and a larger rainy day fund.[7] NPRI, state senator Bob Beers and Chuck Muth of Citizen Outreach all oppose raising taxes.\n",
  "concepts": [
    "2008 Nevada budget crisis",
    "nevada",
    "budget",
    "crisis",
    "state",
    "spending",
    "government",
    "taxes",
    "npri",
    "shortfall",
    "research institute"
  ],
  "findings": [
    "Origins",
    "Las Vegas Housing Crisis",
    "Solving the Budget Crisis",
    "See also",
    "Notes"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:30:55.240168"
}