{
  "title": "Warty frogfish",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Warty_frogfish",
  "content": "The warty frogfish or clown frogfish (Antennarius maculatus) is a species of marine ray-finned fish belonging to the family Antennariidae, the frogfishes. The warty frogfish is found in the Indo-Pacific region.\n\nThe warty frogfish was first formally described as Chironectes maculatus in 1840 by the French zoologist Julien  François Desjardins with its type locality given as Mauritius.[3] Within the genus Antennarius the Indian frogfish belongs to the pictus species group.[4] The 5th edition of Fishes of the World classifies the genus Antennarius in the family Antennariidae within the suborder Antennarioidei within the order Lophiiformes, the anglerfishes.[5]\n\nAntennarius maculatus has the genus name Antennarius which suffixes -ius to antenna, an allusion to first dorsal spine being adapted into a tentacle on the snout used as a lure to attract prey. The specific name maculatus means \"spotted\", an allusion to the many brown variably sized circular dark spots on the body.[6]\n\nThe warty frogfish grows up to 15 cm (5.9 in) long. Like other members of its family, it has a globulous, extensible body, and its soft skin is covered with small dermal spinules. The skin is covered with numerous small, wart-like protuberances. Its large prognathous mouth allows it to consume prey its same size. The coloring of its body is extremely variable because it tends to match its living environment.\n\nFrogfishes have the capacity to change coloration and pigment pattern in a few weeks: during coral bleaching events, they can even turn to plain white to blend in with the environment.[7] However, the dominant coloration goes from white to black, passing through a whole range of related nuances such as cream, pink, yellow, red, and brown, often with dark, circular spots and/or with saddles. Some heavily spotted specimens can easily be confused with its close relative Antennarius pictus.\nThis characteristic can help to separate them: usually, A. maculatus has red or orange margins on all fins and sometimes a spike of the saddle blotch starts posterior to the eye.[8]\n\nThe first dorsal spine, the illicium is modified and is used as a fishing rod. Its extremity is endowed with a characteristic esca (lure), which looks like a small fish with a pinkish to brownish coloration.  The illicium is twice the length of the second dorsal spine and its often darkly banded. The second dorsal spine is practically straight and is mobile, and the third one is bent towards the back of the body; both are membranously attached to the head. They are well separated from each other and also from the dorsal fin.[9]\n\nThe pectoral fins are angled and help, with the pelvic fins, to move the fish on the bottom and to keep a stable position for ambush.\n\nThe warty frogfish exhibits biofluorescence, that is, when illuminated by blue or ultraviolet light, it re-emits it as red, and appears differently than under white light illumination. Biofluorescence may assist intraspecific communication and camouflage.[10]\n\nA. maculatus lives in the tropical waters of the Indo-Pacific area from Mauritius and Reunion Island  of the center of the Indian Ocean to the western part of the Pacific Ocean.[8] It is found in sheltered rocky and coral reefs; adults are usually associated with sponges down to 20 m (66 ft) deep.[8]\n\nAs all frogfishes, A. hispidus is a voracious carnivore which can attack all small animals that pass within its \"strike range\", mainly fishes. Its prey can vary in size to close to its own size.[9]\n\nLike other members of their family, they have a benthic and solitary lifestyle. They gather during mating period, but do not tolerate each other any more after the act of fertilization. The female can kill or eat the male if he stays close.[9]\n",
  "concepts": [
    "Warty frogfish",
    "frogfish",
    "maculatus",
    "antennarius",
    "warty frogfish",
    "warty",
    "dorsal",
    "spine",
    "small",
    "like",
    "family"
  ],
  "findings": [
    "Taxonomy",
    "Etymology",
    "Description",
    "Distribution and habitat",
    "Feeding",
    "Behaviour",
    "See also",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T16:55:24.576121"
}