{
  "title": "Jasin District",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Jasin_District",
  "content": "Jasin District, formerly known as Southern District, is one of the three administrative district in Malacca, Malaysia. It borders Tangkak District of Johor to the east, Tampin District of Negeri Sembilan to the north and Alor Gajah District and Melaka Tengah District to the west. The district capital is Jasin Town.\n\nThe early establishment of Jasin started since the establishment of small settlement by the local people. They chose an area near river mainly for their water supply, communication and agricultural purpose. To sustain life, they planted paddy and grew vegetables and fruit.[citation needed]\n\nJasin District is the largest district in Malacca occupying 41.47% of the state area. The Kesang River runs through the center of Jasin Town. The Kesang River separates the new town from the old town center. Almost 75% of the district area is flat plain, located not more than 50 meters above sea level.[5]\n\nJasin District is divided into 20 mukims:[3]\n\nTwo big towns:\n\nAnd nine small towns:\n\nJasin district is divided with two federal constituencies with northern part of Jasin in Alor Gajah constituency while the rest of district in Jasin constituency.\n\nList of Jasin district representatives in the Federal Parliament (Dewan Rakyat) \n\nList of Jasin district representatives in the State Legislative Assembly (Dewan Undangan Negeri) \n\nMajor businesses are mainly conducted by the Malays with a handful of Chinese, South Indians and Gujaratis. Jasin was known for its best Nasi Lemak especially in Kesang most peaceful place in Jasin District, it was made from generation to generation in Malay culture, also Kuih and Mee Bandung.\n\nThe Gujaratis in Jasin are mainly furniture dealers and the Mavani family has a monopoly. Run by generations of family members till today, the Mavani family business has flourished to be one of the most successful entrepreneurs in the city. Another popular shop on the same row is the Chen Sing Stationery Shop which sells stationery, magazines, comics and newspapers. There are two major banks in Jasin: Maybank and BIMB, which are also Malaysia's biggest banks.\n\nBecause the district has been designated as a water catchment area, industrialization is restricted to around the towns of Jasin and Merlimau. A large proportion of the land is used for the growing of rubber trees, oil palm and fruits. The area is also known for its durian fruits.\n\nThe old town center of Jasin Town consists of mainly 1920s 2-storey shophouses where small businesses is conducted on the ground floor and the owner lives above. Modern commercial buildings adorn the new town area and only one bridge over the Kesang River connects the new town to the old town.\n\nJasin boasts a new government hospital, Jasin Hospital, which replaced the old one that was fast becoming insufficient to meet the needs of the growing population. The hospital also serves as a teaching hospital for Malacca Manipal Medical College.\n\nBesides the hospital, other government healthcare facilities include\n\nThere are about 19 schools in Jasin district. Schools such as MRSM Tun Ghafar Baba, SMK Iskandar Shah and SMK Dang Anum are examples of schools that are well known in Malaysia. The Malaysia Institute of Aviation Technology, part of the Universiti Kuala Lumpur, is also located in Jasin. Other schools are listed below:\n\n\nJalan Sempang Kerayong,\n77000 Jasin,\nMalacca.\n\nJalan Chinchin, Simpang Kerayong\nPeti Surat 141, 77000\nJasin, Malacca\n\nJalan Batang Melaka,\n77500 Selandar,\nMalacca.\n\nJalan Kelubi,\n77000 Jasin,\nMalacca.\n\nJalan Jasin,\n77300 Merlimau,\nMalacca.\n\nJalan Bunga Tanjung (Jalan Taman Maju),\n77000 Jasin,\nMalacca.\n\nJalan Pegawai,\n77000 Jasin,\nMalacca.\n\nJalan Ayer Panas,\n77200 Bemban,\nMalacca.\n\nJalan Asahan,\n77100 Jasin,\nMalacca.\n\nPejabat Pos Selandar,\n77500 Selandar,\nMalacca.\n\nJalan Parit Putat,\n77400 Sungai Rambai,\nMalacca.\n\nJalan Bunga Tanjung,\n77000 Jasin,\nMalacca.\n\nKM16, Umbai,\n77300 Merlimau,\nMalacca.\n\nJalan Jasin,\n77300 Merlimau,\nMalacca.\n\nJalan Kemendor,\n77000 Jasin,\nMalacca.\n\nJalan Melangkan,\nNyalas, 77100 Asahan,\nMalacca.\n\nKarung Berkunci 1031,\nPejabat Pos Merlimau,\n77300 Merlimau,\nMalacca.\n\n77000 Jasin,\nMalacca.\n\n77000 Jasin,\nMalacca.\n\nJalan Batang Melaka,\n77500 Selandar,\nMalacca.\n\nKM 69, Jalan Kolam Air,\nMukim Chabau,\n77100 Asahan,\nMalacca.\n\nJasin town center is about half-an-hour drive away from Malacca City. From nearby Asahan it is possible to ascend the peak of Mount Ledang in Johor. Asahan is a border town boasting waterfalls. Jasin also borders Tangkak District, particularly the town of Tangkak in Johor. The two towns are about ten minutes' drive away from each other.\n",
  "concepts": [
    "Jasin District",
    "jasin",
    "malacca",
    "district",
    "jalan",
    "malacca jalan",
    "town",
    "jasin malacca",
    "77000 jasin",
    "77000",
    "jasin district"
  ],
  "findings": [
    "History",
    "Geography",
    "Administrative divisions",
    "Demographics",
    "Federal Parliament and State Assembly Seats",
    "Economy",
    "Industrial areas",
    "Infrastructure",
    "Medicine",
    "Education",
    "Tourist attractions",
    "Shopping",
    "Transportation",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:28:12.463459"
}