{
  "title": "American Freedmen's Inquiry Commission",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/American_Freedmen's_Inquiry_Commission",
  "content": "The American Freedmen's Inquiry Commission was charged by U.S. Secretary of War Edwin McMasters Stanton in March 1863 with investigating the status of the slaves and former slaves who were freed by the Emancipation Proclamation.  Stanton appointed Dr. Samuel Gridley Howe, James McKaye, and Robert Dale Owen as commissioners, all three of whom served from the creation of the committee in 1863 through to their submission of its final report in May 1864.\n\nCommission members and staff traveled to the American South, where they interviewed former slaves and Union field commanders to get a better grasp of the situation and of the \"condition and capacity\" of freed slaves. Howe and his secretary also traveled to Canada West, where thousands of former slaves had settled after gaining freedom in Canada. He visited their communities, interviewed freedmen and government officials, and noted their progress in a free country where they were enfranchised and their rights protected by the government.[1]\n\nThrough its report, the Commission recommended that the government help support freedmen through their transition to a free life. Their report was submitted to Congress and its findings debated. Its recommendations contributed to the passage by Congress of a bill authorizing formation of the Freedmen's Bureau, to help manage the transition of freedmen to freedom.\n\nThe Commission used Federal money to establish schools and churches in the South in an attempt to employ and educate former slaves. The commission's mission was successful, and the bill's life was extended in Congress in January 1866.\n\nIncluded in its reporting of the dire conditions faced by many freedmen in the South, the Commission reported that there had been instances of Union Army soldiers stealing from already poverty stricken African-American \"contrabands\" in Virginia. The following documents the looting:[2]\n\nIn connection with the probabilities of our obtaining the above number of colored troops, it is the duty of the Commission to report the fact that, in too many cases, not injustice only but robbery and other crimes have been committed against fugitives on first entering our lines. As an example: the Assistant Superintendent at Suffolk, Virginia, informed the Commission that instances had come to his knowledge of pickets who sometimes kept refugees until their masters came for them, and sometimes sent them back, pocketing the reward; the examples, however, of this offence were not numerous. He stated further, that, “in hundreds of cases,” the refugees had been robbed by the pickets, chiefly of money, but occasionally of other articles. Valuable horses, too, and other property, were taken from them by the Quartermaster, without remuneration to the refugee who brought them in.\nThe report fully described the poverty and difficult conditions of most former slaves in the South, as aspects of the society. Some members of Congress found it hard to believe that such conditions existed in the United States.\n\nRobert Dale Owen later re-published the full final report as a book titled The Wrong of Slavery, the Right of Emancipation, and the Future of the African Race in the United States.[3]\n",
  "concepts": [
    "American Freedmen's Inquiry Commission",
    "commission",
    "slaves",
    "report",
    "freedmen",
    "south",
    "congress",
    "government",
    "conditions",
    "american",
    "virginia"
  ],
  "findings": [
    "Background",
    "Footnotes",
    "References",
    "Bibliography"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T15:36:23.965435"
}