{
  "title": "Narciso Abeyta",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Narciso_Abeyta",
  "content": "Narciso \"Ciso\" Platero Abeyta, or Ha So Deh (1918–1998) was a Navajo painter, silversmith and Navajo code talker. He is known for his colorful paintings depicting Navajo life.[1] His work is in the permanent collection of museums including the Smithsonian National Museum of the American Indian.[2]\n\nAbeyta was born in 1918. He is named after his father, Narciso. His mother was Pablita.[3] He started drawing when he was eleven.[4] He attended the Santa Fe Indian School, starting in 1939. Dorothy Dunn was his teacher. Abeyta was a Golden Gloves boxer. He served in World War II in the United States Army,[5] as a code talker.[6] After he returned from service, he was unable to work for ten years due to his experiences at war.[7] Eventually, he attended the University of New Mexico. He trained under Raymond Jonson.[4]\n\nAbeyta was primarily a painter. His paintings document Navajo life, and use brush stroke techniques that are reminiscent of Navajo rugs.[4] He had two known commissions for work as a muralist; a 1934 mural for a social science classroom in Santa Fe, New Mexico and in 1939 for Maisel's Indian Trading Post in Albuquerque, New Mexico.[8] He demonstrated painting at the 1939 San Francisco World's Fair[9]\n\nAbeyta married Sylvia Ann, a Quaker ceramics artist.[7] They had seven children, including artists Tony Abeyta and Pablita Abeyta. The family lived in Gallup, New Mexico.[10]\n\nAbeyta died on June 22, 1998, from a cerebral hemorrhage.[1]\n\nHis work is held in the collections of the National Gallery of Art, National Museum of the American Indian,[2] and the Museum of New Mexico.[1]\n\nAbeyta's paintings were included the book, Southwest Indian Painting: A Changing Art (1957, University of Arizona Press) by Clara Lee Tanner.\n",
  "concepts": [
    "Narciso Abeyta"
  ],
  "findings": [
    "Early life and education",
    "Mid-life and career",
    "Later life and legacy",
    "Major exhibitions",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:20:19.461430"
}