{
  "title": "Samuel Henry Whitehouse",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Samuel_Henry_Whitehouse",
  "content": "\nSamuel Henry Whitehouse (14 February 1849 – 20 December 1919) was a British trade unionist.\n\nBorn in Swan Village in Staffordshire, Whitehouse began working underground at a coal mine when he was eight years old. He took part in his first strike when only ten, and within the next couple of years had experienced two accidents at the pit.[1]\n\nWhitehouse became an active trade unionist, and by 1867 was secretary of the lodge. He supported a Liberal Party candidate in a local Parliamentary election in 1867, and as a result, was sacked. Out of work for some months, he spent the time learning to read and was soon back at a different mine, where he was elected checkweighman. He was also elected as the agent for the West Bromwich Miners' Association, was a founder of the Amalgamated Association of Miners, and was elected to the West Bromwich School Board. He also worked part-time for the Labour Tribune newspaper.[1]\n\nWhen the Midland Miners' Federation was established in 1886, Whitehouse was elected as its first secretary. He served for two years until he took up a full-time post as an agent for the Somerset Miners' Association. Almost immediately after starting, he was taken to court by a local mine owner; he lost the case, but refused to pay the fine, and bailiffs took many of his possessions. However, he remained in the post and managed to greatly increase members.[1]\n\nWhitehouse was Somerset's delegate to the founding conference of the Miners' Federation of Great Britain, and served on its executive on several occasions. He was also elected to Radstock Urban District Council as a Liberal-Labour member, serving from 1893 to 1898. He retired from his union post in 1917 due to poor health, and died two years later aged 70.[1]\n",
  "concepts": [
    "Samuel Henry Whitehouse",
    "whitehouse",
    "miners",
    "elected",
    "years",
    "took",
    "time",
    "post",
    "association",
    "west bromwich",
    "west"
  ],
  "findings": [
    "Early life",
    "Career",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T15:18:49.491540"
}