{
  "title": "Padanilam Parabrahma Temple",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Padanilam_Parabrahma_Temple",
  "content": "Padanilam Parabrahma Temple (പടനിലം പരബ്രഹ്മ ക്ഷേത്രം ) is situated at Padanilam[2] in Mavelikara taluk of Alappuzha district in Kerala,[3] India. It is one of the major temples in erstwhile Travancore state. Padanilam is the cultural center of Nooranad region. The temple is situated 17 km east of Kayamkulam and 7 km south west of Pandalam. The temple is dedicated to Lord Parabrahma, also known as omkaram.\n\n[4]\nPadanilam Temple is believed to be swayambhu. Its actual history and the facts about how worship started there are unknown. Padanilam has been the administrative centre of Nooranad and it has the history of intense conflict between various karakal (territories) around the temple. This was for gaining control over the temple administration and thereby controlling the entire village. Due to this pada (battle/conflict), the place is said to have got its name. It is believed that the army troops of Kayamkulam Kingdom was camped near the temple for protecting the kingdom from the attack of neighbouring kings. During this period, the village had some chieftains and their supporters. They include Noorukodi Unnithans, Kadackal Kuruppans, Vettathasaans and Vettadickal Kuruppans. \n\nKayamkulam Raja withdrew his troops about four centuries ago. This initiated tensions between the chieftains for control of the village. Thus they divided into south and north, starting battle. The south side consisted of Noorukodi Karuppans and Kadackal Kuruppans. The other side had Vettathasans and Vettadickal Kuruppans with them. Twenty-two karakal supported their respective sides. During the battle, many soldiers of both the sides died in large numbers. They were buried in the chira near the temple. Even from very earliest of times, this temple was a blessing for the people in the surrounding areas. It is also believed that the battle was between Marthanda varma King on one side and Kayamkulam King on the other. The twenty-two karakals of Nooranad took side with the two kings. The common people started worrying about the devastation of the war and approached the Pazhoor Panamana Thampuran to find a solution to end the war. He tried to intervene but the parties were not in a position to stop. He made a tent in the eastern part of the temple and started fasting unto death. But that also did not deter the warring parties. But when he was on the verge of death due to the fast, they fearing the Brahmanasaapam, agreed to stop war. They demarcated the boundary in the north-south direction and stopped the war in the name of Parabrahma, the presiding deity of the temple.\n\nSivarathri[5] is the main festival in the temple.[6] Giant effigies of bulls, known locally as kettukala, are pulled to the temple from 15 territories (kara) of the temple. Some of these have a height of more than 50 feet. Its one of the largest festivals of its kind in Kerala. There are many people in the Nooranad area, who are involved in the making of these colossal effigies. There is a proposal in front of the Kerala Government to recognize this village as the Nandikesha Paithruka Gramam due to its cultural importance.\nThousands come to the temple on Sivarathri day to see the kaavadiyattam for Lord Subrahmanyan in the morning. Kaavady from all parts of the area come separately and meet at the temple. Kettulsavam is the most spectacular sight of the festival and is held in the evening. Kettulsavam from the distinct areas of the village come to the temple at around 4 p.m. The rituals and programmes only end at midnight.\n\nPadanilam Parabrahma Temple temple has mainly 15 karakal (territories). They are\n\n[7]\nOther festivals in the temple include:\n\nMany marriages are also conducted in this temple, because marriage in this temple is considered auspicious.\n\nThere are both private and KSRTC buses from the towns of Kayamkulam and Pandalam. There are buses from Pandalam, Kayamkulam, Pathanamthitta, Konni, Mavelikkara, Oachira, and Karunagapally passing through Padanilam. Padanilam is situated on the Kayamkulam-Pandalam-Pathanamthitta bus route.\n\nOfficial temple website",
  "concepts": [
    "Padanilam Parabrahma Temple"
  ],
  "findings": [
    "History",
    "Padanilam Sivarathri",
    "Temple Specialities",
    "Karakal (territories)",
    "Other festivals",
    "How to reach",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:18:25.859776"
}