{
  "title": "Medical grade silicone",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Medical_grade_silicone",
  "content": "Medical grade silicones are silicones tested for biocompatibility and are appropriate to be used for medical applications.[1] In the United States, the Food and Drug Administration (FDA) Center for Devices and Radiological Health (CDRH) regulates devices implanted into the body. It does not regulate materials other than certain dental materials. The FDA regulate silicones used in food contact under the auspices of the Center for Food Safety and Nutrition (CFSAN) and for use in pharmaceuticals under the auspices of the Center for Drug Evaluation and Research (CDER).\n\nMedical grade silicones are generally grouped into three categories: non implantable, short term implantable, and long-term implantable. Materials approved as Class V and VI can be considered medical grade. Most medical grade silicones are at least Class VI certified. Silicone suppliers and some silicone prototyping companies provide guidelines for material use.\n\nSilicone rubber applications such as catheters are widespread in medicine, but have several limitations. For example, they exhibit poor tear strength and poor resistance to fatigue. Brittle fracture can occur from defects within sections owing to poor control of vulcanization.[2] It resulted in high failure rates for breast implants, and much subsequent litigation in the US, as well as elsewhere in the world. It led to a crisis of confidence in the US, with many manufacturers being forced out of the business entirely, and others to manufacture under FDA control.\n\nThis material-related article is a stub. You can help Wikipedia by expanding it.\nThis article related to medical technology is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Medical grade silicone",
    "medical",
    "silicones",
    "medical grade",
    "grade",
    "silicone",
    "poor",
    "materials",
    "implantable",
    "grade silicones",
    "food"
  ],
  "findings": [
    "Uses",
    "Limitations",
    "See also",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:36:57.942414"
}