{
  "title": "Martha Crone",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Martha_Crone",
  "content": "Martha Crone (1894–1989) was an American botanist and horticulturist.[1]\n\nCrone was born in Minneapolis on January 29, 1894, as Martha E. Eberlein, to Edward and Amelie Eberlein.[2] She attended formal schooling only through 8th grade, but became a self-taught expert in, botany, horticulture, and writing.[1]\n\nShe married the dentist Bill Crone (1894-1951), in 1915,[3] She had a daughter (Janet C. Prevey, born 1917, died 1989) and three grandchildren (David Prevey, Judith Prevey, and Linder Wander).[4] At the time of her death in 1989, Crone had three great-grandchildren and one great-great-grandchild.[1]\n\nCrone served as an assistant for 15 years to Eloise Butler, the first curator of what was originally known as the Minneapolis Wildflower Garden. She went on to become the second curator of what is now known as the Eloise Butler Wildflower Garden and Bird Sanctuary in 1933.[5] Under her leadership, the garden grew to over 20 acres[4] in Theodore Wirth Park (formerly known as Glenwood Park) in north Minneapolis. She planted thousands of flowers and ferns while overseeing the landscaping of trees and other plantings.[6] Martha Crone planted over 100 species of wildflowers including many rare wildflowers that were rescued by Crone from across the state including at sites being plowed under for development.[1] She served as Curator of The Garden for 26 years and founded The Friends of the Garden, Inc in 1952.[5] After her retirement as Curator of the Garden, she continued her support and advocacy of The Garden as Secretary, Treasurer, and Newsletter Editor until 1971.[4] In 1951, Martha Crone was awarded a bronze medal for achievement from the Minnesota Horticultural Society.[5] On May 17, 1970, The Martha E. Crone Shelter, which was planned, built, and funded by the Friends of the Wildflower Garden, opened in Eloise Butler Wildflower Garden.[7]\n\nFrom 1953 to 1971, Crone became the editor of The Fringed Gentian [8] the quarterly newsletter of Friends of the Wildflower Garden, Inc. Her writing skills and passion for nature are evident in her last contribution to the newsletter in April 1971.[9] Her yearly reports to the Park Board, led by Theodore Wirth, were comprehensive about plantings, visitors, weather, improvements to the garden, and mosquitoes. Her sense of humor over the latter is evidenced in a letter to Theodore Wirth. In response to Wirth's criticism of the mosquitoes at the garden, Martha Crone replies: \"I wish to offer my apologies for the ill manner of my mosquitoes, they are rather difficult to train as each one lives only a short time.\"[10]\n\nOn December 31, 1936, Crone and her husband acquired 40 acres of property in the Cedar Creek Forest, north of Minneapolis and east of Bethel, MN, for $375 with a down payment of $10.[4] They built a small cabin on the site in 1938, and proceeded to spend weekends year round in this wetlands retreat for many years.[4] Crone collected rare plants from this site to be transplanted in The Garden, including 24 Ram's Head ladyslippers in 1936.[4] In the spring of 1940, Professor Arthur N. Wilcox of the University of Minnesota, visited Crone at her Cedar Creek property to get her \"version of conservation at our Cedar Bog site.\"[4] Arthur Wilcox was influential in establishing the Cedar Creek Natural History Area in 1940 which is now known as the Cedar Creek Ecosystem Science Reserve, and this began Crone's sustained involvement with this important ecological study site.[11] The Crone property provided access to the research laboratories at Cedar Creek Natural History Area and she eventually sold her parcel to this now registered US Natural Landmark where the hillock where her cabin was is now known as Crone Knoll.[12]\n",
  "concepts": [
    "Martha Crone",
    "crone",
    "garden",
    "martha",
    "cedar",
    "wildflower garden",
    "wildflower",
    "martha crone",
    "known",
    "creek",
    "cedar creek"
  ],
  "findings": [
    "Biography",
    "Private life",
    "Career",
    "References"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:35:05.488676"
}