{
  "title": "Lindsay Wisdom-Hylton",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Lindsay_Wisdom-Hylton",
  "content": "Lindsay Wisdom-Hylton (born May 26, 1986)[1] is a retired American professional basketball player. She attended high school at Neuqua Valley High School in Naperville, IL. She recently played the forward position for the Washington Mystics in the WNBA.[2]\n\nBorn in Indianapolis, Indiana, her parents are Elaine and Antonio Hylton. She has three younger sisters: Kristin, Zoe, and Sydney.  She knew at age five that she wanted to be a professional athlete. She played with Los Angeles Sparks teammate Candace Parker in junior leagues prior to the going to high school.\n\nAttended Neuqua Valley High School where she ended her career there with stat totals of 1,752 points and 1,200 rebounds.  It is believed that she was the first female to reach 1,000 points, 1,000 rebounds, 500 assists, 500 blocks, and 500 steals in Illinois high school history.  Named 2004 Parade Magazine All-America third team, and 2004 WBCA All-American honorable mention.[1]\n\nShe spent her entire college career at Purdue University, majoring in organizational leadership and supervision (management). She redshirted her senior year (2007–08), and would stay at Purdue for a fifth year. Played on the 2007 USA U21 National team that won the gold at the FIBA Women's World Championship in Moscow, Russia. In 2006, she played on the USA U20 National team that won a gold medal in the FIBA Americas Championship for Women in Mexico City, Mexico. She was a 2-time All-Big Ten, 3-time All-Defensive Big Ten selection and named Big Ten Defensive Player of the Year in 2007. She recorded 25 career double-doubles, led the Purdue Boilermakers in points (13.3), rebounds (9.2), and blocks (1.5) per game in 2008.  She holds the Purdue school record for blocked shots and rebounds. Wisdom-Hylton came back to Purdue during the 2009–10 season to be an assistant coach.\n\nSource[3]\n\nPicked thirteenth overall in the 2009 WNBA draft by the Los Angeles Sparks. Wisdom-Hylton was traded to the Chicago Sky before the start of the 2011 season for a 2012 second round draft pick. In the 2012 season, she played with the Washington Mystics. After the season ended, she announced her retirement to coach full-time. She averaged 3.2 points per game in 124 WNBA games.\n\nOn September 26, 2012, 4 days after she played her final WNBA game, Wisdom-Hylton signed with Purdue as their assistant coach for the second time. She took the place of Martin Clapp, who left the school earlier that month.[4][5] On April 18, 2019, it was announced that Wisdom-Hylton stepped down as an assistant coach at Purdue to pursue other opportunities in coaching.[6] On May 22, 2019, she was signed to the same position at the University of Wisconsin under head coach Jonathan Tsipis.[7] On April 30, 2021, it was announced that she was hired as assistant coach at Boston College.[8]\n\nWisdom-Hylton played for Ravenna Esperides/Glyfada in Greece for the 2009–2010 off-season for 8 games before returning to the U.S. to be an assistant coach at her alma mater, Purdue University. For the 2010–2011 off-season, she played for Elitzur Ramla in Israel for 11 games. Then, she went to France to play for Union Hainaut for four games. Wisdom'Hylton would go to Vienna, Austria to play for the Flying Foxes for the 2011–2012 season in the Austrian Basketball League. She then went back to Israel in 2012 for a second stint with Elitzur Ramla and played on the squad for the remainder of the 2011-2012 off-season.\n",
  "concepts": [
    "Lindsay Wisdom-Hylton"
  ],
  "findings": [
    "Childhood",
    "High School career",
    "College career",
    "Purdue statistics",
    "WNBA career",
    "WNBA career statistics",
    "Coaching career",
    "International career",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:08:54.056174"
}