{
  "title": "USS Pocono",
  "source": "Wikipedia (Random Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/USS_Pocono",
  "content": "USS Pocono (AGC-16) was an Adirondack-class amphibious force command ship named after a range of Pocono Mountains in eastern Pennsylvania. She was designed as an amphibious force flagship, a floating command post with advanced communications equipment and extensive combat information spaces to be used by the amphibious forces commander and landing force commander during large-scale operations.\n\nAn amphibious force flagship, Pocono's keel was laid down on 30 November 1944 and the vessel was launched on 25 January 1945 by the North Carolina Shipbuilding Company, of Wilmington, North Carolina, sponsored by Miss Mary V. Carmines of Messick. The ship was acquired by the Navy on 15 February 1945, towed to Boston for fitting out and commissioned on 29 December 1945.\n\nPocono departed Boston on 18 March 1946 for Key West, Florida, en route to Guantanamo Bay for shakedown. The ship then proceeded to Washington, D.C., via Norfolk, and arrived in the US capital on 7 May.\n\nDuring the next few years, she operated off the Atlantic coast from Newfoundland to Trinidad. Early in 1948, she was flagship of Admiral W. H. P. Blandy, Commander Atlantic Fleet.\n\nPocono decommissioned at Norfolk on 19 June 1949 and moved to Bayonne, New Jersey, where she entered the Atlantic Reserve Fleet.\n\nPocono was recommissioned on 18 August 1951 to serve as flagship for Commander, Amphibious Force, Atlantic Fleet. She operated in this capacity in the Caribbean and off the East Coast of the U.S. until 1956. On 31 October 1956, during the Suez Crisis, the Commander-in-Chief, Naval Forces, Eastern Atlantic and Mediterranean, embarked in Pocono, and remained on board until 13 December.\n\nIn September 1957 Pocono served as flagship for a 38-ship amphibious task force in NATO exercise \"Deepwater\" off the coast of Turkey.\n\nIn early 1958 Pocono served as flagship for operation \"Packard X\", an Atlantic Fleet amphibious exercise at Onslow Beach, North Carolina. On 23 June 1958 she departed the U.S. bound for the Mediterranean. She was diverted to Beirut, Lebanon, where she controlled the landing that assisted that nation. During her three-month stay in Beirut, she performed such functions as air control and command communications. Because of the Lebanon Crisis the regular six-month Mediterranean deployment was extended to nine months, with Pocono returning to Norfolk on 20 March 1959.\n\nOn 11 January 1960 Pocono again departed Norfolk for the Mediterranean where she participated in four amphibious landing exercises, including a joint NATO landing at Porto Scudo, Sardinia, before returning to Norfolk on 14 June. She participated in Caribbean landing exercises in July 1960 and February 1961. On 11 April 1961 she departed for the Mediterranean, and participated in several amphibious landings, including a joint NATO landing at the Gulf of Saros, Turkey, before returning to Norfolk on 12 October.\n\nAfter an extensive overhaul she departed 10 April 1962 for the Caribbean, and 23 July for the Mediterranean. When the Cuban Missile Crisis arose, Pocono was recalled to the United States. She carried the flag of Commander, Amphibious Forces, Atlantic, and remained in operational readiness in Norfolk. For the rest of 1962, 1963, and through most of 1964 Pocono remained in the U.S. In early 1964 she participated in two landing exercises at Onslow Beach. On 11 October she deployed for \"Steelpike I\", which included an assault with helicopter landings at Huelva Bay, Spain. She returned to Norfolk on 25 November.\n\nPocono departed Norfolk on 21 May 1965 en route to Santo Domingo, Dominican Republic to aid in the peace-keeping operation there. She provided the platform from which Vice Admiral John S. McCain directed the naval forces' support of this operation. From late 1965 through early 1968 Pocono participated in further operations in the Caribbean and off the east coast of the U.S., returning to Norfolk on 24 February 1968.\n\nDecommissioned on 16 September 1971, she was stricken from the Naval Vessel Register on 1 December 1976.  Pocono was sold for non-transportation use 3 December 1981 to Union Minerals & Alloys of New York, New York and scrapped.\n\n This article incorporates text from the public domain Dictionary of American Naval Fighting Ships. The entry can be found here.\n",
  "concepts": [
    "USS Pocono"
  ],
  "findings": [
    "Service history",
    "1946–1949",
    "1951–1959",
    "1960–1971",
    "References",
    "External links"
  ],
  "timestamp": "2025-04-11T10:16:14.984874"
}