{
  "title": "List of compositions by Jake Heggie",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/List_of_compositions_by_Jake_Heggie",
  "content": "\nThis is a list of compositions by Jake Heggie sorted by genre, date of composition, and title.\n\nCommissioned by Music of Remembrance (Mina Miller, artistic director). Each part received its premiere individually by Music of Remembrance.\n\nUnpublished.\n\nCommissioned by Brian Asawa.\n\nDedicated to Frederica von Stade.\n\nCommissioned by the New Century Chamber Orchestra.\n\nCommissioned by Earle Patriarco.\n\nMusic and poetry composed for Nicolle Foland.\n\nCommissioned by Frederica von Stade and dedicated to her daughter, Lisa Elkus. Orchestration commissioned by the Louisville Orchestra in 2000.\n\nDedicated to Zheng Cao. Three songs based on works written in 1986, revised in 1998.\n\nCommissioned for Frederica von Stade by MUSIC ACCORD.\n\nComposed for Peggy Kriha-Dye.\n\nCommissioned by Vija Nadai.\n\nCommissioned by James Schwabacher.\n\nCommissioned by Bravo! Vail Valley Music Festival. Orchestration commissioned by the St. Paul Chamber Orchestra in 2005.\n\nCommissioned by the Harmida Trio.\n\nPrologue: Winter Roses (Baldridge) \n\nI. Two Birds \n\nII. Three Shades (in memoriam C.v.S.) \n\nIII. Looking West \n\nEpilogue: Late Fragment (Carver)\n\nCommissioned by Richard and Luci Janssen for Camerata Pacifica.\n\nCommissioned by University of Kansas at Lawrence for mezzo-soprano Joyce Castle.\n\nCommissioned by Welz Kaufman and the Ravinia Festival for the Stearns Institute for Young Artists.\n\nBased on four transformative friendships and meetings in Francis Poulenc’s life.\n\nCommissioned by Houston Grand Opera.\n\nCommissioned by Dallas Opera in association with the Dallas Museum of Art for baritone Nathan Gunn.\n\nCommissioned by Music of Remembrance (Mina Miller, Artistic Director).\n\nCommissioned by San Francisco Performances.\n\nCommissioned by Ravinia Festival (2012) and Opera America (2013).\n\nComposed for soprano Lisa Delan.\n\nCommissioned by the Ravinia Festival in celebration of Dame Kiri Te Kanawa’s 70th Birthday.\n\nCommissioned by the UCLA Choir (William Hatcher, conductor).\n\nArrangement by Jake Heggie. Unpublished.\n\nMusic by Noël Coward, arrangement by Jake Heggie. Unpublished.\n\nCommissioned by the Orcas Island Chamber Music Festival.\n",
  "concepts": [
    "List of compositions by Jake Heggie",
    "commissioned",
    "music",
    "festival",
    "von stade",
    "von",
    "unpublished",
    "stade",
    "remembrance",
    "ravinia festival",
    "ravinia"
  ],
  "findings": [
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:37:16.363718"
}