{
  "title": "Animation Magic",
  "source": "Wikipedia (Auto Fetch)",
  "source_url": "https://en.wikipedia.org/wiki/Animation_Magic",
  "content": "Animation Magic (Russian: «Магия анимации», romanized: Magiya Animatsii) was a Russian-American animation studio founded in Gaithersburg, Maryland in 1991, with offices later added in Cambridge, Massachusetts and a 100%-owned subsidiary in Saint Petersburg, Russia. The company developed animations for CD-based software. It was acquired in December 1994 by Capitol Multimedia.\n\nBy 1994 Animation Magic had 90 employees, including 12 software engineers and approximately 60 animators, computer graphic, background and sprite artists. Its products included Hotel Mario, Link: The Faces of Evil,[3] Zelda: The Wand of Gamelon,[4] Mutant Rampage: Bodyslam, Pyramid Adventures,[5] I.M. Meen,[6] King's Quest VII: The Princeless Bride, Darby the Dragon, and the cancelled Warcraft Adventures: Lord of the Clans.[7][8]\n\nCirca 2006, games by Animation Magic were major source materials for YouTube poops, specifically Hotel Mario, Link: The Faces of Evil, Zelda: The Wand of Gamelon, and I. M. Meen.[9]\n\nOn September 6, 2020, over 200 animators collaborated to reanimate 21 minutes of cutscenes of Link: The Faces of Evil and Zelda: The Wand of Gamelon (both 1993).[10][11][12][13] Nintendo Wire reported, \"The ever-shifting mediums and the contrasting animation styles, ranging from professional and sophisticated to intentionally goofy and exaggerated, lend themselves incredibly well to cutscenes that were already chaotic and bizarre to begin with.\"[11][12]\n\nThis United States video game corporation or company article is a stub. You can help Wikipedia by expanding it.\nThis article related to an animation studio is a stub. You can help Wikipedia by expanding it.",
  "concepts": [
    "Animation Magic",
    "animation",
    "zelda wand",
    "zelda",
    "wand gamelon",
    "wand",
    "magic",
    "link faces",
    "link",
    "gamelon",
    "faces evil"
  ],
  "findings": [
    "Legacy",
    "References",
    "External links"
  ],
  "relationships": [],
  "timestamp": "2025-04-11T13:27:31.457799"
}